Repository: Neamar/KISS
Catalog: */00a_preface.po
Languages: ar_ma, de_de, es_es, fr_fr, ja_jp, pt_br

source: So Debian is quite unique. Are we the only ones noticing this? Definitely not. According to <ulink url="http://distrowatch.com/">DistroWatch</ulink> there are about 300 active Free Software distributions around. Half of that (about 140) are Debian <emphasis>derivatives</emphasis>. That means that they start from Debian, adapt it to fit the needs of their users — usually by adding, modifying, and rebuilding packages — and release the resulting product. In essence, derivatives apply the Free Software granted freedoms of modifying and redistributing copies not only to individual pieces of software, but to a distribution as a whole. The potential of reaching out to new Free Software users and contributors by the means of derivative distributions is huge. We believe that it is mainly thanks to that thriving ecosystem that Free Software is nowadays finally rivaling with proprietary software in fields which were historically considered hard to conquer, such as large desktop deployments. Debian sits at the root of the largest ecosystem of Free Software distributions in existence: even if you are not using Debian directly, and even if your distributor has not told you, chances are that you are benefiting right now from the work of the Debian community.
ar_ma: دبيان متميز جداً إذن. هل نحن وحدنا من يدرك هذا؟ قطعاً لا. وفقاً لموقع <ulink url="http://distrowatch.com/">DistroWatch</ulink> هناك حوالي 300 توزيعة برمجيات حرة نشطة حالياً. نصف ذلك العدد (حوالي 140) <emphasis>مشتقة</emphasis> من دبيان. هذا يعني أنهم يبدؤون من دبيان، ثم يعدلونها لتناسب حاجات مستخدميهم —عبر إضافة وتعديل وإعادة بناء الحزم عادة— ويطلقون المنتج النهائي. أساساً، التوزيعات المشتقة لا تقصر تطبيق الحريات التي تمنحها البرمجيات الحرة من تعديل وإعادة توزيع على البرمجيات المفردة وحسب، بل تطبقها على التوزيعة ككل أيضاً. احتمال الوصول لمستخدمين جدد للبرمجيات الحرة من خلال التوزيعات المشتقة كبير جداً. نحن نعتقد أن هذا النظام المزدهر هو السبب الرئيسي وراء وصول البرمجيات الحرة هذه الأيام أخيراً إلى منافسة البرمجيات المحتكرة في مجالات كانت تعتبر تاريخياً صعبة المنال، مثل التنصيب على أعداد كبيرة من الحواسيب المكتبية. يتربع دبيان على عرش أكبر منظومة من توزيعات البرمجيات الحرة في الوجود: وحتى لو لم تكن تستخدم دبيان مباشرة، وحتى لو يخبرك موزعك بذلك، الأغلب أنك تستفيد الآن من جهود مجتمع دبيان.
de_de: Also, Debian ist ziemlich einzigartig. Sind wir die Einzigen, denen das Auffällt? Definitiv nicht. Laut <ulink url="http://distrowatch.com/">DistroWatch</ulink> gibt es etwa 300 aktive Freie-Software-Distributionen. Die Hälfte davon (etwa 140) sind Debian-<emphasis>Derivate</emphasis>. Das bedeutet, dass sie mit Debian starten, es — gewöhnlich durch Hinzufügen, Ändern und Neuerstellen von Paketen — an die Bedürfnisse ihrer Benutzer anpassen und das Ergebnis veröffentlichen. Im Wesentlichen nutzen Derivate die von freier Software garantierten Freiheiten der Veränderung und Neuveröffentlichung nicht nur einzelner Softwareteile, sondern der Distribution als Ganzes. Das Potential das sich hier auf neue Freie Software Benutzer und Unterstützer ausstreckt durch die Vermittlung von derivativen Distributionen ist enorm. Wir glauben, dass es diesem blühendem Ecosystem zu verdanken ist, dass freie Software es heutzutage in Bereichen mit proprietärer Software aufnehmen kann, welche wir in der Vergangenheit als schwer zu erobern angesehen haben, wie beispielsweise große Desktop-Deployments. Debian sitzt an der Basis des größten Ökosystems freier Software Distributionen die existieren: Selbst wenn Sie nicht Debian direkt nutzen, und sogar wenn Ihr Softwaredistributor Ihnen nichts davon gesagt hat, sind die Chancen hoch, dass Sie schon jetzt von der Arbeit der Debian-Community profitieren.
es_es: Así que Debian es bastante único. ¿Somos los únicos que lo notamos? Definitivamente no. Según <ulink url="http://distrowatch.com/">DistroWatch</ulink>, existen alrededor de 300 distribuciones de Software Libre activas. La mitad de ellas (alrededor de 140) son <emphasis>derivadas</emphasis> de Debian. Esto significa que comienzan con Debian, lo adaptan a las necesidades de sus usuarios — generalmente agregando, modificando o reconstruyendo paquetes — y publican el producto que resulta. Escencialmente, las derivadas utilizan las libertadas que ofrece el Software Libre para modificar y redistribuir copias no sólo de porciones individuales de software sino de la distribución completa. El potencial para alcanzar nuevos usuarios y colaboradores de Software Libre a través de distribuciones derivadas es enorme. Creemos que es gracias a ese ecosistema floreciente que el Software Libre hoy en día finalmente le hace frente a software privativo en campos que históricamente eran considerados difíciles de conquistar, como grandes despliegues de sistemas de escritorio. Debian se ubica en la raíz del ecosistema de distribuciones de Software Libre más grande que existe: inclusive si no utiliza Debian directamente, e inclusive si se lo informó su distribuidor, es posible que ahora se esté beneficiando del trabajo de la comunidad de Debian.
fr_fr: C'est ainsi : Debian est tout-à-fait unique. Sommes-nous les seuls à le dire ? Certainement pas. D'après <ulink url="http://distrowatch.com/">DistroWatch</ulink>, il y a actuellement environ 300 distributions de logiciels libres. La moitié (environ 140) sont dérivées de Debian, ce qui signifie qu'elles sont parties d'une base Debian, l'ont adaptée aux besoins spécifiques des utilisateurs qu'elles ciblent — souvent en ajoutant, en modifiant ou en recompilant les paquets — et publient le résultat. Ces distributions dérivées ne font qu'appliquer en substance les libertés du logiciel libre, notamment le droit de modifier et de redistribuer des versions modifiées, et les appliquer pas seulement à des logiciels individuels mais à la distribution dans son ensemble. Cela crée un énorme potentiel pour atteindre non seulement de nouveaux utilisateurs de logiciels libres, mais aussi de nouveaux contributeurs, par le biais de distributions dérivées. Nous pensons que cet écosystème, très vivace, est un des plus grands moteurs qui a permis que le logiciel libre rivalise de nos jours avec le logiciel propriétaire même dans des domaines qui en étaient précédemment considérés comme une chasse gardée, comme les déploiements massifs de machines bureautiques. Et c'est Debian qui est placé à la racine du plus grand écosystème de distributions de logiciels libres actuellement existantes : même si vous n'utilisez pas Debian directement, et même si votre distributeur ne vous l'a pas dit, il est très probable que vous bénéficiez en ce moment même du travail de la communauté Debian.
ja_jp: そんなわけで Debian はとても独特です。これに気が付いているのは我々だけでしょうか? そんな訳がありません。<ulink url="http://distrowatch.com/">DistroWatch</ulink> によれば、世界には約 300 の活発なフリーソフトウェアディストリビューションがあります。そのうちの半分 (約 140) は Debian <emphasis>派生物</emphasis>です。Debian <emphasis>派生物</emphasis>とは、それらのディストリビューションが Debian を基にして、ユーザの必要性に合わせた改変 (通常はパッケージの追加、改変、再構築) を行い、その成果物をリリースしている事を意味しています。要するに派生物は、一つ一つのソフトウェアだけでなくディストリビューション全体としてコピーを改変したり再配布する自由が保障されているフリーソフトウェアを利用しているのです。派生ディストリビューションを通じて、新たなフリーソフトウェアのユーザと貢献者に働きかける潜在的可能性は大きなものです。今日、フリーソフトウェアは歴史的に見て乗り越える事が難しいと考えられている、例えば大きなデスクトップ環境などの、分野においてもプロプライエタリソフトウェアとようやく張り合う事ができるようになっています。これは主にに繁栄しているエコシステムのお陰だと考えられています。Debian は存在するフリーソフトウェアディストリビューションでは最大のエコシステムの根幹に位置しています: 直接 Debian を使っていなかったとしても、ディストリビュータが言わなかったとしても、今現在あなたは Debian コミュニティによる業績の恩恵を受けている可能性があります。
pt_br: Portanto o Debian é bastante único. Apenas nós percebemos isto? Certamente que não. de acordo com a <ulink url="http://distrowatch.com/">DistroWatch</ulink> existem cerca de 300 distribuições de Software Livre ativas por aí. Metade delas (cerca de 140) são <emphasis>derivadas</emphasis> do Debian. Isto significa que elas iniciaram no Debian, adaptaram para as necessidades de seus usuários — normalmente adicionando, modificando ou reconstruindo pacotes — e lançaram o produto resultante. Basicamente, derivados aplicam as liberdade do Software Livre de modificar e redistribuir cópias não apenas de partes incividuais do software, mas da distribuição como um todo. O potencial de alcançar novos usuários e colaboradores de Software Livre através de distribuições derivadas é imenso. Acreditamos que é principalmente por causa deste próspero ecossistema que o Software Livre está atualmente finalmente rivalizando com o software proprietário em campos considerados historicamente difíceis de conquistar, como grandes instalações de computadores de mesa. O Debian está na raíz deste grande ecossistema de distribuições de Software Livre existentes: mesmo se você não está usando o Debian diretamente, e mesmo se seu fornecedor não te disse, existe uma chance de você estar neste exato momento se beneficiando do trabalho da comunidade Debian.

source: But Debian's uniqueness sometimes comes with unexpected consequences. A consequence of Debian's vision on digital freedoms has been the need of redefining what we mean by <emphasis>software</emphasis>. The Debian Project has since long realized that, as part of an operating system, you need to distribute a lot of non-software material: music, images, documentation, raw data, firmware, etc. But how do you apply <emphasis>software</emphasis> freedoms to that material? Should we have different requirements or should all material be held up to the same high standard of freedom? The Debian Project has decided for the latter: all material shipped as part of Debian should offer the same freedoms to its users. Such a radical philosophical position has far reaching effects. It means we cannot distribute non-free firmware, or artwork not meant to be used in commercial settings, or books that cannot be modified in order to avoid tarnishing (as book publishers folklore goes) the author/publisher reputation.
ar_ma: لكن تميّز دبيان ينتج أحياناً عواقب غير متوقعة. فطموح دبيان بتحقيق الحرية الرقمية فرض علينا إعادة تعريف معنى كلمة <emphasis>برمجيات</emphasis>. لقد أدرك مشروع دبيان منذ زمن طويل أنك تحتاج توزيع كمية كبيرة من المواد غير البرمجية كجزء من نظام التشغيل: موسيقى، صور، وثائق، بيانات خام، تعريفات للأجهزة، الخ. لكن كيف يمكنك تطبيق حرية <emphasis>البرمجيات</emphasis> على تلك المواد؟ هل نحتاج لتعريف متطلبات جديدة لحرية تلك المواد أو هل يجب أن تتمتع كل الأجزاء بنفس معايير الحرية الصارمة؟ اختار مشروع دبيان الطريق الثاني: ويجب أن تقدم جميع المواد التي توزع كجزء من دبيان نفس الحريات للمستخدمين. هذا الموقف الفلسفي المتطرف له باع طويل جداً. فهو يعني أننا لا نستطيع توزيع تعريفات الأجهزة إذا لم تكن حرة، أو الأعمال الفنية التي لا يمكن استخدامها تجارياً، أو الكتب التي لا يمكن تعديلها لتفادي تشويه سمعة المؤلف أو الناشر (كما هي عادات دور نشر الكتب).
de_de: Aber Debians Einzigartigkeit führt mitunter zu unerwarteten Konsequenzen. Ein Ergebnis der Vison digitaler Freiheiten von Debian war die Notwendigkeit neu zu definieren, was wir <emphasis>Software</emphasis> nennen. Das Debian Projekt hat schon vor Lngerem realisiert, dass man als Teil des Betriebssystems auch eine Menge Software unabhängiges Material verteilen muß: Musik, Bilder, Dokumentation, Rohdaten, Firmware, usw. Aber wie passt freie <emphasis>Software</emphasis> zu diesem Material? Sollen wir unterschiedliche Anforderungen haben oder soll jedes Material den gleichen hohen Anforderungen an Freiheit gestellt werden? Das Debianprojekt hat sich für letzteres entschieden: Jedwedes Material, das mit Debian veröffentlicht wird, soll den Nutzern die gleichen Freiheiten bieten. Eine solch radikale philosophische Position hat weitreichende Auswirkungen. Es bedeutet, dass wir keine unfreie Firmware verbreiten dürfen, oder Bebilderungen die nicht auch kommerziell genutz werden sollen, noch Bücher die aufgrund der (nach volkstümlicher Meinung) guten Reputation eines Autors/Verlags nicht verändert werden dürfen.
es_es: Pero el que Debian sea único acarrea consecuencias inesperadas a veces. Una consecuencia de la visión de Debian sobre libertades digitales, fue la necesidad de redefinir lo que entendemos por <emphasis>software</emphasis>. Hace tiempo que el Proyecto Debian se dio cuenta que, como parte de un sistema operativo, necesita distribuir material que no es software: música, imágenes, documentación, datos crudos, firmware, etc. ¿Cómo se aplican la libertades de <emphasis>software</emphasis> a ese material? ¿Deberían existir requisitos particulares o todo el material debería estar sujeto a los mismos, y altos, estándares de libertad? El Proyecto Debian se decidió por esto último: todo el material provisto como parte de Debian debería ofrecer las mismas libertades a sus usuarios. Esa posición filosófica tan radical tiene efectos de gran alcance. Significa que no podemos distribuir firmware privativo, u obras de arte que no pueden utilizarse en ambientes comerciales, o libros que no pueden modificarse para evitar manchar (como dice el folklore de publicadores de libros) la reputación del autor/publicador.
fr_fr: Mais l'unicité de Debian a parfois des conséquences inattendues. Par exemple, la vision que Debian porte sur les libertés numériques a rendu nécessaire de redéfinir ce que l'on entend par « logiciel ». Le projet Debian a depuis longtemps pris conscience qu'un système d'exploitation nécessite tout un tas de composants qui ne sont pas du logiciel au sens traditionnel du terme : de la musique, des images, de la documentation, des données brutes, des microcodes, etc. Comment appliquer les libertés du <emphasis>logiciel</emphasis> libre à ces composants ? Est-il justifié d'avoir des critères différents pour chacun, ou est-ce qu'ils doivent tous répondre aux mêmes critères, fussent-ils exigeants ? Le projet Debian a choisi cette dernière solution : tout ce qui est distribué comme un composant de Debian doit garantir à l'utilisateur les mêmes libertés. Cette position philosophique radicale a des conséquences très vastes. À titre d'exemple, elle nous interdit de distribuer des microcodes non libres, ou des éléments graphiques dont l'utilisation serait restreinte à un usage non commercial, ou des livres dont il serait interdit de publier des versions modifiées (censément pour protéger la réputation des auteurs et éditeurs, d'après l'argumentaire habituel).
ja_jp: しかし Debian の独自性は時に思いもよらない結果を招く事があります。デジタルフリーダムに関する Debian の構想の結果、<emphasis>ソフトウェア</emphasis>の意味を再定義する必要性が出てきました。Debian プロジェクトはずっと以前から、オペレーティングシステムの一部として数多くのソフトウェアではない作品 (音楽、画像、文書、生データ、ファームウェアなど) を配布する必要がある、ということに気が付いていました。しかし、これらの作品に対してどのように<emphasis>ソフトウェア</emphasis>フリーダムを適用すればよいのでしょうか。個々の作品が独自の要件を設定するべきでしょうか、それともすべての作品に単一で高い水準の自由を求めるべきなのでしょうか? Debian プロジェクトは後者を選ぶことに決めました: Debian の一部として配布されるすべての作品はユーザに対して一義的な自由を提供するべきである。このような徹底的な哲学的姿勢は広範囲に影響を与えました。この姿勢は、フリーでないファームウェア、商業的環境で利用される事を許可していないアートワーク、(本の出版社が変わらない限り) 著者と出版社の評判を下げる事を回避するために改変できない本などは配布できないという事を意味しています。
pt_br: Mas a unicidade do Debian vem às vezes com consequencias inesperadas. Uma consequencia da visão do Debian sobre liberdades digitais foi a necessidade de redefinir o que entendemos por <emphasis>software</emphasis>. O projeto Debian a muito percebeu que, junto com um sistema operacional, você precisa distribuir um monte de material que não é programa (software): música, imagens, documentação, dados brutos, firmware, etc. Mas como aplicar liberdade de <emphasis>software</emphasis> a este material? Devemos ter requisitos diferentes ou todo o material deve seguir o mesmo critério rigoroso de liberdade? O Projeto Debian decidiu pela última opção: todo material disponível como parte do Debian deve oferecer as mesmas liberdades a seus usuários. Tal posição filosófica radical teve efeitos amplos. Significa que não podemos distribuir firmware não-livre, ou arte que não possa ser usada para fins comerciais, ou livros que não podem ser modificados para evitar macular (segundo as lendas das editoras) a reputação do(a) autor(a).
