Repository: Neamar/KISS
Catalog: */00a_preface.po
Languages: ar_ma, de_de, es_es, fr_fr, ja_jp, pt_br

source: But this political vision is not yet enough to explain Debian's uniqueness. Debian is also a very peculiar social experiment, strongly attached to its independence. Think for a moment of other mainstream Free Software distributions, or even of popular <emphasis>proprietary</emphasis> operating systems. Chances are that you can associate each of them with a large company that is either the main development force behind the project, or at the very least the steward of all its non-development activities. Debian is different. Within the Debian Project volunteers pick on themselves the responsibilities of all the activities that are needed to keep Debian alive and kicking. The variety of those activities is stunning: from translations to system administration, from marketing to management, from conference organization to artwork design, from bookkeeping to legal issues, ... not to mention software packaging and development! Debian contributors take care of all of these.
ar_ma: لكن هذه الرؤية السياسية لا تكفي لتبرير تميُّز دبيان. دبيان تجربة احتماعية فريدة جداً، ترتبط بشدة باستقلالها. فكر قليلاً بتوزيعات البرمجيات الحرة الأساسية الأخرى، أو حتى بنظم التشغيل <emphasis>المحتكرة</emphasis> الشهيرة. سوف تستطيع على الأغلب ربط كل منها بإحدى الشركات الكبيرة التي تمثل قوة التطوير الأساسية في المشروع، أو أنها على الأقل مسؤولة عن كافة النشاطات غير التطويرية. دبيان مختلف. في مشروع دبيان، يأخذ المتطوعون على عاتقهم مسؤولية المهام الضرورية للحفاظ على حياة دبيان ونشاطه كلها. تنوع هذه المهام مذهل: من الترجمة إلى إدارة النظم، ومن التسويق إلى الإدارة، من تنظيم الاجتماعات إلى التصميم الفني، من المحاسبة المالية إلى القضايا القانونية، ... ناهيك عن تحزيم البرمجيات والتطوير! يهتم المساهمون في مشروع دبيان بكل هذه النواحي.
de_de: Aber diese politische Sicht ist nicht ausreichend um Debians Einzigartigkeit zu erklären. Debian ist auch ein ganz besonderes soziales Experiment, das stark an seiner Unabhängigkeit festgemacht wird. Denken Sie für einen Moment an andere etablierte freie Software Distributionen, oder sogar an beliebte <emphasis>proprietäre</emphasis> Betriebssysteme. Es besteht die Möglichkeit dass Sie für jedes eine Verbindung zu einem großen Unternehmen finden das die Hauptentwicklung vorantreibt oder zu aller mindest der Vertreter aller Nicht-Entwicklungstätigkeiten darstellt. Debian ist da anders. Mit dem Debian Projekt übernehmen Ehrenamtliche selbst die Verantwortung über alle Aktivitäten, die notwendig sind um Debian gesund und munter zu halten. Die Bandbreite dieser Aktivitäten ist verblüffend: von der Übersetzung bis zur Systemadministration, vom Marketing bis zum Management, von der Organisation von Konferenzen bis zu Design, von Buchführung bis zu rechtlichen Angelegenheiten, ... ganz zu schweigen von Softwarepaketierung und Entwicklung! Debianmitarbeiter kümern sich um alles.
es_es: Pero esta visión política todavía no es suficiente para explicar cuán especial es Debian. Debian también es un experimento social peculiar, muy cercano a su independencia. Considere por un momento a otras distribuciones de Software Libre reconocidas, o inclusive sistemas operativos <emphasis>privativos</emphasis> populares. Es probable que pueda asociar cada una de ellas con una gran empresa que es la fuerza mayoritaria en el desarrollo del proyecto o, cuando menos, el supervisor de todas sus actividades ajenas al desarrollo. Debian es diferente. Dentro del Proyecto Debian, los voluntarios eligen por sí mismos las responsabilidades de todas las actividades necesarias para mantener a Debian vivo y coleando. La variedad de dichas actividades es impresionante: desde traducciones a administración de sistemas, desde publicidad a gestión, desde organización de conferencias a diseño de arte, desde los registros contables a cuestiones legales... ¡y no olvidemos el empaquetado de software y el desarrollo en sí! Los colaboradores de Debian se encargan de todas ellas.
fr_fr: Mais cette vision éminemment politique ne suffit toujours pas à expliquer l'unicité dont jouit Debian ; le projet est également une expérience sociale très particulière et très attachée à son indépendance. Considérez un instant les autres grandes distributions de logiciel libre, ou même les systèmes d'exploitation <emphasis>propriétaires</emphasis> les plus populaires. Il est très vraisemblable que vous puissiez associez à chacun une grande entreprise qui est soit la principale force de développement, soit au minimum en charge de toutes les activités non liées au développement. Mais Debian est différent. Au sein du projet Debian, toutes les activités requises pour que le projet garde sa vivacité incombent à des volontaires qui en prennent la responsabilité. Ces activités sont extrêmement variées : des traductions à l'administration des systèmes, du marketing au management, de l'organisation de conférences à la conception artistique, de la comptabilité aux considérations juridiques… et tout ceci en plus de l'empaquetage et du développement des logiciels eux-mêmes ! Les contributeurs de Debian prennent tout cela en charge.
ja_jp: しかしこの政治的な観点だけでは Debian の独自性をまだ十分に説明できません。Debian はその独立性に強く付随する非常に独特な社会実験でもあります。他の主要なフリーソフトウェアディストリビューションや人気のある<emphasis>プロプライエタリ</emphasis>オペレーティングシステムについてちょっと考えてみましょう。おそらくそれらは、プロジェクトの裏で開発を主に推し進めているかまたは控え目に言っても開発に無関係のすべての活動を請け負っている大企業と結びつける事ができるでしょう。Debian は違います。Debian プロジェクトでは、ボランティアが自分自身に Debian が維持され素晴らしいものであり続けるために必要なすべての活動に対する責任を課しています。ボランティア活動の範囲は驚くほど広いものです: 翻訳からシステム管理、マーケティングから経営、カンファレンス組織からアートワークデザイン、簿記から法的問題、ソフトウェアのパッケージ化と開発はいうまでもありません! Debian 開発者はこれらすべての面倒を見ているのです。
pt_br: Mas esta visão política não é o suficiente para explicar por que o Debian é único. O Debian é também um experimento social bastante particular, fortemente ligado à sua independência. pense num momento em outras distribuições de software livre importantes, ou mesmo em sistemas operacionais <emphasis>proprietários</emphasis> populares. Há uma boa chance de você associar cada um dele a uma grande companhia que é ou a grande força de desenvolvimento por trás do projeto, ou pelo menos o responsável de toda a atividade que não seja desenvolvimento. No Debian é diferente. Dentro do projeto Debian os voluntários tomam para si a responsabilidade de todas as atividades que são necessárias para manter o Debian vivo e andando. A variedade destas atividades é impressionante: de traduções a administração de sistemas, de marketing a gestão, de organização de eventos a projeto gráfico, de contabilidade a questões legais, ... sem mencionar o empacotamento de software e o desenvolvimento! Contribuidores Debian cuidam de tudo isto.

source: As a first consequence of this radical form of independence, Debian needs and relies on a very diverse community of volunteers. Any skill in any of the above areas, or others you can imagine, can be invested into Debian and will be used to improve the project. A second consequence of Debian independence is that Debian's choices can be trusted not to be driven by the commercial interests of specific companies — interests that we have no guarantee will always be aligned with the goal of promoting people's control over machines, as too many recent examples in the tech news testify.
ar_ma: إحدى أولى النتائج المترتبة على هذا الاستقلال الثوري حاجة دبيان اعتماده على مجتمع شديد التنوع من المتطوعين. أي مهارة في أي من المجالات السابقة، أو غيرها مما يخطر لك، يمكن استثمارها في دبيان وسوف تستخدم لتحسين المشروع. من النتائج الأخرى لاستقلالية دبيان هي أنك تستطيع الثقة بأن خيارات المشروع لن تقودها الأهواء التجارية لشركة ما — الأهواء التي لا يمكن أن يضمن لنا أحد أنها ستتفق دائماً مع هدف تعزيز سيطرة البشر على الآلات، كما تشهد على ذلك أمثلة عديدة في الأخبار التقنية مؤخراً.
de_de: Als erstes Resultat dieser radikalen Unabhängigkeit braucht und vertraut Debian auf eine sehr differenzierte Gemeinschaft von Freiwilligen. Jede Fähigkeit in einer der oben genannten oder anderen denkbaren Bereichen kann in Debian eingebracht werden und wird genutzt um das Projekt zu verbessern. Als zweites Resultat der Unabhängigkeit von Debian kann man darauf vertrauen, dass Debian nicht von wirtschaftlichen Interessen einzelner Unternehmen abgängt — Interessen, bei denen nicht garantiert ist dass sie immer mit dem Ziel übereinstimmen, die Kontrolle der Maschinen durch den Menschen zu fördern was zu viele aktuelle Beispiele in den Techniknachrichten bezeugen.
es_es: Como primera consecuencia de esta forma radical de independencia, Deben necesita y confía en una comunidad de voluntarios muy diversa. Cualquier habilidad en cualquier área mencionada, u otras que pueda imaginar, puede invertirse en Debian y utilizarse para mejorar el proyecto. Una segunda consecuencia de la independencia de Debian es que se puede confiar en que las decisiones de Debian no son influenciadas por intereses comerciales o empresas específicas — intereses sobre los que no tenemos garantías siempre estén alineados con el objetivo de promocionar el control que tiene la gente sobre las máquinas, como muchos ejemplos recientes en las noticias tecnológicas atestiguan.
fr_fr: La première de ces conséquences de cette forme d'indépendance radicale est que la communauté Debian est, par nécessité, très hétéroclite. Toutes les compétences mentionnées ci-dessus, et d'autres qui restent à imaginer, peuvent être mis à provis pour contribuer au projet. Une autre conséquence de l'indépendance est qu'on peut avoir confiance que les choix de Debian ne sont pas dictés par les intérêts commerciaux d'entreprises spécifiques — intérêts dont rien ne garantit qu'ils restent alignés avec le but de promouvoir le contrôle des ordinateurs par leurs propriétaires, comme de trop nombreux exemples de l'actualité des nouvelles technologies nous l'ont récemment rappelé.
ja_jp: 独立性を徹底的に守ることでもたらされる 1 番目の結果として、Debian は非常に多様なボランティアコミュニティを必要としておりそれに依存している、という点があります。上に挙げた技能およびその他の考えうる技能を使えば Debian に貢献したり、プロジェクトを改善する事ができるでしょう。Debian の独立性がもたらす 2 番目の結果として、Debian の方向性は特定企業の商業的興味によって決定されたものではない事が保障されている、という点があります。テクニカルニュースによって検証された数多くの最近の例の通り、Debian の興味は何も保証されておらず、その興味は常に人々がマシンを支配するという目標に向けられています。
pt_br: Como uma primeira consequência desta forma radical de independencia, o Debian precisa e se apóia em uma comunidade muito variada de voluntários. Qualquer habilidade em qualquer uma das áreas acima, ou outras que você possa imaginar, pode ser feita no Debian e será usada para melhorar o projeto. Uma segunda consequência da independência do Debian é que pode-se confiar que as escolhas do Debian não são voltadas a interesses comerciais de companhias específicas — interesses que não podemos garantir que estarão sempre alinhados com o objetivo de promover a causa das pessoas controlarem as máquinas, assim como muitos exemplos recentes nas notícias de tecnologia atestam.

source: One last aspect contributes to Debian's uniqueness: the way in which the social experiment is run. Despite the folklore of being bureaucratic, decision making in Debian is in fact highly unstructured, almost anarchic. There exist clearly defined areas of responsibility within the project. People in charge of those areas are free to drive their own boat. As long as they keep up with the quality requirements agreed upon by the community, no one can tell them what to do or how to do their job. If you want to have a say on how something is done in Debian, you need to put yourself on the line and be ready to take the job on your shoulders. This peculiar form of meritocracy — which we sometimes call <emphasis>do-ocracy</emphasis> — is very empowering for contributors. Anyone with enough skills, time, and motivation can have a real impact on the direction the project is taking. This is testified by a population of about 1 000 official members of the Debian Project, and several thousands of contributors world-wide. It is no wonder that Debian is often credited as the largest community-driven Free Software project in existence.
ar_ma: هناك ناحية أخيرة تساهم في تميُّز دبيان: ألا وهي طريقة قيادة هذه التجربة الاجتماعية. فبدلاً من البيروقراطية التقليدية، عملية اتخاذ القرار في دبيان غير منظمة في معظمها، بل هي فوضوية تقريباً. هناك نطاقات مسؤولية محددة بوضوح ضمن المشروع. يتمتع الأشخاص المسؤولون عن هذه النطاقات بحرية اتخاذ القرار. وطالما أنهم يواكبون متطلبات الجودة التي يوافق عليها المجتمع، فلا يحق لأحد أن يقول لهم ما يفعلونه أو يملي عليهم طريقة عملهم. هذا الشكل الفريد من الميريتوقراطية —التي ندعوها أحياناً الفعلوقراطية (<emphasis>do-ocracy</emphasis>)— يمنح المساهمين صلاحيات واسعة. فأي شخص يملك المهارات اللازمة والوقت الكافي والدافع يستطيع التأثير بشكل حقيقي على توجّه المشروع. يشهد على ذلك أعضاء مشروع دبيان الرسميون الذين يبلغ عددهم الألف تقريباً، وبضعة آلاف من المساهمين حول العالم. لا عجب أن يشار لمشروع دبيان على أنه أكبر مشروع برمجيات حرة حي يقوده المجتمع.
de_de: Ein letzter Aspekt trägt zu Debians Einzigartigkeit bei: die Art auf der das soziale Engagement gestartet ist. Trotz der volkstümlichen Meinung dass Debian Bürokratisch sei erfolgt die Entscheidungsfindung tatsächlich extrem unstrukturiert, nahezu anarchisch. Es gibt klar definierte Verantwortungsbereiche im Projekt. Verantwortliche in diesen Bereichen dürfen ihr eigenes Ding machen. Solange sie die Qualitätsanforderungen der Gemeinschaft erfüllen, kann niemand ihnen was sie tun sollen oder wie sie ihren Job machen. Wenn Sie Einflußdarauf nehmen möchten, wie etwas in Debian umgesetzt wird, müssen Sie selbst das Risiko eingehen und die Verantwortung dafür auf ihre eigenen Schultern laden. Diese seltsame Form der Leistungsgesellschaft — die wir mitunter <emphasis>do-ocracy</emphasis> nennen — ermächtigt in starkem Maße die Mitarbeiter. (Anm. d. Ü: Wortspiel do-ocracy beschreibt eine Regierungsform die denjenigen die Macht haben gibt, die etwas erschaffen) Jeder mit genügent Fähigkeiten, Zeit und Motivation kann effektiven Einfluß auf die Führung eines Projekts nehmen. Dies bezeugt eine Gesamtheit von etwa 1000 offiziellen Mitgliedern des Debian Projekts und mehreren tausend Unterstützern in der ganzen Welt. Da wundert es nicht, dass Debian oft zugeschrieben wird das größte gemeinschaftsbasierte freie Softwareprojekt zu sein.
es_es: Un último aspecto contribuye a que Debian sea especial: la forma en la que se conduce el experimento social. A pesar de su fama burocrática, la toma de decisiones en Debian es muy desestructurada, casi anárquica. Existen áreas de responsabilidad bien definidas dentro del proyecto. Quienes están a cargo de dichas áreas pueden hacerlo como lo deseen. Siempre que adhieran a los requisitos de calidad acordados por la comunidad, nadie puede decirles qué hacer o cómo hacerlo. Si desea tener incidencia en cómo se hace algo en Debian, necesita estar dispuesto a poner su reputación en juego y tomar dicho trabajo sobre sus hombros. Esta forma peculiar de meritocracia — a veces llamada <emphasis>«do-ocracy»</emphasis> (del inglés «do»: hacer) — es muy poderosa para los colaboradores. Cualquiera con suficiente habilidad, tiempo y motivación puede tener un impacto real en la dirección que toma el proyecto. Es testigo de esto la población de alrededor de 1000 miembros oficiales del Proyecto Debian y miles de colaboradores en todo el mundo. No es sorpresa que se diga que Debian es el proyecto de Software Libre llevado a cabo por una comunidad más grande que existe.
fr_fr: Un dernier aspect de l'unicité de Debian concerne la manière dont l'expérience sociale est menée. À contre-pied de la réputation de grosse machine bureaucratique qui reste accolée au projet, la manière dont les décisions sont prises au sein du projet est en réalité très peu structurée, parfois même presque anarchique. Il y a des zones du projet dans lesquelles les responsabilités sont clairement établies ; les personnes en charge de ces zones sont libres de mener leur barque comme il leur convient. Tant qu'elles maintiennent un niveau de qualité correspondant à ce qui est considéré comme requis par la communauté, aucune personne de l'extérieur ne peut exiger qu'elles fassent quoi que ce soit, ni leur dicter comment le faire. Si vous voulez avoir voix au chapitre sur la manière dont Debian fait quelque chose, vous devez être prêt à prendre en charge le travail correspondant. Cette forme de méritocratie — que nous appelons parfois « faisocratie » (<foreignphrase>do-ocracy</foreignphrase>, le règne de ceux qui font) — est très valorisante pour les contributeurs. Toute personne qui dispose des compétences, du temps et de la motivation nécessaires peut avoir un impact réel sur la direction que prend le projet. Nous en voulons pour preuve le millier de membres du projet Debian, et les plusieurs miliers d'autres contributeurs dans le monde. Il ne faut donc pas s'étonner que Debian soit souvent cité comme le plus grand projet de logiciel libre communautaire existant dans le monde.
ja_jp: Debian の独自性に対する貢献の最後の側面: 社会的実験の方法。お役所的と言われているにもかかわらず、実際のところは Debian の意思決定は全く体系化されておらず、ほとんど無秩序といえます。プロジェクトにおける責任の範囲は明確に定義されています。責任者は自身の責任が及ぶ範囲で自由に仕事を行う事が可能です。責任者はコミュニティが取り決める品質保証を守っている限り、責任者は仕事の内容や仕事のやり方に文句を言われることはありません。もしあなたが Debian のやり方に口を出したいのなら、あなた自身が主導して仕事を引き受ける心構えがなければいけません。このような能力主義の特異な形、時折これは <emphasis>do-ocracy</emphasis> と呼ばれます、は貢献者に強い力を与えます。十分な能力、時間、意欲を持っている人は誰でも、プロジェクトの方向性に大きな影響を及ぼす事ができるのです。Debian プロジェクトに参加している千人あまりの公式メンバーと世界中の数千の貢献者がこの点について証言しています。Debian が存在する内で最大のコミュニティ主導フリーソフトウェアプロジェクトと認められているのも少しも不思議なことではないのです。
pt_br: Um último aspecto contribui para a unicidade do Debian: a forma na qual o experimento social é tocado. Apesar do que se diz sobre ser burocrático, a tomada de decisões no Debian é de fato altamente desestruturada, quase anárquica. Existem áreas bem definidas de responsabilidade dentro do projeto. Pessoas responsáveis por estas áreas são livres para guiarem seus próprios barcos. Assim que alcançam os requisitos de qualidade com os quais a comunidade concorda, ninguém pode dizer o que fazer ou como fazer seu trabalho. Se você quer dar uma olhada em como algo é feito no Debian, você precisa meter a mão na massa e assumir o trabalho. Esta forma peculiar de meritocracia — que às vezes chamados de <emphasis>fazer-cracia</emphasis> — é muito "empowering" para contribuidores. qualquer um com as habilidades necessárias, tempo e motivação pode ter um impacto real na direção que o projeto toma. Isto é verificado pela população de cerca de 1000 membros oficiais do projeto Debian, e várias centenas de contribuidores ao redor do mundo. Não é estranho que o Debian seja frequentemente creditado como o maior projeto de software livre liderado pela comunidade em existência.
