Repository: Neamar/KISS
Catalog: */00a_preface.po
Languages: ar_ma, de_de, es_es, fr_fr, ja_jp, pt_br

source: The book you have in your hands is different. It's a <emphasis>free as in freedom</emphasis> book, a book which is up to Debian freedom standards for every aspects of your digital life. For a very long time, the scarce availability of books like this one has been a significant shortcoming of Debian. It meant that that there was little reading material that help spreading Debian and its values, while at the same time embodying those values and showing off their advantages. But it also meant, ironically, that we had little such material that we could distribute as part of Debian itself. This is the first reputable book to address this shortcoming. You can <command>apt-get install</command> this book, you can redistribute it, you can fork this book or, better, submit bug reports and patches for it, so that other in the future can benefit from your contributions. The “maintainers” of this book — who are also its authors — are longstanding members of the Debian Project, who grok the freedom ethos that permeates every aspect of Debian and know first-hand what it means to take on the responsibility for important parts of Debian. By releasing this Free book they are doing, once more, such a wonderful service to the Debian community.
ar_ma: هذا الكتاب الذي بين يديك مختلف. هو كتاب حر، <emphasis>free as in freedom</emphasis>، كتاب يتوافق مع معايير دبيان لحرية جميع نواحي حياتك الرقمية. كانت ندرة الكتب الحرة مثل هذا الكتاب إحدى أهم نقائص دبيان لفترة طويلة جداً من الزمن. هذا يعني أن المواد المقروءة التي تساعد على نشر دبيان وقِيَمِه، مع تجسيد هذه القيم وإبراز منافعها، قليلة. كما يعني أننا لم نكن نستطيع توزيع إلا القليل من هذه المواد كجزء من مشروع دبيان نفسه. أنت تقرأ أول كتاب قيّم يحارب هذا النقص. يمكنك الحصول على هذا الكتاب من مستودعات دبيان عبر <command>apt-get install</command>، ويمكنك إعادة توزيعه، كما يمكنك الاشتقاق منه، أو إرسال تقارير الأخطاء والترقيعات إليه، حتى يستفيد الآخرون من مساهماتك في المستقبل. ”المشرفان“ على هذا الكتاب —وهم مؤلفاه أيضاً— هما عضوان قديمان في مشروع دبيان تشرّبا أخلاقيات الحرية التي تجري في عروق دبيان كلها، وتعرفا بأيديهما على معنى تولي مسؤولية الأجزاء المهمة في دبيان. وبإطلاقهما لهذا الكتاب الحر فهما يقدمان جميلاً عظيماً لمجتمع دبيان مرة أخرى.
de_de: Das Buch, das Sie gerade lesen, ist anders als andere Bücher. Es ist ein <emphasis>Freies Buch</emphasis>, ein Buch, das den Freiheits-Standards für die Dinge des täglichen digitalen Lebens von Debian folgt. Lange Zeit war es ein klares Manko von Debian, dass derartige Bücher kaum verfügbar waren. Deshalb gab es auch wenig Literatur, die dazu beitragen konnte, Debian und die dahinter stehenden Wertevorstellungen bekannt zu machen und gleichzeitig selbst diesen Werten zu genügen und ihre Vorteile aufzuzeigen. Aber dadurch hatten wir ironischerweise auch wenig geeignetes Material, das wir als Teil von Debian selbst ausliefern konnten. Dies ist das erste ernst zu nehmende Buch, das diesen Mißstand angeht. Sie können dieses Buch mit <command>apt-get install</command> installieren, Sie können es weiter vertreiben, Sie können es abwandeln oder, besser noch, Fehlermeldungen oder Änderungen einreichen, damit andere in Zukunft von Ihrem Beitrag profitieren können. Die "Instandhalter" dieses Buches - gleichzeitig seine Autoren - sind langjährige Mitglieder des Debian Projekts, die den Grundsatz der "freien Verfügbarkeit", der jeden Aspekt von Debian durchzieht, verstanden haben und aus erster Hand wissen, was es bedeutet, Verantwortung für wichtige Teile von Debian zu übernehmen. Mit der Veröffentlichung dieses Freien Buches leisten sie einmal mehr einen wertvollen Beitrag für die Debian Gemeinde.
es_es: El libro que tiene en sus manos es diferente. Es un libro <emphasis>libre como la libertad</emphasis>, un libro que adhiere a los estándares de libertad de Debian para todos los aspectos de su vida digital. Por mucho tiempo, la escasa disponibilidad de libros como este fue una gran limitación de Debian. Significaba que existía poco material de lectura que ayudara a difundir Debian y sus valores al mismo tiempo que representara dichos valores y mostrara sus ventajas. Por también significaba, irónicamente, que teníamos poco material que pudiéramos distribuir con Debian en sí mismo. Este es el primer libro reputable que intenta solucionar esta limitación. Puede utilizar <command>apt-get install</command> para obtener este libro, puede redistribuirlo, puede bifurcarlo o, mejor aún, enviar reportes de error y correcciones para el mismo de forma que otros puedan beneficiarse de sus contribuciones. Los «encargados» de este libro — que también son sus autores — son miembros del Proyecto Debian desde hace mucho tiempo, quienes asimilaron y fueron asimilados por la distintiva libertad que empapa todo aspecto de Debian y conocen de primera mano lo que significa ser responsables de partes importantes de Debian. Al liberar este libro Libre realizan, una vez más, un fantástico servicio a la comunidad Debian.
fr_fr: Le livre que vous avez sous les yeux est différent. C'est un livre libre, <foreignphrase>free as in freedom</foreignphrase>, un livre conforme aux standards que Debian applique à tous les aspects de votre vie numérique. Pendant très longtemps, Debian a été pénalisé par la rareté des livres comme celui-ci ; il n'y avait que très peu de livres (ou assimilés) qui pouvaient à la fois aider à diffuser Debian et ses valeurs, et en même temps respecter ces valeurs et incarner leurs avantages. De manière ironique, cela voulait également dire que nous ne disposions que de très peu de tels textes que nous aurions pu distribuer à l'intérieur même de Debian. Vous lisez actuellement le premier livre qui s'attaque de front à ce manque : vous pouvez récupérer ce livre avec <command>apt-get install</command>, vous pouvez le redistribuer, vous pouvez en préparer une version modifiée, et vous pouvez même soumettre des rapports de bogue et des correctifs à son sujet, de sorte que d'autres lecteurs puissent profiter de vos contributions à l'avenir. Les « mainteneurs » de ce livre — qui en sont aussi les auteurs — sont des membres de longue date dans le projet Debian, qui ont une compréhension intime de l'ethos de liberté dans lequel baignent tous les aspects de Debian, et qui savent de première main ce que signifie prendre en charge la responsabilité de parties importantes de Debian. En publiant ce livre libre, ils rendent une fois de plus un grand service à la communauté Debian.
ja_jp: あなたの手元にあるこの本は違います。この本は <emphasis>free as in freedom</emphasis> な本です。つまりこの本の利用にはデジタルライフのあらゆる側面で Debian の標準的なフリーダムに従う事が求められています。とても長い間、この本のような本が少ない事が Debian の重大な欠点でした。これは、Debian とその価値を広く伝え、同時にそれらの価値を具体化してそれらの利点をはっきりさせるための読み物が少なかった事を意味しています。しかし皮肉なことに、これはまた Debian それ自身の一部として配布する事ができる読み物が少なかった事も意味しています。この本は初めてその欠点に取り組んだ信頼できる本です。あなたはこの本を <command>apt-get install</command> したり、再配布したりできます。さらに将来他の人があなたの貢献の恩恵を受ける事ができるように、フォークして改善し、バグレポートやパッチを投稿する事もできるのです。この本の「メンテナ」(著者でもあります) は Debian プロジェクトにメンバーとして長い間かかわっています。彼らは Debian のすべての側面に浸透しているフリーダムの精神に共感し、Debian の重要な部分に関する責任を負う事がどのような意味を持っているかを直接的に知っています。このようなフリーな本をリリースすることによって、彼らは Debian コミュニティに素晴らしい貢献をしているのです。
pt_br: O livro que tens nas suas mãos é diferente. Ele é um livro <emphasis>"free" como em liberdade</emphasis>, um livro que segue os padrões de liberdade do Debian para cada aspecto de sua vida digital. Por um tempo muito longo, a disponibilidade escassa de livros como este tem sido uma grande limitação do Debian. Significava que exisita pouco material de leitura que ajudasse a difundir o Debian e seus valores, ao mesmo tempo que encorporava seus valores e mostrava suas vantagens. Mas também significava, ironicamente, que tínhamos pouco material que pudéssemos distribuir como parte do Debian em si. Este é o primeiro livro respeitável para suprir essa limitação. Você pode <command>apt-get install</command> este livro, pode redistribuí-lo, pode derivá-lo ou, melhor, enviar reportes de erros e correções para ele, de forma que outros possam se beneficiar de suas contribuições no futuro. Os "mantenedores" deste livro - quem são também os autores - são membros de longa data do Projeto Debian, quem assimilaram e foram assimilados pela ethos livre que permeia cada aspecto do Debian e conhecem de primeira mão o que significa assumir responsabilidades de grandes partes do Debian. Ao lançar este livro livre eles realizam, uma vez mais, um fantástico serviço para toda a comunidade Debian.

source: We hope you will enjoy this cornerstone of Debian reading Freedom as much as we did.
ar_ma: نتمنى أن يعجبك حجر الأساس هذا في صرح حرية القراءة في مشروع دبيان كما أعجبنا.
de_de: Wir hoffen, dass Sie genau so viel Freude an diesem Grundprinzip der Freien Lektüre von Debian haben wie wir.
es_es: Esperamos que disfrute esta piedra angular de Debian leyendo Libertad tanto como nosotros.
fr_fr: Nous espérons que vous apprécierez autant que nous cette pierre angulaire de la lecture libre sur Debian.
ja_jp: この Debian に関するフリーな読み物の基礎が皆さんにとって楽しいものである事を強く望んでいます。
pt_br: Esperamos que você curta esta pedra angular do Debian lendo Liberdade tanto como nós.

source: November 2013
ar_ma: نوفمبر 2013
es_es: Noviembre de 2013
fr_fr: Novembre 2013,
ja_jp: 2013 年 11 月
pt_br: Novembro de 2013

source: Stefano Zacchiroli (Debian Project Leader 2010-2013) and Lucas Nussbaum (Debian Project Leader 2013-incumbent)
ar_ma: ستيفانو زاتشيرولي (قائد مشروع دبيان 2010-2013) و لوكاس ناسبوم (قائد مشروع دبيان 2013-حتى الوقت الحالي)
de_de: Stefano Zacchiroli (Debian Projektleiter 2010-2013) and Lucas Nussbaum (Debian Projektleiter 2013-bis heute in dieser Funktion)
es_es: Stefano Zacchiroli (líder del Proyecto Debian 2010-2013) y Lucas Nussbaum (líder del Proyecto Debian 2013-actualidad)
fr_fr: Stefano Zacchiroli (chef du projet Debian 2010-2013) et Lucas Nussbaum (chef du projet Debian depuis 2013)
ja_jp: Stefano Zacchiroli (Debian プロジェクトリーダー 2010-2013) と Lucas Nussbaum (Debian プロジェクトリーダー 2013-現職)
pt_br: Stefano Zacchiroli (líder do Projeto Debian 2010-2013) e Lucas Nussbaum (líder do Projeto Debian 2013-atualidade)
