Repository: Neamar/KISS
Catalog: */00a_preface.po
Languages: ar_ma, de_de, es_es, fr_fr, ja_jp, pt_br

source: Preface
ar_ma: مقدمة
de_de: Einführung
es_es: Prólogo
fr_fr: Préface
ja_jp: 序文
pt_br: Prefácio

source: Debian is a very successful operating system, which is pervasive in our digital lives more than people often imagine or are aware of. A few data points will suffice to make this clear. At the time of writing Debian is the most popular GNU/Linux variant among web servers: according to <ulink url="http://w3techs.com/">W3Techs</ulink>, more than 10% of the web is Debian-powered. Think about it: how many web sites would have you missed today without Debian? Onto more fascinating deployments, Debian is the operating system of choice on the International Space Station. Have you been following the work of ISS astronauts, maybe via the social network presence of NASA or other international organizations? Both the work in itself and the posts about it have been made possible by Debian. Countless companies, universities, and public administrations rely on Debian daily for their operations, delivering services to millions of users around the world... and its orbit!
ar_ma: دبيان نظام تشغيل ناجح جداً يتغلل في حياتنا الرقمية أكثر مما يتصور أو يعي الناس أحياناً. بضعة أرقام تكفي لتوضيح هذا. ففي وقت كتابتنا دبيان هي أكثر توزيعة غنو/لينكس شعبية على مخدمات الوب: حسب إحصائيات <ulink url="http://w3techs.com/">W3Techs</ulink>، فإن أكثر من ‎10% من الوب يعتمد على دبيان. فكر بالموضوع: كم عدد مواقع الوب التي لم تكن لتراها اليوم لولا نظام دبيان؟ وعلى صعيد أكثر تشويقاً، دبيان هي أيضاً نظام التشغيل المعتمد في محطة الفضاء الدولية. هل كنت تتابع أعمال رواد محطة الفضاء الدولية أو غيرها من المنظمات الدولية، عبر صفحات الشبكات الاجتماعية ربما؟ إن هذه الأعمال والأخبار التي تنشر تدعمها دبيان. أعداد لا تحصى من الشركات، والجامعات، والمكاتب الحكومية تعتمد على دبيان يومياً لإنجاز أعمالها، وتقديم خدماتها لملايين المستخدمين حول العالم... وفي الفضاء أيضاً!
de_de: Debian ist ein sehr erfolgreiches Betriebssystem, das in unserem digitalen Umfeld allgegenwärtiger ist, als den Menschen bewusst ist. Ein paar Daten reichen aus um dies zu demonstrieren. Während dieses Buch geschrieben wird ist Debian die populärste GNU/Linux Distribution bei Web-Servern: laut <ulink url="http://w3techs.com/">W3Techs</ulink> werden 10% der Webserver mit Debian betrieben. Überlegen Sie: Wie viele Webseiten hätten Sie heute ohne Debian nicht besucht? Eine der faszinierendsten Entwicklungen ist, dass Debian für die International Space Station (ISS) ausgewählt wurde. Möglicherweise haben Sie die Arbeit der ISS_Astronauten via Social-Netwerk der NASA oder anderer internationaler Organisationen verfolgt? Sowohl die eigentliche Arbeit, als auch die Berichte darüber wurden durch Debian möglich. Zahlreiche Unternehmen, Universitäten, und öffentliche Verwaltungen verlassen sich bei ihrer täglichen Arbeit auf Debian und stellen Dienstleistungen für Millionen von Nutzern rund um die Welt und seinen Orbit zur Verfügung.
es_es: Debian es un sistema operativo muy exitoso, presente en nuestras vidas digitales mucho más de lo que la gente imagina o sabe. Unos pocos ejemplos son suficientes para demostrarlo. Al momento de escribir estas palabras, Debian es la variante de GNU/Linux más popular para servidores web: según <ulink url="http://w3techs.com/">W3Techs</ulink> más de 10% de la web funciona con Debian. Considérelo cuidadosamente: ¿cuántos sitios web no podría haber visitado hoy sin Debian? En despliegues más imponentes, Debian es el sistema operativo de preferencia en la estación espacial internacional (ISS: «International Space Station»). ¿Conoce del trabajo de los astronautas de la ISS, tal vez a través de la presencia de la NASA en las redes sociales u otras organizaciones internacionales? Tanto el trabajo en sí como los artículos al respecto fueron posibles gracias a Debian. Incontables empresas, universidades y administraciones públicas confían en Debian para su funcionamiento diario, proveyendo servicios a millones de usuarios alrededor del mundo... ¡y en órbita!
fr_fr: Le système Debian a énormément de succès, à tel point qu'il est omniprésent dans nos vies numériques — bien plus que la plupart des gens ne l'imaginent. Quelques chiffres suffisent pour s'en convaincre. Lorsque nous écrivons ces lignes, Debian est la variante de GNU/Linux la plus populaire sur les serveurs web : d'après une étude de <ulink url="http://w3techs.com/">W3Techs</ulink>, plus de 10 % du web est hébergé sur des serveurs Debian. Pensez-y : de combien de sites web auriez-vous dû vous passer aujourd'hui sans Debian ? Pour un exemple plus édifiant, Debian est le système d'exploitation en usage sur la Station spatiale internationale (ISS). Peut-être suivez-vous le travail des astronautes de l'ISS, peut-être via la présence sur les réseaux sociaux de la NASA ou d'autres organisations internationales ? Eh bien le travail lui-même et les articles qui vous en tiennent informés ont été rendus possibles par des systèmes Debian. D'innombrables sociétés, universités, administrations, collectivités locales, dépendent de Debian au quotidien pour leurs opérations, ce qui leur permet de rendre le service attendu à des millions d'utilisateurs partout dans le monde… et en orbite autour du monde !
ja_jp: Debian は大きな成功を収めたオペレーティングシステムで、人々が想像したり気付いているよりも広くデジタルライフの至る所に浸透しています。これを明らかにするためにいくつかの例を挙げてみましょう。本書の執筆時点では、Debian は web サーバ用途で最も人気のある GNU/Linux 派生物です: <ulink url="http://w3techs.com/">W3Techs</ulink> によれば、10% を超える web サーバが Debian で運用されています。考えてみてください: 今もし Debian が無かったら、いくつの web サイトが無くなってしまうのでしょうか? より興味深い展開として、Debian は 国際宇宙ステーションで使われるオペレーティングシステムに選ばれています。ソーシャルネットワークにある NASA や他の国際的組織のアカウントなどを通して、国際宇宙ステーションの宇宙飛行士の仕事に注目した事がありますか? Debian を使うことで彼らは業務を遂行したり、業務に関して投稿したりする事が可能になっています。数え切れないほど多くの企業、大学、行政機関が、業務を遂行したり世界中... さらに軌道上にいる何百万のユーザに向けてサービスを供給するために、日常的に Debian を利用しています!
pt_br: Debian é um sistema operacional muito bem sucedido, que penetra nas nossas vidas digitais muito mais do que a maioria das pessoas imagina. Uns poucos dados são o suficiente para mostrar isto. No momento em que este texto foi escrito, o Debian era a variante GNU/Linux mais popular entre servidores web: de acordo com <ulink url="http://w3techs.com/">W3Techs</ulink>, mais de 10% da web roda sobre Debian. Pense nisso, quantos sítios da web parariam se o Debian sumisse hoje? Em ambientes mais fascinantes, Debian é o sistema operacional escolhido na Estação Orbital Internacional (International Space Station). Você tem acompanhado o trabalho dos astronautas da ISS, talvez via NASA nas redes sociais ou outras organizações internacionais? Tanto o trabalho em si quanto as postagens sobre o trabalho são possíveis graças ao Debian. Inúmeras companhias, universidades e administrações públicas se baseiam no Debian para suas operações, fornecendo serviços a milhões de usuários ao redor do planeta... e em órbita!

source: But Debian is much more than an operating system, no matter how complex, featureful, and reliable such a system could be. Debian is a vision of the freedoms that people should enjoy in a world where more and more of our daily activities depend on software. Debian is born from the cardinal Free Software idea that people should be in control of their computers, and not the other way around. People with enough software knowledge should be able to dismantle, modify, reassemble and share with others all the software that matters to them. It doesn't matter if the software is used for frivolous activities like posting pictures of kittens on the Web, or for potentially life-threatening tasks such as driving our cars and powering the medical devices which cure us; you should control it. People without in-depth software knowledge, them too, should enjoy those freedom: they should be put in condition to delegate to people of their choice, people they trust, the audit or modification of software-based devices on their behalf.
ar_ma: لكن دبيان أكثر بكثير من مجرد نظام تشغيل، مهما كان تعقيد نظم التشغيل هذا ومهما كانت مزاياه واستقراره. دبيان هو تعبير عن الحريات التي يجب أن يتمتع بها الناس في عالم أصبحت فيه نشاطاتنا اليومية تعتمد على البرمجيات أكثر فأكثر. دبيان هي ثمرة فكرة حرية البرمجيات بأن الناس يجب أن يتحكموا بحواسيبهم، لا أن تتحكم بهم الحواسيب. يجب أن يسمح لأصحاب الخبرة الكافية في البرمجيات بتفكيك وإعادة تجميع ومشاركة البرمجيات التي تهمهم مع الآخرين. لا فرق إذا كانت البرمجيات تستخدم لأنشطة بسيطة مثل نشر صور القطط على الوب، أو لمهام حرجة كقيادة سياراتنا أو تشغيل الأجهزة الطبية التي تعالجنا؛ يجب أن تتحكم أنت بها. حتى الناس الذين لا يملكون خبرة برمجية عميقة يجب أن يتمتعوا بهذه الحريات: يجب أن يسمح لهم بتفويض الأشخاص الذين يختارونهم، والذين يثقون بهم، لفحص أو تعديل أجهزتهم التي تعمل بالبرمجيات.
de_de: Aber Debian ist viel mehr als nur ein Betriebssystem, ganz davon abgesehen wie komplex, voller Möglichkeiten und zuverlässig ein solches sein mag. Debian ist eine Vision der Freiheiten die Menschen genießen sollten, die in einer Welt leben in der unserere täglichen Aktivitäten zunehmend von Software abhängt. Debian ist aus der grundlegenden Idee freier Sofftware geboren, dass Menschen die Computer beherrschen sollten und nicht umgekehrt. Menschen mit genügend Softwarekenntnissen sollen in die Lage versetzt werden, die Software die für sie wichtig ist zu zerlegen, zu verändern und neu zusammenzustellen und dies mit anderen zu teilen. Es macht keinen Unterschied, ob die Software für leichtfertige Aktivitäten wie das Hochladen von Katzenfotos ins Internet oder für eventuell lebensrettende Aufgaben wie zum Bespiel das Steuern unserer Autos oder zum Berieb medizinischer Geräte die uns heilen genutzt wird; wir sollten sie kontrollieren. Auch Menschen ohne tiefere Softwarekenntnisse sollten an dieser Freiheit Gefallen finden: Sie werden in die Lage versetzt, die Überprüfung und Veränderung an Software an diejenigen zu delegieren, die sie selbst auswählen und denen sie vertrauen.
es_es: Pero Debian es mucho más que un sistema operativo, sin importar cuán complejo, funcional y confiable pueda ser dicho sistema. Debian es una visión de las libertades que todos deberíamos disfrutar en un mundo en el que cada vez más actividades diarias dependen de software. Debian nace de la idea principal del Software Libre: toda persona debe tener control de sus equipos y no a la inversa. Aquellos que posean suficiente conocimiento de software deberían poder desmantelar, modificar, rearmar y compartir con otro todo el software que les importe. No importa si se usa el software para actividades frívolas como publicar imágenes de gatitos, o tareas que podrían amenazar la vida como manejar nuestros autos o hacer funcionar los dispositivos médicos que nos curan; deberíamos controlarlo. Aquellos que no tengan un conocimiento profundo del software también deberían disfrutar esta libertad: deberían ser capaces de delegar a quienes ellos decidan, en quienes confíen, la auditoría o modificación del software de sus dispositivos.
fr_fr: Mais Debian, avec toute sa complexité, toutes ses fonctionnalités, et toute sa fiabilité, est bien plus qu'un système d'exploitation. Premièrement, Debian constitue une vision des libertés dont les personnes jouissent dans un monde où une proportion croissante de nos activités quotidiennes dépendent du logiciel. Debian est né avec pour point cardinal l'idée fondatrice du Logiciel Libre, selon laquelle les utilisateurs doivent être au contrôle de leurs ordinateurs et non le contraire. Les personnes ayant les connaissances nécessaires doivent pouvoir démonter, modifier, remonter, et partager avec d'autres tous les composants logiciels qui leur tiennent à cœur. Il importe peu qu'il s'agisse d'activités « frivoles » comme la publication de photos de chatons sur le web ou de tâches d'importance vitale comme le fonctionnement de nos voitures et des appareils médicaux qui nous soignent : nous devons contrôler tout cela. Et les personnes qui n'ont pas ces connaissances, pour leur part, doivent elles aussi pouvoir profiter de ces libertés : il doit leur être rendu possible de déléguer à des personnes, en ayant choisi ces personnes en qui elles ont confiance, l'audit et les modifications des équipements logiciels en leur nom.
ja_jp: Debian を使えばシステムを複雑にする事も多機能にする事も高い信頼性を持たせる事も可能ですが、Debian を選ぶことは単なるオペレーティングシステムを選ぶこと以上の意味を持っています。Debian は、日常生活においてソフトウェアに対する依存度がどんどん高まっているこの世界で人々はソフトウェアを自由に選択できるようになるべきである、という構想を持っています。Debian は、人々は自分のコンピュータを己の支配下におくべきでありコンピュータに支配されるべきではない、という基本的なフリーソフトウェア構想から生まれています。ソフトウェアに関して十分な知識を持っている人々は、自分にとって重要なすべてのソフトウェアを分解、改変、再構築してその成果を他の人と共有するべきです。ここで重要なのは、ソフトウェアの用途に関わらず成果を共有するという思想です。子猫の写真を Web に投稿するような取るに足らない作業に使われるソフトウェアも、車の制御や治療に使われる医療機器への電力供給などの潜在的に命にかかわるような目的に使われるソフトウェアも、そのソフトウェアに対して成された成果は同じように共有されます。さらに、ソフトウェアに関して深い知識を持っていない人々も同様にソフトウェアを自由に選択するべきです: そのような人々は自分たちの代わりに、ソフトウェアによって制御される機器の監査や改良を、自分たちが選んだ信頼できる人に委託するべきです。
pt_br: Mas o Debian é muito mais que um sistema operacional, independente de quão complexo, funcional e confiável tal sistema possa ser. O Debian é uma visão das liberdades que as pessoas devem curtir num mundo onde mais e mais de nossas atividades diárias depende de software. O Debian nasceu da relevente ideia do mundo do software livre de que as pessoas devem estar no controle dos seus computadores, e não o contrário. Pessoas com suficiente conhecimento de software devem ser capazes de desmontar, modificar, remontar e compartilhar com outros todo o software importante para elas. Não importa se o software é usado para atividades triviais como postar fotos de gatinhos na rede ou para tarefas que envolvam risco de vida como dirigir nossos carros ou controlar os dispositivos médicos que nos curam; você deve controlar isto. Pessoas sem conhecimento profundo de software, elas também, devem aproveitar esta liberdade: eles devem poder delegar para pessoas que eles escolham, que eles confiem, a auditoria ou modificação de dispositivos baseados em software para seu próprio benefício.

source: In the quest for the control of people over machines, Free operating systems play a fundamental role: you cannot be in full control of a computer device if you do not control its operating system. This is where Debian's main ambition comes from: producing the best, entirely Free operating system. For more than 20 years now, Debian has both developed a Free operating system and promoted a vision of Free Software around it. In so doing, Debian has set a very high bar for software freedom advocates around the world. Debian's decisions on matters of software licensing, for example, are routinely looked up to by international standard organizations, governments, and other Free Software projects, when deciding if something should be considered “free enough” or not.
ar_ma: عندنا يسعى الناس إلى التحكم بالآلات والسيطرة عليها، تلعب نظم التشغيل الحرة دوراً أساسياً: فلا يمكنك الوصول إلى التحكم الكامل بالحاسوب إذا لم تتحكم بنظام تشغيله. هذا هو طموح دبيان الرئيسي: إنتاج أفضل نظام تشغيل حر بالكامل. منذ أكثر من عشرين عاماً حتى اليوم، استمر مشروع دبيان بتطوير نظام تشغيل حر وتعزيز رؤيا حرية البرمجيات من حوله. بذلك كان دبيان محط تطلعات أنصار البرمجيات الحرة حول العالم. فمنظمات المعايير العالمية والحكومات ومشاريع البرمجيات الحرة الأخرى –مثلاً– تراجع قرارات دبيان حول قضايا ترخيص البرمجيات دورياً لتقرر إذا كان أحد الأشياء يعتبر ”حراً بما يكفي“ أم لا.
de_de: In der Frage der Kontrolle der Maschinen durch die Menschen spielen freie Betriebssysteme eine grundlegende Rolle: Man kann einen Computer nicht kontrollieren, wenn man das Betriebssystem nicht kontrolliert. Darauf gründet Debians Hauptziel: Das beste freie Betriebssystem zu erstellen. Seit mehr als 20 Jahren hat Debian nicht nur ein freies Betriebssystem entwickelt sondern auch für freie Software geworben. So hat Debian einen hohen Standard für die Anwälte freier Software rund um die Welt geschaffen. Debians Entscheidungen zu Softwarelizenzen zum Beispiel werden regelmäßig von internationalen Standardisierungsgremien, Verwaltungen und anderen freien Softwareprojekten untersucht wenn es darum geht zu entscheiden, ob etwas "frei genug" ist oder nicht.
es_es: En la búsqueda del control sobre las máquinas, los sistemas operativos Libres tienen un rol fundamental: no puede estar completamente en control de un dispositivo si no controla su sistema operativo. De aquí proviene la ambición fundamental de Debian: producir el mejor sistema operativo completamente Libre. Hace ya más de 20 años Debian ha desarrollado un sistema operativo libre y también promocionado una visión de Software Libre alrededor del mismo. Al hacerlo, Debian elevó la barrera para los promotores del software libre en el mundo. Por ejemplo, organizaciones de estándares internacionales, gobiernos y otros proyectos de Software Libre hacen referencia a las decisiones de Debian en cuestiones de licenciamiento de software para decidir si algo debe ser considerado «suficientemente libre» o no.
fr_fr: Sur le chemin de l'appropriation des machines par les humains, les systèmes d'exploitation libres jouent un rôle fondamental. Il est impossible d'être complètement aux commandes d'un appareil informatique sans contrôler son système d'exploitation. C'est de là que provient l'ambition principale de Debian : produire le meilleur système d'exploitation entièrement libre. Depuis maintenant plus de 20 ans, Debian a tout à la fois développé un tel système et fait la promotion d'une vision du logiciel libre. Ce faisant, le projet a placé la barre très haut pour les défenseurs du logiciel libre dans le monde. Les décisions de Debian dans le domaine des licences logicielles, par exemple, servent fréquemment de référence pour des organisations de normalisation internationale, des gouvernements, et d'autres projets de logiciel libre, lorsqu'il s'agit de décider si quelque chose peut être considéré comme « suffisamment libre ».
ja_jp: 人々がコンピュータを己の支配下におく上で、オペレーティングシステムがフリーであることは根本的な役割を担っています: オペレーティングシステムを支配しなければ、コンピュータデバイスを完全に支配できません。最高で完全にフリーなオペレーティングシステムを作成するという Debian の主要な目標はここから来ています。20 年以上もの間、Debian はフリーオペレーティングシステムを開発し、付随するフリーソフトウェア構想を推進し続けています。その際に Debian は世界中のソフトウェアフリーダム支持者に対して非常に高いハードルを設定し続けています。例えば、国際的標準機構や政府やその他のフリーソフトウェアプロジェクトが対象を「十分にフリー」と考えるべきか否かを決定する際には、ソフトウェア使用許諾に関する Debian の決定を基準にしています。
pt_br: Na missão de trazer o controle das máquinas para as pessoas, sistemas operacionais livres desempenham um papel fundamental: você não pode estar no controle total de um dispositivo computacional se você não controla seu sistema operacional. É daí que vem a principal ambição do Debian: produzir o melhor sistema operacional completamente livre. Por mais de 20 anos, o Debian desenvolveu um sistema operacional livre e promoveu uma visão de software livre a partir dele. Desta forma, o Debian manteve um padrão bastante alto para protetores da liberdade de software o redor do mundo. As decisões do Debian em matéria de licenciamento de software, por exemplo, são normalmente observadas por instituições de padronização internacionais, governos e outros projetos de software livre, quando decidem se algo deve ser considerado livre o suficiente ou não.
