Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: <primary>package</primary><secondary>Debian package</secondary>
ar_ma: <primary>حزمة</primary><secondary>حزمة دبيان</secondary>
es_es: <primary>paquete</primary><secondary>Debian</secondary>
fr_fr: <primary>paquet</primary><secondary>Debian</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto Debian</secondary>
ja_jp: <primary>パッケージ</primary><secondary>Debian パッケージ</secondary>
pl_pl: <primary>pakiet</primary><secondary>pakiet Debiana</secondary>
pt_br: <primary>pacote</primary><secondary>pacote Debian</secondary>
zh_cn: <primary>包</primary><secondary>Debian 包</secondary>

source: <primary>package</primary><secondary>binary package</secondary>
ar_ma: <primary>حزمة</primary><secondary>حزمة ثنائية</secondary>
es_es: <primary>paquete</primary><secondary>binario</secondary>
fr_fr: <primary>paquet</primary><secondary>binaire</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto binario</secondary>
ja_jp: <primary>パッケージ</primary><secondary>バイナリパッケージ</secondary>
pl_pl: <primary>pakiet</primary><secondary>pakiet binarny</secondary>
pt_br: <primary>pacote</primary><secondary>pacote binario</secondary>
zh_cn: <primary>包</primary><secondary>二进制包</secondary>

source: <primary>package</primary><secondary>source package</secondary>
ar_ma: <primary>حزمة</primary><secondary>حزمة مصدرية</secondary>
es_es: <primary>paquete</primary><secondary>fuente</secondary>
fr_fr: <primary>paquet</primary><secondary>source</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto sorgente</secondary>
ja_jp: <primary>パッケージ</primary><secondary>ソースパッケージ</secondary>
pl_pl: <primary>pakiet</primary><secondary>pakiet źródłowy</secondary>
pt_br: <primary>pacote</primary><secondary>pacote fonte</secondary>
zh_cn: <primary>包</primary><secondary>源码包</secondary>

source: <primary>source</primary><secondary>package</secondary>
ar_ma: <primary>مصدر</primary><secondary>حزمة</secondary>
es_es: <primary>fuente</primary><secondary>paquete</secondary>
fr_fr: <primary>source</primary><secondary>paquet source</secondary>
ja_jp: <primary>ソース</primary><secondary>パッケージ</secondary>
pt_br: <primary>fonte</primary><secondary>pacote</secondary>
zh_cn: <primary>源码</primary><secondary>包</secondary>

source: A Debian package is an archive containing all the files required to install a piece of software. It is generally a file with a <filename>.deb</filename> extension, and it can be handled with the <command>dpkg</command> command. Also called <emphasis>binary package</emphasis>, it contains files that can be directly used (such as programs or documentation). On the other hand, a <emphasis>source package</emphasis> contains the source code for the software and the instructions required for building the binary package.
ar_ma: حزمة دبيان عبارة عن أرشيف يحوي كل الملفات المطلوبة لتثبيت برنامج ما. تكون الحزمة عادة ملفاً له اللاحقة <filename dir="ltr">.deb</filename>، يمكن التعامل معه باستخدام الأمر <command>dpkg</command>. كما تدعى أيضاً <emphasis>بالحزم الثنائية</emphasis>، وهذه الحزم تحوي ملفات يمكن استخدامها مباشرةً (مثل البرمجيات أو الوثائق). من ناحية أخرى، تحوي <emphasis>الحزم المصدرية</emphasis> الشِّفرة المصدرية للبرمجيات والتعليمات المطلوبة لبناء الحزم الثنائية.
el_gr: Ένα Debian πακέτο ειναι ενα αρχείο που περιέχει όλους τους φακέλλους που απαιτείται απο ενα κομμάτι λογισμικού. Είναι γενικώς ένας φάκελλος με <filename>.deb</filename> επέκταση και μπορεί να χειριστεί με <command>dpkg</command> εντολή. Επίσης ονομάζεται <emphasis>binary package</emphasis>, περιέχει φακέλλους οι οποίοι μπορούν να χρησιμοποιηθούν αμέσως (σαν προγράμματα η τεκμηρίωση). Διαφορετικά ενα <emphasis>source package</emphasis> περιέχει τον πηγαίο κώδικα για το λογισμικό και τις οδηγίες που απαιτούνται για την κατασκευή ενός δυαδικού(bianary) πακέτου.
es_es: Un paquete Debian es un archivo que contiene todos los archivos necesario para instalar una pieza de software. Normalmente es un archivo con extensión <filename>.deb</filename> y puede ser manipulado con el programa <command>dpkg</command>. También conocido como <emphasis>paquete binario</emphasis>, contiene los archivos que pueden ser utilizados directamente (tales como programas y documentación). Por otro lado, un <emphasis>paquete fuente</emphasis> contiene el código fuente para el software y las instrucciones necesarias para construir el paquete binario.
fr_fr: Un paquet Debian est une archive qui renferme un ensemble de fichiers permettant d'installer un logiciel. En général, il s'agit d'un fichier d'extension <filename>.deb</filename>, qu'on manipule avec le programme <command>dpkg</command>. Un paquet sera qualifié de <emphasis>binaire</emphasis> s'il contient des fichiers fonctionnels directement utilisables (programmes, documentation) ou de <emphasis>source</emphasis> s'il abrite les codes sources du logiciel et les instructions nécessaires à la fabrication du paquet binaire.
it_it: Un pacchetto Debian consiste in un archivio contenente tutti i file necessari per installare un software. É generalmente un file con estensione <filename>.deb</filename> e può essere gestito dal comando <command>dpkg</command>. Chiamato anche <emphasis>pacchetto binario</emphasis>, contiene file che possono essere utilizzati direttamente (come programmi eseguibili o documentazione). Un <emphasis>pacchetto sorgente</emphasis> invece contiene il codice sorgente del software e le istruzioni necessarie per costruire il pacchetto binario.
ja_jp: Debian パッケージとはあるソフトウェアをインストールするために必要な全てのファイルを含むアーカイブです。通常、このファイルは <filename>.deb</filename> という拡張子が付けられ、<command>dpkg</command> コマンドで処理されます。<emphasis>バイナリパッケージ</emphasis>と呼ばれるものには直接使用する (プログラムや文書のような) ファイルが含まれています。これに対して、<emphasis>ソースパッケージ</emphasis>にはソフトウェアのソースコードとバイナリパッケージをビルドする際に必要な手順書が含まれています。
pl_pl: Pakiet Debiana jest archiwum zawierającym wszystkie pliki wymagane do zainstalowania danego programu. Na ogół jest to plik z rozszerzeniem <filename>.deb</filename> i może być obsługiwany za pomocą polecenia <command>dpkg</command>. Nazywany również jako <emphasis>pakiet binarny</emphasis>, zawiera pliki, które mogą być użyte bezpośrednio (np. programy lub dokumentacja). Z kolei <emphasis>pakiet źródłowy</emphasis> zawiera kod źródłowy oprogramowania i instrukcje wymagane do zbudowania pakietu binarnego.
pt_br: Um pacote Debian é um arquivo contendo todos os arquivos necessários para instalar um dado software. É geralmente um arquivo com uma extensão <filename>.deb</filename>, e pode ser manuseado com o comando <command>dpkg</command>. Também chamado de <emphasis>pacote binário</emphasis>, ele contém arquivos que podem ser utilizados diretamente (como programas ou documentação). Por outro lado, um <emphasis>pacote fonte</emphasis> contém o código-fonte do software e as instruções necessárias para a construção do pacote binário.
zh_cn: Debian 包是一种存档格式，它包含了安装一个软件将用到的所有文件。它通常是一个带 <filename>.deb</filename> 扩展名的文件，并且能被 <command>dpkg</command>命令所处理。<emphasis>二进制包</emphasis>包含能直接被使用的文件（如程序或文档）。另一方面，<emphasis>源码包</emphasis>包含软件的源代码，以及如何编译二进制包的指令说明。

source: The present version is the first written primarily for English, and the second one available in English; the previous one was based on the fifth edition of the French book. This edition covers version 7 of Debian, code-named <emphasis role="distribution">Wheezy</emphasis>. Among the changes, Debian now sports two new architectures — <emphasis>s390x</emphasis> as a replacement for <emphasis>s390</emphasis>, for IBM System Z mainframe computers, and <emphasis>armhf</emphasis> for ARM processors with a hardware floating point arithmetic unit. Speaking of architectures, Debian's package manager is now multi-architecture, and can handle installation of different architectures of the same package at the same time. All included packages have obviously been updated, including the GNOME desktop, which is now included in its version 3.4.
ar_ma: كُتِبَت النسخة الأجنبية الحالية باللغة الإنكليزية بشكل أساسي، وهي النسخة الثانية المتاحة بالإنكليزية؛ أما النسخة الأولى فقد اعتمدت على الطبعة الخامسة من الكتاب الفرنسي. تغطي هذه الطبعة النسخة 7 من دبيان، التي تدعى <emphasis role="distribution">ويزي</emphasis>. من التغييرات التي طرأت ظهور معماريتين جديدتين في دبيان الآن — معمارية <emphasis>s390x</emphasis> التي تستبدل <emphasis>s390</emphasis> الخاصة بالحواسيب الكبيرة IBM System Z، ومعمارية <emphasis>armhf</emphasis> لمعالجات ARM التي تحوي وحدة حساب عتادية لعمليات النقطة العائمة. بالحديث عن المعماريات، أصبح مدير الحزم في دبيان الآن متعدد المعماريات، ويستطيع تثبيت معماريات مختلفة من الحزمة ذاتها في الوقت نفسه. كما تم تحديث جميع الحزم المضمنة طبعاً، بما فيها سطح المكتب GNOME، المتوفر الآن بنسخته 3.4.
es_es: La versión actual es la primera escrita principalmente para inglés y la segunda disponible en dicho idioma; la anterior estaba basada en la quinta edición del libro en francés. Esta edición trata sobre la versión 7 de Debian, de nombre código <emphasis role="distribution">Wheezy</emphasis>. Entre sus cambios, Debian ahora es compatible con dos arquitecturas nuevas — <emphasis>s3890x</emphasis> en reemplazo de <emphasis>s390</emphasis> para equipos «mainframe» IBM System Z, y <emphasis>armhf</emphasis> para procesadores ARM que poseen una unidad hardware para aritmética de punto flotante. Hablando de arquitecturas, el gestor de paquetes de Debian ahora es multiarquitectura y puede administrar la instalación simultánea del mismo paquete para diferentes arquitecturas. Obviamente, se actualizaron todos los paquetes incluidos, inclusive el escritorio GNOME proveyendo ahora su versión 3.4.
fr_fr: Cette édition française est la première à n'être qu'une traduction du livre anglais ; les éditions précédentes constituaient alors l'œuvre originale. Ce livre traite de la version 7 de Debian, j'ai nommée <emphasis role="distribution">Wheezy</emphasis>. Parmi les changements, deux nouvelles architectures font leur apparition : <emphasis>s390x</emphasis> en remplacant de <emphasis>s390</emphasis> pour les <foreignphrase>mainframes</foreignphrase> IBM System Z, et <emphasis>armhf</emphasis> pour les processeurs ARM avec une unité de calcul en virgule flottante. Le gestionnaire de paquets Debian est désormais multi-architecture et peut gérer l'installation simultanée de différentes architectures du même paquet. Tous les paquets inclus ont évidemment été mis à jour, y compris le bureau GNOME, disponible en version 3.4.
ja_jp: 現在のバージョンは主に英語で書かれた最初の版で、英語板が入手できる 2 番目の版です; 前の版はフランス語で書かれた本の第 5 版を基にしていました。このバージョンは Debian バージョン 7、コードネーム <emphasis role="distribution">Wheezy</emphasis>、を対象としています。数ある変更の中でもとくに注目すべきは、Debian は今や IBM System Z メインフレームコンピュータ <emphasis>s390</emphasis> の代替である <emphasis>s390x</emphasis> アーキテクチャとハードウェア浮動小数点演算装置を備える ARM プロセッサ向けの <emphasis>armhf</emphasis> アーキテクチャという 2 つの新アーキテクチャをサポートしているという点です。アーキテクチャの話と言えば、Debian のパッケージマネージャは今やマルチアーキテクチャに対応し、異なるアーキテクチャ向けに作られたパッケージのインストールをまとめて処理することができます。もちろん提供されている全てのパッケージは最新の状態にあり、GNOME デスクトップのパッケージには GNOME 3.4 が含まれています。
pt_br: A versão atual é a primeira escrita principalmente para o inglês e a segunda disponível em inglês; a anterior baseou-se na quinta edição do livro francês. Esta edição aborda a versão 7 do Debian, de codinome <emphasis role="distribution">Wheezy</emphasis>. Entre as mudanças, o Debian agora suporta duas novas arquiteturas - <emphasis>s390x</emphasis> como um substituto para o <emphasis>s390</emphasis>, para computadores mainframe IBM System Z e <emphasis>armhf</emphasis> para processadores ARM com um hardware para unidade aritmética de ponto flutuante. Falando de arquiteturas, o gerenciador de pacotes do Debian é agora multi-arquitetura, e pode lidar com a instalação de diferentes arquiteturas de um mesmo pacote ao mesmo tempo. Todos os pacotes incluídos foram obviamente atualizados, incluindo o desktop GNOME, que agora está incluso na sua versão 3.4.

source: We have added some notes and remarks in sidebars. They have a variety of roles: they can draw attention to a difficult point, complete a notion of the case study, define some terms, or serve as reminders. Here is a list of the most common of these sidebars:
ar_ma: كما أضفنا ملاحظات وتوجيهات في الملاحظات الجانبية. لهذه الملاحظات عدة أدوار منها: لفت الانتباه إلى موضوع صعب، إكمال فكرة من الحالة المدروسة، تعريف بعض المصطلحات، أو كنوع من التذكرة. هذه قائمة بأكثر الملاحظات الجانبية شيوعاً:
el_gr: Έχουμε προσθέσει μερικές σημειώσεις και παρατηρήσεις στους πίνακες. Αυτοί έχουν ποικιλία ρόλων: αυτοί μπορούν να επισυγκεντρωθούν σ'ένα δύσκολο σημείο, να ολοκληρώσουν μια ιδέα της υπόθεσης μελέτης, να προσδιορίσουν μερικούς όρους, η να υπηρετήσουν σαν επισήμανση. Εδώ ειναι μια λίστα απο τους πιό συνήθεις πίνακες(sidebars):
es_es: Hemos añadido algunas notas y comentarios en recuadros. Cumplen varias funciones: pueden remarcar un punto difícil, complementar nociones del caso de estudio, definir algunos términos o servir como recordatorios. A continuación se muestra una lista de las anotaciones más comunes:
fr_fr: Nous avons placé dans des encadrés des notes et remarques diverses. Elles ont plusieurs rôles : attirer votre attention sur un point délicat, compléter ou détailler une notion abordée dans le cas d'étude, définir un terme, ou faire des rappels. Voici une liste non exhaustive de ces encadrés :
it_it: Abbiamo aggiunto alcune note e osservazioni nei riquadri evidenziati. Queste assolvono a svariati compiti: risaltare punti particolarmente difficili, completare una nozione del caso di studio, definire alcuni termini o servire da promemoria. Questa è un lista delle tipologie più comuni:
ja_jp: 我々はページ脇に注意とコメントを追加しています。これらには様々な役割があります: 扱い辛い点の注意、ケーススタディ概念の補足、専門用語の定義、リマインダの提供。以下はページ脇で最もよく使われる傍注のリストです:
pl_pl: Dodaliśmy kilka notatek i uwag w uzupełnieniach. Spełniają wiele zadań: mogą zwrócić uwagę na trudne miejsce, dopełnić pojęcie w studium przypadku, definiować pewne terminy lub służyć jako przypomnienia. Oto lista najczęściej występujących uzupełnień:
pt_br: Nós adicionamos algumas notas e observações nas barras laterais. Elas têm vários papéis: elas podem chamar a atenção para um ponto difícil, completar uma noção do estudo de caso, definir alguns termos, ou servir como lembretes. Aqui está uma lista das mais comuns destas barras laterais:
zh_cn: 我们在侧边栏加了一些笔记和评注。它们有很多作用：让一个难点引起你的注意，对一个实例研究作个备注，定义一些术语，或者只是提醒一下。这有一个常用侧边栏的列表：

source: BACK TO BASICS: a reminder for some information that is supposed to be known;
ar_ma: أساسيات: تذكرة ببعض المعلومات التي يفترض أنك تعرفها؛
el_gr: ΠΙΣΩ ΣΤΑ ΒΑΣΙΚΑ: μία υπενθύμιση για μερικές πληροφορίες η οποίες έπρεπε να είναι γνωστές;
es_es: VOLVER A LOS CIMIENTOS: un recordatorio acerca de información que se supone ya es conocida por el lector;
fr_fr: B.A.-BA : rappelle une information supposée connue du lecteur.
it_it: FONDAMENTALI: un promemoria per alcune informazioni che si suppone siano già note;
ja_jp: BACK TO BASICS: 知っておくべき情報に関するリマインダ;
pl_pl: WRACAJĄC DO PODSTAW: przypomnienie kilku informacji, które powinny być znane;
pt_br: DE VOLTA AO BÁSICO: um lembrete para alguma informação que supostamente é conhecida;
zh_cn: 基础知识：关于一些默认应该知道的信息的提醒；

source: VOCABULARY: defines a technical term, sometimes Debian specific;
ar_ma: مصطلحات: تعريف مصطلح تقني، وأحياناً مصطلح دبياني؛
el_gr: ΛΕΞΙΛΟΓΙΟ: προσδιορίζει ενα τεχνικό όρο, μερικές φορές εξειδικευμένο για Debian;
es_es: VOCABULARIO: define un término técnico, a veces específico de Debian;
fr_fr: VOCABULAIRE : définit un terme technique (parfois spécifique au projet Debian).
it_it: VOCABOLARIO: definisce un termine tecnico, alle volte specifico di Debian;
ja_jp: VOCABULARY: 専門用語の定義、時々 Debian 固有の専門用語;
pl_pl: SŁOWNIK: definiuje termin techniczny, czasem typowo Debianowy;
pt_br: VOCABULÁRIO: define um termo técnico, às vezes específico Debian;
zh_cn: 关键字：定义一个技术用语，有时候是 Debian 特定的用语；

source: COMMUNITY: highlights important persons or roles within the project;
ar_ma: مجتمع: إلقاء الضوء على شخص مهم أو دور ضمن المشروع؛
el_gr: ΚΟΙΝΟΤΗΤΑ: κυριότερα σημεία απο σημαντικά άτομα η ρόλους μέσα στη παραγωγή(project);
es_es: COMUNIDAD: resalta personas o roles importantes dentro del proyecto;
fr_fr: COMMUNAUTÉ : présente des personnages importants ou les rôles définis au sein du projet.
it_it: COMUNITÀ: evidenziano persone o ruoli importanti all'interno del progetto;
ja_jp: COMMUNITY: Debian プロジェクトにおける重要な人物および役割を強調;
pl_pl: SPOŁECZNOŚĆ: zaznacza ważne osoby lub role w ramach projektu;
pt_br: COMUNIDADE: destaca pessoas importantes ou funções dentro do projeto;
zh_cn: 社区：Debian 项目相关的重要的人或角色；

source: POLICY: a rule or recommendation from the Debian Policy. This document is essential within the project, and describes how to package software. The parts of policy highlighted in this book bring direct benefits to users (for example, knowing that the policy standardizes the location of documentation and examples makes it easy to find them even in a new package).
ar_ma: سياسة: قاعدة أو نصيحة من سياسة دبيان. هذه الوثيقة (Debian Policy) أساسية ضمن المشروع، وهي تشرح طريقة تحزيم البرامج. أجزاء السياسة التي نركز عليها في هذا الكتاب ذات فائدة مباشرة للمستخدمين (مثلاً، عندما تعرف أن السياسة تفرض موقعاً قياسياً لوضع الوثائق والأمثلة ستعثر بسهولة على هذه الملفات حتى في الحزم الجديدة).
el_gr: ΠΟΛΙΤΙΚΗ: ένας κανόνας η υπόδειξη της Debian πολιτικής. Αυτό το έγγραφο είναι ουσιαστικό μέσα πρόγραμμα και περιγράφει το πως να "πακετάρεις" λογισμικό. Τα μέρη της πολιτικής επισημαίνονται στο βιβλίο φέρνοντας άμεσα ωφέλει στους χρήστες (για παράδειγμα, ξέροντας οτι η πολιτική τυποποιεί ένα μέρος του εγγράφου και υποδεικνύει κάνοντας εύκολο να τα βρείς ακόμα και σε νέο πακέτο).
es_es: NORMA: una regla o recomendación de la Política de Debian («Debian Policy»). Este documento es esencial en el proyecto y describe cómo empaquetar software. Las partes de la política resaltadas en este libro proporcionarán beneficios directos a los usuarios (por ejemplo: el saber que estandariza la ubicación de la documentación y los ejemplos facilita encontrarlos incluso en un nuevo paquete).
fr_fr: CHARTE DEBIAN : évoque une règle ou recommandation de la « charte Debian ». Ce document essentiel décrit comment empaqueter les logiciels. Toutes ces connaissances s'avéreront utiles pour découvrir un nouveau logiciel. Tout paquet Debian devant se conformer à la charte, on saura ainsi où en trouver la documentation, des exemples de fichiers de configuration, etc.
it_it: SPECIFICHE: una regola o una raccomandazione delle Debian Policy. Questo documento è fondamentale all'interno del progetto, e descrive come realizzare un pacchetto software. Le parti delle specifiche evidenziate in questo libro portano benefici diretti agli utenti (ad esempio, sapere che le specifiche standardizzano la posizione della documentazione e degli esempi rende facile trovarli anche in un nuovo pacchetto).
ja_jp: POLICY: Debian ポリシーに基づく規則および勧告。Debian ポリシーは Debian プロジェクトにおいて不可欠なものであり、ソフトウェアをパッケージ化する方法を説明しています。この本が強調するポリシー内の箇所はユーザにとって直接の利益となるものです (例えば、ポリシーでは文書や例の場所が統一化されています。これを知ることでたとえ初見のパッケージであったとしても簡単に文書や例を探すことができます)。
pl_pl: POLITYKA: zasada lub zalecenia z Polityki Debiana. Ten dokument jest niezbędny w ramach projektu i opisuje sposób pakietowania oprogramowania. Elementy polityki wyróżnione w tej książce przynoszą bezpośrednie korzyści użytkownikom (np. wiedząc, że polityka standaryzuje lokalizację dokumentacji i przykładów sprawia, że łatwo je odnaleźć nawet w nowym pakiecie).
pt_br: POLÍTICA: uma regra ou recomendação da Política do Debian. Este documento é essencial dentro do projeto e descreve como empacotar software. As partes da política destacadas neste livro trazem benefícios diretos para os usuários (por exemplo, saber que a política padroniza a localização da documentação e exemplos torna fácil encontrá-los, mesmo em um novo pacote).
zh_cn: 政策：Debian Policy 中要求的规则或建议。Debian Policy 是 Debian 项目的重要文档，描述如何打包软件。本书中引用到的部分政策带给用户直接的好处（例如，知道了政策要求文档和示例的路径标准后，就算是面对一个新软件包也能很容易找到它们）。

source: TOOL: presents a relevant tool or service;
ar_ma: أدوات: يقدم أداة أو خدمة متعلقة بالموضوع المطروح؛
el_gr: ΕΡΓΑΛΕΙΟ: παρουσιάζει ένα σχετικό εργαλείο η υπηρεσία;
es_es: HERRAMIENTA: presenta una herramienta o servicio relevante;
fr_fr: OUTIL : présente un outil ou service pertinent.
it_it: STRUMENTO: presenta uno strumento o un servizio importante;
ja_jp: TOOL: 関連するツールやサービスの紹介;
pl_pl: NARZĘDZIE: przedstawia omawiane narzędzie lub usługę;
pt_br: FERRAMENTA: apresenta uma ferramenta ou serviço relevante;
zh_cn: 工具：代表相关的工具或服务；

source: IN PRACTICE: theory and practice do not always match; these sidebars contain advice resulting from our experience. They can also give detailed and concrete examples;
ar_ma: ممارسة عملية: النظرية والتطبيق لا يتفقان دائماً؛ تحوي هذه الملاحظات الجانبية نصائح نابعة من خبرتنا. كما يمكن أن تقدم أمثلة واقعية ومفصلة؛
el_gr: ΠΡΑΚΤΙΚΑ: θεωρία και πράξη συνήθως δεν πάνε μαζί; αυτοί οι πίνακες(sidebars) περιέχουν συμβουλές απο την εμπειρία μας. Μπορούν επίσης να δώσουν λεπτομερή και συγκεκριμένα παραδείγματα;
es_es: EN LA PRÁCTICA: la teoría y la práctica no siempre coinciden; estos recuadros contienen consejos que son el resultado de nuestra experiencia. También pueden proporcionar ejemplos detallados y concretos;
fr_fr: EN PRATIQUE : la pratique a parfois des spécificités, que présenteront ces encadrés. Ils pourront aussi donner des exemples détaillés et concrets.
it_it: IN PRATICA: teoria e pratica non sempre coincidono; questi riquadri contengono consigli pratici derivanti dalla nostra esperienza. Possono anche fornire esempi dettagliati e concreti.
ja_jp: IN PRACTICE: 理論と実際が常に適合しません; これらの傍注には我々が経験から導き出した助言を書いています。傍注には詳細で具体的な例を載せています;
pl_pl: W PRAKTYCE: teoria i praktyka nie zawsze sobie odpowiadają, te uzupełnienia zawierają porady wynikające z naszego doświadczenia; mogą również przedstawiać szczegółowe i konkretne przykłady;
pt_br: NA PRÁTICA: teoria e prática nem sempre coincidem; essas barras laterais contêm conselhos resultantes da nossa experiência. Eles também podem dar exemplos detalhados e concretos;
zh_cn: 实践：理论和实践不总是对应的；这类的侧边注记包含我们经过实践检验的意见，或者是详细而具体的例子。

source: other more or less frequent sidebars are rather explicit: CULTURE, TIP, CAUTION, GOING FURTHER, SECURITY, and so on.
ar_ma: هناك ملاحظات جانبية معناها واضح تتكرر أحياناً أو لا تتكرر: ثقافة، تلميح، تحذير، التعمق أكثر، أمن، وغيرها.
el_gr: άλλοι λιγότερο η περισσότερο συχνοί-γνωστοί πίνακες(sidebars) είναι κάπως σαφής: CULTURE, TIP, CAUTION, GOING FURTHER, SECURITY, and so on.
es_es: otros recuadros más o menos frecuentes son bastante explícitos: CULTURA, SUGERENCIA, PRECAUCIÓN, YENDO MÁS ALLÁ, SEGURIDAD y otros.
fr_fr: D'autres encadrés, plus ou moins fréquents, sont relativement explicites : CULTURE, ASTUCE, ATTENTION, POUR ALLER PLUS LOIN, SÉCURITÉ...
it_it: altri tipi di riquadri usati più o meno frequentemente hanno etichette piuttosto esplicite: CULTURA, SUGGERIMENTO, ATTENZIONE, APPROFONDIMENTI, SICUREZZA e così via.
ja_jp: その他の頻繁に使われる傍注に説明の必要はないでしょう: CULTURE、TIP、CAUTION、GOING FURTHER、SECURITY など。
pl_pl: inne częściej lub rzadziej występujące uzupełnienia są raczej jednoznaczne: KULTURA, PORADA, UWAGA, IDĄC DALEJ, BEZPIECZEŃSTWO, itd.
pt_br: outras barras laterais mais ou menos frequentes são bastante explícitas: CULTURA, DICA, CUIDADO, INDO ALÉM, SEGURANÇA, e assim por diante.
zh_cn: 其它或多或少的侧边注记就很明显了：文化、技巧、注意、更多、安全等等。

source: Acknowledgments
ar_ma: شكر وتقدير
el_gr: Επιβεβαιώσεις
es_es: Reconocimientos
fr_fr: Remerciements
it_it: Ringraziamenti
ja_jp: 謝辞
pl_pl: Podziękowania
pt_br: Agradecimentos
zh_cn: 致谢

source: A Bit of History
ar_ma: شيء من التاريخ
el_gr: Λίγο απο Ιστορία
es_es: Un poco de historia
fr_fr: Un peu d'histoire
it_it: Un po' di storia
ja_jp: 歴史小話
pl_pl: Trochę Historii
pt_br: Um pouco de História
zh_cn: 历史
