Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: The first edition of this book (in 2004) served to fill a gaping hole: it was the first French-language book that focused exclusively on Debian. At that time, many other books were written on the topic both for French-speaking and English-speaking readers. Unfortunately almost none of them got updated, and over the years the situation slipped back to one where there were very few good books on Debian. We hope that this book, which has started a new life with its translation into English (and several translations from English into various other languages), will fill this gap and help many users.
ar_ma: عملت النسخة اﻷولى من هذا الكتاب (عام 2004) على ردم هوة سحيقة: كانت أول كتاب فرنسي يركز حصرياً على دبيان. في ذلك الوقت، قدمت كتب أخرى عديدة عن نفس الموضوع للقراء الذين يتحدثون الفرنسية والإنكليزية على السواء. لكن لسوء الحظ لم يتابع تحديث أي منها، ومع مضي السنين وجدنا أنفسنا اليوم مرة أخرى في وضع لا يوجد فيه كتب جيدة عن دبيان إلا قلة قليلة جداً. نأمل بصدق أن يتمكن هذا الكتاب، الذي بدأ حياته من جديد بعد ترجمته إلى الإنكليزية (وعدة ترجمات من الإنكليزية إلى لغات متنوعة أخرى)، من ردم هذه الهوة ومساعدة العديد من المستخدمين.
es_es: La primera edición de este libro (en 2004) sirvió para llenar un vacío: fue el primer libro en francés que se centró exclusivamente en Debian. En ese momento se escribieron muchos otros libros sobre Debian, tanto para los lectores de habla francesa como para los de habla inglesa. Lamentablemente casi ninguno de ellos fue actualizado desde entonces, y con los años volvimos a una situación en la que había muy pocos libros buenos sobre Debian. Esperamos que este libro, que cobró vida nuevamente desde su traducción al inglés (y varias traducciones del inglés a muchos otros idiomas) llene este vacío y ayude a muchos usuarios.
fr_fr: La première édition de ce livre a comblé un manque criant : il s'agissait alors du premier livre français consacré exclusivement à Debian. À cette époque, de nombreux autres livres ont été écrits sur le sujet. Malheureusement, presque aucun de ceux-là n'ont été mis à jour et aujourd'hui nous sommes de nouveau dans une situation avec très peu de bons livres sur Debian. Nous espérons vraiment que ce livre (avec toutes ses traductions) va combler ce manque et aider de nombreux utilisateurs.
ja_jp: この本の初版 (2004 年) は大きな穴を埋める目的がありました: Debian だけに注目したの最初のフランス語によって書かれた本でした。当時、この話題に関して書かれた他の多くの本はフランス語と英語の読者向けに書かれていました。残念なことに、それらのほとんどすべてが更新されておらず、何年も Debian に関する良い本がほとんどない状況が続いていました。我々は英語に翻訳されて (英語からさらに他の言語に翻訳されて) から新たな人生が始まったこの本がこの溝を埋めて多くのユーザの助けになることを望んでいます。
pt_br: A primeira edição deste livro (de 2004) serviu para preencher uma lacuna: era o primeiro livro de língua francesa focado exclusivamente no Debian. Naquele tempo, muitos outros livros foram escritos sobre o tema para os leitores de francês e inglês. Infelizmente quase nenhum deles foi atualizado, e ao longo do tempo a situação foi piorando até o momento em que temos uns poucos bons livros sobre Debian. Nós esperamos que este livro, que iniciou uma nova vida com sua tradução para o inglês (e com várias traduções do inglês para outras línguas), preencha a lacuna e ajude muitos usuários.

source: Who Is this Book For?
ar_ma: لمن هذا الكتاب؟
el_gr: Για ποιόν είναι αυτό το βιβλίο;
es_es: ¿Para quién es este libro?
fr_fr: À qui s'adresse cet ouvrage ?
it_it: A chi è rivolto questo libro?
ja_jp: この本の対象者とは?
pl_pl: Dla Kogo jest Ta książka?
pt_br: Para quem é este Livro?
zh_cn: 本书为谁而写？

source: We tried to make this book useful for many categories of readers. First, systems administrators (both beginners and experienced) will find explanations about the installation and deployment of Debian on many computers. They will also get a glimpse of most of the services available on Debian, along with matching configuration instructions and a description of the specifics coming from the distribution. Understanding the mechanisms involved in Debian's development will enable them to deal with unforeseen problems, knowing that they can always find help within the community.
ar_ma: حاولنا أن نجعل هذا الكتاب مفيدًا لفئات عديدة من القراء. أولاً، سيجد مديرو اﻷنظمة (محترفين ومبتدئين على السواء) شروحات حول تثبيت ونشر دبيان على حواسيب متعددة. سيتمكنون أيضا من أخذ لمحة عن معظم الخدمات المتاحة على دبيان، بالإضافة إلى تعليمات إعداد هذه الخدمات ووصفاً لخصوصيات التوزيعة. إن فهم آليات التطوير المعتمدة في دبيان سيمكنهم من التعامل مع المشاكل غير المتوقعة، مع العلم أنهم يستطيعون دائماً الحصول على المساعدة من المجتمع.
el_gr: Προσπαθήσαμε να φτάξουμε αυτό το βιβλίο χρήσιμο για διάφορες κατηγορίες αναγνωστών. Πρώτα το σύστημα διαχείρισης (μαζί για αρχάριους και μ'εμπειρία) θα δώσει εξηγήσεις για θέματα εγκατάστασης και επέκτασης του Debian σε πολλά κομπιούτερς. Επίσης θα δώσει μια γρήγορη ματιά των διαθέσιμων υπηρεσιών στο Debian μαζί με σχετικές οδηγίες διευθέτησης και περιγραφής της διανομής. Κατανοώντας τους μηχανισμούς που περιλαμβάνει η ανάπτυξη Debian θα διαθέσει την δυνατότητα αντιμετώπισης απρόβλεπτων προβλημάτων, γνωρίζοντας οτι πάντοτε μπορούν να βοηθηθούν απο την κοινότητα.
es_es: Hemos intentado hacer un libro útil para muchas categorías de lectores. En primer lugar, administradores de sistemas (tanto principiantes como expertos) encontrarán explicaciones acerca de la instalación y despliegue en muchos equipos. También se harán una idea de la mayoría de los servicios disponibles en Debian, junto con las instrucciones de configuración y una descripción de las particularidades de la distribución. Comprender los mecanismos que tienen lugar en el desarrollo de Debian les capacitará para tratar con problemas imprevistos, sabiendo que siempre pueden contar con la ayuda de la comunidad.
fr_fr: Ses divers niveaux de lecture permettront à différents profils d'en tirer le meilleur parti. En premier lieu, les administrateurs système (débutants ou expérimentés) y trouveront des explications sur l'installation de Debian et son déploiement sur de nombreux postes ; mais aussi un aperçu de la plupart des services disponibles sur Debian avec les instructions de configuration correspondantes, qui prennent en compte les spécificités et améliorations de la distribution. La compréhension des mécanismes régissant le développement de Debian leur permettra encore de faire face à tout imprévu, en s'appuyant au besoin sur la collaboration des membres de la communauté.
it_it: Abbiamo cercato di rendere questo libro utile a molte categorie di lettori. Innanzitutto gli amministratori di sistema (sia principianti che esperti) troveranno spiegazioni a proposito dell'installazione e dell'utilizzo di Debian su molti computer; troveranno inoltre una panoramica sulla maggior parte dei servizi disponibili in Debian, assieme alle relative istruzioni di configurazione e la descrizione delle specifiche che provengono dalla distribuzione. Conoscere i meccanismi coinvolti nello sviluppo di Debian permetterà loro di affrontare problemi imprevisti sapendo che potranno sempre trovare aiuto nella comunità.
ja_jp: 我々はこの本が様々なタイプの読者にとって有益になるようにしました。最初に、システム管理者 (初心者もベテランも) に向けて、多数のコンピュータに Debian をインストールしてそれらを配備する方法についての説明を載せています。また、Debian で利用可能なほとんどのサービスの説明、併せて設定項目の説明と具体的に Debian でこれを設定する方法も載せています。手助けは常にコミュニティの中から得られるものであるということがわかれば、システム管理者は Debian の開発に利用される仕組みを理解することで不測の問題に対処することができるようになります。
pl_pl: Staraliśmy się napisać tę książkę w taki sposób, aby była użyteczna dla różnych grup czytelników. Na początek, administratorzy systemów (zarówno początkujący i doświadczeni) znajdą objaśnienia dotyczące instalacji i wdrożenia Debiana na wielu komputerach. Uzyskają również przegląd większości usług dostępnych na Debianie, razem z instrukcjami konfiguracji i opisem specyfiki związanej z tą dystrybucją. Zrozumienie mechanizmów związanych z rozwojem Debiana pozwoli im radzić sobie z nieprzewidzianymi problemami, wiedząc, że zawsze mogą szukać pomocy wśród społeczności.
pt_br: Tentamos fazer com que este livro fosse útil para muitas categorias de leitores. Primeiro, os administradores de sistemas (novatos e experientes) encontrarão explicações sobre a instalação e implementação do Debian em muitos computadores. Eles também terão uma idéia da maioria dos serviços disponíveis no Debian, juntamente com instruções de configuração correspondentes e uma descrição das especificidades provenientes da distribuição. Compreender os mecanismos envolvidos no desenvolvimento do Debian irá capacitá-los a lidar com problemas imprevistos, sabendo que podem sempre encontrar ajuda dentro da comunidade.
zh_cn: 我们试图让本书适用于不同类型的读者。首先，系统管理员（不管是初学者还是经验老道的）将会在书中找到关于在多台计算机上安装和部署 Debian 的说明；他们也将获得一个列表，罗列 Debian 所能提供的大多数服务，附带匹配的配置说明和发行版相关的细节描述；为使他们能够处理不可预见的问题，通过本书可了解 Debian 开发中所涉及的种种机制，并且让他们知道总能从社区中得到帮助。

source: Users of another Linux distribution, or of another Unix variant, will discover the specifics of Debian, and should become operational very quickly while benefiting fully from the unique advantages of this distribution.
ar_ma: سيكتشف مستخدمي توزيعات لينكس المختلفة، أو تنويعات يونكس الأخرى، تفاصيل دبيان، وينبغي أن يصبحوا قادرين على العمل عليها بشكل فاعل في وقت قصير، مع الاستفادة الكاملة من المزايا الفريدة في هذه التوزيعة.
es_es: Los usuarios de otras distribuciones de Linux, o de otra variante de Unix, descubrirán las características específicas de Debian y se adaptarán muy rápidamente mientras se benefician plenamente de las ventajas únicas de esta distribución.
fr_fr: Les utilisateurs d'une autre distribution Linux ou d'un autre Unix découvriront les spécificités de Debian ; ils y seront ainsi très vite opérationnels, tout en bénéficiant des avantages propres à cette distribution.
it_it: Gli utenti di altre distribuzioni Linux, o di altre varianti Unix, scopriranno le specifiche di Debian, e dovrebbero divenire rapidamente operativi beneficiando completamente dei vantaggi unici propri di questa distribuzione.
ja_jp: 他の Linux ディストリビューションや他の Unix 系 OS のユーザは、Debian の特徴の良さを理解し、Debian 特有の利点から恩恵を受けるのと同時に極めて短期間で Debian を操作できるようになるでしょう。
pl_pl: Użytkownicy innej dystrybucji Linuksa lub innej odmiany Uniksa poznają specyfikę Debiana i bardzo szybko nauczą się pracować wykorzystując w pełni unikatowe zalety tej dystrybucji.
zh_cn: 其它 Linux 发行版，或是 Unix 变种的用户，将会在书中发掘 Debian 的特性，并能在充分受益于 Debian 发行版独特优势的同时，很快投入实用。

source: Finally, readers who already have some knowledge of Debian and want to know more about the community behind it should see their expectations fulfilled. This book should make them much closer to joining us as contributors.
ar_ma: أخيرًا، سوف نرضي توقعات القراء الذين يعرفون القليل عن دبيان مسبقاً ويرغبون بمعرفة المزيد عن المجتمع الذي يقف خلفه. يجب أن يُقرّبهم هذا الكتاب أكثر للانضمام إلينا كمساهمين.
el_gr: Τέλος, αναγνώστες που ήδη έχουν κάποια γνώση του Debian και θέλουν να ξέρουν περισσότερα για την κοινότητα που ειναι πίσω, θ'ανακαλύψουν οτι οι προσδοκίες τους πραγματοποιούνται. Το βιβλίο αυτό θα τους κάνει να έλθουν κοντά και να γίνουν συντελεστές.
es_es: Finalmente, los lectores que ya tienen conocimientos previos de Debian y quieren conocer más acerca de la comunidad que se encuentra detrás de Debian verán sus expectativas cumplidas. Este libro debería acercarles mucho más a unirse a nosotros como colaboradores.
fr_fr: Enfin, tous ceux qui connaissent déjà un peu Debian et souhaitent en savoir plus sur son fonctionnement communautaire seront exaucés. Après la lecture de ce livre, ils pourront rejoindre les rangs de nos contributeurs.
it_it: Infine, i lettori che hanno già qualche conoscenza di Debian e vogliono conoscere di più a proposito della comunità alle sue spalle dovrebbero veder soddisfatte le loro aspettative. Questo libro dovrebbe avvicinarli ad unirsi a noi come collaboratori.
ja_jp: 最後に、すでに Debian に関する知識をある程度持っており Debian の背後にあるコミュニティについてさらに知りたいと思っている読者はその期待が満足されるでしょう。この本を読めば、読者は貢献者としてコミュニティに参加する敷居が下げられたと感じることでしょう。
pl_pl: Na koniec, czytelnicy posiadający już jakąś wiedzę o Debianie i chcący dowiedzieć się więcej o stojącej za nim społeczności również spełnią swoje oczekiwania. Ta książka powinna ich przybliżyć do dołączenia w charakterze współpracowników.
pt_br: Finalmente, os leitores que já têm algum conhecimento do Debian e querem saber mais sobre a comunidade por trás dele devem ver suas expectativas satisfeitas. Este livro deve deixá-los muito mais próximos de se juntar a nós, como colaboradores.
zh_cn: 最后，对于已经具备一些 Debian 相关知识的读者，若想揭开 Debian 背后社区的神秘面纱，本书将能满足这个愿望；并且，读者若有意作为贡献者加入 Debian 社区，亦将发现本书可助其一臂之力。

source: General Approach
ar_ma: التوجّه العام
es_es: Enfoque general
fr_fr: Approche adoptée
ja_jp: 全体的な方針
pt_br: Abordagem Geral
zh_cn: 一般方法

source: All of the generic documentation you can find about GNU/Linux also applies to Debian, since Debian includes most common free software. However, the distribution brings many enhancements, which is why we chose to primarily describe the “Debian way” of doing things.
ar_ma: كل الوثائق العامة التي تتحدث عن غنو/لينكس التي تستطيع الوصول إليها تنطبق أيضاً على دبيان، بما أن دبيان يتضمن البرمجيات الحرة مفتوحة المصدر اﻷكثر شيوعاً. لكن التوزيعة تقدم العديد من التحسينات، لذلك اخترنا أن نشرح ”الطريقة الدبيانية“ في تنفيذ الأمور بشكل أساسي.
el_gr: Όλη η χαρακτηριστική τεκμηρίωση που μπορείς να βρείς για GNU/Linux επίσης ισχύει και για Debian συμπεριλαμβάνοντας πολλα κοινά απο ελεύθερο λογισμικό. Παρ'ολ'αυτά, η διανομή κουβαλά πολλά πρόσθετα τα οποία επελέξαμε κατ'αρχήν να περιγράψουμε σαν "Debian τρόπος" του να κάνεις πράματα.
es_es: Toda la documentación genérica que pueda encontrar acerca de GNU/Linux también es aplicable a Debian ya que Debian incluye la mayoría del software libre. Sin embargo, la distribución incorpora muchas mejoras, por lo que hemos decidido describir en primer lugar la «forma Debian» de hacer las cosas.
fr_fr: Toutes les documentations génériques concernant GNU/Linux s'appliquent à Debian, qui propose les logiciels libres les plus courants. Cette distribution apporte cependant de nombreuses améliorations ; c'est pourquoi nous avons pris le parti de présenter en priorité les manières de procéder recommandées par Debian.
ja_jp: Debian に含まれるフリーソフトウェアは非常に一般的なものであるため、GNU/Linux について書かれた一般的文書はどんなものでも Debian に適用することができます。一方で、Debian ディストリビューションは多くの改良を行います。そのため我々は最初に「Debian 流」のやり方を説明することに決めました。
pl_pl: Całość ogólnej dokumentacji, którą można znaleźć na temat GNU/Linux, stosuje się również do Debiana, ponieważ zawiera on większość popularnego wolnego oprogramowania. Jednakże ta dystrybucja zawiera wiele usprawnień, dlatego zdecydowaliśmy się opisać głównie "Debianowy sposób" wykonywania zadań.
pt_br: Toda a documentação genérica que você possa encontrar sobre GNU/Linux também se aplica ao Debian, já que o Debian inclui os softwares livres mais comuns. No entanto, a distribuição traz muitas melhorias, razão pela qual optou-se primeiramente por descrever o "modo do Debian" de fazer as coisas.
zh_cn: 所有你能找到的适用于 GNU/Linux 的通用文档也适用于 Debian，因为 Debian 包括最常见的自由软件。不过，作为一个发行版， Debian 带来了许多改进，这就是为什么我们写本书时着重描述如何以“Debian 风格”行事。

source: It is interesting to follow the Debian recommendations, but it is even better to understand their rationale. Therefore, we won't restrict ourselves to practical explanations only; we will also describe the project's workings, so as to provide you with comprehensive and consistent knowledge.
ar_ma: من المفيد اتباع توصيات دبيان، ولكن يبقى الأفضل فهم الدواعي المنطقية وراء هذه التوصيات. بناء عليه، لن نقيّد أنفسنا بالشرح العملي فقط؛ بل سنشرح أيضاً طريقة عمل المشروع، حتى تصل إلى فهم شامل ومتين.
el_gr: Έχει ενδιαφέρον το ν'ακολουθείς Debian υποδείξεις, αλλά ακόμα καλύτερα το να καταλάβεις την αιτιολογία. Γι'αυτό, δεν θα περιοριστούμε σε πρακτικές εξηγήσεων μονο; επίσης θα περιγράψουμε πως το σύστημα δουλεύει ώστε να σου παρέχει περιεκτικές και σταθερές γνώσεις.
es_es: Es importante seguir las recomendaciones de Debian, pero es aún más importante entender sus razones. Por lo tanto, no nos limitaremos sólamente a explicaciones prácticas; también describiremos la forma en la que funciona el proyecto para brindarle un conocimiento exhaustivo y consistente.
fr_fr: Il est bien de suivre le chemin tracé par Debian, mais mieux encore d'en comprendre les tenants et les aboutissants. Nous ne nous contenterons donc pas d'explications pratiques, mais détaillerons également le fonctionnement du projet, afin de vous fournir des connaissances complètes et cohérentes.
it_it: È interessante seguire le raccomandazioni di Debian, ma è molto meglio capire le loro motivazioni. Quindi, non ci limiteremo alle spiegazioni pratiche; cercheremo anche di descrivere il funzionamento del progetto per fornire conoscenze esaustive e coerenti.
ja_jp: Debian の推薦に従うことは興味深いですが、推薦理由を理解することの方がさらに望ましいものです。我々は読者に包括的で一貫性のある知識を提供するために、実用的な説明だけでなくプロジェクトの仕組みに関する説明も載せています。
pl_pl: Postępując zgodnie z zaleceniami odnośnie Debiana jest interesujące, ale lepiej jest zrozumieć ich uzasadnienie. Z tego powodu, nie ograniczamy się jedynie do praktycznych wyjaśnień. Opiszemy również funkcjonowanie projektu tak, aby dostarczyć wyczerpującej i spójnej wiedzy.
pt_br: É interessante seguir as recomendações do Debian, mas é ainda melhor compreender a sua lógica. Portanto, não nos restringiremos a explicações práticas apenas; também vamos descrever o funcionamento do projeto, de modo a proporcionar-lhe um conhecimento abrangente e consistente.
zh_cn: 按照 Debian 推荐的方式做事是很有意思的，但若能理解其基本原理则更好。因此，我们不会仅局限于操作说明上，我们也将描述项目内部的运作机制，以便提供读者全面和一致的认知。

source: Book Structure
ar_ma: بنية الكتاب
el_gr: Δομή του βιβλίου
es_es: Estructura del libro
fr_fr: Structure du livre
it_it: Struttura del libro
ja_jp: 本書の構造
pl_pl: Struktura książki
pt_br: Estrutura do Livro
zh_cn: 本书结构

source: This book has its origins in French publisher Eyrolles' “Administrator's Handbook” collection, and keeps the same approach of revolving around a case study providing both support and illustration for all topics being addressed.
ar_ma: نشأ هذا الكتاب كواحد من مجموعة ”Administrator's Handbook“ التابعة لدار النشر الفرنسية Eyrolles، وهو يحافظ على الأسلوب نفسه في مركزة الشرح حول حالة مدروسة واحدة تدعم المواضيع المطروحة وتقربها لذهن القارئ.
es_es: Este libro nace en la colección «Libro del Administrador» de la editorial francesa Eyrolles, y mantiene el mismo enfoque en torno a un caso de estudio que proporciona apoyo y ejemplos de todos los temas abordados en el mismo.
fr_fr: Bien qu'étant une traduction, il n'en reste pas moins que ce livre trouve ses origines dans la collection « Cahiers de l'Admin » de Eyrolles et, comme tous les ouvrages de cette collection, il s'articulera autour d'un cas d'étude concret qui servira à la fois de support et d'illustration pour tous les sujets traités.
ja_jp: この本はフランスの出版社 Eyrolles の「Administrator's Handbook」シリーズを起源としており、このシリーズと同様の、文章と図を使って取り上げられた全てのトピックを解説しながらケーススタディを中心に話を展開する、方針を採っています。
pt_br: Este livro tem suas origens na série "Guia do Administrador" da editora francesa Eyrolles, e mantém a mesma abordagem de resoluções em torno de um estudo de caso fornecendo apoio e ilustração para todos os tópicos tratados.

source: <emphasis>NOTE</emphasis> Web site, authors' email
ar_ma: <emphasis>ملاحظة</emphasis> موقع الوب، البريد الإلكتروني للمؤلف
es_es: <emphasis>NOTA</emphasis> Sitio web, email del autor
fr_fr: <emphasis>NOTE</emphasis> Site web et courriel des auteurs
it_it: <emphasis>NOTA</emphasis> Sito Web, email degli autori
ja_jp: <emphasis>NOTE</emphasis> ウェブサイト、著者の電子メールアドレス
pl_pl: <emphasis>NOTATKA</emphasis> Witryna internetowa, email autorów
pt_br: <emphasis>NOTA</emphasis> Página Web, email dos autores
zh_cn: <emphasis>笔记</emphasis>网站，作者的电子邮件
