Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: Last but not least, thank you to my wife, Sophie. She has been very supportive of my work on this book and on Debian in general. There have been too many days (and nights) when I left her alone with our 2 sons to make some progress on the book. I am grateful for her support and know how lucky I am to have her.
ar_ma: أخيراً وليس آخراً، شكراً لزوجتي صوفي، التي دعمتني كثيراً خلال عملي على هذا الكتاب وعلى دبيان بصفة عامّة. كانت هناك الكثير من الأيام (والليالي) التي تركتها فيها وحيدة مع طفلانا من أجل إحراز بعض التقدم في الكتاب. وأنا ممتن لدعمها وهي تعرف كم أنا محظوظ بوجودها.
es_es: Por último, pero no menos importante, gracias a mi esposa Sophie. Ha sido un gran apoyo para mi trabajo en este libro y en Debian en general. Hubo demasiados días (y noches) en que la dejé sola con nuestros 2 hijos para lograr avanzar algo en el libro. Estoy muy agradecido por su apoyo y sé lo afortunado que soy de tenerla.
fr_fr: Pour terminer, merci à mon épouse, Sophie. Elle m'a toujours soutenu dans mon travail pour ce livre et pour Debian en général. Il y a eu trop de jours (et de nuits) où je l'ai laissée seule avec nos deux fils pour avancer sur ce livre. Je lui suis très reconnaissant pour son soutien et je sais à quel point j'ai de la chance de l'avoir.
ja_jp: 最後に大切なことを言いますが、私の妻 Sophie にも感謝しています。彼女はこの本と一般に Debian に関する仕事にとても協力的でした。私は幾日 (幾夜) もこの本の仕事のために 2 人の息子と一緒に彼女を放っておくことがありました。私は彼女の支援にとても感謝しており、そして彼女に巡り合えたことが非常に幸運なことだ思っています。
pt_br: Por último mas não menos importante, agradeço à minha esposa, Sophie. Ela deu muito apoio ao meu trabalho neste livro e para o Debian em geral. Houve muitos dias (e noites), quando eu a deixei sozinha com nossos 2 filhos para fazer algum progresso no livro. Eu sou grato pelo seu apoio e sei quanta sorte eu tenho por tê-la.

source: Personal Acknowledgments from Roland
ar_ma: شكر وتقدير شخصي من رولاند
el_gr: Προσωπικές Παραδοχές του Roland
es_es: Agradecimientos personales de Roland
fr_fr: Remerciements personnels de Roland
it_it: Ringraziamenti personali di Roland
ja_jp: Roland さんからの個人的なお礼
pl_pl: Osobiste Podziękowania od Roland'a
pt_br: Agradecimentos pessoais de Roland
zh_cn: Roland 的个人致谢

source: Well, Raphaël preempted most of my “external” thank-yous already. I am still going to emphasize my personal gratitude to the good folks at Eyrolles, with whom collaboration has always been pleasant and smooth. Hopefully the results of their excellent advice hasn't been lost in translation.
ar_ma: حسناً، لقد استبق رافائيل معظم من أرغب بشكرهم. ولكن لا زلت أرغب بالتشديد على امتناني الشخصي للأشخاص الطيبين في Eyrolles، الذين كان التنسيق معهم ساراً ولطيفاً دائماً. آمل أن نتائج نصائحهم الممتازة لم تضع في الترجمة.
el_gr: Λοιπόν, ο Raphaël εξέφρασε ήδη κατά πάρα πολύ τις ευχαριστίες του. Με έμφαση θέλω να εκφράσω την ευγνωμοσύνη μου στους φίλους της Eyrolles, όπου η συνεργασία μαζί τους ήταν ευχάριστη και απλή αλλά και ελπίζω τ' αποτελέσματα των εξαιρετικών των συμβουλών δεν χάθηκε στην μετάφραση.
es_es: Bien, Raphaël ya adelantó gran parte de mis agradecimientos «externos». Aún así, voy a enfatizar mi agradecimiento personal a la buena gente de Eyrolles con la que la colaboración siempre ha sido agradable y fluida. Esperemos que los resultados de sus excelentes consejos no se hayan perdido en la traducción.
fr_fr: Eh bien ! Raphaël m'a devancé sur la plupart de mes remerciements « externes ». Je vais tout de même exprimer ma gratitude particulière envers les gens d'Eyrolles, avec qui la collaboration a toujours été agréable et fluide. J'espère que les résultats de leurs excellents conseils ne se sont pas perdus lors de la traduction.
ja_jp: さて、Raphaël さんが先に「外部向けの」感謝の言葉を述べてくれました。私はさらに協力体制が常に心地よく、順調だった Eyrolles のよい仲間たちに対して、私の個人的な感謝の気持ちを強調したいと思います。願わくば、彼らの優れた助言が翻訳作業においても続きますように。
pl_pl: Dobrze, Raphaël wypisał już większość z "zewnętrznych" podziękowań. Chciałbym jednak podkreślić moje osobiste podziękowania dla dobrych ludzi z Eyrolles, z którymi współpraca zawsze była przyjemna i bezproblemowa. Mam nadzieję, że wyniki ich doskonałych porad nie zostały utracone w tłumaczeniu.
pt_br: Bem, Raphaël já antecipou a maior parte dos agradecimentos "externos". Eu vou enfatizar o meu agradecimento pessoal para o pessoal da Eyrolles, com quem a colaboração tem sido sempre agradável e tranquila. Esperamos que os resultados de seus excelentes conselhos não se percam na tradução.
zh_cn: 好吧，Raphaël 把很多我的“对外”感谢都先说了，但我还是要强调我个人对 Eyrolles 的好伙计们的感激，和他们的合作总是那么地愉快而顺畅。希望他们的优秀建议并没有在翻译中被埋没。

source: I am extremely grateful to Raphaël for taking on the administrative part of this English edition. From organizing the funding campaign to the last details of the book layout, producing a translated book is so much more than just translating and proofreading, and Raphaël did (or delegated and supervised) it all. So thanks.
ar_ma: أنا ممتن جداً لرافائيل لاستلامه أعمال الإشراف على هذه الطبعة الإنكليزية. بداية من تنظيم حملة التبرعات إلى آخر تفاصيل تصميم هذا الكتاب. إخراج كتاب مترجم أكثر بكثير من ترجمته فقط وتدقيقه، وقد أنجز رافائيل (أو أشرف وتابع) كل ما يتعلق بالكتاب. لذا شكراً.
el_gr: Είμαι εξαιρετικά ευγνώμων που ο Raphaël ανέλαβε το διαχειριστικό μέρος αυτής της Αγγλικής έκδοσης. Απο την οργάνωση της οικονομικής εκστρατείας μέχρι της τελευταίας λεπτομέρειας διακόσμησης του βιβλίου, δημιουργώντας ένα μεταφρασμένο βιβλίο το οποίο ειναι πολύ πάνω απο μιά απλή μετάφραση κι ένα αποδεικτικό κείμενο και ναι ο Raphaël το έκανε (αναθέτοντας κι επιβλέποντας) τα πάντα. Λοιπόν τον ευχαριστώ.
es_es: Estoy extremadamente agradecido a Raphaël por llevar a cabo la parte administrativa de la edición en inglés. Desde organizar la campaña para obtener fondos hasta los detalles de la apariencia del libro, crear un libro traducido es mucho más que una simple traducción y una corrección, Raphaël lo hizo todo (o por lo menos delegó y lo supervisó). Así que gracias.
fr_fr: Je suis très reconnaissant envers Raphaël pour s'être occupé de la partie administrative de l'édition anglaise. De l'organisation de la campagne de financement aux derniers détails de la maquette et de la mise en page, la préparation d'un livre traduit va bien au-delà de la simple traduction (et de la relecture) ; Raphaël en a fait une grande partie et a supervisé le reste. Merci.
it_it: Sono estremamente grato a Raphaël per aver seguito la parte amministrativa di questa edizione inglese. Dall'aver organizzato la campagna di finanziamento agli ultimi dettagli dell'impaginazione del libro, produrre un libro tradotto è molto più di una semplice traduzione e correzione di bozze, e Raphaël ha fatto (o delegato e supervisionato) tutto. Quindi grazie.
ja_jp: 私は英語版発行に係る事務的な部分を引き受けてくれたことを Raphaël さんに非常に感謝しています。ファンディングキャンペーンの企画から、本のレイアウトの細部にわたるまで、翻訳本の制作は翻訳と校正だけにでなくはるかにたくさんの作業が必要になります。Raphaël さんはそのすべてを行い (代表および指揮し) ました。本当に感謝しています。
pl_pl: Jestem niesamowicie wdzięczny Raphaël za powierzenie mi administrowania anglojęzycznym wydaniem. Poczynając od organizowania kampanii finansującej do najdrobniejszych szczegółów wyglądy książki, tworzenie przetłumaczonej książki, to o wiele więcej, niż tylko tłumaczenie i korekta, a Raphaël zrobił (lub oddelegował i nadzorował) to wszystko. Więc, dziękuję.
pt_br: Eu estou extremamente grato a Raphaël por assumir a parte administrativa desta edição em inglês. De organizar a campanha de financiamento para os últimos detalhes do leiaute do livro, produzindo um livro traduzido é muito mais do que apenas traduzir e revisar, e Raphaël fez (ou delegou e supervisionou) tudo. Então, obrigado.
zh_cn: 我极度感谢 Raphaël 负责了本书英文版的管理部分工作。从组织基金活动到书本布局的最终细节，制作一本译本比翻译和校对要多很多工作，Raphaël 把这些工作都做了（或委派、监督其他人做了）。太感谢了。

source: Thanks also to all who more or less directly contributed to this book, by providing clarifications or explanations, or translating advice. They are too many to mention, but most of them can usually be found on various #debian-* IRC channels.
ar_ma: الشكر أيضاً لكل من ساهم مباشرة في هذا الكتاب سواء بقدر قليل أو كثير، من خلال تقديم توضيحات أو تفسيرات، أو نصائح تتعلق بالترجمة. عدد هؤلاء كبير جداً ولا يمكن ذكرهم، ولكن يمكن العثور عادة على معظمهم على مختلف قنوات IRC التي يبدأ اسمها بـ ‎#debian-*‎.
el_gr: Ευχαριστώ επίσης όλους εκείνους που λίγο-πολύ ευθέως συνείσφεραν για το βιβλίο, παρέχοντας διευκρινήσεις η εξηγήσεις η μεταφραστικές συμβουλές. Υπάρχουν πολλοί που πρέπει ν' αναφερθούν αλλα περισσότεροι συνήθως μπορούν να βρεθούν μέσα απο τα διάφορα #debian-* IRC κανάλια.
es_es: Gracias también a todos los que han contribuido más o menos directamente con este libro, proporcionando aclaraciones, explicaciones o consejos para la traducción. Son demasiados para mencionar, pero la mayoría de ellos se pueden encontrar en varios canales de IRC de #debian-*.
fr_fr: Merci aussi à tous ceux qui ont contribué de manière plus ou moins directe à ce livre, en apportant clarifications, explications et conseils de traduction. Ils (et elles !) sont trop nombreux pour être listés ici, mais une bonne partie sont des habitués des divers canaux IRC #debian-*.
it_it: Grazie anche a tutti coloro che più o meno direttamente hanno contribuito a questo libro, fornendo chiarimenti o spiegazioni e consigli sulla traduzione. Sono troppi da citare, ma la maggior parte di loro di solito può essere trovata nei diversi canali IRC #debian-*.
ja_jp: 程度の差はあるにせよ明確化や説明、翻訳のアドバイスを提供することでこの本に直接的な貢献をしてくださったすべての人に感謝しています。名前を挙げるには多すぎますが、ほとんどの人が #debian-* IRC チャンネルの参加者です。
pl_pl: Dziękuję również wszystkim, którzy mniej lub bardziej bezpośrednio przyczynili się do książki, dostarczając uściślenia lub wyjaśnienia, lub doradzając w tłumaczeniu. Jest ich zbyt wiele, aby wszystkich wymienić, ale większość z nich można zazwyczaj znaleźć na różnych kanałach IRC #debian-*.
pt_br: Obrigado também a todos aqueles que mais ou menos diretamente contribuíram para este livro, fornecendo esclarecimentos ou explicações, ou conselhos de tradução. Eles são muitos para mencionar, mas a maioria deles podem ser encontrados em vários canais de IRC #debian-*.
zh_cn: 也感谢那些对本书或多或少有直接贡献的人们，例如那些提供澄清和解释，或者提供翻译建议的人们。他们太多了不好一一列举，但大多数都能在各个 #debian-* 的 IRC 频道里找到。

source: There is of course some overlap with the previous set of people, but specific thanks are still in order for the people who actually do Debian. There wouldn't be much of a book without them, and I am still amazed at what the Debian project as a whole produces and makes available to any and all.
ar_ma: وهناك بالطبع بعض التداخل مع المجموعات السابقة من الناس، ولكن لا بد من الشكر المخصوص لأولئك الذين يعملون في دبيان. لا يمكن أن يكون هناك كتاب من دونهم، وما زلت أشعر بالدهشة من إنتاجات مشروع دبيان ككل التي يتيحها لأي شخص ولكل شخص.
el_gr: Βέβαια υπάρχει σίγουρα μια κάποια "επικάλυψη" ανθρώπων, αλλά ειδικά ευχαριστώ στους ανθρώπους που λειτουργούν με Debian. Δεν θα υπήρχε το βιβλίο χωρίς αυτούς και είμαι έκπληκτος το πως η Debian παραγωγή με όλα τα παράγωγα το κάνει διαθέσιμο στον καθένα και σε όλα.
es_es: Hay, por supuesto, algo de superposición con el conjunto de personas anterior, pero merecen agradecimientos específicos aquellos que hacen Debian específicamente. No habría libro sin ellos, y todavía estoy sorprendido por lo que el proyecto Debian en su conjunto produce y pone a disposición de todos y cada uno.
fr_fr: Même si elles ont été (en partie) citées, d'autres personnes méritent des remerciements spéciaux : toutes celles qui travaillent réellement sur Debian. Sans eux et sans elles, pas de Debian, donc pas de livre. Et je suis continuellement ébahi par tout ce que le projet Debian accomplit et rend accessible à tous.
it_it: C'è una certa sovrapposizione con il precedente insieme di persone, ma un ringraziamento particolare va alle persone che contribuiscono effettivamente a Debian. Non ci sarebbe questo libro senza di loro, e sono ancora stupito di quello che il progetto Debian nel suo complesso mette a disposizione di tutti.
ja_jp: もちろん先に挙げた人と重なる部分もありますが、実際に Debian を開発している人に特に感謝します。彼らがいなければ多くの本は存在しなかったでしょうし、私はまだ Debian プロジェクト全体の製品と誰でもそれを利用可能である点に驚かされます。
pl_pl: Oczywiście część z osób pokrywa się z poprzednim zbiorem, ale szczególne podziękowania należą się tym, którzy tworzą Debiana. Bez nich nie byłoby wiele z tej książki i nadal jestem oszołomiony tym, co projekt Debian tworzy jako całość, i udostępnia dla każdego.
pt_br: Há, naturalmente, alguma sobreposição com o conjunto anterior de pessoas, mas agradecimentos específicos ainda valem para as pessoas que realmente fazem o Debian. Muito deste livro não exsitiria sem eles, e eu ainda estou admirado com o que o projeto Debian como um todo produz e disponibiliza para qualquer pessoa.
zh_cn: 当然前面这几部分人里肯定是有重复的，但接下来还是要特别感谢的就是直接在为 Debian 努力的人们。没有他们就不会有这么一本书。Debian 项目作为一个整体能对任何人和所有人开放，对此我至今依然赞叹不已。

source: More personal thanks go to my friends and my clients, for their understanding when I was less responsive because I was working on this book, and also for their constant support, encouragement and egging on. You know who you are; thanks.
ar_ma: أشكر أصدقائي وزبائني مرة أخرى، لتفهمهم عندما كنت أقل تجاوباً بسبب عملي على هذا الكتاب، وأيضا لدعمهم المستمر، وتشجيعهم وتحفيزهم. أنتم تعلمون أنفسكم؛ شكراً.
el_gr: Περισσότερα προσωπικά ευχαριστώ στους φίλους και πελάτες για την κατανόησή τους για την μη υπευθυνότητά μου διότι με απασχολούσε η δουλειά του βιβλίου και την αδιάκοπη υποστήριξή τους και ενθάρρυνσή τους. Ξέρετε ποιοί είστε; ευχαριστώ.
es_es: Agradezco más personalmente a mis amigos y mis clientes, por su comprensión cuando demoraba en responder porque estaba trabajando en este libro, y también por su constante apoyo, aliento e inspiración. Ustedes saben quienes son, gracias.
fr_fr: De manière plus personnelle, je voudrais remercier mes amis et mes clients pour leur compréhension lorsque j'étais moins réactif parce que très occupé par ce livre, et pour leur soutien et leurs encouragements constants. Vous savez qui vous êtes, merci.
it_it: Un ringraziamento più personale va ai miei amici ed ai miei clienti, per la loro comprensione quando ero meno scattante alle loro richieste perché ero impegnato alla stesura di questo libro, e anche per il loro costante supporto e incoraggiamento. Voi sapete chi siete, grazie
ja_jp: 私は個人的に私の友人と依頼人が、この本に関する仕事中に反応が遅かったことに理解を示してくれたこと、継続的に支援や激励や動機づけをしてくれたこと、に感謝しています。本人はそれが自分であることがはずです; ありがとう。
pl_pl: Bardziej osobiste podziękowania dla moich przyjaciół i klientów, za ich zrozumienie, kiedy byłem mniej osiągalny z powodu pracy nad książką oraz za ich ciągłe wsparcie, doping i zachętę.
pt_br: Mais agradecimentos pessoais vão para os meus amigos e clientes, por sua compreensão quando eu estava menos responsivo, pois estava trabalhando neste livro, e também pelo seu apoio constante, incentivo e orientação. Você sabe quem você é; obrigado.
zh_cn: 更多的个人感谢给予我的朋友们和客户们，我在为这本书努力的时候变得不太响应其他事情，感谢他们的理解，也感谢他们一贯的支持、鼓励和鼓动。是谁你懂的。谢谢。

source: And finally; I am sure they would be surprised by being mentioned here, but I would like to extend my gratitude to Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, and of course the late Douglas Adams. The countless hours I spent enjoying their books are directly responsible for my being able to take part in translating one first and writing new parts later.
ar_ma: وأخيراً؛ أنا متأكد من أنهم سيفاجئون لذكرهم هنا، ولكن أرغب بتقديم شكري إلى Terry Pratchett، ‏Jasper Fforde، ‏Tom Holt، ‏William Gibson، ‏Neal Stephenson وطبعاً للراحل Douglas Adams. كانت الساعات التي لا تحصى التي أنفقتها بالاستمتاع بقراءة كتبهم مسؤولة بشكل مباشر عن تمكيني من المشاركة في ترجمة أحد الكتب أولاً وكتابة أجزاء جديدة لاحقاً.
es_es: Por último, y estoy seguro de que se sorprenderían por ser mencionados aquí, pero me gustaría expresar mi agradecimiento a Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson y por supuesto al difunto Douglas Adams. Las incontables horas que pasé disfrutando de sus libros son directamente responsables de que yo sea capaz de formar parte primero en la traducción de uno y luego escribiendo nuevas partes.
fr_fr: Et pour terminer… je suis sûr qu'ils seraient surpris d'apprendre qu'ils sont mentionnés ici, mais je voudrais exprimer publiquement ma gratitude envers Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson et bien entendu le regretté Douglas Adams. Les innombrables heures que j'ai passées plongé dans leurs livres sont directement impliquées dans ma capacité à participer à la traduction de ce livre d'abord et à la rédaction de nouvelles parties ensuite.
ja_jp: 最後に; 彼らは間違いなくここで言及されたことに驚くと思いますが、Terry Pratchett さん、Jasper Fforde さん、Tom Holt さん、William Gibson さん、Neal Stephenson さん、そして最後に Douglas Adams さんに感謝します。この本を楽しむために無限の時間を費やすことができたおかげで、私はまず翻訳、のちに新しいパートの執筆に参加することができました。
pt_br: E, finalmente, estou certo de que ficariam surpresos ao ser mencionado aqui, mas gostaria de estender minha gratidão a Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, e, claro, o falecido Douglas Adams. As incontáveis horas que passei desfrutando seus livros são diretamente responsáveis por eu ser capaz de fazer parte na tradução de um e logo escrever novas partes.
zh_cn: 最后，我确信他们会因为在这里被提到而吃惊，可我还是要把我的感谢再加给 Terry Pratchett，Jasper Fforde，Tom Holt，William Gibson，Neal Stephenson，当然还有已故的 Douglas Adams。无数个小时畅享他们的书，直接使我有能力参与翻译本书并续写新的篇章。

source: Linux has been garnering strength for the last few years, and its growing popularity drives more and more users to make the jump. The first step on that path is to pick a distribution. This is an important decision, because each distribution has its own peculiarities, and future migration costs can be avoided if the right choice is made from the start.
el_gr: Το Linux τα τελευταία δύο χρόνια έχει γίνει ρωμαλέο και η αύξηση της δημοτικότητάς του οδηγεί όλο και πιο πολλούς χρήστες να μεταπηδήσουν. Το πρώτο βήμα σ'αυτό το μονοπάτι ειναι η επιλογή μιάς διανομής. Είναι σημαντική απόφαση διότι κάθε διανομή έχει τις δικές της ιδιαιτερότητες και δια το κόστος μιας μελλοντικής μετανάστευσης η σωστή απόφαση πρέπει να γίνει απο την αρχή.
it_it: Linux negli ultimi anni ha rafforzato la propria posizione e la sua crescente popolarità porta sempre più utenti a fare il salto. Il primo passo lungo questo percorso è la scelta di una distribuzione. Questa è una decisione importante poiché ogni distribuzione ha le proprie peculiarità e futuri costi di migrazione possono essere evitati se la scelta iniziale è quella giusta.
pl_pl: Linuks zyskiwał na sile przez ostatnie lata, a jego rosnąca popularność skłania coraz więcej użytkowników do podjęcia zmian. Pierwszym krokiem na tej drodze jest wybranie dystrybucji. Jest to ważna decyzja, ponieważ każda z nich ma swoją specyfikę, a przyszłych kosztów migracji można uniknąć, jeżeli na początku podejmie się właściwą decyzję.

source: Strictly speaking, Linux is only a kernel, the core piece of software sitting between the hardware and the applications.
el_gr: Για την ακρίβεια, το Linux ειναι μόνο ο kernel, η καρδιά ενός λογισμικού όπου κάθεται ανάμεσα στον εξοπλισμό του υπολογιστή και των εφαρμογών.
it_it: In senso stretto, Linux è solo un kernel, la parte di software di collegamento tra l'hardware e le applicazioni
pl_pl: Ściśle mówiąc, Linuks to tylko jądro, rdzenna część oprogramowania znajdująca się pomiędzy sprzętem, a aplikacjami.

source: A «Linux distribution» is a full operating system; it usually includes the Linux kernel, an installer program, and most importantly applications and other software required to turn a computer into an actually useful tool.
it_it: Una «distribuzione Linux» è un sistema operativo completo; solitamente include il kernel Linux, un programma di installazione e soprattutto, le applicazioni e i software necessari per trasformare un computer in uno strumento effettivamente utile.

source: Debian GNU/Linux is a «generic» Linux distribution that fits most users. The purpose of this book is to show its many aspects so you can make an informed decision when choosing.
it_it: Debian GNU/Linux è una distribuzione Linux «generica» che soddisfa la maggior parte degli utenti. Il proposito di questo libro è di illustrarne i suoi molteplici aspetti così da permettere di prendere una decisione consapevole al momento della (propria) scelta.

source: At the other end of the spectrum lie the likes of Debian and the Apache Software Foundation (which hosts the development for the Apache web server). Debian is above all a project in the Free Software world, implemented by volunteers working together through the Internet.
el_gr: Απο την άλλη το φάσμα ψεύδους ομοιότητας του Debian και Apache Software Foundation (το οποίο φιλοξενεί την ανάπτυξη του Apache web server). Του Debian τα προγράμματα ειναι, πάνω απ'όλα, ελεύθερου λογισμικού, όπου εφαρμόζονται απο εθελοντές που δουλεύουν μαζί διαμέσω του διαδικτύου.
it_it: Alla parte opposta si trovano progetti del calibro di Debian e la Apache Software Foundation (che ospita lo sviluppo per il web server Apache). Debian è soprattutto un progetto nel mondo del Software Libero, realizzato da volontari che collaborano tramite Internet.
pl_pl: Na drugim końcu spektrum znajdują się między innymi Debian i Apache Software Foundation (która rozwija serwer HTTP Apache). Debian jest przede wszystkim projektem w świecie Wolnego Oprogramowania, realizowanym przez wolontariuszy współpracujących przez Internet.
