Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: Linux has gathered a fair amount of media coverage, which mostly benefits the distributions supported by a real marketing department — in other words, to company-backed distributions (Ubuntu, Red Hat, Suse, Mandriva, and so on). But Debian is far from being a marginal distribution; according to a German study made in early 2009, Debian is the most widely used distribution on servers (with nearly half of the responding companies having at least one Debian server), and the second most widely deployed on desktops (right behind Ubuntu, which is a Debian derivative). <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" />
el_gr: Το Linux συγκεντρώνει μια πολύ καλή κάλυψη απο media(ήχος-εικόνα κτλ), όπου το καρπώνονται οι διανομές υποστηριζόμενες απο ένα καλο τμήμα "αγοράς" - με άλλα λόγια, το εμπορική υποστήριξη διανομών (Ubuntu, Red Hat, Suse, Mandriva, και λοιπα). Αλλά το Debian ειναι πολύ μακρυά απο το να ειναι μια περιθωριακή διανομή. Σύμφωνα με Γερμανική μελέτη αρχές του 2009, το Debian ειναι η πιο ευρέως χρησιμοποιούμενη διανομή για σέρβερς (σχεδόν οι μισές παγκοσμίως εταιρείες χρησιμοποιούν έστω κι απο ένα Debian server) και κατα δεύτερον για ευρέα παράταξη επιφανειών εργασίας "desktops" (όπως πίσω απο το Ubuntu, που ειναι Debian "παράγωγο").<ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" />
it_it: Linux ha raccolto una discreta copertura mediatica, di cui hanno beneficiato per la maggiore le distribuzioni supportate da un dipartimento marketing reale, in altre parole le distribuzioni con alle spalle un'azienda (Ubuntu, Red Hat, Suse, Mandriva e così via). Ma Debian è tutt'altro che una distribuzione marginale; secondo uno studio tedesco realizzato nei primi mesi del 2009, Debian è la distribuzione universalmente più utilizzata sui server (quasi la metà delle aziende partecipanti al sondaggio hanno almeno un server Debian) e la seconda universalmente più utilizzata sulle postazioni desktop (subito dopo Ubuntu, che è derivata da Debian). <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" />
pl_pl: Linuks zyskał w mediach spore zainteresowanie, z którego korzystają dystrybucje wspierane marketingiem — innymi słowy, dystrybucje tworzone przez firmy (Ubuntu, Red Hat, Suse, Mandriva, itd.). Jednakże Debian jest daleki od bycia marginalną dystrybucją. Według niemieckich badań z początku 2009 roku, Debian jest najszerzej stosowaną dystrybucją na serwerach (blisko połowa ankietowanych firm posiada przynajmniej jeden serwer Debiana), oraz drugą najczęściej wdrażaną na komputerach osobistych (zaraz za Ubuntu, które jest pochodną Debiana). <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" />

source: The purpose of this book is to help you discover this distribution. We hope to share the experience we've gathered since we joined the project as developers and contributors in 1998 (Raphaël) and 2000 (Roland). With any luck, our enthusiasm will be communicative, and maybe you'll join us sometime…
el_gr: Σκοπός αυτού του βιβλίου ειναι να σε βοηθήσει ν'ανακαλύψεις αυτή τη διανομή. Ελπίζουμε να μοιραστείτε την εμπειρία που έχουμε συγκεντρώσει απ'όταν καταταχτήκαμε σαν υπεύθυνοι ανάπτυξης και συνεργάτες το 1998 (Raphaël) και 2000 (Roland). Με λίγη τύχη ο ενθουσιασμός μας να καταστεί επικοινωνιακός και ίσως κάποτε να μας ενώσει...
it_it: L'obiettivo di questo libro è di aiutare a scoprire questa distribuzione. Speriamo di condividere l'esperienza che abbiamo raccolto da quando abbiamo aderito al progetto come sviluppatori e collaboratori nel 1998 (Raphaël) e 2000 (Roland). Con un po' di fortuna, speriamo di trasmettere il nostro entusiasmo, e può darsi che prima o poi vi uniate a noi…
pl_pl: Celem tej książki jest pomóc Ci odkryć tę dystrybucję. Mamy nadzieję podzielić się doświadczeniem, które zebraliśmy od czasu dołączenia do projektu jako deweloperzy i współpracownicy w 1998 roku (Raphaël) i 2000 roku (Roland). Przy odrobinie szczęścia nasz entuzjazm będzie się udzielał i może kiedyś do nas dołączysz...

source: The first edition of this book (in 2004) served to fill a gaping hole: it was the first French-language book that focused exclusively on Debian. At that time, many other books were written on the topic both for French-speaking and English-speaking readers. Unfortunately almost none of them got updated, and today we again find ourselves in a situation where there are very few good books on Debian. We truly hope that this first English edition will fill this gap and help many users.
el_gr: Η πρώτη έκδοση του βιβλίου (το 2004) εξυπηρέτισε το γέμισμα του κενού: ήταν κατ'αρχήν στη Γαλλική γλώσσα το οποίο εστιαζόταν αποκλειστικά στο Debian. Την εποχή εκείνη, πολλά άλλα βιβλία είχαν γραφτεί για Γαλλόφωνους και Αγγλόφωνους. Δυστυχώς σχεδόν κανένα απ'αυτά δεν ανανεώθηκε και ξανά βρεθήκαμε σε κατάσταση οπου υπήρχαν πολύ λίγα βιβλία για Debian. Ελπίζουμε αυτή η πρώτη Αγγλική έκδοση να γεμίσει το κενό και να βοηθήσει πολλους χρήστες.
it_it: La prima edizione di questo libro (nel 2004) è servita a riempire un vuoto: è stato il primo libro in lingua francese concentrato esclusivamente su Debian. Fino ad allora, molti altri libri erano stati scritti sull'argomento, sia per i lettori francofoni che anglofoni. Sfortunatamente quasi nessuno di tali libri è stato aggiornato ed oggi ci troviamo nuovamente in una situazione in cui sono veramente pochi i libri di qualità a proposito di Debian. Noi speriamo veramente che questa prima edizione riempia questo vuoto ed aiuti molti utenti.
pl_pl: Pierwsze wydanie tej książki (w 2004 roku) służyło wypełnieniu luki: była to pierwsza francuskojęzyczna książka skupiająca się wyłącznie na Debianie. W tamtym czasie napisano wiele książek na ten temat zarówno dla czytelników francusko- i anglojęzycznych. Niestety większość z nich nie została zaktualizowana i dzisiaj znów znajdujemy się w sytuacji, gdzie możemy znaleźć zaledwie kilka dobrych książek na temat Debiana. Mamy szczerą nadzieję, że to pierwsze polskie wydanie wypełni powstałą lukę i pomoże wielu użytkownikom.

source: Chosen Approach
el_gr: Επιλογή προσέγγισης
it_it: L'approccio scelto
pl_pl: Wybrane podejście

source: All of the generic documentation you can find about GNU/Linux also applies to Debian, since Debian includes most common free software. However, the distribution brings many enhancements, which is why we chose to primarily describe the «Debian way» of doing things.
it_it: Tutte le documentazioni generiche che si possono trovare a proposito di GNU/Linux sono applicabili anche a Debian, poiché Debian include la maggior parte del software libero di uso comune. Ad ogni modo, la distribuzione garantisce molti miglioramenti, che sono alla base della nostra scelta di descrivere principalmente «la filosofia Debian» di fare le cose.

source: Following the structure and aims of Eyrolles' «Administrator's Handbook» collection, this book revolves around a case study providing both support and illustration for all topics being addressed.
it_it: Seguendo la traccia proposta da Eyrolles nella sua serie «Administrator's Handbook», questo libro ruota attorno a un caso di studio, fornendo sia il supporto che l'illustrazione di tutti gli argomenti affrontati

source: <emphasis role="strong">Chapters 2 and 3</emphasis> provide a broad outline of the case study. At this point, novice readers can take the time to read <emphasis role="strong">appendix B</emphasis>, where they'll find a short remedial course explaining a number of basic computing notions, as well as concepts inherent to any Unix system.
el_gr: <emphasis role="strong">Chapters 2 and 3</emphasis>παρέχει μια πλατειά σκιαγράφηση της αιτίας προς μελέτη. Σ'αυτό το σημείο, αρχάριοι αναγνώστες έχουν το χρόνο να διαβάσουν <emphasis role="strong">appendix B</emphasis>, όπου θα βρούν μικρές θεραπευτικές σειρές εξηγήσεων απο πλήθος βασικών αντιλήψεων για κομπιούτινγκ, αλλα και ιδέες έμφυτες για κάθε σύστημα Unix.
it_it: I <emphasis role="strong">capitoli 2 e 3</emphasis> illustreranno a grandi linee un caso di studio reale. A questo punto, i lettori meno esperti possono dedicare un po' di tempo a leggere l'<emphasis role="strong">appendice B</emphasis>, dove potranno trovare un breve corso di recupero che spiega una serie di nozioni informatiche di base, nonché i concetti principali relativi a qualsiasi sistema Unix.
pl_pl: <emphasis role="strong">Rozdziały 2 i 3</emphasis> dostarczają szeroki opis studium przypadku. W tym momencie początkujący czytelnicy mogą poświęcić trochę czasu na przeczytanie <emphasis role="strong">przypisu B</emphasis>, gdzie znajdą krótki kurs wyrównawczy wyjaśniający wiele podstawowych pojęć informatycznych, jak również pojęcia nieodłączne systemom Uniksowym.

source: <primary>source package</primary>
it_it: <primary>pacchetto sorgente</primary>
pl_pl: <primary>pakiet źródłowy</primary>

source: The present English version is based on the fifth edition of the French book. This fifth edition was an important update, covering version 6.0 of Debian, code-named <emphasis role="distribution">Squeeze</emphasis>. Among the changes, Debian now sports two new architectures — <emphasis>kfreebsd-i386</emphasis> and <emphasis>kfreebsd-amd64</emphasis> — based on the FreeBSD kernel and supporting the associated technologies (<emphasis>jails</emphasis>, <emphasis>packet filter</emphasis> and so on). On Linux-based architectures, the 2.6.32 kernel extends support to all the main virtualization technologies (Xen/OpenVZ/LXC/KVM, see <xref linkend="sect.virtualization" />). All included packages have obviously been updated. Many improvements specifically target package maintainers, who can now use a simplified <filename>debian/rules</filename> (with debhelper's <command>dh</command> command); they also benefit from a standard patch management system integrated to <command>dpkg-source</command> (by using the <literal>3.0 (quilt)</literal> source package format).
el_gr: Η παρούσα Αγγλική έκδοση ειναι βασισμένη στο 5ο τεύχος του Γαλλικού βιβλίου. Αυτό το 5ο τεύχος έχει ενδιαφέρουσες αναβαθμίσεις, που καλύπτουν τη έκδοση 6.0 του Debian, code-named <emphasis role="distribution">Squeeze</emphasis>. Ανάμεσα στις αλλαγές, το Debian αναδεικνύει δύο νέες αρχιτεκτονικές - <emphasis>kfreebsd-i386</emphasis> και <emphasis>kfreebsd-amd64</emphasis> - βασιζόμενα στο FreeBSD kernel και υποστηρίζουν συγγενείς τεχνολογίες (<emphasis>jails</emphasis>, <emphasis>packet filter</emphasis> and so on). Για αρχιτεκτονικές που βασίζονται σε Linux, ο κέρνελ 2.6.32 επεκτείνεται υποστηρίζοντας όλες τις κυρίως εικονικές τεχνολογίες (Xen/OpenVZ/LXC/KVM, see <xref linkend="sect.virtualization" />). Όλα τα συμπελιλαμβανόμενα πακέτα φυσικά έχουν αναβαθμιστεί. Πολλές συγκεκριμένες βελτιώσεις στοχεύουν συντήριση πακέτων, όπου τώρα χρησιμοποιούν απλούστερα <filename>debian/rules</filename> (with debhelper's <command>dh</command> command); αυτά επίσης επιδοτούνται απο σημαντικά μπαλώματα(patches) διεύθυνσης συστήματος ενσωματώνοντας σε <command>dpkg-source</command> (by using the <literal>3.0 (quilt)</literal> source package format).
it_it: Questa versione è basata sulla quinta edizione del libro francese. Questa quinta edizione è stata un importante aggiornamento, in quanto copre la versione 6.0 di Debian, denominata <emphasis role="distribution">Squeeze</emphasis>. Tra le altre modifiche, Debian ora mette a disposizione due nuove architetture — <emphasis>kfreebsd-i386</emphasis> e <emphasis>kfreebsd-amd64</emphasis> — basate sul kernel FreeBSD supportando le rispettive tecnologie (<emphasis>jails</emphasis>, <emphasis>packet filter</emphasis> e così via). Sulle architetture basate su Linux, il kernel 2.6.32 estende il supporto a tutte le principali piattaforme di virtualizzazione (Xen/OpenVZ/LXC/KVM, vedere <xref linkend="sect.virtualization" />). Tutti i pacchetti inclusi, ovviamente, sono stati aggiornati. Molti miglioramenti sono dedicati in particolare ai manutentori dei pacchetti, che possono utilizzare un <filename>debian/rules</filename> semplificato (con il comando <command>dh</command> di debhelper); possono anche beneficiare di un sistema standard per la gestione delle patch integrato in <command>dpkg-source</command> (utilizzando il formato di pacchetti sorgenti <literal>3.0 (quilt)</literal> ).
pl_pl: Aktualna polska wersja bazuje na piątym wydaniu francuskiej książki. Piąte wydanie było ważną aktualizacją, obejmującą Debiana 6.0 o nazwie kodowej <emphasis role="distribution">Squeeze</emphasis>. Wśród zmian, Debian wspiera teraz dwie nowe architektury — <emphasis>kfreebsd-i386</emphasis> i <emphasis>kfreebsd-amd64</emphasis> — bazujące na jądrze FreeBSD i wspierające związane z nimi technologie (<emphasis>jails</emphasis>, <emphasis>packet filter</emphasis> itd.). Na architekturach bazujących na Linuksie, jądro 2.6.32 rozszerza wsparcie dla wszystkich głównych technologii wirtualizacji (Xen/OpenVZ/LXC/KVM, patrz <xref linkend="sect.virtualization" />). Wszystkie zawarte pakiety zostały oczywiście uaktualnione. Wiele usprawnień kierowanych jest do zarządców pakietów, którzy mogą teraz używać uproszczonego <filename>debian/rules</filename> (z komendą <command>dh</command> debhelper'a). Skorzystają także ze standardowego systemu zarządzania łatkami zintegrowanego w <command>dpkg-source</command> (przez użycie <literal>3.0 (quilt)</literal> formatu pakietu źródłowego).

source: In 2003, Nat Makarevitch contacted me (Raphaël) because he wanted to publish a book on Debian in the <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) collection that he was managing for Eyrolles, a leading French editor of technical books. I immediately accepted to write it. The first edition came out on 14th October 2004 and was a huge success — it was sold out barely four months later.
el_gr: Το 2003, ο Nat Makarevitch επικοινώνησε μαζί μου (Raphaël) διότι ήθελε να δημοσιεύση ένα Debian βιβλίο στο <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) συλλογή η οποία θα ηγείτω μιά κορυφαία Γαλλική εταιρία μεταφράσεων και επεξεργασίες κειμένου για τεχνικά βιβλία(Eyrolles). Αμέσως δέχτηκα να το γράψω. Η πρώτη έκδοση βγήκε στις 14 Οκτωβρίου 2004 και είχε τεράστια επιτυχία - εξαντλήθηκε σχεδόν μέσα σε 4 μήνες.
it_it: Nel 2003, Nat Makarevitch mi contattò (Raphaël) perché aveva intenzione di pubblicare un libro su Debian nella raccolta <foreignphrase>Cahier de l'Admin</foreignphrase> (Manuale dell'Amministratore) che gestiva per Eyrolles, un importante editore francese di testi tecnici. Accettai immediatamente di scrivere il libro. La prima edizione è stata pubblicata il 14 ottobre 2004 e fu un tale successo che appena quattro mesi dopo andò esaurito.
pl_pl: W 2003 roku Nat Makarevitch skontaktował się ze mną (Raphaël), ponieważ chciał opublikować książkę o Debianie w serii <foreignphrase>Cahier de l'Admin</foreignphrase> (Podręcznik Administratora), którą zarządzał dla Eyrolles, wiodącego francuskiego wydawcy książek specjalistycznych. Natychmiast zaakceptowałem propozycję, aby ją napisać. Pierwsze wydanie ujrzało światło dzienne 14-go października 2004 roku i okazało się wielkim sukcesem - zostało wyprzedane w niecałe cztery miesiące.

source: Since then, we have released 4 other editions of the French book, one for each subsequent Debian release. Roland Mas, who started working on the book as my proofreader, gradually became its co-author.
el_gr: Έκτοτε, έχουμε δημοσιεύσει άλλες 4 εκδόσεις του Γαλλικού βιβλίου, ένα για κάθε ματαγενέστερη Debian διανομή. Ο Roland Mas, ο οποίος άρχισε να δουλεύει στο βιβλίο σαν διορθωτής μου, βαθμιαία έγινε συνεργάτης στη συγγραφή.
it_it: Da allora, sono state rilasciate altre 4 edizioni della versione francese, una per ogni successivo rilascio di Debian. Roland Mas, che ha iniziato a lavorare al libro come mio correttore di bozze, a poco a poco divenne il co-autore.
pl_pl: Od tamtego czasu wydaliśmy 4 edycje francuskiej wersji, po jednej na każde kolejne wydanie Debiana. Roland Mas, który zaczynał pracę nad książką jako mój korektor, stopniowo stał się jej współautorem.

source: Alas, no English-speaking editor that we contacted was willing to take the risk of translating and publishing the book. Not put off by this small setback, we decided to negotiate with our French editor Eyrolles to recuperate the necessary rights to translate the book into English and to try to publish it ourselves.
el_gr: Αλοίμονο, κανένας Αγγλόφωνος επεξεργαστής που ήλθαμε σ'επαφη ήθελε να ρισκάρει να μεταφράσει και να δημοσιεύσει το βιβλίο. Χωρίς να υποχωρίσουμε λόγω αυτής της μικρή αναποδιάς, αποφασίσαμε να διαπραγματευτούμε με τον Γαλλικό επεξεργαστή(editor) Eyrolles ν'ανακτήσει τ'απαραίτητα δικαιώματα μετάφρασης στ' Αγγλικά και να προσπαθήσουμε να το δημοσιεύσουμε εμείς.
it_it: Purtroppo nessun editore inglese che contattammo era disposto a correre il rischio di tradurre e pubblicare il libro. Non lasciandoci scoraggiare da questo piccolo passo indietro, abbiamo deciso di negoziare con il nostro editore francese Eyrolles i diritti necessari per la traduzione del libro in Inglese ed abbiamo cercato di pubblicarlo noi stessi.
pl_pl: Niestety żaden z anglojęzycznych wydawców, z którymi się skontaktowaliśmy, nie chciał podjąć ryzyka przetłumaczenia i wydania książki. Niezrażeni tym niepowodzeniem, zdecydowaliśmy się negocjować z naszym francuskim wydawcą Eyrolles, aby odzyskać prawa potrzebne do przetłumaczenia książki na angielski i spróbować wydania jej samodzielnie.

source: A Crowd-Funded Translation
el_gr: Ένα Πλήθος-Απόθεμα Μεταφραστικό
it_it: Una traduzione finanziata dal basso
pl_pl: Tłumaczenie Finansowane przez Społeczność

source: Translating a book of 450 pages is a considerable effort that requires several months of work. For self-employed people like Roland and me, we had to ensure a minimum income to mobilize the time necessary to complete the project. So we set up a crowd-funding campaign on Ulule and asked people to pledge money towards the project. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
el_gr: Μεταφράζοντας ένα βιβλίο 450 σελίδων είναι μια αξιόλογη προσπάθεια οπου απαιτεί δουλειά πολλών μηνών. Για αυτοαπασχολούμενα άτομα όπως ο Ρόλαντ κι εγώ, είχαμε να σιγουρέψουμε ένα ελάχιστο εισόδημα, να κινητοποιήσουμε χρήσιμο χρόνο για την ολοκλήρωση του έργου. Έτσι στήσαμε μια εκστρατεία χρηματοδότησης στο Ulule και ζητούσαμε απο τον κόσμο να δεσμεύση χρήματα για το έργο. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
it_it: Tradurre un libro di 450 pagine comporta uno sforzo notevole che richiede diversi mesi di lavoro; essendo io e Roland lavoratori autonomi, dovevamo garantirci un minimo reddito durante il tempo necessario al completamento del progetto. Così abbiamo avviato una campagna di finanziamento popolare su Ulule chiedendo alle persone di contribuire economicamente alla riuscita del progetto. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
pl_pl: Tłumaczenie ponad 450-stronicowej książki jest znaczącym wysiłkiem wymagającym kilku miesięcy pracy. Roland i ja, jako osoby samozatrudnione, musieliśmy zapewnić wpływy, aby zmobilizować czas potrzebny do ukończenia projektu. Zaczęliśmy kampanię finansowania społecznościowego na Ulule i poprosiliśmy ludzi, aby wpłacali pieniądze na nasz projekt. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />

source: We had the pleasure of getting significant contributions from many free software-friendly companies and organizations. Thank you to <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.backtrack-linux.org">BackTrack Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), and <ulink url="http://www.syminet.com">Syminet</ulink>.
el_gr: Είχαμε την ευχαρίστηση να δεχτούμε σημαντική συνεισφορά απο πλήθος εταιριών και οργανισμών φιλικών με το ελεύθερο λογισμικό. Ευχαριστούμε τους <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.backtrack-linux.org">BackTrack Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), and <ulink url="http://www.syminet.com">Syminet</ulink>.
it_it: Abbiamo avuto il piacere di ottenere contributi significativi da molte aziende e organizzazioni amiche del software libero. Grazie a <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (l'azienda dietro <ulink url="http://www.backtrack-linux.org">BackTrack Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres) e <ulink url="http://www.syminet.com">Syminet</ulink>.
pl_pl: Mieliśmy przyjemność otrzymać znaczący wkład od wielu firm i organizacji przyjaznych otwartemu oprogramowaniu. Podzięowania dla <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (firmie odpowiedzialnej za <ulink url="http://www.backtrack-linux.org">BackTrack Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), and <ulink url="http://www.syminet.com">Syminet</ulink>.
