Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: This book would not be what it is without the contributions of several persons who each played an important role. We would like to thank Marilyne Brun, who helped us to translate the sample chapter and who worked with us to define some common translation rules. She also revised several chapters which were desperately in need of supplementary work. Thank you to Anthony Baldwin (of Baldwin Linguas) who translated several chapters for us.
el_gr: Το βιβλίο δεν θα ήταν αυτό που είναι χωρίς την συνεργασία πλήθους ατόμων τα οποία έπαιξαν σπουδαίο ρόλο. Θέλουμε να ευχαριστήσουμε την Marilyne Brun, που μας βοήθησε στην μετάφραση των κεφαλαίων δοκιμών(εξαγωγή αποτελέσματος μιάς εντολής) και η οποία δούλεψε μαζί μας αναγνωρίζοντας μερικούς κοινούς μεταφραστικούς όρους. Επίσης διόρθωσε αρκετά κεφάλαια τα οποία χρήζαν απελπιστικά συμπληρωματική εργασία. Ευχαριστούμε τον Anthony Baldwin (του Baldwin Linguas) ο οποίος μετάφρασε αρκετά κεφάλαια για μας.
it_it: Questo libro non sarebbe stato quello che è senza il contributo di diverse persone che hanno avuto un ruolo importante. Vorremmo ringraziare Marilyne Brun, che ci ha aiutato a tradurre il capitolo di esempio e ha lavorato con noi per definire le regole da adottare durante la traduzione. Ha inoltre revisionato diversi capitoli che avevano un disperato bisogno di lavoro supplementare. Grazie a Anthony Baldwin (di Baldwin Linguas) che ci ha tradotto diversi capitoli.
pl_pl: Ta książka nie byłaby tym, czym jest, bez wkładu kilku osób, z których każda odegrała ważną rolę. Chcielibyśmy podziękować Marilyne Brun, która pomogła nam przetłumaczyć przykładowy rozdział i pracowała z nami nad zdefiniowaniem kilku ogólnych zasad tłumaczeń. Poprawiła również kilka rozdziałów, które pilnie potrzebowały uzupełnienia. Podziękowanie dla Anthony Baldwin (z Baldwin Linguas), który przetłumaczył za nas kilka rozdziałów.

source: First off, I would like to thank Nat Makarevitch, who offered me the possibility to write this book and who provided strong guidance during the year it took to get it done. Thank you also to the fine team at Eyrolles, and Muriel Shan Sei Fan in particular. She has been very patient with me and I learned a lot with her.
el_gr: Πρώτα απ' όλα, θα ήθελα να ευχαριστήσω τον Nat Makarevitch, που μου πρόσφερε την δυνατότητα να γράψω το βιβλίο και που με την ισχυρή του καθοδήγηση κατάφερα να το φέρω σε πέρας. Επίσης ευχαριστώ την ομάδα του Eyrolles και ειδικά την Muriel Shan Sei Fan όπου με την υπομονή της έμαθα πολλά απ' αυτήν.
it_it: Prima di tutto, vorrei ringraziare Nat Makarevitch, che mi ha offerto la possibilità di scrivere questo libro e mi ha guidato durante l'anno che è stato necessario per scriverlo. Grazie anche alla bella squadra di Eyrolles e a Muriel Shan Fan Sei in particolare che è stata molto paziente e mi ha insegnato molte cose.
pl_pl: Przede wszystkim, chciałbym podziękować Nat Makarevitch, który zaoferował mi możliwość napisania tej książki i wsparł wieloma wskazówkami podczas roku jej pisania. Dziękuję również świetnemu zespołowi z Eyrolles, a w szczególności Muriel Shan Sei Fan. Była dla mnie bardzo cierpliwa i dzięki niej wiele się nauczyłem.

source: The period of the Ulule campaign was very demanding for me but I would like to thank everybody who helped to make it a success, and in particular the Ulule team who reacted very quickly to my many requests. Thank you also to everybody who promoted the operation. I don't have any exhaustive list (and if I had it would probably be too long) but I would like to thank a few people who were in touch with me: Joey-Elijah Sneddon and Benjamin Humphrey of OMG! Ubuntu, Frédéric Couchet of April.org, Jake Edge of Linux Weekly News, Clement Lefebvre of Linux Mint, Ladislav Bodnar of Distrowatch, Steve Kemp of Debian-Administration.org, Christian Pfeiffer Jensen of Debian-News.net, Artem Nosulchik of LinuxScrew.com, Stephan Ramoin of Gandi.net, Matthew Bloch of Bytemark.co.uk, the team at Divergence FM, Rikki Kite of Linux New Media, Jono Bacon, the marketing team at Eyrolles, and numerous others that I have forgotten (sorry about that).
el_gr: Η περίοδος της εκστρατείας στο Ulule ήταν πολύ απαιτητική για μένα και θα ήθελα να ευχαριστήσω τον καθένα που βοήθησε στο να επιτύχω και ειδικά στην ομάδα του Ulule που αντέδρασε πολύ γρήγορα στις απαιτήσεις μου. Ευχαριστώ επίσης τον κάθ' ένα που διέδωσε την όλη επιχείρηση. Δεν έχω κάποια λίστα εξάντλησης (και να είχα πιθανά θα ήταν πολύ σε μάκρος) αλλά θα ήθελα να ευχαριστήσω λίγα άτομα που ήλθαν σ' επαφή μαζί μου: Joey-Elijah Sneddon and Benjamin Humphrey of OMG! Ubuntu, Frédéric Couchet of April.org, Jake Edge of Linux Weekly News, Clement Lefebvre of Linux Mint, Ladislav Bodnar of Distrowatch, Steve Kemp of Debian-Administration.org, Christian Pfeiffer Jensen of Debian-News.net, Artem Nosulchik of LinuxScrew.com, Stephan Ramoin of Gandi.net, Matthew Bloch of Bytemark.co.uk, the team at Divergence FM, Rikki Kite of Linux New Media, Jono Bacon, το τμήμα διαφήμισης της Eyrolles και πλήθος άλλων που ίσως ξεχνώ (ζητώ συγνώμη γι' αυτό).
it_it: Il periodo della campagna Ulule per me è stato molto impegnativo, ma vorrei ringraziare tutti coloro che hanno contribuito a renderlo un successo, in particolare il team di Ulule che ha reagito molto velocemente alle mie numerose richieste. Grazie anche a tutti coloro che hanno promosso l'operazione. Non ho un elenco completo (e se lo avessi probabilmente sarebbe troppo lungo), ma vorrei ringraziare alcune delle persone che erano in contatto con me: Joey-Elijah Sneddon e Benjamin Humphrey di OMG! Ubuntu, Frédéric Couchet di April.org, Jake Edge di Linux Weekly News, Clement Lefebvre di Linux Mint, Ladislav Bodnar di Distrowatch, Steve Kemp di Debian-Administration.org, Christian Pfeiffer Jensen di Debian-News.net, Artem Nosulchik di LinuxScrew.com, Stephan Ramoin di Gandi.net, Matthew Bloch di Bytemark.co.uk, il team a Divergence FM, Rikki Kite di Linux New Media, Jono Bacon, il team marketing di Eyrolles e molti altri che potrei aver dimenticato (scusatemi per questo).
pl_pl: Okres kampanii Ulule był dla mnie bardzo wymagający, ale chciałbym podziękować wszystkim, którzy pomogli mi wtedy osiągnąć sukces, a w szczególności zespołowi Ulule, który reagował bardzo szybko na moje prośby. Dziękuję też wszystkim promującym akcję. Nie mam wyczerpującej listy (a gdybym miał, byłaby prawdopodobnie zbyt długa), ale chciałbym podziękować kilku osobom, z którymi byłem w kontakcie: Joey-Elijah Sneddon i Benjamin Humphrey z OMG! Ubuntu, Frédéric Couchet z April.org, Jake Edge z Linux Weekly News, Clement Lefebvre z Linux Mint, Ladislav Bodnar z Distrowatch, Steve Kemp z Debian-Administration.org, Christian Pfeiffer Jensen z Debian-News.net, Artem Nosulchik z LinuxScrew.com, Stephan Ramoin z Gandi.net, Matthew Bloch z Bytemark.co.uk, zespół z Divergence FM, Rikki Kite z Linux New Media, Jono Bacon, zespół marketingowy z Eyrolles i wielu innych, o których zapomniałem (przepraszam za to).

source: Last but not least, thank you to my wife, Sophie. She has been very supportive of my work on this book and on Debian in general. There have been too many days (and nights) when I left her alone with our 2-year-old son to make some progress on the book. I am grateful for her support and know how lucky I am to have her.
el_gr: Τέλος αλλά όχι τελευταία, ευχαριστώ την γυναίκα μου Σόφι. Με υποστήριξε πολύ στη δουλειά του βιβλίου και για το Debian γενικώς. Υπήρχαν μέρες (αλλά και νύχτες) που άφησα μόνους αυτή και τον 2χρονο γιό μας για να προοδεύση το βιβλίο. Ευγνωμονώ την υποστήριξή της κι αισθάνομαι τυχερός που την έχω.
it_it: Ultimo, ma non meno importante grazie a mia moglie Sophie. È stata di grande aiuto al mio lavoro su questo libro e su Debian in generale. L'ho lasciata sola troppi giorni (e notti) con il nostro bimbo di 2 anni per portare a termine il libro. Le sono grato per il suo sostegno e so quanto sono fortunato di averla a mio fianco.
pl_pl: Ostatnie, ale nie najmniejsze podziękowania kieruję do mojej żony Sophie. Wspierała mnie podczas pracy nad książką i nad Debianem w ogóle. Było zbyt wiele dni (i nocy), kiedy zostawiłem ją samą z naszym 2 letnim synem, aby zrobić postęp z książką. Jestem wdzięczny za jej wsparcie i wiem jakim jestem szczęściarzem, że ją mam.

source: Well, Raphaël preempted most of my «external» thank-yous already. I am still going to emphasize my personal gratitude to the good folks at Eyrolles, with whom collaboration has always been pleasant and smooth. Hopefully the results of their excellent advice hasn't been lost in translation.
it_it: Beh, Raphaël ha già anticipato anche la maggior parte dei miei ringraziamenti «esterni». Vorrei comunque sottolineare la mia gratitudine al personale di Eyrolles con il quale ho sempre avuto una piacevole collaborazione. Nella speranza che i risultati dei loro ottimi consigli non si siano persi nella traduzione.

source: And finally; I am sure they would be surprised by being mentioned here, but I would like to extend my gratitude to Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, and of course the late Douglas Adams. The countless hours I spent enjoying their books are directly responsible for my being able to take part in translating this one.
el_gr: Και τέλος; είμαι σίγουρος οτι θα εκπλαγούν που τους ανέφερα εδώ, αλλά θα ήθελα να επεκτείνω την ευγνωμοσύνη μου στους Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson και σίγουρα στον πρόσφατο Douglas Adams. Οι αναρίθμητες ώρες που πέρασα για το βιβλίο είναι ευθέως υπεύθυνες που μ' έκαναν μέρος της μετάφρασης αυτού.
it_it: E infine, sono sicuro che sarebbero sorpresi di essere menzionati qui, ma vorrei estendere la mia gratitudine a Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson e naturalmente al compianto Douglas Adams. Per le innumerevoli ore che ho trascorso godendo dei loro libri, sono direttamente responsabili per il mio essere in grado di prendere parte alla traduzione di questo.
pl_pl: Na koniec. Jestem pewien, że byliby zaskoczeni będąc wymienieni tutaj, ale chciałbym rozszerzyć moje podziękowania dla Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson i oczywiście późnego Douglas Adams. Nieskończone godziny, które spędziłem ciesząc się ich książkami, są bezpośrednio odpowiedzialne za moją możliwość uczestniczenia w tłumaczeniu tej książki.

source: A “Linux distribution” is a full operating system; it usually includes the Linux kernel, an installer program, and most importantly applications and other software required to turn a computer into an actually useful tool.
el_gr: Μια "Linux διανομή" ειναι γεμάτη απο λειτουργικά συστήματα. Περιλαμβάνει τον Linux kernel, ενα πρόγραμμα εγκατάστασης και το πιό σημαντικό εφαρμογές και άλλα λογισμικά τα οποία μεταμορφώνουν το υπολογιστή σ'ένα όντως χρήσιμο εργαλείο.
pl_pl: "Dystrybucja Linuksa" to cały system operacyjny. Zwykle zawiera ona jądro Linuksa, program instalacyjny oraz najważniejsze aplikacje i inne oprogramowanie, wymagane, aby zmienić komputer w faktycznie użyteczne narzędzie.

source: Following the structure and aims of Eyrolles' “Administrator's Handbook” collection, this book revolves around a case study providing both support and illustration for all topics being addressed.
el_gr: Ακολουθώντας την δομή και με το βλέμμα στη συλλογή “Administrator's Handbook” το βιβλίο αναπτύσεται γύρο απο να προσφέρει μελέτη για υποστήριξη και εικόνα για όλα τα θέματα που απευθύνεται.
pl_pl: Zgodnie ze strukturą i celami kolekcji Eyrolles "Administrator's Handbook", ta książka koncentruje się na studium przypadku, dostarczając zarówno wsparcie i ilustrację dla wszystkich poruszonych w niej tematów.
