Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: This book has its own website, which hosts whatever elements that can make it more useful. In particular, it includes an online version of the book with clickable links, and possible errata. Feel free to browse it and to leave us some feedback. We will be happy to read your comments or support messages. Send them by email to <email>hertzog@debian.org</email> (Raphaël) and <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
ar_ma: للكتاب موقعه الخاص، الذي يستضيف كل العناصر التي يمكن أن تزيد الفائدة من الكتاب. نخص بالذكر النسخة الشبكية المزودة بروابط حية، وأيضاً تصحيحات الأخطاء المكتشفة في الكتاب. لا تتردد بتصفح الكتاب وترك تعليق لنا. سنكون سعداء بقراءة تعليقاتك أو رسائل دعمك. يمكنك إرسالها عبر البريد الإلكتروني إلى <email>hertzog@debian.org</email> (رافائيل) و<email>lolando@debian.org</email> (رولاند). <ulink type="block" url="http://debian-handbook.info/" /> للترجمة العربية من الكتاب موقع خاص بها أيضاً، وفيه مدونة لنشر التطورات وبعض المواضيع المتعلقة بهذه النسخة من الكتاب أو دبيان بشكل عام.<ulink type="block" url="http://ar.debian-handbook.info/" />
el_gr: Το βιβλίο έχει την δική του ιστοσελίδα, η οποία φιλοξενεί στοιχεία τα οποία τα κάνει πολύ χρήσιμα. Πρακτικώς περιλαμβάνει μια "ζωντανή" έκδοση του βιβλίου με παραπομπές δικτυακές και πιθανά "τυπογραφικά λάθη". Να αισθανθείς ελεύθερος στη περιήγηση και να μας αφήσεις κάποιες ανατροφοδοτήσεις. Θα είμαστε σαφώς χαρούμενοι να λάβουμε σχόλια η μηνύματα υποστήριξης. Μπορείτε να στείλετε στο εξής email <email>hertzog@debian.org</email> (Raphaël) and <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
es_es: Este libro tiene su propio sitio web que alberga todos los elementos que pueden hacerlo más útil. En particular, incluye una versión online del libro con enlaces clickables y posible fe de erratas. Siéntase libre de navegarlo y dejarnos sus comentarios y sugerencias. Nos alegrará leer sus opiniones o sus mensajes de apoyo. Envíe un email a <email>hertzog@debian.org</email> (Raphaël) y <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
fr_fr: Ce livre a son propre site web, qui héberge tout ce qui peut le compléter utilement. On y trouvera par exemple une version électronique du livre avec des liens cliquables, ou encore les éventuels errata découverts après impression. N'hésitez pas à le consulter et profitez-en pour nous faire part de vos remarques ou messages de soutien en nous écrivant à <email>hertzog@debian.org</email> (pour Raphaël) et <email>lolando@debian.org</email> (pour Roland). <ulink type="block" url="http://debian-handbook.info/" />
it_it: Per questo libro è stato realizzato uno specifico sito web completo di tanti strumenti che lo rendono più utile. In particolare, include una versione online del libro con collegamenti navigabili ed eventuali errata. Tutti possono navigare nel sito a piacere e lasciare feedback. Commenti o messaggi di supporto sono i benvenuti. Potete inviarli via email a <email>hertzog@debian.org</email> (Raphaël) e <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
ja_jp: この本にはウェブサイトがあり、ウェブサイトにはこの本をより有益なものにする要素はなんでも載せています。具体的には、クリックできるリンクを備えたオンライン版の本と正誤表を提供しています。ご自由にご覧になって、フィードバックを送ってください。我々はコメントやサポートメッセージを歓迎します。メールは <email>hertzog@debian.org</email> (Raphaël) と <email>lolando@debian.org</email> (Roland) 宛にお願いします。<ulink type="block" url="http://debian-handbook.info/" />
pl_pl: Ta książka ma własną witrynę internetową, zawierającą każdy element, mogący uczynić ją bardziej użyteczną. W szczególności, zawiera wersję online książki z klikalnymi odnośnikami i możliwymi poprawkami. Zapraszamy do zapoznania się z nią i pozostawienia swojej opinii. Z radością przeczytamy komentarze lub wiadomości wsparcia. Prosimy przesyłać je mailowo na adres <email>hertzog@debian.org</email> (Raphaël) i <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
pt_br: Este livro tem o seu próprio site, que hospeda elementos que podem torná-lo mais útil. Em particular, inclui uma versão online do livro com links clicáveis, e possíveis erratas. Sinta-se a vontade para navegar nele e deixar-nos um comentário. Teremos o maior prazer de ler seus comentários ou mensagens de apoio. Pode enviar por e-mail para <email>hertzog@debian.org</email>(Raphaël) e <email>lolando@debian.org</email>(Roland). <ulink type="block" url="http://debian-handbook.info/" />
zh_cn: 本书拥有自己的网站，该站点上放了许多可以丰富本书的元素。值得一提的是，本书的在线电子版就可以在该网站上找到，这个版本包含了可点击的链接和可能的勘误表。请尽情浏览该网站并给我们一些反馈。我们将很乐意阅读您的意见或支持消息。请将它们发送电子邮件到 <email>hertzog@debian.org</email> (Raphaël) 和 <email>lolando@debian.org</email> (Roland)。 <ulink type="block" url="http://debian-handbook.info/" />

source: <emphasis role="strong">Chapter 1</emphasis> focuses on a non-technical presentation of the Debian project and describes its goals and organization. These aspects are important because they define a general framework that others chapters will complete with more concrete information.
ar_ma: يركز <emphasis role="strong">الفصل اﻷول</emphasis> على عرض مشروع دبيان بشكل غير تقني وتوضيح أهدافه والحديث عن المنظمة. هذه الجوانب مهمة لأنها تحدد إطارا عاماً ستتكامل معه الفصول اللاحقة من خلال طرح معلومات محددة أكثر.
el_gr: <emphasis role="strong">Chapter 1</emphasis>επικεντρώνοντας μια όχι-τεχνική παρουσίαση της παραγωγής Debian και περιγράφοντας τους στόχους και την οργάνωση. Αυτές οι απόψεις ειναι ενδιαφέρων διότι προσδιορίζουν μια γενικευμένη δομή σκελετού όπου τ'άλλα κεφάλαια θα συμπληρώσουν με πιο συγκεκριμένη πληροφορία
es_es: El <emphasis role="strong">capítulo 1</emphasis> se centra en una presentación no técnica del proyecto Debian y describe sus objetivos y organización. Estos aspectos son importantes porque definen un marco general que se completará en otros capítulos con información más concreta.
fr_fr: Le <emphasis role="strong">chapitre 1</emphasis>, réservé à une présentation non technique de Debian, en exposera les objectifs et le mode de fonctionnement. Ces aspects sont importants, car ils permettent de fixer un cadre où viendront se greffer les contenus des autres chapitres.
it_it: Il <emphasis role="strong">capitolo 1</emphasis> si concentra su una presentazione del progetto Debian descrivendone gli obiettivi e la sua organizzazione. Questi aspetti sono importanti perché permettono di definire un quadro generale che sarà completato con informazioni più dettagliate dai successivi capitoli.
ja_jp: <emphasis role="strong">第 1 章</emphasis>では Debian プロジェクトの技術的ではない部分に注目し、プロジェクトの目標と組織について説明します。これらの側面は Debian の一般的な構造を規定しているために、重要です。こうすることで、他の章の内容をより具体的な情報に集中させることができます。
pl_pl: <emphasis role="strong">Rozdział 1</emphasis> skupia się na nietechnicznej prezentacji projektu Debiana oraz opisuje jego cele i organizację. Te aspekty są ważne, ponieważ definiują ogólne ramy, które w innych rozdziałach zostaną wypełnione bardziej konkretnymi informacjami.
pt_br: O <emphasis role="strong">Capitulo 1</emphasis> se concentra em uma apresentação não-técnica do projeto Debian e descreve seus objetivos e organização. Estes aspectos são importantes porque definem um quadro geral que irá completar outros capítulos com informações mais concretas.
zh_cn: <emphasis role="strong">第一章</emphasis>集中探讨介绍 Debian 项目非技术性方面的内容，同时描述该项目的目标和组织结构。这些方面的内容是很重要的，因为它们定义了一个总体框架，其他章节将围绕它完成更具体的信息介绍。

source: <emphasis role="strong">Chapters 2 and 3</emphasis> provide a broad outline of the case study. At this point, novice readers can take the time to read <emphasis role="strong">appendix B</emphasis>, where they will find a short remedial course explaining a number of basic computing notions, as well as concepts inherent to any Unix system.
ar_ma: يطرح <emphasis role="strong">الفصلان 2 و 3</emphasis> الخطوط العريضة للحالة المدروسة. في هذه المرحلة، يمكن للقراء المبتدئين أن ينتقلوا لقراءة <emphasis role="strong">الملحق B</emphasis>، حيث يجدون دورة تذكيرية قصيرة تشرح عدة مفاهيم حاسوبية أساسية، بالإضافة إلى المفاهيم المرتبطة بنظم يونكس بشكل عام.
es_es: Los <emphasis role="strong">capítulos 2 y 3</emphasis> presentan el caso de estudio en líneas generales. Llegados a este punto los lectores principiantes pueden echar un vistazo al <emphasis role="strong">apéndice B</emphasis>, donde pueden encontrar un breve curso que explica nociones básicas de informática, así como también los conceptos inherentes a cualquier sistema Unix.
fr_fr: Les <emphasis role="strong">chapitres 2 et 3</emphasis> présenteront les grandes lignes de l'étude de cas retenue. À ce stade, les lecteurs les plus novices peuvent faire un détour par l'<emphasis role="strong">annexe B</emphasis> qui rappelle un certain nombre de notions informatiques de base ainsi que les concepts inhérents à tout système Unix.
ja_jp: <emphasis role="strong">第 2 章と第 3 章</emphasis>ではケーススタディの大筋を述べています。この時点で、初心者は<emphasis role="strong">付録 B</emphasis> を読んでください。この付録では多くの基本的なコンピュータに関する概念と Unix システム全般に内在する概念が説明されています。
pt_br: Os <emphasis role="strong">Capítulos 2 e 3</emphasis> fornecem uma descrição geral do estudo de caso. Neste ponto, os leitores iniciantes podem reservar um tempo para ler o <emphasis role="strong">apêndice B</emphasis>, onde encontrarão um curso rápido de nivelamento, explicando uma série de noções básicas de computação, bem como conceitos inerentes à qualquer sistema Unix.
zh_cn: <emphasis role="strong">第二章和第三章</emphasis>提供了一个清晰的范例分析大纲。新手读者可能需要花时间去阅读<emphasis role="strong">附录B</emphasis>，那是一个简短的补习课程，解释了一些基本计算机概念，以及任何 Unix 系统固有的概念。

source: To get on with our real subject matter, we will quite naturally start with the installation process (<emphasis role="strong">chapter 4</emphasis>); <emphasis role="strong">chapters 5 and 6</emphasis> will unveil basic tools that any Debian administrator will use, such as those of the <emphasis role="strong">APT</emphasis> family, which is largely responsible for the distribution's excellent reputation. These chapters are in no way reserved to professionals, since everyone is their own administrator at home.
ar_ma: لمتابعة المادة الفعلية، سنبدأ بشكل طبيعي بعملية التثبيت (<emphasis role="strong">الفصل 4</emphasis>)؛ ثم يلقي <emphasis role="strong">الفصل 5 والفصل 6</emphasis> الضوء على الأدوات التي يستخدمها أي مدير لنظام دبيان، مثل عائلة <emphasis role="strong">APT</emphasis>، وهي السبب الرئيسي وراء السمعة الممتازة للتوزيعة. هذه الفصول ليست حكراً على المحترفين بأي شكل من الأشكال، فكل واحد منا مدير لحاسوبه في البيت.
el_gr: Για να προχωρήσεις με τη δική μας πραγματική ουσία θέματος, φυσικά θα ξεκινήσουμε με την επεξεργασία εγκατάστασης (<emphasis role="strong">chapter 4</emphasis>); <emphasis role="strong">chapters 5 and 6</emphasis> θα αποκαλύψουμε βασικά εργαλεία που χρησιμοποιεί κάθε Debian διαχειριστής όπως τα <emphasis role="strong">APT</emphasis> οικογένεια, το οποίο κατα πολύ ευθύνεται για την εξαιρετική φήμη της διανομής. Τα κεφάλαια αυτά με κανένα τρόπο ειναι κρατημένα για επαγγελματίες, απο τότε που ο καθένας ειναι ο ίδιος διαχειριστής στο σπίτι του.
es_es: Para comenzar nuestro tema principal, lógicamente vamos a empezar con el proceso de instalación (<emphasis role="strong">capítulo 4</emphasis>); <emphasis role="strong">los capítulos 5 y 6</emphasis> darán a conocer las herramientas básicas que todo administrador de Debian utilizará, como las pertenecientes a la familia <emphasis role="strong">APT</emphasis> que es, en gran parte, la responsable de la excelente reputación de la distribución. Estos capítulos no son exclusivamente para profesionales, puesto que cada uno en su casa es su propio administrador.
fr_fr: Nous débuterons ensuite logiquement par l'installation (<emphasis role="strong">chapitre 4</emphasis>), puis découvrirons, aux <emphasis role="strong">chapitres 5 et 6</emphasis>, les outils de base utiles à tout administrateur Debian, notamment la famille <emphasis role="strong">APT</emphasis>, largement responsable de la bonne réputation de cette distribution. Rappelons qu'à la maison, chacun est son propre administrateur ; ces chapitres ne sont donc nullement réservés aux informaticiens professionnels.
it_it: Per proseguire con il nostro caso reale, partiremo naturalmente dall'inizio con il processo di installazione (<emphasis role="strong">capitolo 4</emphasis>); i <emphasis role="strong">capitoli 5 e 6</emphasis> ci porteranno alla scoperta dei principali strumenti che ogni amministratore di Debian utilizzerà, come quelli della famiglia <emphasis role="strong">APT</emphasis>, che sono in larga parte i responsabili della eccellente reputazione maturata da questa distribuzione. Questi capitoli non sono dedicati ai soli professionisti in quanto ognuno è amministratore del proprio computer.
ja_jp: 我々の真の主題に進むために、ごく自然にインストール過程から始めます (<emphasis role="strong">第 4 章</emphasis>); <emphasis role="strong">第 5 章と第 6 章</emphasis>は全ての Debian 管理者が使う基本的なツールである <emphasis role="strong">APT</emphasis> ファミリーを紹介します。これのおかげで Debian ディストリビューションは素晴らしい評価を受けています。これらの章は専門家のためだけに用意された章ではありません。なぜなら、誰もが家では自分自身を管理する立場になっているからです。
pl_pl: Aby przejść do właściwego tematu, zaczniemy naturalnie od procesu instalacji (<emphasis role="strong">rozdział 4</emphasis>). <emphasis role="strong">Rozdziały 5 i 6</emphasis> zaprezentują podstawowe narzędzia, których używa każdy administrator Debiana, jak te z rodziny <emphasis role="strong">APT</emphasis>, która jest w dużej mierze odpowiedzialna za doskonałą reputację dystrybucji. Te rozdziały nie są w żaden sposób zarezerwowane dla profesjonalistów, ponieważ każdy jest administratorem we własnym domu.
pt_br: Para começar com o nosso assunto real, vamos naturalmente começar com o processo de instalação (<emphasis role="strong">capítulo 4</emphasis>); os <emphasis role="strong">capítulos 5 e 6</emphasis> vão apresentar ferramentas básicas que qualquer administrador Debian vai usar, como os da família <emphasis role="strong">APT</emphasis>, que é largamente responsável pela excelente reputação da distribuição. Estes capítulos não estão de forma alguma reservados a profissionais, já que todo mundo é seu próprio administrador em casa.
zh_cn: 讲到实际的主题，我们很自然地从安装过程开始（<emphasis role="strong">第四章</emphasis>）；<emphasis role="strong">第五章和第六章</emphasis>重点介绍任何 Debian 管理员都会使用到的一些基本工具，如：令这个发行版拥有卓越声誉的 <emphasis role="strong">APT</emphasis> 工具族。这些章节可不是仅供专业人员看的，因为每个人在家里都是自己电脑的管理员。

source: <emphasis role="strong">Chapter 7</emphasis> will be an important parenthesis; it describes workflows to efficiently use documentation and to quickly gain an understanding of problems in order to solve them.
ar_ma: ‏<emphasis role="strong">الفصل 7</emphasis>سيكون فاصلاً هاماً؛ فهو يصف طريقة استخدام الوثائق بكفاءة وفهم المشاكل بسرعة لحلها.
el_gr: <emphasis role="strong">Chapter 7</emphasis>θα είναι μια ενδιαφέρουσα παρένθεσις; περιγράφει εργασίες οπου αποτελεσματικά χρησιμοποιούν τεκμηρίωση και γρήγορο κέρδος στο να καταλάβεις ένα πρόβλημα στη σειρά επίλυσης.
es_es: El <emphasis role="strong">capítulo 7</emphasis> será un paréntesis importante, describe los flujos de trabajo para usar eficientemente la documentación y para lograr comprender rápidamente los problemas para poder resolverlos.
fr_fr: Un chapitre intermédiaire, le <emphasis role="strong">chapitre 7</emphasis>, présentera des méthodes à suivre pour utiliser efficacement toute la documentation et comprendre rapidement ce qui se passe afin de résoudre les problèmes.
it_it: Il <emphasis role="strong">capitolo 7</emphasis> rappresenta un'importante parentesi, che descrive le modalità per utilizzare in modo efficiente la documentazione in modo da comprendere rapidamente i problemi incontrati e trovarne la soluzione.
ja_jp: <emphasis role="strong">第 7 章</emphasis>は重要な章です; この章では、問題の解決に向けて、文書を効果的に使い問題を素早く理解するための作業手順について説明しています。
pl_pl: <emphasis role="strong">Rozdział 7</emphasis> będzie ważnym wtrąceniem, gdyż opisuje sposoby efektywnego korzystania z dokumentacji i szybkiego zrozumienia problemów w celu ich rozwiązania.
pt_br: O <emphasis role="strong">Capítulo 7</emphasis> será um parênteses importante, que descreve os fluxos de trabalho para uso eficiente da documentação e atingir rapidamente uma compreensão dos problemas, a fim de resolvê-los.
zh_cn: <emphasis role="strong">第七章</emphasis>是个重要的插入章节：它描述了如何有效地使用文档，以及快速理解问题的本质，以便解决它们。

source: The next chapters will be a more detailed tour of the system, starting with basic infrastructure and services (<emphasis role="strong">chapters 8 to 10</emphasis>) and going progressively up the stack to reach the user applications in <emphasis>chapter 13</emphasis>. <emphasis role="strong">Chapter 12</emphasis> deals with more advanced subjects that will most directly concern administrators of large sets of computers (including servers), while <emphasis role="strong">chapter 14</emphasis> is a brief introduction to the wider subject of computer security and gives a few keys to avoid most problems.
ar_ma: الفصل التالي عبارة عن رحلة تفصيلية حول النظام، تبدأ مع البنية التحتية الأساسية والخدمات (<emphasis role="strong">الفصول من 8 إلى 10</emphasis>) ويتقدم تدريجياً وصولاً إلى تطبيقات المستخدم في <emphasis>الفصل 13</emphasis>. يطرح <emphasis role="strong">الفصل 12</emphasis> مواضيعاً أكثر تقدماً تهم مديري المجموعات الحاسوبية الكبيرة (والمخدمات) بشكل مباشر، بينما <emphasis role="strong">الفصل 14</emphasis>هو نبذة عن قضية أمن المعلومات الواسعة كما يقدم بضعة نصائح لتفادي أغلب الأخطاء.
el_gr: Τα επόμενα κεφάλαια θα είναι πιο λεπτομερή οσον αφορά το σύστημα, ξεκινώντας με την βασική υποδομή και υπηρεσίες (<emphasis role="strong">chapters 8 to 10</emphasis>) και πηγαίνει προδευτικά στο να πλησιάσει τις εφαρμογές του χρήστη σε <emphasis>chapter 13</emphasis>. <emphasis role="strong">Chapter 12</emphasis> διαπραγματεύεται με πιό προχωρημένα είδη τα οποία κατα πολύ αφορούν τον διαχειριστή για μεγάλα σύνολα απο κομπιούτερς (συμπεριλαμβανόμενοι και σέρβερς), ενώ <emphasis role="strong">chapter 14</emphasis> είναι μια σύντομη εισαγωγή σε ευρύτερο φάσμα ασφάλειας των κομπιούτερς και δίνει μερικά "κλειδιά" για αποφυγή περισσότερων προβλημάτων.
es_es: Los capítulos siguientes proporcionarán una visión más detallada del sistema, empezando por la infraestructura básica y los servicios (<emphasis role="strong">desde el capítulo 8 hasta el 10</emphasis>) y se irá avanzado progresivamente hasta las aplicaciones de usuario en el <emphasis>capítulo 13</emphasis>. El <emphasis role="strong">capítulo 12</emphasis> trata de temas más avanzados relacionados directamente con los administradores de grandes conjuntos de equipos (incluyendo servidores), mientras que el <emphasis role="strong">capítulo 14</emphasis> es una breve introducción al tema más amplio que es la seguridad y proporciona algunas claves para evitar la mayoría de los problemas.
fr_fr: La suite détaillera la configuration pas à pas du système en commençant par les infrastructures et services de base (<emphasis role="strong">chapitres 8 à 10</emphasis>) pour remonter progressivement vers les applicatifs utilisateur (<emphasis role="strong">chapitre 13</emphasis>). Le <emphasis role="strong">chapitre 12</emphasis> s'attarde sur des sujets plus pointus qui concernent directement les administrateurs de parc informatique (serveurs y compris), tandis que le <emphasis role="strong">chapitre 14</emphasis> rappelle la problématique de la sécurité informatique et donne les clés nécessaires pour éviter la majorité des problèmes.
it_it: I capitoli seguenti saranno un dettagliato tour del sistema, iniziando con la infrastuttura base ed i servizi (<emphasis role="strong">capitoli da 8 a 10</emphasis>) avanzando fino a raggiungere le applicazioni utente, nel <emphasis>capitolo 13</emphasis>. Il <emphasis role="strong">capitolo 12</emphasis> si occupa di argomenti più avanzati che riguardano più direttamente gli amministratori di grandi insiemi di computer (tra cui i server), mentre il <emphasis role="strong">capitolo 14</emphasis> è una breve introduzione al tema più ampio della sicurezza informatica e fornisce alcuni spunti per evitare la maggior parte di questo tipo di problemi.
ja_jp: 以降の章では Debian のシステムをより詳細に案内しています、基礎的な構造とサービスにはじまり (<emphasis role="strong">第 8 章から第 10 章</emphasis>)、<emphasis>第 13 章</emphasis>ではユーザアプリケーションまで進みます。<emphasis role="strong">第 12 章</emphasis>ではより高度なテーマ、(サーバを含む) 巨大なコンピュータ群の管理者がより強い興味を惹かれるテーマ、を取り上げています。一方で<emphasis role="strong">第 14 章</emphasis>ではコンピュータセキュリティに関する広範な問題について簡単に紹介し、多くの問題を避けるための秘訣を挙げています。
pl_pl: Następne rozdziały będą bardziej szczegółowym opisem systemu, zaczynając od infrastruktury i usług (<emphasis role="strong">rozdziały 8 do 10</emphasis>) i pnąc się w górę, aby dotrzeć do aplikacji użytkownika w <emphasis>rozdziale 13</emphasis>. <emphasis role="strong">Rozdział 12</emphasis> dotyczy bardziej zaawansowanych tematów, które najbardziej dotyczą administratorów dużej ilości komputerów (włączając w to serwery), podczas gdy <emphasis role="strong">rozdział 14</emphasis> jest krótkim wprowadzeniem do szerszej tematyki bezpieczeństwa komputerów i dostarcza kilku rozwiązań, aby uniknąć większości problemów.
pt_br: Os próximos capítulos serão uma visita mais detalhada ao sistema, começando com infraestrutura básica e serviços (<emphasis role="strong">capítulos 8 a 10 </emphasis>) e indo progressivamente na pilha, até chegar nas aplicações de usuários no <emphasis>capítulo 13</emphasis>. O <emphasis role="strong">Capítulo 12</emphasis> lida com assuntos mais avançados que tratam mais diretamente às preocupações dos administradores de grandes conjuntos de computadores (incluindo servidores), enquanto o <emphasis role="strong">capítulo 14</emphasis> é uma breve introdução para a questão mais ampla de segurança de computadores e dá algumas chaves para evitar a maioria dos problemas.
zh_cn: 接下去的章节将开启对系统更深入了解的旅程，从基本的架构和服务（<emphasis role="strong">第八章到第十章</emphasis>）开始，慢慢讲到用户程序（<emphasis>第十三章</emphasis>）；<emphasis role="strong">第十二章</emphasis>处理一个比较进阶的主题，直接与绝大多数管理着大量计算机（包括服务器）的管理员们息息相关；<emphasis role="strong">第十四章</emphasis>则是针对计算机安全这个大主题做了简介，并给出一些关键提示以避免大多数的问题。

source: <emphasis role="strong">Chapter 15</emphasis> is for administrators who want to go further and create their own Debian packages.
ar_ma: سيكون <emphasis role="strong">الفصل 15</emphasis> لمن يريد التعمق أكثر وإنشاء حزم دبيان خاصة به.
el_gr: <emphasis role="strong">Chapter 15</emphasis> ειναι για διαχειριστές οι οποίοι θέλουν να προχωρήσουν ακόμα πιο πολύ και να δημιουργήσουν δικά τους Debian πακέτα.
es_es: El <emphasis role="strong">capítulo 15</emphasis> es para administradores que quieran profundizar y crear sus propios paquetes Debian.
fr_fr: Le <emphasis role="strong">chapitre 15</emphasis> sera consacré aux administrateurs qui souhaitent aller plus loin et créer des paquets Debian personnalisés.
it_it: Il <emphasis role="strong">capitolo 15</emphasis> è per quegli amministratori che voglio andare oltre e crearsi i propri pacchetti Debian.
ja_jp: <emphasis role="strong">第 15 章</emphasis>はさらに踏み込んで自分で Debian パッケージを作りたいと考えている管理者のための章です。
pl_pl: <emphasis role="strong">Rozdział 15</emphasis> jest dla administratorów, którzy chcą pójść o krok dalej i tworzyć własne pakiety Debiana.
pt_br: O <emphasis role="strong">Capítulo 15</emphasis> é para os administradores que querem ir além e criar seus próprios pacotes Debian.
zh_cn: <emphasis role="strong">第十五章</emphasis>是为那些想走得更远，想创建自己的 Debian 软件包的管理员而准备的。

source: <emphasis>VOCABULARY</emphasis> Debian package
ar_ma: <emphasis>مصطلحات</emphasis> حزمة دبيان
es_es: <emphasis>VOCABULARIO</emphasis> Paquete Debian
fr_fr: <emphasis>VOCABULAIRE</emphasis> Paquet Debian
it_it: <emphasis>VOCABOLARIO</emphasis> Pacchetto Debian
ja_jp: <emphasis>VOCABULARY</emphasis> Debian パッケージ
pl_pl: <emphasis>SŁOWNIK</emphasis> Pakiet Debiana
pt_br: <emphasis>VOCABULÁRIO</emphasis> pacote Debian
zh_cn: <emphasis>关键词</emphasis> Debian 包
