Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: Foreword
ar_ma: تمهيد
el_gr: Εισαγωγή
es_es: Prefacio
fr_fr: Avant-propos
it_it: Introduzione
ja_jp: 前書き
pl_pl: Przedsłowie
pt_br: Prefácio
zh_cn: 英文版前言

source: Linux has been garnering strength for a number of years now, and its growing popularity drives more and more users to make the jump. The first step on that path is to pick a distribution. This is an important decision, because each distribution has its own peculiarities, and future migration costs can be avoided if the right choice is made from the start.
ar_ma: كانت قوة لينكس تتراكم خلال السنوات القليلة الماضية، وشعبيته المتنامية تدفع مزيدًا من المستخدمين للمغامرة. الخطوة الأولى والأهم في هذا المسار هي اختيار التوزيعة، لأن لكل واحدة مميزات خاصة، ثم إن الاختيار الصحيح من البداية يغني عن تكاليف الانتقال إلى توزيعة أخرى.
es_es: Desde hace varios años Linux adquiere cada vez más fuerza, y su creciente popularidad impulsa a cada vez más y más usuarios a dar el salto. El primer paso en ese camino consiste en elegir una distribución. Es una decisión importante ya que cada distribución tiene sus propias peculiaridades y una elección correcta desde el principio puede evitar los costos de migraciones futuras.
fr_fr: Linux a le vent en poupe depuis un certain nombre d'années et sa popularité croissante encourage de plus en plus à faire le grand saut. Cette aventure commence par le choix d'une distribution, décision importante car chacune a ses particularités. Autant s'épargner de futurs efforts inutiles de migration !
ja_jp: 今や Linux は何年にもわたり力を蓄え続け、その高まる人気によってより多くのユーザを惹き付けています。Linux 人気の波に乗るための第一歩はディストリビューションを選ぶことです。各ディストリビューションはそれぞれ異なる特徴を持っているため、ディストリビューションを選ぶことは重要です。最初から正しいものを選んでいれば将来の乗り換えコストを避けることができるのです。
pt_br: O Linux foi ganhando força nos últimos anos, e sua popularidade crescente leva mais e mais usuários a dar o salto. O primeiro passo nesse caminho é escolher uma distribuição. Esta é uma decisão importante, porque cada distribuição tem suas próprias peculiaridades, e os futuros custos de migração podem ser evitados se a escolha certa é feita desde o início.

source: <emphasis>BACK TO BASICS</emphasis> Linux distribution, Linux kernel
ar_ma: <emphasis>أساسيات</emphasis> توزيعة لينكس، نواة لينكس
es_es: <emphasis>VOLVER A LOS CIMIENTOS</emphasis> distribución Linux, núcleo Linux
fr_fr: <emphasis>B.A.-BA</emphasis> Distribution et noyau Linux
it_it: <emphasis>FONDAMENTALI</emphasis> Distribuzione Linux, Kernel Linux
ja_jp: <emphasis>BACK TO BASICS</emphasis> Linux ディストリビューション、Linux カーネル
pl_pl: <emphasis>WRACAJĄC DO PODSTAW</emphasis> Dystrybucja Linuksa, jądro Linuksa
pt_br: <emphasis>DE VOLTA AO BÁSICO</emphasis> distribuição Linux, kernel Linux
zh_cn: <emphasis>基础知识：</emphasis> Linux 发行版本与 Linux 内核

source: <primary>Linux</primary><secondary>kernel</secondary>
ar_ma: <primary>لينكس</primary><secondary>نواة</secondary>
es_es: <primary>Linux</primary><secondary>núcleo</secondary>
fr_fr: <primary>Linux</primary><secondary>noyau</secondary>
it_it: <primary>Kernel</primary><secondary>Linux</secondary>
ja_jp: <primary>Linux</primary><secondary>カーネル</secondary>
pl_pl: <primary>jądro</primary><secondary>Linuksa</secondary>
zh_cn: <primary>Linux</primary><secondary> 内核</secondary>

source: <primary>Linux</primary><secondary>distribution</secondary>
ar_ma: <primary>لينكس</primary><secondary>توزيعة</secondary>
es_es: <primary>Linux</primary><secondary>distribución</secondary>
it_it: <primary>Distribuzione</primary><secondary>Linux</secondary>
ja_jp: <primary>Linux</primary><secondary>ディストリビューション</secondary>
pl_pl: <primary>dystrybucja</primary><secondary>Linuksa</secondary>
pt_br: <primary>Linux</primary><secondary>distribuição</secondary>
zh_cn: <primary>Linux</primary><secondary> 发行版本</secondary>

source: <primary>distribution</primary><secondary>Linux distribution</secondary>
ar_ma: <primary>توزيعة</primary><secondary>توزيعة لينكس</secondary>
es_es: <primary>distribución</primary><secondary>Linux</secondary>
fr_fr: <primary>distribution Linux</primary><secondary>définition</secondary>
it_it: <primary>distribuzione</primary><secondary>distribuzione Linux</secondary>
ja_jp: <primary>ディストリビューション</primary><secondary>Linux ディストリビューション</secondary>
pl_pl: <primary>dystrybucja</primary><secondary>dystrybucja Linuksa</secondary>
pt_br: <primary>distribuição</primary><secondary>distribuição Linux</secondary>
zh_cn: <primary>发行版本</primary><secondary>Linux 发行版本</secondary>

source: Strictly speaking, Linux is only a kernel, the core piece of software which sits between the hardware and the applications.
ar_ma: في الواقع، لينكس هي مجرد نواة، أي الجزء البرمجي الأساسي الواقع بين العتاد والتطبيقات.
es_es: Estrictamente hablando, Linux es solo un núcleo, la pieza central de software que se encuentra entre el hardware y las aplicaciones.
fr_fr: Linux n'est en fait qu'un noyau, la brique logicielle de base assurant l'interface entre le matériel et les programmes.
ja_jp: 厳密に言えば、Linux とはカーネル (ハードウェアとアプリケーションの間に位置するソフトウェアの中核部分) だけを指しています。
pt_br: Estritamente falando, Linux é apenas um núcleo (ou kernel), a parte essencial do software que fica entre o hardware e as aplicações.
zh_cn: 严格意义上说，Linux 只是一个内核，是处于硬件与应用程序之间的核心软件。

source: A “Linux distribution” is a full operating system; it usually includes the Linux kernel, an installer program, and most importantly applications and other software required to turn a computer into a tool that is actually useful.
ar_ma: ”توزيعة لينكس“ هي نظام تشغيل متكامل؛ يتضمّن عادة نواة لينكس، وبرنامج تثبيت، وأهم من ذلك التطبيقات وغيرها من البرامج الضرورية لتحويل الحاسوب إلى أداة مفيدة فعلياً.
es_es: Una «distribución Linux» es un sistema operativo completo; normalmente incluye el núcleo Linux, un programa instalador y sobre todo aplicaciones y otro software necesario para convertir un equipo en una herramienta realmente útil.
fr_fr: Une distribution Linux est un système d'exploitation complet incluant un noyau Linux, un programme d'installation, et surtout des applications et utilitaires transformant l'ordinateur en outil réellement exploitable.
ja_jp: 「Linux ディストリビューション」は完全なオペレーティングシステムです; これには通常、Linux カーネル、インストーラプログラム、そして最も重要なことですがコンピュータを実際に役立つ道具に変えるためのアプリケーションとその他のソフトウェアが含まれています。
pt_br: Uma "distribuição Linux" é um sistema operacional completo, que normalmente inclui o kernel do Linux, um programa de instalação e, o mais importante, aplicativos e outros softwares necessários para transformar um computador em uma ferramenta realmente útil.
zh_cn: Linux 发行版本则是一个完整的操作系统，通常包括 Linux 内核，安装程序，大部分重要的应用程序和其它能把电脑变得有用的软件。

source: Debian GNU/Linux is a “generic” Linux distribution that fits most users. The purpose of this book is to show its many aspects so you can make an informed decision when choosing.
ar_ma: دبيان غنو/لينكس هي توزيعة لينكس ”عامة“ تُناسب معظم المستخدمين. الغرض من هذا الكتاب هو إظهار جوانبها العديدة، حتى يكون اختيارك مبني على معرفة.
el_gr: Το Debian GNU/Linux είναι μία "χωρίς εμπορικό σήμα" διανομή η οποία ταιριάζει στους περισσότερους χρήστες. Ο σκοπός αυτού του βιβλίου είναι να δείξει πολλές πλευρές ώστε να συμβάλλει στην επιλογή απόφασης.
es_es: Debian GNU/Linux es una distribución de Linux «genérica» que se ajusta a la mayoría de los usuarios. El propósito de este libro es mostrar sus numerosos aspectos para que pueda tomar una decisión fundada en el momento de elegir una distribución.
fr_fr: Debian GNU/Linux est une distribution Linux « généraliste », convenant a priori à tous. Nous vous proposons d'en découvrir toutes les facettes, afin de pouvoir choisir en toute connaissance de cause…
ja_jp: Debian GNU/Linux は多くのユーザにぴったりの「汎用」Linux ディストリビューションです。この本の目的は、ディストリビューションを選ぶ際に十分な情報に基づいた判断を下すことができるように、ディストリビューションの様々な側面を示すことです。
pl_pl: Debian GNU/Linux jest "ogólną" dystrybucją Linuksa, która odpowiada większości z użytkowników. Celem tej książki jest pokazanie jej wielu aspektów, aby można było podjąć świadomą decyzję przy wyborze.
pt_br: O Debian GNU/Linux é uma distribuição Linux "genérica" que serve à maioria dos usuários. O propósito deste livro é mostrar seus muitos aspectos para que você possa tomar uma decisão fundamentada ao escolher.
zh_cn: Debian GNU/Linux 是一个通用的 Linux 发行版本，适合于大多数用户。本书的目的便是介绍它的各个方面，于是，当你面临选择时便可以作出明智的决定。

source: Why This Book?
ar_ma: لماذا هذا الكتاب؟
el_gr: Γιατί αυτό το Βιβλίο;
es_es: ¿Por qué este libro?
fr_fr: Pourquoi ce livre ?
it_it: Perché questo libro?
ja_jp: この本の目的とは?
pl_pl: Dlaczego Ta książka?
pt_br: Por que este Livro?
zh_cn: 为什么写这本书？

source: <emphasis>CULTURE</emphasis> Commercial distributions
ar_ma: <emphasis>ثقافة</emphasis> توزيعات تجارية
el_gr: <emphasis>CULTURE</emphasis> Εμπορικές διανομές
es_es: <emphasis>CULTURA</emphasis> Distribuciones comerciales
fr_fr: <emphasis>CULTURE</emphasis> Distributions commerciales
it_it: <emphasis>CULTURA</emphasis> Distribuzioni commerciali
ja_jp: <emphasis>CULTURE</emphasis> 商用ディストリビューション
pl_pl: <emphasis>KULTURA</emphasis> Dystrybucje komercyjne
pt_br: <emphasis>CULTURA</emphasis> Distribuições Comerciais
zh_cn: <emphasis>文化：</emphasis> 商业发行版本

source: <primary>distribution</primary><secondary>commercial distribution</secondary>
ar_ma: <primary>توزيعة</primary><secondary>توزيعة تجارية</secondary>
es_es: <primary>distribución</primary><secondary>distribución comercial</secondary>
fr_fr: <primary>distribution Linux</primary><secondary>commerciale</secondary>
it_it: <primary>distribuzione</primary><secondary>distribuzioni commerciali</secondary>
ja_jp: <primary>ディストリビューション</primary><secondary>商用ディストリビューション</secondary>
pl_pl: <primary>dystrybucja</primary><secondary>dystrybucja komercyjna</secondary>
pt_br: <primary>distribuição</primary><secondary>distribuição comercial</secondary>
zh_cn: <primary>发行版本</primary><secondary>商业发行版本</secondary>

source: Most Linux distributions are backed by a for-profit company that develops them and sells them under some kind of commercial scheme. Examples include <emphasis>Ubuntu</emphasis>, mainly developed by <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, by French company <emphasis>Mandriva SA</emphasis>; and <emphasis>Suse Linux</emphasis>, maintained and made commercially available by <emphasis>Novell</emphasis>.
ar_ma: معظم توزيعات لينكس تدعمها شركات ربحية تطوّرها وتسوّقها بصيغة تجارية معينة. مثل <emphasis>أوبنتو</emphasis>، التي تطورها شركة <emphasis>كانونيكال المحدودة</emphasis>؛ و<emphasis>ماندريفا لينكس</emphasis>، التي تطوّرها شركة <emphasis>Mandriva SA</emphasis> الفرنسية؛ و<emphasis>سوزا لينكس</emphasis>، التي تطورها وتسوّقها شركة <emphasis>Novell</emphasis>.
el_gr: Οι περισσότερες Linux διανομές υποστηρίζονται απο κερδοσκοπικές εταιρίες όπου τις αναπτύσουν και πωλούν με κάποιο εμπορικό πλάνο.Examples include <emphasis>Ubuntu</emphasis>, mainly developed by <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, by French company <emphasis>Mandriva SA</emphasis>; and <emphasis>Suse Linux</emphasis>, maintained and made commercially available by <emphasis>Novell</emphasis>.
es_es: La mayoría de distribuciones Linux están respaldadas por empresas con fines de lucro que las desarrollan y comercializan bajo algún tipo de proyecto comercial. Algunos ejemplos son <emphasis>Ubuntu</emphasis>, principalmente desarrollado por <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, por la compañía francesa <emphasis>Mandriva SA</emphasis>; y <emphasis>Suse Linux</emphasis>, que es mantenida y comercializada por <emphasis>Novell</emphasis>.
fr_fr: La plupart des distributions Linux sont adossées à une entreprise commerciale qui les développe et les commercialise. C'est par exemple le cas d'<emphasis>Ubuntu</emphasis>, développée principalement par la société <emphasis>Canonical Ltd</emphasis>, mais aussi de <emphasis>Mandriva Linux</emphasis>, réalisée par la société française <emphasis>Mandriva SA</emphasis>, ou encore celui de <emphasis>Suse Linux</emphasis>, maintenue et commercialisée par <emphasis>Novell</emphasis>.
it_it: La maggior parte delle distribuzioni sono supportate da aziende commerciali che le sviluppano e le vendono per trarne profitti, le più conosciute sono <emphasis>Ubuntu</emphasis>, manutenuta principalmente da <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, dall'azienda francese <emphasis>Mandriva SA</emphasis>; e <emphasis>Suse Linux</emphasis>, manutenuta e commercializzata da <emphasis>Novell</emphasis>.
ja_jp: 多くの Linux ディストリビューションはある種の商業計画の下にディストリビューションを開発、販売する営利目的の企業から支援を受けています。例として、<emphasis>Canonical Ltd.</emphasis> が主に開発している <emphasis>Ubuntu</emphasis>; フランスの企業 <emphasis>Mandriva SA</emphasis> が開発している <emphasis>Mandriva Linux</emphasis>; <emphasis>Novell</emphasis> が保守と市販を行っている <emphasis>Suse Linux</emphasis> などが挙げられます。
pl_pl: Większość dystrybucji Linuksa jest wspieranych przez firmy nastawione na zysk, które rozwijają i sprzedają je według jakichś komercyjnych modeli. Przykłady obejmują <emphasis>Ubuntu</emphasis>, rozwijane głównie przez <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, przez francuską firmę <emphasis>Mandriva SA</emphasis>; oraz <emphasis>Suse Linux</emphasis>, zarządzane i dostępne w ofercie firmy <emphasis>Novell</emphasis>.
pt_br: A maioria das distribuições Linux são suportadas por uma empresa com fins lucrativos que as desenvolve e vende sob algum tipo de esquema comercial. Exemplos incluem <emphasis>Ubuntu</emphasis>, desenvolvida principalmente pela <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, pela companhia francesa <emphasis>Mandriva SA</emphasis>; e <emphasis>Suse Linux</emphasis>, mantida e disponibilizada comercialmente pela <emphasis>Novell</emphasis>.
zh_cn: 多数 Linux 发行版本是由商业公司支持着的。这些公司以营利为目的，在特定商业模式下开发并销售 Linux 发行版本。例如：<emphasis>Canonical</emphasis> 公司开发的 <emphasis>Ubuntu</emphasis>，法国公司 <emphasis>Mandriva SA</emphasis> 的 <emphasis>Mandriva Linux</emphasis>，以及 <emphasis>Novell</emphasis> 维护和销售的 <emphasis>Suse Linux</emphasis> 。

source: At the other end of the spectrum lie the likes of Debian and the Apache Software Foundation (which hosts the development for the Apache web server). Debian is above all a project in the Free Software world, implemented by volunteers working together through the Internet. While some of them do work on Debian as part of their paid job in various companies, the project as a whole is not attached to any company in particular, nor does any one company have a greater say in the project's affairs than what purely volunteer contributors have.
ar_ma: وعلى النقيض من هذا تجد دبيان ومؤسسة أباتشي للبرمجيات (التي تُطوّر مخدم الوب أباتشي). دبيان هو قبل كل شيء مشروع في عالم البرمجيات الحرة، أنجزه متطوّعون يعملون معًا من خلال الإنترنت. وفي حين يعمل بعضهم في دبيان كجزء من وظائفهم مدفوعة الأجر في شركات مختلفة، إلا أن المشروع ككل غير مرتبط بأي شركة محددة، ولا تتمتع أي شركة بأي صلاحيات في شؤون المشروع أعلى من صلاحيات المساهمين المتطوعين.
es_es: En el extremo opuesto se encuentran aquellas similares a Debian y de la «Apache Software Foundation» (que alberga el desarrollo del servidor web Apache). Debian es ante todo un proyecto en el mundo del Software Libre, implementado por voluntarios que trabajan juntos a través de Internet. Si bien algunos de ellos trabajan en Debian como parte del trabajo que realizan en varias empresas, el proyecto como tal no está asociado a ninguna empresa en particular, así como tampoco ninguna empresa tiene una influencia especial en las cuestiones del proyecto que la que posee cualquier colaborador voluntario.
fr_fr: Par opposition à ces distributions commerciales, et à l'instar de l'<foreignphrase>Apache Software Foundation</foreignphrase>, qui développe le serveur web du même nom, Debian est avant tout un projet du monde du logiciel libre. C'est une organisation regroupant des bénévoles qui coopèrent par Internet. Alors que certains d'entre eux travaillent effectivement sur Debian dans le cadre de leur emploi dans diverses entreprises, le projet en tant que tel n'est attaché à aucune entreprise en particulier, et aucune entreprise n'a plus d'influence dans les affaires du projet que celle que les contributeurs bénévoles peuvent avoir.
ja_jp: その対極に、Debian や Apache ソフトウェア財団 (Apache ウェブサーバの開発を主導しています) のようなものがあります。Debian はフリーソフトウェア世界におけるすべてのプロジェクトを超越し、インターネットを介して共同作業するボランティア達によって実装されました。一部のボランティアはさまざまな企業から報酬を受ける仕事の一部として Debian に関する仕事を行っていますが、Debian プロジェクト全体は特定の企業との結びつきはありません。どんな企業でも完全にボランティアの貢献者が持っているものよりも強くプロジェクトの仕事について口を出す権利を持っていないのです。
pt_br: No outro extremo do espectro encontram-se nomes como o Debian e a Apache Software Foundation (que hospeda o desenvolvimento para o servidor web Apache). O Debian é, acima de tudo, um projeto no mundo do Software Livre, implementado por voluntários que trabalham em conjunto através da Internet. Embora alguns deles trabalhem no Debian como parte de seus trabalhos remunerados em várias companhias, o projeto como um todo não é vinculado a nenhuma companhia em particular, nem deixa que uma única companhia tenha muito mais voz nos negócios do projeto que os contribuidores puramente voluntários tenham.

source: Linux has gathered a fair amount of media coverage over the years; it mostly benefits the distributions supported by a real marketing department — in other words, company-backed distributions (Ubuntu, Red Hat, SUSE, Mandriva, and so on). But Debian is far from being a marginal distribution; multiple studies have shown over the years that it is widely used both on servers and on desktops. This is particularly true among webservers where Debian is the leading Linux distribution. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
ar_ma: حَظِيَ لينكس بتغطية إعلامية جيدة خلال السنوات المنصرمة، استفادت منها في الأساس التوزيعات التي تدعمها خدمات تسويقية حقيقية — أي التوزيعات التي تدعمها شركات (أوبونتو، ريدهات، سوزا، ماندريفا، وغيرها). إلا أن دبيان ليست أبداً توزيعة هامشية؛ فقد أظهرت عدة دراسات عبر الأعوام الماضية أن دبيان مستخدم على نطاق واسع على المخدمات والحواسيب المكتبية. خصوصاً على مخدمات الوب حيث تتفوق حصة دبيان عليها على غيرها من توزيعات لينكس. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
es_es: Linux ha disfrutado de una gran cobertura mediática en los últimos años; esta beneficia sobre todo a las distribuciones que se apoyan en un departamento de marketing real — en otras palabras: distribuciones respaldas por empresas (Ubuntu, Red Hat, SUSE, Mandriva, etc.). Sin embargo, Debian está lejos de ser una distribución marginal; muchos estudios mostraron a través de los años que se utiliza tanto en servidores como escritorios. Esto es particularmente cierto en servidores web, donde Debian es la distribución Linux de preferencia. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
fr_fr: Linux commence à bénéficier d'une couverture médiatique non négligeable, profitant essentiellement aux distributions disposant d'un véritable service marketing. C'est le cas de la plupart des distributions adossées à des entreprises (Ubuntu, Red Hat, SuSE, Mandriva...). Debian est pourtant loin d'être marginale ; de multiples études ont montré au fil des ans qu'elle est largement utilisée aussi bien sur des serveurs que sur des postes de bureautique. C'est encore plus marqué au sein des serveurs web, où Debian est la distribution Linux la plus populaire. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
ja_jp: ここ数年の Linux に関するマスコミ報道の数はかなり多いものです; このことは実在するマーケティング部門によって支援されているディストリビューション、言い換えれば企業支援を受けたディストリビューション (Ubuntu、Red Hat、SUSE、Mandriva など) の利益になっています。しかし Debian は決して重要度の低いディストリビューションではありません; ここ数年の複数の調査によれば、Debian はサーバとデスクトップの両方で広く使われていることが明らかになっています。これは Debian が主要な Linux ディストリビューションであるウェブサーバにおいて特に当てはっています。 <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />
pt_br: O Linux reuniu um volume considerável de cobertura da mídia ao longo dos anos; isto beneficia principalmente as distribuições apoiadas por um departamento de marketing real - em outras palavras, para distribuições baseadas em empresas (Ubuntu, Red Hat, SUSE, Mandriva, e assim por diante). Mas o Debian está longe de ser uma distribuição marginal; múltiplos estudos mostram ao longo dos anos que o Debian é amplamente usado em servidores e desktops, isto é particularmente verdade entre servidores web onde o Debian é a distribuição Linux líder. <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" /> <ulink type="block" url="http://w3techs.com/blog/entry/debian_ubuntu_extend_the_dominance_in_the_linux_web_server_market_at_the_expense_of_red_hat_centos" />

source: The purpose of this book is to help you discover this distribution. We hope to share the experience that we have gathered since we joined the project as developers and contributors in 1998 (Raphaël) and 2000 (Roland). With any luck, our enthusiasm will be communicative, and maybe you will join us sometime…
ar_ma: الغرض من هذاالكتاب هو مساعدتك على اكتشاف هذه التوزيعة. نحن نأمل أن نشاركك الخبرة التي اكتسبناها منذ انضمامنا إلى هذا المشروع كمطورين ومساهمين في 1998 (رافائيل) و2000 (رولاند). بقليل من الحظ، سنتمكن من إيصال حماستنا إليك، وربما تنضم إلينا في وقت ما…
es_es: El propósito de este libro es ayudarle a descubrir esta distribución. Esperamos compartir la experiencia que hemos acumulado desde que nos unimos al proyecto como desarrolladores y contribuidores en 1998 (Raphaël) y 2000 (Roland). Con suerte, transmitiremos nuestro entusiasmo y quizás decidas unirte a nosotros algún día…
fr_fr: Ce livre a ainsi pour vocation de faire découvrir cette distribution. Nous espérons vous faire profiter de toute l'expérience acquise depuis que nous avons rejoint le projet en tant que développeurs-contributeurs, en 1998 pour Raphaël et en 2000 pour Roland. Peut-être parviendrons-nous à vous communiquer notre enthousiasme et vous donner l'envie de rejoindre nos rangs d'ici quelque temps, qui sait...
ja_jp: この本の目的は、このディストリビューションの良さを理解する一助になることです。我々は 1998 年 (Raphaël) と 2000 (Roland) 年から開発者としてこのプロジェクトに参加して以降に集め続けた経験を共有したいと望んでいます。運が良ければ、あなたに我々の熱意が通じて、あなたがいつか我々の仲間になりますように…
pt_br: O propósito deste livro é ajudar você a descobrir esta distribuição. Nós esperamos compartilhar a experiência que tivemos desde 1998 (Rafaël) e 2000 (Roland) quando nos juntamos ao projeto como desenvolvedores e colaboradores. Com alguma sorte, nosso entusiasmo vai ser comunicativo, e talvez você se junte a nós em algum momento…
zh_cn: 本书的目的是帮助您探索这个发行版。做为 Debian 项目的开发者和贡献者，我们希望分享我们自加入到这个项目以来积累的点滴经验（Raphaël自1998年加入，Roland自2000年加入）。运气好的话，我们所热衷的 Debian 将带有交流的性质，可能您有一天也会加入我们……
