Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: In 2003, Nat Makarévitch contacted Raphaël because he wanted to publish a book on Debian in the <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) collection that he was managing for Eyrolles, a leading French editor of technical books. Raphaël immediately accepted to write it. The first edition came out on 14th October 2004 and was a huge success — it was sold out barely four months later.
ar_ma: في عام 2003، اتصل Nat Makarevitch برافائيل ﻷنه يرغب بنشر كتاب عن دبيان في مجموعة <foreignphrase>Cahier de l'Admin</foreignphrase> (دفتر المدير) التي كان يديرها لصالح Eyrolles، وهي دار نشر فرنسية رائدة في مجال الكتب التقنية. وافق رافائيل فوراً على كتابته. رأت الطبعة الأولى النور في 14 أكتوبر 2004 ولاقت نجاحاً كبيراً — حيث بيعت النسخ كلها في أقل من أربعة أشهر.
es_es: En 2003, Nat Makarévitch se puso en contacto con Raphaël porque quería publicar un libro sobre Debian en la colección <foreignphrase>Cahier de l'Admin</foreignphrase> («libro del administrador») que estaba coordinando para Eyrolles, un editor francés de libros técnicos. Raphaël aceptó escribirlo inmediatamente. La primera edición salió a la luz el 14 de octubre de 2004 y tuvo un gran éxito — se agotó apenas cuatro meses más tarde.
fr_fr: En 2003, Nat Makarévitch a contacté Raphaël dans le but de publier un livre sur Debian dans la collection des « Cahiers de l'Admin », dont il était directeur, chez Eyrolles, un éditeur français d'ouvrages techniques. Raphaël a immédiatement accepté de l'écrire et la première édition, parue le 14 octobre 2004, a été un franc succès — elle a été épuisée après à peine quatre mois.
ja_jp: Nat Makarévitch さんは自分がフランスで一流の専門書出版社である Eyrolles で運営している <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) シリーズで Debian をテーマにした本を出版したかったので、2003 年に Raphaël さんに連絡をとりました。Raphaël さんはすぐに本の執筆を引き受けました。最初の版は 2004 年 10 月 14 日に出版され、大成功を収めました (約 4 か月で売り切れました)。
pt_br: Em 2003, Nat Makarévitch contatou Raphaël porque queria publicar um livro sobre Debian na coleção <foreignphrase>Cahier de l'Admin</foreignphrase> (Manual de Administração) que ele estava gerenciando para a Eyrolles, uma importante editora francesa de livros técnicos. Raphaël imediatamente aceitou escrevê-lo. A primeira edição saiu no dia 14 de outubro de 2004 e foi um enorme sucesso - esgotou em cerca de quatro meses.
zh_cn: 2003年，Nat Makarévitch 联系了 Raphaël，因为他想出版一本关于 Debian 的书，作为他为 Eyrolles －一个法国著名的技术书籍编辑 － 管理的 <foreignphrase>Cahier de l'Admin</foreignphrase>（管理员手册）系列丛书之一。Raphaël 立即答应去写这本书。第一版是在200年10月14日完成的，并且获得了巨大成功 － 仅仅四个月之后就销售一空。

source: Since then, we have released 5 other editions of the French book, one for each subsequent Debian release. Roland, who started working on the book as a proofreader, gradually became its co-author.
ar_ma: منذ ذلك الحين، أصدرنا 4 طبعات أخرى من الكتاب الفرنسي، واحدة لكل إصدار من إصدارات دبيان اللاحقة. أما رولاند، الذي بدأ العمل في الكتاب كمدقق، أصبح تدريجياً مؤلفاً مشاركاً به.
es_es: Desde entonces, hemos publicado 5 ediciones del libro en francés, uno para cada versión posterior de Debian. Roland, quien inicialmente trabajó en el libro como corrector, poco a poco se convirtió en su co-autor.
fr_fr: Nous avons depuis publié cinq nouvelles éditions du livre français, une pour chaque version de Debian parue. Roland, qui a commencé comme relecteur technique, est progressivement devenu co-auteur à part entière.
ja_jp: それ以来我々は Debian がリリースされるたびに、このフランス語の本の別の版を 5 つ発行しました。Roland さんは初め校正者として本の発行に参加しましたが、徐々に共同執筆することになりました。
pt_br: Desde então, lançamos 5 outras edições do livro francês, um para cada nova versão do Debian. Roland, que começou a trabalhar no livro como um revisor, se tornou gradativamente seu co-autor.
zh_cn: 从那以后，我们又发行了这本法语书的其它五个版本，针对其后的每一个 Debian 版本。Roland，刚开始是校对者，后来慢慢地变成了共同执笔人。

source: While we were obviously satisfied with the book's success, we always hoped that Eyrolles would convince an international editor to translate it into English. We had received numerous comments explaining how the book helped people to get started with Debian, and we were keen to have the book benefit more people in the same way.
ar_ma: رغم أننا كنا راضين عن نجاح الكتاب بشكل واضح، إلا أننا أملنا لفترة طويلة أن تقنع Eyrolles إحدى دور النشر الدولية بترجمته إلى الإنكليزية. تلقينا العديد من التعليقات التي تخبرنا كيف ساعد كتابنا الناس على بدء العمل مع دبيان، وكنا نتوق لإفادة المزيد من الأشخاص بنفس الشكل.
el_gr: Μολονότι είμασταν φανερά ικανοποιημένοι με την επιτυχία του βιβλίου, ελπίζαμε οτι η Eyrolles(βιβλιοθήκη μεταφράσεων) θα ετοίμαζε ένα διεθνή μεταφραστικό επεξεργαστή στα Αγγλικά. Λάβαμε πολυάριθμα σχόλια που εξηγούσαν το πώς το βιβλίο βοήθησε πολύ κόσμο να ξεκινήσει με το Debian και μας κίνησε το ενδιαφέρον το βιβλίο να ωφελήσει ακόμα πιο πολλούς παρομοίως.
es_es: Si bien estábamos satisfechos, obviamente, con el éxito del libro siempre esperamos que Eyrolles convenciera a un editor internacional para que realizara la traducción al inglés. Hemos recibido numerosos comentarios que explican cómo el libro ayudó a gente a empezar con Debian y estábamos interesados en ayudar a más personas de la misma manera.
fr_fr: Bien que très satisfaits du succès du livre, nous avons longtemps espéré qu'Eyrolles arriverait à convaincre un éditeur international d'en publier une traduction anglaise ; nous avons reçu de nombreux commentaires décrivant comment le livre avait permis à de nombreuses personnes d'aborder Debian et nous étions impatients de le voir servir à d'autres encore.
it_it: Mentre eravamo ovviamente soddisfatti del successo del libro, speravamo che Eyrolles riuscisse a convincere un editore internazionale a tradurlo in inglese. Avevamo ricevuto molte segnalazioni di come il libro avesse aiutato molte persone ad iniziare con Debian ed eravamo desiderosi di far sì che il libro potesse aiutare nello stesso modo molte altre persone.
ja_jp: この本の成功に満足していた一方で、我々は常に Eyrolles に対して国際的な編集者がこの本を英語に翻訳するよう説得してくれることを望んでいました。我々の元には、人々が Debian を始める際にこの本をどのようにして役立てるかを説明するコメントが数多く届けられ、我々はこの本がより多くの人の利益になればと思っています。
pl_pl: Podczas, gdy my byliśmy oczywiście usatysfakcjonowani z sukcesu książki, zawsze mieliśmy nadzieję, że Eyrolles przekona międzynarodowego wydawcę do przetłumaczenia jej na angielski. Otrzymaliśmy wiele komentarzy opisujących, jak książka pomogła ludziom zacząć korzystanie z Debiana i zależało nam, aby w ten sam sposób skorzystało z niej jeszcze więcej osób.
pt_br: Enquanto nós obviamente estávamos satisfeitos com o sucesso do livro, sempre esperávamos que a Eyrolles convenceria uma editora internacional a traduzi-lo para o inglês. Recebemos muitos comentários explicando como o livro ajudou as pessoas a começar a usar o Debian, e estávamos interessados em ter o livro beneficiando mais pessoas da mesma maneira.
zh_cn: 我们很显然对本书的成功感到满意，所以也经常希望 Eyrolles 能说服一个国际编辑把它翻译成英文。我们收到海量的评论说本书如何帮助他们开始使用 Debian，所以我们也热衷于让本书以同样的方式造福更多的人。

source: Alas, no English-speaking editor that we contacted was willing to take the risk of translating and publishing the book. Not put off by this small setback, we negotiated with our French editor Eyrolles and got back the necessary rights to translate the book into English and publish it ourselves. Thanks to a successful crowdfunding campaign, we worked on the translation between December 2011 and May 2012. The “Debian Administrator's Handbook” was born and it was published under a free-software license!
ar_ma: للأسف، لم يبدي أي ناشر من الناطقين بالإنكليزية الذين تواصلنا معهم استعداده لقبول مخاطرة ترجمة ونشر الكتاب. رفضنا التراجع أمام هذه النكسة الصغيرة، وقررنا مفاوضة ناشرنا الفرنسي Eyrolles لاستعادة الحقوق اللازمة لترجمة الكتاب للغة الإنكليزية ونشره بأنفسنا. وبفضل حملة تمويل جماهيري ناجحة، عملنا على ترجمة الكتاب بين ديسمبر 2011 ومايو 2012. ولد ”Debian Administrator's Handbook“ ونشرناه تحت رخصة برمجيات حرة!
es_es: Por desgracia, no conseguimos contactar con ningún editor de habla inglesa que estuviera dispuesto a correr el riesgo de traducir y publicar el libro. No nos dejamos intimidar por este pequeño contratiempo y negociamos con nuestro editor francés, Eyrolles y recuperamos los derechos necesarios para traducir el libro al inglés y publicarlo nosotros mismos. Gracias a una campaña de financiación colectiva («crowdfunding»), trabajamos en la traducción desde Diciembre de 2011 y Mayo de 2012. ¡Así nació el «Libro del administrador de Debian» y fue publicado bajo una licencia de software libre!
fr_fr: Hélas, parmi tous les éditeurs anglophones que nous avons contactés, aucun n'était prêt à prendre le risque de traduire et publier le livre. Mais nous ne nous sommes pas démontés : nous avons négocié avec Eyrolles la rétrocession des droits nécessaires à une traduction en anglais et la possibilité de publier nous-même le résultat. Grâce à une campagne de financement participative fructueuse, nous avons pu travailler à la traduction de décembre 2011 jusqu'à mai 2012. C'est ainsi que le <foreignphrase>Debian Administrator's Handbook</foreignphrase> est venu au monde et a été publié sous une licence libre !
ja_jp: 悲しいことに我々が連絡を取った英語圏の編集者には、この本を翻訳して出版するという危険を冒すことに前向きな人はいませんでした。この小さな逆風に意欲を削がれることなく、我々はフランスの出版社 Eyrolles と交渉し、この本を英語に翻訳し自分たちの手で出版する権利を取り戻しました。クラウドファンディングキャンペーンが成功したおかげで、我々は 2011 年 12 月から 2012 年 5 月まで翻訳作業を行いました。そして「Debian 管理者ハンドブック」は生まれ、フリーソフトウェアライセンスの下で出版されたのです!
pt_br: Infelizmente, nenhuma editora de língua inglesa que nós contatamos estava disposta a correr o risco de traduzir e publicar o livro. Não nos intimidamos com este pequeno contratempo, e decidimos negociar com o nosso editor francês Eyrolles para recuperar os direitos necessários para traduzir o livro em Inglês e publicá-lo nós mesmos. Graças a uma campanha de financiamento colaborativo bem sucedida, trabalhamos na tradução entre dezembro de 2011 e maio de 2012. O "Manual de Administração do Debian" nasceu e foi publicado sob uma licença de software livre!

source: While this was an important milestone, we already knew that the story would be not be over for us until we could contribute the French book as an official translation of the English book. This was not possible at that time because the French book was still distributed commercially under a non-free license by Eyrolles.
ar_ma: مع أن هذه كانت مرحلة مفصلية هامة، إلا أننا أدركنا أن قصتنا لن تنتهي قبل أن نتبرع بالكتاب الفرنسي كترجمة رسمية للكتاب الإنكليزي. لم يكن هذا ممكناً ذلك الوقت لأن Eyrolles كانت لا تزال توزع الكتاب الفرنسي تجارياً برخصة غير حرة.
es_es: Si bien este fue un avance importante, ya sabíamos que nuestra historia no acabaría hasta que contribuyéramos el libro en francés como una traducción oficial del libro en inglés. Esto no fue posible originalmente porque Eyrolles todavía distribuía comercialmente el libro en francés bajo una licencia privativa.
fr_fr: Même si c'était là une étape importante, nous savions déjà que l'histoire ne serait pas terminée avant que le livre français soit considéré comme une traduction officielle du livre anglais. Ce n'était pas possible à l'époque parce qu'il était encore exploité commercialement par Eyrolles sous une licence non libre.
ja_jp: これは重要な節目であった一方で、英語版の公式翻訳としてフランス語版が提供されるまで、話が終わらないことも理解していました。当時フランス語版は Eyrolles から非フリーライセンスで市販されていたため、これを行うことは不可能でした。
pt_br: Mesmo vencida esta importante etapa, sabíamos que a história só terminaria depois que o livro em francês fosse considerado uma tradução oficial do livro em Inglês. Isso não era possível na época porque o livro em francês ainda era distribuído comercialmente sob uma licença não-livre pela Eyrolles.

source: In 2013, the release of Debian 7 gave us a good opportunity to discuss a new contract with Eyrolles. We convinced them that a license more in line with the Debian values would contribute to the book's success. That wasn't an easy deal to make, and we agreed to setup another crowdfunding campaign to cover some of the costs and reduce the risks involved. The operation was again a huge success and in July 2013, we added a French translation to the Debian Administrator's Handbook.
ar_ma: في 2013، منحنا إصدار دبيان 7 فرصة جيدة لمناقشة عقد جديد مع Eyrolles. أقنعناهم أن استخدام رخصة أكثر توافقاً مع قيم دبيان سيساهم في زيادة نجاح الكتاب. لم تكن تلك الصفقة سهلة، وقد وافقنا على إعداد حملة تمويل جماهيري أخرى لتغطية بعض التكاليف وتخفيض مخاطر العملية. كانت العملية ناجحة بشكل كبير مرة ثانية، وفي يوليو 2013 أضفنا الترجمة الفرنسية إلى Debian Administrator's Handbook.
es_es: En 2013, la publicación de Debian 7 nos proveyó una buena oportunidad para discutir un nuevo contrato con Eyrolles. Los convencimos que una licencia más acorde con los valores de Debian ayudaría al éxito del libro. No fue una negociación sencilla y acordamos organizar una nueva campaña de financiación colectiva para cubrir algunos de los gastos y reducir los riesgos involucrados. Dicha operación, nuevamente, fue un gran éxito y agregamos la traducción al francés del «Libro del administrador de Debian» en Julio de 2013.
fr_fr: En 2013, la sortie de Debian 7 nous a offert une bonne opportunité de discuter un nouveau contrat avec Eyrolles. Nous les avons convaincus qu'une licence plus en accord avec les valeurs de Debian contribuerait au succès du livre. Cette décision n'a pas été facile à prendre et nous nous sommes mis d'accord sur la mise en place d'une nouvelle campagne de financement participatif pour couvrir une partie des frais et ainsi limiter les risques pris. L'opération a de nouveau été un énorme succès et, en juillet 2013, nous avons ajouté une traduction française au <foreignphrase>Debian Administrator's Handbook</foreignphrase>.
ja_jp: 2013 年、Debian 7 がリリースされたことで、Eyrolles と新しい契約について話し合う良い機会を得ました。我々は Debian の価値に適するライセンスがこの本の成功に貢献するということを Eyrolles に納得させました。これは簡単にまとまる取引ではありませんでしたが、我々は費用の一部を負担して関連するリスクを減らすために別のクラウドファンディングキャンペーンを行うことに同意を取り付けました。これもまた大きな成功を収め、2013 年 7 月、我々は Debian 管理者ハンドブックのフランス語の翻訳を公開しました。
pt_br: Em 2013, o lançamento do Debian 7 nos deu uma boa oportunidade para discutir um novo contrato com a Eyrolles. Nós os convencemos de que uma licença mais alinhada com os valores do Debian poderia contribuir para o sucesso do livro. Isso não foi algo fácil de fazer, e nós concordamos em fazer outra campanha de financiamento colaborativo para cobrir alguns dos custos e reduzir os riscos envolvidos. A operação foi novamente um grande sucesso e em julho de 2013 adicionamos uma tradução francesa ao Manual do Administrador do Debian.

source: The Birth of the English Book
ar_ma: ولادة الكتاب الإنكليزي
es_es: Nacimiento del libro en inglés
fr_fr: La genèse du livre anglais
ja_jp: 英語版の誕生
pt_br: O nascimento do livro em inglês

source: We are back in 2011 and we just got the required rights to make an English translation of our French book. We are looking into ways to make this happen.
ar_ma: نحن في 2011 وقد حصلنا للتو على حقوق ترجمة الكتاب الفرنسي للإنكليزية. كنا نبحث عن وسيلة تسمح لنا بتحقيق ذلك.
es_es: Volvemos a 2011, cuando acabábamos de obtener los derechos necesarios para traducir al inglés nuestro libro en francés. Estamos investigando formas de lograrlo.
fr_fr: Retour en 2011. Nous venons juste d'obtenir les droits nécessaires à la réalisation d'une traduction anglaise de notre livre français. Nous recherchons des solutions pour concrétiser ce projet.
ja_jp: 2011 年、我々はフランス語版の英語翻訳を作る権利を得ただけでした。それでは今からどのようにしてこうなったかを見ていきましょう。
pt_br: Estamos de volta em 2011 e só temos os direitos necessários para fazer uma tradução em Inglês do nosso livro em francês. Estamos procurando maneiras de fazer isso acontecer.

source: Translating a book of 450 pages is a considerable effort that requires several months of work. Self-employed people like us had to ensure a minimum income to mobilize the time necessary to complete the project. So we set up a crowdfunding campaign on Ulule and asked people to pledge money towards the project. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
ar_ma: ترجمة كتاب من 450 صفحة هو جهد كبير يتطلب عدة أشهر من العمل. بالنسبة لشخصين يعملان لحسابهما الخاص مثلنا، لا بد من تأمين الحد اﻷدنى من الدخل لتغطية الوقت المطلوب لإكمال المشروع. لهذا أطلقنا حملة تمويل جماهيري على موقع Ulule وطلبنا من الناس التعهد بتقديم المال لإكمال المشروع. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
es_es: Traducir un libro de 450 páginas supone un esfuerzo considerable que requiere varios meses de trabajo. Trabajadores autónomos como nosotros tuvimos que garantizar unos ingresos mínimos para poder disponer del tiempo necesario para completar el proyecto. Así que pusimos en marcha una campaña de financiación pública en Ulule y pedimos a la gente que contribuyera al proyecto comprometiéndose economicamente. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
fr_fr: La traduction d'un ouvrage de 450 pages est un effort considérable, qui représente plusieurs mois de travail. Roland et moi, étant consultants indépendants, avions donc besoin d'assurer un revenu minimum avant d'engager le temps nécessaire à ce projet. Nous avons donc mis en place une campagne sur Ulule et avons demandé aux lecteurs de contribuer au financement collaboratif du projet. <ulink type="block" url="http://fr.ulule.com/debian-handbook/" />
ja_jp: 450 ページの本を翻訳するには数カ月に渡る相当な努力が必要です。我々のようなフリーラーンスがこのプロジェクトの完遂に時間を使うには最低限の収入を保証されなければいけない。そのため我々は Ulule でクラウドファンディングキャンペーンを開始し、人々からこのプロジェクトに関する寄付の協力を求めました。<ulink type="block" url="http://www.ulule.com/debian-handbook/" />
pt_br: Traduzir um livro de 450 páginas é um esforço considerável que requer vários meses de trabalho. Trabalhadores autônomos como nós têm que garantir uma renda mínima para mobilizar o tempo necessário para completar o projeto. Assim, montamos uma campanha de financiamento coletivo no Ulule e pedimos às pessoas o dinheiro para o projeto. <ulink type="block" url="http://www.ulule.com/debian-handbook/"/>
zh_cn: 翻译一本450页的书的工作量是可观的，需要好几个月。我们这样的自由职业者必须确保有一定的收入，才能有时间腾出来去完成翻译工作。所以我们在 Ulule 网站发起了大集市式的活动，并且要求大家捐助这个项目。<ulink type="block" url="http://www.ulule.com/debian-handbook/" />

source: The campaign had two goals: raising €15,000 for the translation and completing a €25,000 liberation fund to get the resulting book published under a free license — that is, a license that fully follows the Debian Free Software Guidelines.
ar_ma: كان للحملة هدفين: جمع 15,000€ للترجمة وإكمال مبلغ تحرير قدره 25,000€ من أجل نشر الكتاب الناتج وفق رخصة حرة — أي رخصة تتبع توصيات دبيان للبرمجيات الحرة تماماً.
el_gr: Η εκστρατεία είχε δύο στόχους: να ξεκινήσει με €15,000 για την μετάφραση και να ολοκληρωθεί με €25,000 ποσό "απελευθέρωσης" για να μπορέσει το βιβλίο να δημοσιευτεί κάτω απο ελεύθερη άδεια - η οποία άδεια ειναι πλήρως η Debian κατευθυντήρια γραμμή πλεύσης.
es_es: La campaña tenía dos objetivos: alcanzar la cifra de 15.000 € para poder realizar la traducción y llegar a disponer de un fondo para la liberación del libro de 25.000 € que hiciera que el mismo sea publicado bajo una licencia libre — es decir, una licencia que sigue fielmente las Directrices de software libre de Debian («Debian Free Software Guidelines»).
fr_fr: La campagne de financement avait deux objectifs : le premier (15 000 € collectés) visait à financer la traduction elle-même. Si des fonds supplémentaires étaient collectés, ils alimentaient une cagnotte séparée ; si cette cagnotte atteignait 25 000 €, le résultat serait sous une licence libre — c'est-à-dire une licence compatible avec les principes du logiciel libre selon Debian.
it_it: La campagna aveva 2 obiettivi: raccogliere 15.000 € per la traduzione e destinare un fondo di 25.000 € per ottenere completa proprietà del testo, così da permetterci di pubblicarlo sotto una licenza libera, cioè una licenza che segue pienamente le linee guida Debian per il software libero.
ja_jp: このキャンペーンには 2 つの目標が設定されました: 翻訳用に €15,000 の資金調達、さらに、本をフリーライセンス (Debian フリーソフトウェアガイドラインに完全に従うライセンス) で出版できるようにするための解放基金用に €25,000 の資金調達です。
pl_pl: Kampania miała dwa cele: zebranie €15 000 na tłumaczenie oraz wypełnienie "funduszy wyzwolenia" do €25 000, aby wydać powstałą książkę na otwartej licencji - licencji, która spełnia Wytyczne Debiana dotyczące Wolnego Oprogramowania.
pt_br: A campanha teve dois objetivos: alcançar €15.000 para a tradução e completar um fundo de €25.000 para liberar o livro publicado sob uma licença livre - ou seja, uma licença que segue totalmente as Diretrizes de Software Livre do Debian (DFSG).
zh_cn: 这个活动有两个目标：为翻译集资15000欧元，并用25000欧元的“解放基金”使得翻译的成书能在一种自由的许可证下发布——一种完全遵循 Debian 自由软件指引的许可证发布。

source: When the Ulule campaign ended, the first goal had been achieved with €24,345 raised. The liberation fund was not complete however, with only €14,935 raised. As initially announced, the liberation campaign continued independently from Ulule on the book's official website.
ar_ma: تحقق الهدف اﻷول بجمع 24,345€ بنهاية حملة Ulule. أما مبلغ التحرير فلم يكتمل على أي حال، فما جمعه كان €14,935. استمرت حملة التحرير بشكل مستقل عن Ulule على موقع الكتاب الرسمي، كما أعلنا بادئ اﻷمر.
el_gr: Όταν η εκστρατεία στο Ulule τελείωσε, ο πρώτος στόχος είχε επιτελεστεί με ύψος €24,345. Το ποσό απελευθέρωσης δεν ολοκληρώθηκε με μόνο ποσό ύψους €14,935. Ενώ αρχικά ανακοινώθηκε, η εκστρατεία "απελευθέρωσης" συνεχίστηκε ανεξαρτήτως του Ulule στην επίσημη σελίδα του βιβλίου.
es_es: Cuando terminó la campaña en Ulule, se había logrado alcanzar el primer objetivo con 24.345 €. Sin embargo, no se completó el fondo para la liberación del libro, recaudando sólo 14.395 €. Tal y como se anunció inicialmente, la campaña para la liberación del libro continuó en el sitio oficial del libro independientemente de Ulule.
fr_fr: À la fin de la campagne de financement Ulule, le premier objectif avait été atteint, avec 24 345 € collectés. En revanche, le deuxième n'a pas été complètement atteint, puisque seuls 14 935 € ont été versés au fonds de libération. Comme prévu, la campagne de libération a continué sur le site du livre, même après la fin de la campagne Ulule.
it_it: Terminata la campagna di Ulule, il primo obiettivo si concluse con la raccolta di 24.345 €. Mentre non fu possibile completare il fondo per la pubblicazione libera in quanto vennero raccolti solo 14.935 €, come annunciato inizialmente la campagna per la pubblicazione libera proseguì sul sito ufficiale del libro.
ja_jp: Ulule でのキャンペーンが終了したとき、1 つ目の目標は €24,345 の資金を集めて達成されていました。しかし、解放基金の集めた資金はほんの €14,935 でありまだ達成されていませんでした。当初の発表通り、解放基金のキャンペーンは Ulule から離れこの本の公式ウェブサイト上で続けられました。
pl_pl: Kiedy kampania na Ulule zakończyła się, osiągnęliśmy pierwszy cel z kwotą €24 345. Jednakże nie udało się wypełnić "funduszy wyzwolenia", gdyż zebraliśmy jedynie €14 935. Zgodnie ze wstępną zapowiedzią, kampania "wyzwolenia" była kontynuowana niezależnie od Ulule na oficjalnej witrynie książki.
pt_br: Quando a campanha no Ulule terminou, o primeiro objetivo foi alcançado com €24.345 levantado. O fundo de liberação não foi completo, no entanto, com apenas €14.935 levantado. Como anunciado inicialmente, a campanha de liberação continuou independentemente do Ulule no portal oficial do livro.
zh_cn: 当在 Ulule 的活动结束时，第一个目标已经达成，以24345欧元告终。而解放基金没有完成，只收到了14935欧元。按照最初宣布的那样，解放活动在本书的官方网站独立于 Ulule 继续进行。
