Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: So thank you Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, and Yazid Cassam Sulliman.
ar_ma: نشكر إذن Alain Coron و Alain Thabaud و Alan Milnes و Alastair Sherringham و Alban Dumerain و Alessio Spadaro و Alex King و Alexandre Dupas و Ambrose Andrews و Andre Klärner و Andreas Olsson و Andrej Ricnik و Andrew Alderwick و Anselm Lingnau و Antoine Emerit و Armin F. Gnosa و Avétis Kazarian و Bdale Garbee و Benoit Barthelet و Bernard Zijlstra و Carles Guadall Blancafort و Carlos Horowicz — Planisys S.A. و Charles Brisset و Charlie Orford و Chris Sykes و Christian Bayle و Christian Leutloff و Christian Maier و Christian Perrier و Christophe Drevet و Christophe Schockaert (R3vLibre) و Christopher Allan Webber و Colin Ameigh و Damien Dubédat و Dan Pettersson و Dave Lozier و David Bercot و David James و David Schmitt و David Tran Quang Ty و Elizabeth Young و Fabian Rodriguez و Ferenc Kiraly و Frédéric Perrenot — Intelligence Service 001 و Fumihito Yoshida و Gian-Maria Daffré و Gilles Meier و Giorgio Cittadini و Héctor Orón Martínez و Henry و Herbert Kaminski و Hideki Yamane و Hoffmann Information Services GmbH و Holger Burkhardt و Horia Ardelean و Ivo Ugrina و Jan Dittberner و Jim Salter و Johannes Obermüller و Jonas Bofjäll و Jordi Fernandez Moledo و Jorg Willekens و Joshua و Kastrolis Imanta و Keisuke Nakao و Kévin Audebrand و Korbinian Preisler و Kristian Tizzard و Laurent Bruguière و Laurent Hamel و Leurent Sylvain و Loïc Revest و Luca Scarabello و Lukas Bai و Marc Singer و Marcelo Nicolas Manso و Marilyne et Thomas و Mark Janssen — Sig-I/O Automatisering و Mark Sheppard و Mark Symonds و Mathias Bocquet و Matteo Fulgheri و Michael Schaffner و Michele Baldessari و Mike Chaberski و Mike Linksvayer و Minh Ha Duong و Moreau Frédéric و Morphium و Nathael Pajani و Nathan Paul Simons و Nicholas Davidson و Nicola Chiapolini و Ole-Morten و Olivier Mondoloni و Paolo Innocenti و Pascal Cuoq و Patrick Camelin و Per Carlson و Philip Bolting و Philippe Gauthier و Philippe Teuwen و PJ King و Praveen Arimbrathodiyil (j4v4m4n)‎ و Ralf Zimmermann و Ray McCarthy و Rich و Rikard Westman و Robert Kosch و Sander Scheepens و Sébastien Picard و Stappers و Stavros Giannouris و Steve-David Marguet و T. Gerigk و Tanguy Ortolo و Thomas Hochstein و Thomas Müller و Thomas Pierson و Tigran Zakoyan و Tobias Gruetzmacher و Tournier Simon و Trans-IP Internet Services و Viktor Ekmark و Vincent Demeester و Vincent van Adrighem و Volker Schlecht و Werner Kuballa و Xavier Neys و Yazid Cassam Sulliman.
el_gr: Έτσι σας ευχαριστώ Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, and Yazid Cassam Sulliman.
es_es: Así que gracias a Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, y a Yazid Cassam Sulliman.
fr_fr: Merci donc à Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys et Yazid Cassam Sulliman.
it_it: Quindi grazie a: Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne e Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys e Yazid Cassam Sulliman.
ja_jp: Alain Coron さん、Alain Thabaud さん、Alan Milnes さん、Alastair Sherringham さん、Alban Dumerain さん、Alessio Spadaro さん、Alex King さん、Alexandre Dupas さん、Ambrose Andrews さん、Andre Klärner さん、Andreas Olsson さん、Andrej Ricnik さん、Andrew Alderwick さん、Anselm Lingnau さん、Antoine Emerit さん、Armin F. Gnosa さん、Avétis Kazarian さん、Bdale Garbee さん、Benoit Barthelet さん、Bernard Zijlstra さん、Carles Guadall Blancafort さん、Carlos Horowicz — Planisys S.A. さん、Charles Brisset さん、Charlie Orford さん、Chris Sykes さん、Christian Bayle さん、Christian Leutloff さん、Christian Maier さん、Christian Perrier さん、Christophe Drevet さん、Christophe Schockaert (R3vLibre) さん、Christopher Allan Webber さん、Colin Ameigh さん、Damien Dubédat さん、Dan Pettersson さん、Dave Lozier さん、David Bercot さん、David James さん、David Schmitt さん、David Tran Quang Ty さん、Elizabeth Young さん、Fabian Rodriguez さん、Ferenc Kiraly さん、Frédéric Perrenot — Intelligence Service 001 さん、Fumihito Yoshida さん、Gian-Maria Daffré さん、Gilles Meier さん、Giorgio Cittadini さん、Héctor Orón Martínez さん、Henry さん、Herbert Kaminski さん、Hideki Yamane さん、Hoffmann Information Services GmbH さん、Holger Burkhardt さん、Horia Ardelean さん、Ivo Ugrina さん、Jan Dittberner さん、Jim Salter さん、Johannes Obermüller さん、Jonas Bofjäll さん、Jordi Fernandez Moledo さん、Jorg Willekens さん、Joshua さん、Kastrolis Imanta さん、Keisuke Nakao さん、Kévin Audebrand さん、Korbinian Preisler さん、Kristian Tizzard さん、Laurent Bruguière さん、Laurent Hamel さん、Leurent Sylvain さん、Loïc Revest さん、Luca Scarabello さん、Lukas Bai さん、Marc Singer さん、Marcelo Nicolas Manso さん、Marilyne et Thomas さん、Mark Janssen — Sig-I/O Automatisering さん、Mark Sheppard さん、Mark Symonds さん、Mathias Bocquet さん、Matteo Fulgheri さん、Michael Schaffner さん、Michele Baldessari さん、Mike Chaberski さん、Mike Linksvayer さん、Minh Ha Duong さん、Moreau Frédéric さん、Morphium さん、Nathael Pajani さん、Nathan Paul Simons さん、Nicholas Davidson さん、Nicola Chiapolini さん、Ole-Morten さん、Olivier Mondoloni さん、Paolo Innocenti さん、Pascal Cuoq さん、Patrick Camelin さん、Per Carlson さん、Philip Bolting さん、Philippe Gauthier さん、Philippe Teuwen さん、PJ King さん、Praveen Arimbrathodiyil (j4v4m4n) さん、Ralf Zimmermann さん、Ray McCarthy さん、Rich さん、Rikard Westman さん、Robert Kosch さん、Sander Scheepens さん、Sébastien Picard さん、Stappers さん、Stavros Giannouris さん、Steve-David Marguet さん、T. Gerigk さん、Tanguy Ortolo さん、Thomas Hochstein さん、Thomas Müller さん、Thomas Pierson さん、Tigran Zakoyan さん、Tobias Gruetzmacher さん、Tournier Simon さん、Trans-IP Internet Services さん、Viktor Ekmark さん、Vincent Demeester さん、Vincent van Adrighem さん、Volker Schlecht さん、Werner Kuballa さん、Xavier Neys さん、Yazid Cassam Sulliman さん、皆様に感謝します。
pl_pl: Więc, dziękujemy wam Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys i Yazid Cassam Sulliman.
pt_br: Então obrigado a: Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys e Yazid Cassam Sulliman.
zh_cn: 所以，感谢你们：Alain Coron，Alain Thabaud，Alan Milnes，Alastair Sherringham，Alban Dumerain，Alessio Spadaro，Alex King，Alexandre Dupas，Ambrose Andrews，Andre Klärner，Andreas Olsson，Andrej Ricnik，Andrew Alderwick，Anselm Lingnau，Antoine Emerit，Armin F. Gnosa，Avétis Kazarian，Bdale Garbee，Benoit Barthelet，Bernard Zijlstra，Carles Guadall Blancafort，Carlos Horowicz — Planisys S.A.，Charles Brisset，Charlie Orford，Chris Sykes，Christian Bayle，Christian Leutloff，Christian Maier，Christian Perrier，Christophe Drevet，Christophe Schockaert (R3vLibre)，Christopher Allan Webber，Colin Ameigh，Damien Dubédat，Dan Pettersson，Dave Lozier，David Bercot，David James，David Schmitt，David Tran Quang Ty，Elizabeth Young，Fabian Rodriguez，Ferenc Kiraly，Frédéric Perrenot — Intelligence Service 001，Fumihito Yoshida，Gian-Maria Daffré，Gilles Meier，Giorgio Cittadini，Héctor Orón Martínez，Henry，Herbert Kaminski，Hideki Yamane，Hoffmann Information Services GmbH，Holger Burkhardt，Horia Ardelean，Ivo Ugrina，Jan Dittberner，Jim Salter，Johannes Obermüller，Jonas Bofjäll，Jordi Fernandez Moledo，Jorg Willekens，Joshua，Kastrolis Imanta，Keisuke Nakao，Kévin Audebrand，Korbinian Preisler，Kristian Tizzard，Laurent Bruguière，Laurent Hamel，Leurent Sylvain，Loïc Revest，Luca Scarabello，Lukas Bai，Marc Singer，Marcelo Nicolas Manso，Marilyne et Thomas，Mark Janssen — Sig-I/O Automatisering，Mark Sheppard，Mark Symonds，Mathias Bocquet，Matteo Fulgheri，Michael Schaffner，Michele Baldessari，Mike Chaberski，Mike Linksvayer，Minh Ha Duong，Moreau Frédéric，Morphium，Nathael Pajani，Nathan Paul Simons，Nicholas Davidson，Nicola Chiapolini，Ole-Morten，Olivier Mondoloni，Paolo Innocenti，Pascal Cuoq，Patrick Camelin，Per Carlson，Philip Bolting，Philippe Gauthier，Philippe Teuwen，PJ King，Praveen Arimbrathodiyil (j4v4m4n)，Ralf Zimmermann，Ray McCarthy，Rich，Rikard Westman，Robert Kosch，Sander Scheepens，Sébastien Picard，Stappers，Stavros Giannouris，Steve-David Marguet，T. Gerigk，Tanguy Ortolo，Thomas Hochstein，Thomas Müller，Thomas Pierson，Tigran Zakoyan，Tobias Gruetzmacher，Tournier Simon，Trans-IP Internet Services，Viktor Ekmark，Vincent Demeester，Vincent van Adrighem，Volker Schlecht，Werner Kuballa，Xavier Neys 和 Yazid Cassam Sulliman。

source: The Liberation of the French Book
ar_ma: تحرير الكتاب الفرنسي
es_es: Liberación del libro en francés
fr_fr: La libération du livre français
ja_jp: フランス語版の解放
pt_br: A liberação do livro em francês
