Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: Special thanks to those who opted to give 25€ more than the value of their reward. Your faith in this project is highly appreciated. Thank you Adrien Guionie, Adrien Ollier, Adrien Roger, Agileo Automation, Alban Duval, Alex Viala, Alexandre Dupas, Alexandre Roman, Alexis Bienvenüe, Anthony Renoux, Aurélien Beaujean, Baptiste Darthenay, Basile Deplante, Benjamin Cama, Benjamin Guillaume, Benoit Duchene, Benoît Sibaud, Bornet, Brett Ellis, Brice Sevat, Bruno Le Goff, Bruno Marmier, Cédric Briner, Cédric Charlet, Cédrik Bernard, Celia Redondo, Cengiz Ünlü, Charles Flèche, Christian Bayle, Christophe Antoine, Christophe Bliard, Christophe Carré, Christophe De Saint Leger, Christophe Perrot, Christophe Robert, Christophe Schockaert, Damien Escoffier, David Dellier, David Trolle, Davy Hubert, Decio Valeri, Denis Marcq, Denis Soriano, Didier Hénaux, Dirk Linnerkamp, Edouard Postel, Eric Coquard, Eric Lemesre, Eric Parthuisot, Eric Vernichon, Érik Le Blanc, Fabian Culot, Fabien Givors, Florent Bories, Florent Machen, Florestan Fournier, Florian Dumas, François Ducrocq, Francois Lepoittevin, François-Régis Vuillemin, Frédéric Boiteux, Frédéric Guélen, Frédéric Keigler, Frédéric Lietart, Gabriel Moreau, Gian-Maria Daffré, Grégory Lèche, Grégory Valentin, Guillaume Boulaton, Guillaume Chevillot, Guillaume Delvit, Guillaume Michon, Hervé Guimbretiere, Iván Alemán, Jacques Bompas, Jannine Koch, Jean-Baptiste Roulier, Jean-Christophe Becquet, Jean-François Bilger, Jean-Michel Grare, Jean-Sébastien Lebacq, Jérôme Ballot, Jerome Pellois, Johan Roussel, Jonathan Gallon, Joris Dedieu, Julien Gilles, Julien Groselle, Kevin Messer, Laurent Espitallier, Laurent Fuentes, Le Goût Du Libre, Ludovic Poux, Marc Gasnot, Marc Verprat, Marc-Henri Primault, Martin Bourdoiseau, Mathieu Chapounet, Mathieu Emering, Matthieu Joly, Melvyn Leroy, Michel Casabona, Michel Kapel, Mickael Tonneau, Mikaël Marcaud, Nicolas Bertaina, Nicolas Bonnet, Nicolas Dandrimont, Nicolas Dick, Nicolas Hicher, Nicolas Karolak, Nicolas Schont, Olivier Gosset, Olivier Langella, Patrick Francelle, Patrick Nomblot, Philippe Gaillard, Philippe Le Naour, Philippe Martin, Philippe Moniez, Philippe Teuwen, Pierre Brun, Pierre Gambarotto, Pierre-Dominique Perrier, Quentin Fait, Raphaël Enrici — Root 42, Rémi Vanicat, Rhydwen Volsik, RyXéo SARL, Samuel Boulier, Sandrine D'hooge, Sébasiten Piguet, Sébastien Bollingh, Sébastien Kalt, Sébastien Lardière, Sébastien Poher, Sébastien Prosper, Sébastien Raison, Simon Folco, Société Téïcée, Stéphane Leibovitsch, Stéphane Paillet, Steve-David Marguet, Sylvain Desveaux, Tamatoa Davio, Thibault Taillandier, Thibaut Girka, Thibaut Poullain, Thierry Jaouen, Thomas Etcheverria, Thomas Vidal, Thomas Vincent, Vincent Avez, Vincent Merlet, Xavier Alt, Xavier Bensemhoun, Xavier Devlamynck, Xavier Guillot, Xavier Jacquelin, Xavier Neys, Yannick Britis, Yannick Guérin, and Yves Martin.
ar_ma: شكر خاص لمن تبرع بأكثر من 25€ من قيمة جائزتهم. نقدر ثقتكم بهذا المشروع كثيراً. شكراً لك Adrien Guionie، ‏Adrien Ollier، ‏Adrien Roger، ‏Agileo Automation، ‏Alban Duval، ‏Alex Viala، ‏Alexandre Dupas، ‏Alexandre Roman، ‏Alexis Bienvenüe، ‏Anthony Renoux، ‏Aurélien Beaujean، ‏Baptiste Darthenay، ‏Basile Deplante، ‏Benjamin Cama، ‏Benjamin Guillaume، ‏Benoit Duchene، ‏Benoît Sibaud، ‏Bornet، ‏Brett Ellis، ‏Brice Sevat، ‏Bruno Le Goff، ‏Bruno Marmier، ‏Cédric Briner، ‏Cédric Charlet، ‏Cédrik Bernard، ‏Celia Redondo، ‏Cengiz Ünlü، ‏Charles Flèche، ‏Christian Bayle، ‏Christophe Antoine، ‏Christophe Bliard، ‏Christophe Carré، ‏Christophe De Saint Leger، ‏Christophe Perrot، ‏Christophe Robert، ‏Christophe Schockaert، ‏Damien Escoffier، ‏David Dellier، ‏David Trolle، ‏Davy Hubert، ‏Decio Valeri، ‏Denis Marcq، ‏Denis Soriano، ‏Didier Hénaux، ‏Dirk Linnerkamp، ‏Edouard Postel، ‏Eric Coquard، ‏Eric Lemesre، ‏Eric Parthuisot، ‏Eric Vernichon، ‏Érik Le Blanc، ‏Fabian Culot، ‏Fabien Givors، ‏Florent Bories، ‏Florent Machen، ‏Florestan Fournier، ‏Florian Dumas، ‏François Ducrocq، ‏Francois Lepoittevin، ‏François-Régis Vuillemin، ‏Frédéric Boiteux، ‏Frédéric Guélen، ‏Frédéric Keigler، ‏Frédéric Lietart، ‏Gabriel Moreau، ‏Gian-Maria Daffré، ‏Grégory Lèche، ‏Grégory Valentin، ‏Guillaume Boulaton، ‏Guillaume Chevillot، ‏Guillaume Delvit، ‏Guillaume Michon، ‏Hervé Guimbretiere، ‏Iván Alemán، ‏Jacques Bompas، ‏Jannine Koch، ‏Jean-Baptiste Roulier، ‏Jean-Christophe Becquet، ‏Jean-François Bilger، ‏Jean-Michel Grare، ‏Jean-Sébastien Lebacq، ‏Jérôme Ballot، ‏Jerome Pellois، ‏Johan Roussel، ‏Jonathan Gallon، ‏Joris Dedieu، ‏Julien Gilles، ‏Julien Groselle، ‏Kevin Messer، ‏Laurent Espitallier، ‏Laurent Fuentes، ‏Le Goût Du Libre، ‏Ludovic Poux، ‏Marc Gasnot، ‏Marc Verprat، ‏Marc-Henri Primault، ‏Martin Bourdoiseau، ‏Mathieu Chapounet، ‏Mathieu Emering، ‏Matthieu Joly، ‏Melvyn Leroy، ‏Michel Casabona، ‏Michel Kapel، ‏Mickael Tonneau، ‏Mikaël Marcaud، ‏Nicolas Bertaina، ‏Nicolas Bonnet، ‏Nicolas Dandrimont، ‏Nicolas Dick، ‏Nicolas Hicher، ‏Nicolas Karolak، ‏Nicolas Schont، ‏Olivier Gosset، ‏Olivier Langella، ‏Patrick Francelle، ‏Patrick Nomblot، ‏Philippe Gaillard، ‏Philippe Le Naour، ‏Philippe Martin، ‏Philippe Moniez، ‏Philippe Teuwen، ‏Pierre Brun، ‏Pierre Gambarotto، ‏Pierre-Dominique Perrier، ‏Quentin Fait، ‏Raphaël Enrici — Root 42، ‏Rémi Vanicat، ‏Rhydwen Volsik، ‏RyXéo SARL، ‏Samuel Boulier، ‏Sandrine D'hooge، ‏Sébasiten Piguet، ‏Sébastien Bollingh، ‏Sébastien Kalt، ‏Sébastien Lardière، ‏Sébastien Poher، ‏Sébastien Prosper، ‏Sébastien Raison، ‏Simon Folco، ‏Société Téïcée، ‏Stéphane Leibovitsch، ‏Stéphane Paillet، ‏Steve-David Marguet، ‏Sylvain Desveaux، ‏Tamatoa Davio، ‏Thibault Taillandier، ‏Thibaut Girka، ‏Thibaut Poullain، ‏Thierry Jaouen، ‏Thomas Etcheverria، ‏Thomas Vidal، ‏Thomas Vincent، ‏Vincent Avez، ‏Vincent Merlet، ‏Xavier Alt، ‏Xavier Bensemhoun، ‏Xavier Devlamynck، ‏Xavier Guillot، ‏Xavier Jacquelin، ‏Xavier Neys، ‏Yannick Britis، ‏Yannick Guérin، ‏وYves Martin.
es_es: Especialmente gracias a aquellos que decidieron dar 25€ más que el valor de su recompensa. Apreciamos enormemente su fe en este proyecto. Gracias Adrien Guionie, Adrien Ollier, Adrien Roger, Agileo Automation, Alban Duval, Alex Viala, Alexandre Dupas, Alexandre Roman, Alexis Bienvenüe, Anthony Renoux, Aurélien Beaujean, Baptiste Darthenay, Basile Deplante, Benjamin Cama, Benjamin Guillaume, Benoit Duchene, Benoît Sibaud, Bornet, Brett Ellis, Brice Sevat, Bruno Le Goff, Bruno Marmier, Cédric Briner, Cédric Charlet, Cédrik Bernard, Celia Redondo, Cengiz Ünlü, Charles Flèche, Christian Bayle, Christophe Antoine, Christophe Bliard, Christophe Carré, Christophe De Saint Leger, Christophe Perrot, Christophe Robert, Christophe Schockaert, Damien Escoffier, David Dellier, David Trolle, Davy Hubert, Decio Valeri, Denis Marcq, Denis Soriano, Didier Hénaux, Dirk Linnerkamp, Edouard Postel, Eric Coquard, Eric Lemesre, Eric Parthuisot, Eric Vernichon, Érik Le Blanc, Fabian Culot, Fabien Givors, Florent Bories, Florent Machen, Florestan Fournier, Florian Dumas, François Ducrocq, Francois Lepoittevin, François-Régis Vuillemin, Frédéric Boiteux, Frédéric Guélen, Frédéric Keigler, Frédéric Lietart, Gabriel Moreau, Gian-Maria Daffré, Grégory Lèche, Grégory Valentin, Guillaume Boulaton, Guillaume Chevillot, Guillaume Delvit, Guillaume Michon, Hervé Guimbretiere, Iván Alemán, Jacques Bompas, Jannine Koch, Jean-Baptiste Roulier, Jean-Christophe Becquet, Jean-François Bilger, Jean-Michel Grare, Jean-Sébastien Lebacq, Jérôme Ballot, Jerome Pellois, Johan Roussel, Jonathan Gallon, Joris Dedieu, Julien Gilles, Julien Groselle, Kevin Messer, Laurent Espitallier, Laurent Fuentes, Le Goût Du Libre, Ludovic Poux, Marc Gasnot, Marc Verprat, Marc-Henri Primault, Martin Bourdoiseau, Mathieu Chapounet, Mathieu Emering, Matthieu Joly, Melvyn Leroy, Michel Casabona, Michel Kapel, Mickael Tonneau, Mikaël Marcaud, Nicolas Bertaina, Nicolas Bonnet, Nicolas Dandrimont, Nicolas Dick, Nicolas Hicher, Nicolas Karolak, Nicolas Schont, Olivier Gosset, Olivier Langella, Patrick Francelle, Patrick Nomblot, Philippe Gaillard, Philippe Le Naour, Philippe Martin, Philippe Moniez, Philippe Teuwen, Pierre Brun, Pierre Gambarotto, Pierre-Dominique Perrier, Quentin Fait, Raphaël Enrici — Root 42, Rémi Vanicat, Rhydwen Volsik, RyXéo SARL, Samuel Boulier, Sandrine D'hooge, Sébasiten Piguet, Sébastien Bollingh, Sébastien Kalt, Sébastien Lardière, Sébastien Poher, Sébastien Prosper, Sébastien Raison, Simon Folco, Société Téïcée, Stéphane Leibovitsch, Stéphane Paillet, Steve-David Marguet, Sylvain Desveaux, Tamatoa Davio, Thibault Taillandier, Thibaut Girka, Thibaut Poullain, Thierry Jaouen, Thomas Etcheverria, Thomas Vidal, Thomas Vincent, Vincent Avez, Vincent Merlet, Xavier Alt, Xavier Bensemhoun, Xavier Devlamynck, Xavier Guillot, Xavier Jacquelin, Xavier Neys, Yannick Britis, Yannick Guérin e Yves Martin.
fr_fr: Nos remerciements particuliers vont à tous ceux qui ont choisi de mettre 25 € de plus que la valeur de leur contrepartie. Votre vote de confiance en ce projet est hautement apprécié. Merci Adrien Guionie, Adrien Ollier, Adrien Roger, Agileo Automation, Alban Duval, Alex Viala, Alexandre Dupas, Alexandre Roman, Alexis Bienvenüe, Anthony Renoux, Aurélien Beaujean, Baptiste Darthenay, Basile Deplante, Benjamin Cama, Benjamin Guillaume, Benoit Duchene, Benoît Sibaud, Bornet, Brett Ellis, Brice Sevat, Bruno Le Goff, Bruno Marmier, Cédric Briner, Cédric Charlet, Cédrik Bernard, Celia Redondo, Cengiz Ünlü, Charles Flèche, Christian Bayle, Christophe Antoine, Christophe Bliard, Christophe Carré, Christophe De Saint Leger, Christophe Perrot, Christophe Robert, Christophe Schockaert, Damien Escoffier, David Dellier, David Trolle, Davy Hubert, Decio Valeri, Denis Marcq, Denis Soriano, Didier Hénaux, Dirk Linnerkamp, Edouard Postel, Eric Coquard, Eric Lemesre, Eric Parthuisot, Eric Vernichon, Érik Le Blanc, Fabian Culot, Fabien Givors, Florent Bories, Florent Machen, Florestan Fournier, Florian Dumas, François Ducrocq, Francois Lepoittevin, François-Régis Vuillemin, Frédéric Boiteux, Frédéric Guélen, Frédéric Keigler, Frédéric Lietart, Gabriel Moreau, Gian-Maria Daffré, Grégory Lèche, Grégory Valentin, Guillaume Boulaton, Guillaume Chevillot, Guillaume Delvit, Guillaume Michon, Hervé Guimbretiere, Iván Alemán, Jacques Bompas, Jannine Koch, Jean-Baptiste Roulier, Jean-Christophe Becquet, Jean-François Bilger, Jean-Michel Grare, Jean-Sébastien Lebacq, Jérôme Ballot, Jerome Pellois, Johan Roussel, Jonathan Gallon, Joris Dedieu, Julien Gilles, Julien Groselle, Kevin Messer, Laurent Espitallier, Laurent Fuentes, Le Goût Du Libre, Ludovic Poux, Marc Gasnot, Marc Verprat, Marc-Henri Primault, Martin Bourdoiseau, Mathieu Chapounet, Mathieu Emering, Matthieu Joly, Melvyn Leroy, Michel Casabona, Michel Kapel, Mickael Tonneau, Mikaël Marcaud, Nicolas Bertaina, Nicolas Bonnet, Nicolas Dandrimont, Nicolas Dick, Nicolas Hicher, Nicolas Karolak, Nicolas Schont, Olivier Gosset, Olivier Langella, Patrick Francelle, Patrick Nomblot, Philippe Gaillard, Philippe Le Naour, Philippe Martin, Philippe Moniez, Philippe Teuwen, Pierre Brun, Pierre Gambarotto, Pierre-Dominique Perrier, Quentin Fait, Raphaël Enrici — Root 42, Rémi Vanicat, Rhydwen Volsik, RyXéo SARL, Samuel Boulier, Sandrine D'hooge, Sébasiten Piguet, Sébastien Bollingh, Sébastien Kalt, Sébastien Lardière, Sébastien Poher, Sébastien Prosper, Sébastien Raison, Simon Folco, Société Téïcée, Stéphane Leibovitsch, Stéphane Paillet, Steve-David Marguet, Sylvain Desveaux, Tamatoa Davio, Thibault Taillandier, Thibaut Girka, Thibaut Poullain, Thierry Jaouen, Thomas Etcheverria, Thomas Vidal, Thomas Vincent, Vincent Avez, Vincent Merlet, Xavier Alt, Xavier Bensemhoun, Xavier Devlamynck, Xavier Guillot, Xavier Jacquelin, Xavier Neys, Yannick Britis, Yannick Guérin et Yves Martin.
ja_jp: 25€ 以上の寄付をしてくださった方々に深く感謝しています。このプロジェクトを信頼してくださったことをとてもうれしく思います。Adrien Guionie さん、Adrien Ollier さん、Adrien Roger さん、Agileo Automation さん、Alban Duval さん、Alex Viala さん、Alexandre Dupas さん、Alexandre Roman さん、Alexis Bienvenüe さん、Anthony Renoux さん、Aurélien Beaujean さん、Baptiste Darthenay さん、Basile Deplante さん、Benjamin Cama さん、Benjamin Guillaume さん、Benoit Duchene さん、Benoît Sibaud さん、Bornet さん、Brett Ellis さん、Brice Sevat さん、Bruno Le Goff さん、Bruno Marmier さん、Cédric Briner さん、Cédric Charlet さん、Cédrik Bernard さん、Celia Redondo さん、Cengiz Ünlü さん、Charles Flèche さん、Christian Bayle さん、Christophe Antoine さん、Christophe Bliard さん、Christophe Carré さん、Christophe De Saint Leger さん、Christophe Perrot さん、Christophe Robert さん、Christophe Schockaert さん、Damien Escoffier さん、David Dellier さん、David Trolle さん、Davy Hubert さん、Decio Valeri さん、Denis Marcq さん、Denis Soriano さん、Didier Hénaux さん、Dirk Linnerkamp さん、Edouard Postel さん、Eric Coquard さん、Eric Lemesre さん、Eric Parthuisot さん、Eric Vernichon さん、Érik Le Blanc さん、Fabian Culot さん、Fabien Givors さん、Florent Bories さん、Florent Machen さん、Florestan Fournier さん、Florian Dumas さん、François Ducrocq さん、Francois Lepoittevin さん、François-Régis Vuillemin さん、Frédéric Boiteux さん、Frédéric Guélen さん、Frédéric Keigler さん、Frédéric Lietart さん、Gabriel Moreau さん、Gian-Maria Daffré さん、Grégory Lèche さん、Grégory Valentin さん、Guillaume Boulaton さん、Guillaume Chevillot さん、Guillaume Delvit さん、Guillaume Michon さん、Hervé Guimbretiere さん、Iván Alemán さん、Jacques Bompas さん、Jannine Koch さん、Jean-Baptiste Roulier さん、Jean-Christophe Becquet さん、Jean-François Bilger さん、Jean-Michel Grare さん、Jean-Sébastien Lebacq さん、Jérôme Ballot さん、Jerome Pellois さん、Johan Roussel さん、Jonathan Gallon さん、Joris Dedieu さん、Julien Gilles さん、Julien Groselle さん、Kevin Messer さん、Laurent Espitallier さん、Laurent Fuentes さん、Le Goût Du Libre さん、Ludovic Poux さん、Marc Gasnot さん、Marc Verprat さん、Marc-Henri Primault さん、Martin Bourdoiseau さん、Mathieu Chapounet さん、Mathieu Emering さん、Matthieu Joly さん、Melvyn Leroy さん、Michel Casabona さん、Michel Kapel さん、Mickael Tonneau さん、Mikaël Marcaud さん、Nicolas Bertaina さん、Nicolas Bonnet さん、Nicolas Dandrimont さん、Nicolas Dick さん、Nicolas Hicher さん、Nicolas Karolak さん、Nicolas Schont さん、Olivier Gosset さん、Olivier Langella さん、Patrick Francelle さん、Patrick Nomblot さん、Philippe Gaillard さん、Philippe Le Naour さん、Philippe Martin さん、Philippe Moniez さん、Philippe Teuwen さん、Pierre Brun さん、Pierre Gambarotto さん、Pierre-Dominique Perrier さん、Quentin Fait さん、Raphaël Enrici — Root 42 さん、Rémi Vanicat さん、Rhydwen Volsik さん、RyXéo SARL さん、Samuel Boulier さん、Sandrine D'hooge さん、Sébasiten Piguet さん、Sébastien Bollingh さん、Sébastien Kalt さん、Sébastien Lardière さん、Sébastien Poher さん、Sébastien Prosper さん、Sébastien Raison さん、Simon Folco さん、Société Téïcée さん、Stéphane Leibovitsch さん、Stéphane Paillet さん、Steve-David Marguet さん、Sylvain Desveaux さん、Tamatoa Davio さん、Thibault Taillandier さん、Thibaut Girka さん、Thibaut Poullain さん、Thierry Jaouen さん、Thomas Etcheverria さん、Thomas Vidal さん、Thomas Vincent さん、Vincent Avez さん、Vincent Merlet さん、Xavier Alt さん、Xavier Bensemhoun さん、Xavier Devlamynck さん、Xavier Guillot さん、Xavier Jacquelin さん、Xavier Neys さん、Yannick Britis さん、Yannick Guérin さん、Yves Martin さん、皆様に感謝します。
pt_br: Um agradecimento especial para aqueles que optaram por dar 25 € mais do que o valor de sua recompensa. Sua fé neste projeto é muito apreciada. Obrigado a Adrien Guionie, Adrien Ollier, Adrien Roger, Agileo Automation, Alban Duval, Alex Viala, Alexandre Dupas, Alexandre Roman, Alexis Bienvenüe, Anthony Renoux, Aurélien Beaujean, Baptiste Darthenay, Basile Deplante, Benjamin Cama, Benjamin Guillaume, Benoit Duchene, Benoît Sibaud, Bornet, Brett Ellis, Brice Sevat, Bruno Le Goff, Bruno Marmier, Cédric Briner, Cédric Charlet, Cédrik Bernard, Celia Redondo, Cengiz Ünlü, Charles Flèche, Christian Bayle, Christophe Antoine, Christophe Bliard, Christophe Carré, Christophe De Saint Leger, Christophe Perrot, Christophe Robert, Christophe Schockaert, Damien Escoffier, David Dellier, David Trolle, Davy Hubert, Decio Valeri, Denis Marcq, Denis Soriano, Didier Hénaux, Dirk Linnerkamp, Edouard Postel, Eric Coquard, Eric Lemesre, Eric Parthuisot, Eric Vernichon, Érik Le Blanc, Fabian Culot, Fabien Givors, Florent Bories, Florent Machen, Florestan Fournier, Florian Dumas, François Ducrocq, Francois Lepoittevin, François-Régis Vuillemin, Frédéric Boiteux, Frédéric Guélen, Frédéric Keigler, Frédéric Lietart, Gabriel Moreau, Gian-Maria Daffré, Grégory Lèche, Grégory Valentin, Guillaume Boulaton, Guillaume Chevillot, Guillaume Delvit, Guillaume Michon, Hervé Guimbretiere, Iván Alemán, Jacques Bompas, Jannine Koch, Jean-Baptiste Roulier, Jean-Christophe Becquet, Jean-François Bilger, Jean-Michel Grare, Jean-Sébastien Lebacq, Jérôme Ballot, Jerome Pellois, Johan Roussel, Jonathan Gallon, Joris Dedieu, Julien Gilles, Julien Groselle, Kevin Messer, Laurent Espitallier, Laurent Fuentes, Le Goût Du Libre, Ludovic Poux, Marc Gasnot, Marc Verprat, Marc-Henri Primault, Martin Bourdoiseau, Mathieu Chapounet, Mathieu Emering, Matthieu Joly, Melvyn Leroy, Michel Casabona, Michel Kapel, Mickael Tonneau, Mikaël Marcaud, Nicolas Bertaina, Nicolas Bonnet, Nicolas Dandrimont, Nicolas Dick, Nicolas Hicher, Nicolas Karolak, Nicolas Schont, Olivier Gosset, Olivier Langella, Patrick Francelle, Patrick Nomblot, Philippe Gaillard, Philippe Le Naour, Philippe Martin, Philippe Moniez, Philippe Teuwen, Pierre Brun, Pierre Gambarotto, Pierre-Dominique Perrier, Quentin Fait, Raphaël Enrici — Root 42, Rémi Vanicat, Rhydwen Volsik, RyXéo SARL, Samuel Boulier, Sandrine D'hooge, Sébasiten Piguet, Sébastien Bollingh, Sébastien Kalt, Sébastien Lardière, Sébastien Poher, Sébastien Prosper, Sébastien Raison, Simon Folco, Société Téïcée, Stéphane Leibovitsch, Stéphane Paillet, Steve-David Marguet, Sylvain Desveaux, Tamatoa Davio, Thibault Taillandier, Thibaut Girka, Thibaut Poullain, Thierry Jaouen, Thomas Etcheverria, Thomas Vidal, Thomas Vincent, Vincent Avez, Vincent Merlet, Xavier Alt, Xavier Bensemhoun, Xavier Devlamynck, Xavier Guillot, Xavier Jacquelin, Xavier Neys, Yannick Britis, Yannick Guérin, e Yves Martin.

source: Special Thanks to Contributors
ar_ma: شكر خاص للمساهمين
el_gr: Σπέσιαλ Ευχαριστώ Στους Συνεργάτες
es_es: Agradecimientos especiales para colaboradores
fr_fr: Remerciements particuliers aux contributeurs
it_it: Un ringraziamento speciale ai collaboratori
ja_jp: 貢献者の方々に対する深い感謝
pl_pl: Specjalne Podziękowania dla Współpracowników
pt_br: Um Especial Agradecimento aos Colaboradores
zh_cn: 对贡献者的特别致谢

source: This book would not be what it is without the contributions of several persons who each played an important role during the translation phase and beyond. We would like to thank Marilyne Brun, who helped us to translate the sample chapter and who worked with us to define some common translation rules. She also revised several chapters which were desperately in need of supplementary work. Thank you to Anthony Baldwin (of Baldwin Linguas) who translated several chapters for us.
ar_ma: لم يكن ليصدر الكتاب بهذه الحُلّة لولا مساهمة العديد من الأشخاص الذين لعبوا أدواراً مهمة في مرحلة الترجمة وما بعدها. نرغب بشكر Marilyne Brun، التي ساعدتنا على ترجمة العينة وعملت معنا على تحديد بعض قواعد الترجمة المتعارف عليها. كما راجعت عدة فصول كانت بحاجة ماسة لعمل إضافي. والشكر أيضاً لـ Anthony Baldwin (من Baldwin Linguas) الذي ترجم لنا عدة فصول.
es_es: Este libro no sería lo que es sin la colaboración de varias personas, cada una de las cuales cumplió un papel importante durante la fase de traducción y después. Nos gustaría dar las gracias a Marilyne Brun, quien nos ayudó a traducir el capítulo de ejemplo y que ha trabajado con nosotros para definir unas reglas comunes para la traducción. También revisó varios capítulos en los que necesitábamos desesperadamente una ayuda adicional. Muchas gracias a Anthony Baldwin (de Linguas Baldwin) que ha traducido varios capítulos para nosotros.
fr_fr: Ce livre ne serait pas ce qu'il est sans les contributions de plusieurs personnes qui ont joué un rôle particulier pendant la traduction et au-delà. Nous voudrions remercier Marilyne Brun, qui nous a aidés à traduire un chapitre d'essai et qui a travaillé avec nous pour établir quelques conventions de traduction. Elle a aussi révisé plusieurs chapitres qui avaient grand besoin de travail supplémentaire. Merci aussi à Anthony Baldwin (de Baldwin Linguas) qui a traduit plusieurs chapitres pour nous.
ja_jp: 翻訳作業期間とその先で重要な役割を果たした一部の貢献者の方々がいなければ、この本をこのような形に完成させることができなかったでしょう。我々は、サンプル章を翻訳し我々と協力していくつかの一般的な翻訳規則を定義した Marilyne Brun さんに感謝しています。さらに彼女は大きな捕捉が必要な一部の章を改訂しました。我々は、いくつかの章を翻訳した Anthony Baldwin (Baldwin Linguas 社) さんに感謝しています。
pt_br: Este livro não seria o que é sem as contribuições de várias pessoas que desempenharam um importante papel durante a fase de tradução e além. Gostaríamos de agradecer a Marilyne Brun, que nos ajudou a traduzir o capítulo de amostra e que trabalhou conosco para definir algumas regras de tradução comuns. Ela também revisou vários capítulos que estavam precisando desesperadamente de trabalho suplementar. Obrigado a Anthony Baldwin (da Baldwin Linguas), que traduziu vários capítulos para nós.

source: We benefited from the generous help of proofreaders: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens, and Tom Syroid. They each reviewed many chapters. Thank you very much!
ar_ma: كما استفدنا من المساعدة الكريمة للمنقحين: Daniel Phillips، ‏Gerold Rupprecht، ‏Gordon Dey، ‏Jacob Owens، وTom Syroid. كل واحد منهم راجع لنا عدة فصول. شكراً جزيلاً لكم!
el_gr: Ωφεληθήκαμε απο την γενναιόδωρη βοήθεια των διορθωτών τυπογραφίου: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens, and Tom Syroid. Αυτοί έκαναν ανασκόπηση αρκετών κεφαλαίων. Σας ευχαριστούμε πάρα πολύ!
es_es: Hemos aprovechado la generosa ayuda de los correctores: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Owens Jacob, y Syroid Tom. Cada uno de ellos examinó muchos capítulos. ¡Muchas gracias!
fr_fr: Nos relecteurs nous ont été d'une aide précieuse : Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens et Tom Syroid ont chacun relu, revu et corrigé de nombreux chapitres. Merci beaucoup !
it_it: Abbiamo beneficiato del generoso aiuto dei correttori di bozze: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens e Tom Syroid. Ognuno di loro ha revisionato molti capitoli. Veramente grazie!
ja_jp: 我々は校正者の皆様から惜しみない助けをいただきました: Daniel Phillips さん、Gerold Rupprecht さん、Gordon Dey さん、Jacob Owens さん、Tom Syroid さん。彼らは多くの章をレビューしてくださいました。ありがとうございます!
pl_pl: Skorzystaliśmy z hojnej pomocy korektorów: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens i Tom Syroid. Każdy z nich zrecenzował wiele rozdziałów. Dziękujemy bardzo!
pt_br: Contamos com a ajuda generosa dos revisores: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens, e Tom Syroid. Cada um deles revisou muitos capítulos. Muito obrigado!
zh_cn: 我们从校对们那里得到很多帮助，他们是 Daniel Phillips，Gerold Rupprecht，Gordon Dey，Jacob Owens 和 Tom Syroid。他们每个人都校检了很多章节。非常感谢！
