Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: After the publication of the English book under a free software licence, we were in a weird situation with a free book which is a translation of a non-free book (since it was still distributed commercially under a non-free license by Eyrolles).
ar_ma: بعد نشر الكتاب الإنكليزي تحت رخصة حرة، وجدنا أنفسنا في وضع غريب حيث أن الكتاب الحر هو ترجمة لكتاب غير حر (بما أن Eyrolles كانت لا تزال توزعه تجارياً برخصة غير حرة).
es_es: Después de la publicación del libro en inglés bajo una licencia de software libre, nos encontrábamos en una situación extraña: con un libro libre que es una traducción de un libro privativo (ya que Eyrolles todavía lo distribuía comercialmente bajo una licencia privativa).
fr_fr: Après la publication du livre anglais sous une licence libre, nous étions dans une situation étrange, avec un livre libre qui était la traduction d'un livre non libre (puisqu'étant toujours exploité commercialement par Eyrolles).
ja_jp: 英語版をフリーライセンスで公開した後、非フリーな本を翻訳したフリーな本という変わった状況に陥りました (なぜなら非フリーな本は Eyrolles によって非フリーなライセンスで市販されているからです)。
pt_br: Após a publicação do livro em inglês sob uma licença de software livre, nós estávamos em uma situação estranha com um livro livre, que é uma tradução de um livro de não livre (uma vez que ainda foi distribuído comercialmente sob uma licença não-livre pela Eyrolles).

source: We knew that fixing this would require to convince Eyrolles that a free license would contribute to the book's success. The opportunity came to us in 2013 when we had to discuss a new contract to update the book for Debian 7. Since freeing a book often has a significant impact on its sales, as a compromise, we agreed to setup a crowdfunding campaign to offset some of the risks involved and to contribute to the publication costs of a new edition. The campaign was again hosted on Ulule: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />
ar_ma: علمنا أن تصحيح هذا الوضع سيحتاج لإقناع Eyrolles أن الترخيص الحر سيزيد من نجاح الكتاب. واتتنا الفرصة في 2013 عندما كنا على وشك مناقشة عقد جديد لتحديث الكتاب ليوافق دبيان7. وبما أن تحرير الكتاب سيكون له أثر واضح غالباً على مبيعاته، فقد وافقنا، كنوع من التسوية، على إطلاق حملة تمويل جماهيري لدر بعض الأخطار المحتملة والمساهمة في تكاليف نشر الطبعة الجديدة. استضفنا الحملة على Ulule مرة ثانية: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />
es_es: Sabíamos que necesitaríamos convencer a Eyrolles que una licencia libre contribuiría al éxito del libro para poder corregir esto. Se dio la oportunidad en 2013 cuando tuvimos que discutir un nuevo contrato para actualizar el libro para Debian 7. Debido a que liberar un libro tiene un impacto significativo en sus ventas, como un punto intermedio, accedimos a llevar a cabo una campaña de financiación colectiva («crowdfunding») para contrarrestrar algunos de los riesgos y contribuir a los costos de la publicación de una nueva edición. Nuevamente utilizamos Ulule para dicha campaña: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />
fr_fr: Nous savions que corriger cela nécessiterait de convaincre Eyrolles qu'une licence libre contribuerait au succès du livre. Nous en avons eu l'opportunité en 2013 en discutant d'un nouveau contrat pour mettre à jour le livre pour Debian 7. Puisque la libération d'un livre a un impact significatif sur ses ventes, nous avons décidé — en recherchant un compromis — de mettre en place une campagne de financement participatif pour limiter les risques et pour couvrir une partie des frais induits par la publication d'une nouvelle édition. La campagne a de nouveau été organisée sur la plateforme de Ulule : <ulink type="block" url="http://fr.ulule.com/liberation-cahier-admin-debian/" />
ja_jp: 我々はこれを解決するには、フリーライセンスがこの本の成功に寄与するということを Eyrolles に納得させることが必要であるとわかっていました。この機会がやってきたのが 2013 年です、この年我々は Debian 7 用に本を更新する契約を結ばなければいけませんでした。本をフリーにすることは本の販売に大きな影響を与えることが多いため、妥協案として我々は、関連するリスクの埋め合わせと新しい版の出版費の充当を目的に、クラウドファンディングキャンペーンを立ち上げることに同意しました。このキャンペーンは再度 Ulule で実施されました: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/" />
pt_br: Sabíamos que precisávamos convencer a Eyrolles que uma licença livre contribuiria para o sucesso do livro. A oportunidade veio até nós em 2013, quando tivemos de discutir um novo contrato para atualizar o livro para o Debian 7. Como normalmente liberar um livro com uma licença livre tem um impacto significativo em suas vendas, nós nos comprometemos em organizar uma campanha de financiamento colaborativo para compensar alguns dos riscos envolvidos e contribuir para as despesas de publicação de uma nova edição. A campanha foi novamente hospedada na Ulule: <ulink type="block" url="http://www.ulule.com/liberation-cahier-admin-debian/"/>

source: The target was at €15,000 in 30 days. It took us less than a week to reach it, and at the end we got a whopping €25,518 from 721 supporters.
ar_ma: كان الهدف €15,000 في 30 يوماً. لقد وصلنا للمبلغ المطلوب في أقل من أسبوع، وانتهت الحملة بحصولنا على €25,518 من 721 داعم.
es_es: El objetivo eran 15000€ en 30 días. Nos tomó menos de una semana llegar a dicha cifra, y obtuvimos la increíble cifra de 25518€ de 721 seguidores cuando finalizó.
fr_fr: L'objectif était à 15 000 € en 30 jours. Il nous a fallu moins d'une semaine pour l'atteindre et, à la fin, nous avons obtenu 25 518 € de 721 soutiens.
ja_jp: 目標は 30 日間 で €15,000 でした。1 週間を待たずに目標に到達し、最終的に 721 人の支援者から €25,518 もの寄付をいただきました。
pt_br: O objetivo era €15.000,00 em 30 dias. Foi preciso menos de uma semana para alcançar isso, e no final obtivemos uma incrível cifra de €25.518,00 dos 721 apoiadores.

source: We had significant contributions from free software-friendly companies and organizations. Let us thank the <ulink url="http://linuxfr.org">LinuxFr.org</ulink> website, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink>, and <ulink url="http://www.linuvers.com">Linuvers</ulink>. Many thanks to LinuxFr and Korben, they considerably helped to spread the news.
ar_ma: حصلنا على مساهمات معتبرة من الشركات والمنظمات الصديقة للبرمجيات الحرة. اسمح لنا أن نشكر موقع <ulink url="http://linuxfr.org">LinuxFr.org</ulink>، ‏<ulink url="http://korben.info">Korben</ulink>، ‏<ulink url="http://www.addventure.fr">Addventure</ulink>، ‏<ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>، ‏<ulink url="http://elol.fr">ELOL SARL</ulink>، و<ulink url="http://www.linuvers.com">Linuvers</ulink>. كل الشكر إلى LinuxFr و Korben، لقد ساعدا كثيراً بنشر الخبر.
es_es: Tuvimos contribuciones importantes de empresas y organizaciones cercanas al software libre. Permítanos agradecer a: el sitio web <ulink url="http://linuxfr.org">LinuxFr.org</ulink>, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink> y <ulink url="http://www.linuvers.com">Linuvers</ulink>. Muchas gracias a LinuxFr y Korben, quienes ayudaron significativamente a difundir la noticia.
fr_fr: Nous avons eu des contributions significatives d'entreprises et d'organisations favorables au libre. Permettez-nous de remercier les sites web <ulink url="http://linuxfr.org">LinuxFr.org</ulink>, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink> et <ulink url="http://www.linuvers.com">Linuvers</ulink>. De grands mercis à LinuxFr et Korben, ils nous ont considérablement aidés à faire connaître notre projet.
ja_jp: 数多くのフリーソフトウェアに理解を示す企業と組織が我々の支援者になりました。<ulink url="http://linuxfr.org">LinuxFr.org</ulink> ウェブサイト、<ulink url="http://korben.info">Korben</ulink>、<ulink url="http://www.addventure.fr">Addventure</ulink>、<ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>、<ulink url="http://elol.fr">ELOL SARL</ulink>、<ulink url="http://www.linuvers.com">Linuvers</ulink>、皆様ありがとうございます。このニュースを広めることに大きく協力してくださった LinuxFr と Korben に感謝しています。
pt_br: Tivemos contribuições significativas de companhias e organizações amigas do software livre. Gostaríamos de agradecer ao website <ulink url="http://linuxfr.org">LinuxFr.org</ulink>, <ulink url="http://korben.info">Korben</ulink>, <ulink url="http://www.addventure.fr">Addventure</ulink>, <ulink url="http://www.eco-cystemes.com/">Eco-Cystèmes</ulink>, <ulink url="http://elol.fr">ELOL SARL</ulink>, e <ulink url="http://www.linuvers.com">Linuvers</ulink>. Muito obrigado a LinuxFr e Korben, quem nos ajudaram de forma considerável a difundir a notícia.

source: The operation has been a huge success because hundreds of people share our values of freedom and put their money to back it up! Thank you for this.
ar_ma: كانت العملية ناجحة جداً بفضل مئات الأشخاص الذين يشاركوننا قيم الحرية وينفقون أموالهم في سبيل دعمها! شكراً لكم لهذا.
es_es: ¡La operación fue un gran éxito porque cientos de personas comparten nuestros valores de libertad y los defendieron con su dinero! Muchas gracias por eso.
fr_fr: L'opération a été un formidable succès parce que des centaines de personnes partagent nos valeurs de liberté et qu'elles y ont mis leur argent pour le prouver ! Merci pour tout.
ja_jp: 数百人の人々が我々の自由に対する価値観を共有し、これを支援するためにお金を寄付してくれたことで、このキャンペーンは大きな成功をおさめました。ありがとうございます。
pt_br: A operação foi um enorme sucesso porque centenas de pessoas compartilham os nossos valores de liberdade e colocaram seu dinheiro para nos apoiar! Obrigado por isso.
