Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: While we were busy translating the book, donations towards the liberation continued to flow in… And in April 2012, the liberation fund was completed. You can thus benefit from this book under the terms of a free license.
ar_ma: أثناء انشغالنا بترجمة الكتاب، استمرت التبرعات لتحرير الكتاب بالوصول… وفي أبريل 2012، اكتمل مبلغ التحرير. وبذلك يمكنك الاستفادة الآن من هذا الكتاب تحت شروط رخصة حرة.
el_gr: Ενώ είμασταν απασχολημένοι μεταφράζοντας το βιβλίο, οι δωρεές για την απελευθέρωση του βιβλίου συνέχισαν να ρέουν... Και τον Απρίλιο του 2012, το ποσό απελευθέρωσης ολοκληρώθηκε. Επομένως μπορείτε να επωφεληθείται του βιβλίου κάτω απο τον όρο της ελεύθερης άδειας.
es_es: Mientras estábamos ocupados traduciendo el libro, continuaron las donaciones para la liberación del libro… Y en abril de 2012 se alcanzó el monto necesario para la liberación. De este modo es que puede beneficiarse de este libro bajo los términos de una licencia libre.
fr_fr: Pendant que nous étions occupés à traduire le livre, les donations ont continué d'affluer en direction du fonds de libération… et en avril 2012, l'objectif a été atteint, ce qui vous permet de profiter de ce livre sous une licence libre.
it_it: Mentre eravamo impegnati a tradurre il libro, le donazioni dedicate alla pubblicazione libera hanno continuato ad arrivare… così ad aprile 2012, il fondo fu completato ed è perciò possibile beneficiare di questo libro sotto i termini di una licenza libera.
ja_jp: 我々が本の翻訳に忙しかった一方で、解放基金に対する寄付金は集まり続け、2012 年 4 月解放基金は目標達成しました。そんなわけであなたはこの本をフリーライセンスで手に入れることができています。
pl_pl: Podczas, gdy my byliśmy zajęci tłumaczeniem książki, nadal spływały dotacje na "wyzwolenie"... I w kwietniu 2012-go roku "fundusz wyzwolenia" został wypełniony. Dzięki temu możesz teraz korzystać z tej książki na warunkach otwartej licencji.
pt_br: Enquanto estávamos ocupados traduzindo o livro, as doações para a liberação continuaram chegando... E em abril de 2012, o fundo de liberação foi completado. Você pode, assim, se beneficiar deste livro sob os termos da licença livre.
zh_cn: 我们忙于翻译本书的时候，向着解放基金的捐款也持续不断地流入……直到2012年4月，解放基金完成了。所有人都能从遵循自由许可证的本书中受益了。

source: We would like to thank everybody who contributed to these fundraising campaigns, either by pledging some money or by passing the word around. We couldn't have done it without you.
ar_ma: نود شكر كل شخص ساهم في حملات جمع التبرعات هذه، سواء من خلال تقديم المال أو نشر الحملة إعلامياً. لم نكن لننجح من دونكم.
el_gr: Θέλουμε να ευχαριστήσουμε τον καθένα που συνείσφερε σ'αυτή την εκστρατεία συγκέντρωσης του ποσού, είτε δεσμεύοντας μερικά χρήματα η μεταφέροντας την είδηση αυτή. Δεν θα το κατορθώναμε χωρίς εσάς.
es_es: Nos gustaría dar las gracias a todos los que contribuyeron con estas campañas de recaudación de fondos, ya sea mediante la promesa de algo de dinero o pasando la voz. No podríamos haberlo hecho sin ti.
fr_fr: Nous voudrions donc remercier toutes les personnes qui ont contribué à ces campagnes de financement, soit directement par des dons, soit indirectement en diffusant l'information. Nous n'aurions pas pu en arriver là sans vous.
it_it: Vorremmo ringraziare tutti coloro che hanno contribuito a queste campagne di raccolta fondi, sia con contributi in denaro che con il passaparola, senza di loro non avremmo potuto farlo.
ja_jp: 我々は、金銭的な支援を約束したり資金調達キャンペーンを周りに宣伝することで、キャンペーンにご協力くださったすべての人に感謝しています。あなた方の協力がなければこのキャンペーンを達成することができなかったでしょう。
pl_pl: Chcielibyśmy wyrazić podziękowania dla wszystkich, którzy przyczynili się podczas kampanii zbierania funduszy, zarówno wpłacając trochę pieniędzy lub rozpowszechniając informację o akcji. Bez Was nie moglibyśmy tego dokonać.
pt_br: Gostaríamos de agradecer a todos que contribuíram para estas campanhas de arrecadação de fundos, seja assegurando algum dinheiro ou espalhando a notícia. Nós não poderíamos ter feito isso sem vocês.
zh_cn: 我们要感谢所有为这些募捐活动出力的人们，无论是捐了钱的还是帮我们广为宣传的。没有你们我们无法完成这一切。

source: Supportive Companies and Organizations
ar_ma: الشركات الداعمة والمنظمات
el_gr: Υποστηρικτές Εταιρίες και Οργανισμοί
es_es: Empresas y organizaciones de apoyo
fr_fr: Sociétés et organisations qui nous ont soutenus
it_it: Aziende e organizzazioni che ci hanno appoggiato
ja_jp: 協賛企業と組織
pl_pl: Wspierające Firmy i Organizacje
pt_br: Empresas e Organizações de apoio
zh_cn: 赞助公司和组织

source: We had the pleasure of getting significant contributions from many free software-friendly companies and organizations. Thank you to <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), and <ulink url="http://www.syminet.com">Syminet</ulink>.
ar_ma: يَسرُّنا أننا حصلنا على مساهمات معتبرة من العديد من الشركات والمنظمات الداعمة للبرامج الحرة. كل الشكر إلى <ulink url="http://www.codelutin.com">Code Lutin</ulink>، ‏<ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>، ‏<ulink url="http://www.evolix.fr">Evolix</ulink>، ‏<ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>، ‏<ulink url="http://fsffrance.org">FSF France</ulink>، ‏<ulink url="http://www.offensive-security.com">Offensive Security</ulink> (الشركة الداعمة لتوزيعة <ulink url="http://www.kali.org">Kali Linux</ulink>)، ‏<ulink url="http://www.opensides.be">Opensides</ulink>، ‏<ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>، ‏SSIELL (Société Solidaire d'Informatique En Logiciels Libres)، ‏و<ulink url="http://www.syminet.com">Syminet</ulink>.
es_es: Tuvimos el placer de conseguir importantes contribuciones de muchas empresas y organizaciones afines al software libre. Gracias a <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (la empresa detrás de <ulink url="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL («Société Solidaire d'Informatique En Logiciels Libres») y <ulink url="http://www.syminet.com">Syminet</ulink>.
fr_fr: Nous avons eu le plaisir de recevoir des contributions significatives de la part de nombreuses sociétés et organisations qui partagent les valeurs du logiciel libre. Merci donc à <ulink url="http://www.codelutin.com">Code Lutin</ulink>, l'<ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, la <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (la société derrière <ulink url="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres) et <ulink url="http://www.syminet.com">Syminet</ulink>.
ja_jp: 我々はフリーソフトに理解を示す数多くの企業や組織から多大な寄付をいただいたことを光栄に思っています。<ulink url="http://www.codelutin.com">Code Lutin</ulink>、<ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>、<ulink url="http://www.evolix.fr">Evolix</ulink>、<ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>,、<ulink url="http://fsffrance.org">FSF France</ulink>、<ulink url="http://www.offensive-security.com">Offensive Security</ulink> (<ulink url="http://www.kali.org">Kali Linux</ulink> を支援する企業)、<ulink url="http://www.opensides.be">Opensides</ulink>、<ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>、SSIELL (Société Solidaire d'Informatique En Logiciels Libres)、<ulink url="http://www.syminet.com">Syminet</ulink>、皆様ありがとうございます。
pt_br: Tivemos o prazer de obter contribuições significativas de muitas empresas e organizações amigas do Software Livre. Obrigado a <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org"> École ouverte francófona</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url = "http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (a empresa por trás do <ulink url ="http://www.kali.org">Kali Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url ="http://www.proxmox.com">Proxmox Server Solutions GmbH</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres) e <ulink url="http://www.syminet.com">Syminet</ulink>.
zh_cn: 我们很高兴能得到许多支持自由软件的公司和组织的大力支持。感谢 <ulink url="http://www.codelutin.com">Code Lutin</ulink>，<ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>，<ulink url="http://www.evolix.fr">Evolix</ulink>，<ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>，<ulink url="http://fsffrance.org">FSF France</ulink>，<ulink url="http://www.offensive-security.com">Offensive Security</ulink>（<ulink url="http://www.kali.org">Kali Linux</ulink>背后的公司），<ulink url="http://www.opensides.be">Opensides</ulink>，<ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>，SSIELL（Société Solidaire d'Informatique En Logiciels Libres）和 <ulink url="http://www.syminet.com">Syminet</ulink>。

source: We would also like to thank <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> and <ulink url="http://www.april.org">April</ulink> for their help in promoting the operation.
ar_ma: كما نرغب أيضاً بشكر <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> و<ulink url="http://www.april.org">April</ulink> لمساعدتهما في الترويج للعملية.
el_gr: Θα θέλαμε επίσης να ευχαριστήσουμε <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> and <ulink url="http://www.april.org">April</ulink> για την βοήθειά τους προάγοντας το όλο έργο.
es_es: También nos gustaría dar las gracias a <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> y a <ulink url="http://www.april.org">April</ulink> por su ayuda en la promoción del proyecto.
fr_fr: Nous voudrions aussi remercier <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> et l'<ulink url="http://www.april.org">April</ulink> pour leur aide dans la promotion de l'opération.
it_it: Vorremmo anche ringraziare <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> e <ulink url="http://www.april.org">April</ulink> per il loro aiuto nel pruomovere l'operazione.
ja_jp: さらに我々は、キャンペーンの宣伝にご協力いただいた <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> と <ulink url="http://www.april.org">April</ulink> に感謝します。
pl_pl: Chcielibyśmy również podziękować <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> i <ulink url="http://www.april.org">April</ulink> za ich pomoc w promowaniu akcji.
pt_br: Também gostaríamos de agradecer a <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> e <ulink url="http://www.april.org">April</ulink> por sua ajuda em promover a operação.
zh_cn: 我们也要感谢 <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> 和 <ulink url="http://www.april.org">April</ulink> 帮忙宣传这个活动。

source: Individual Supporters
ar_ma: الداعمون الأفراد
el_gr: Άτομα Υποστηρικτές
es_es: Apoyos individuales
fr_fr: Soutiens individuels
it_it: Sostenitori individuali
ja_jp: 個人支援者
pl_pl: Indywidualne Wsparcie
pt_br: Apoiadores individuais
zh_cn: 个人支持者

source: With over 650 supporters in the initial fundraising, and several hundred more in the continued liberation campaign, it is thanks to people like you that this project has been possible. Thank you!
ar_ma: حصلنا على دعم أكثر من 650 شخص في حملة جمع التبرعات الأولى وعدة مئات أخرى في حملة التحرير المستمرة. لم يكن تنفيذ هذا المشروع ممكناً لولا فضلكم. شكراً لكم!
el_gr: Με πάνω απο 650 υποστηρικτές στο αρχικό ποσό και με πολλές εκατοντάδες ακόμα που συνέχισαν την απελευθερωτική εκστρατεία, ένα μεγάλο ευχαριστώ που το έργο κατέστει δυνατόν. Σας ευχαριστώ!
es_es: Con más de 650 contribuyentes en la recaudación inicial de fondos y varios cientos más en la campaña de liberación posterior, este proyecto ha sido posible gracias a personas como usted. ¡Gracias!
fr_fr: Nous avons reçu le soutien de 650 personnes pendant la campagne de financement initiale, et de plusieurs centaines d'autres pendant la campagne de libération. C'est grâce à vous que ce projet a pu voir le jour. Merci à tous !
it_it: Gli oltre 650 sostenitori nella raccolta fondi iniziale e le altre svariate centinaia che hanno contribuito successivamente fino a raggiungere l'obiettivo finale. È grazie a persone come loro che questo progetto è stato possibile. Grazie!
ja_jp: 1 つ目のキャンペーンに寄付していただいた 650 人を超える支援者の皆様、解放資金キャンペーンに寄付していただいた数百人以上の皆様、このプロジェクトを可能にしたのは、あなたのような人のおかげです。ありがとうございます!
pl_pl: Dzięki ponad 650 osobom wspierającym podczas wstępnego zbierania funduszy oraz kilkuset więcej podczas kontynuowania kampanii "wyzwolenia", dzięki osobom takim jak Ty, ten projekt był możliwy do wykonania. Dziękujemy Ci!
pt_br: Com mais de 650 apoiadores na captação de recursos iniciais, e várias centenas mais na campanha de liberação contínua, é graças a pessoas como você que este projeto foi possível. Obrigado!
zh_cn: 刚开始的募捐中超过650名的支持者，和后来第二阶段募捐中的几百名支持者，感谢你们使这个项目变成可能。谢谢！

source: We want to address our special thanks to those who contributed at least €35 (sometimes much more!) to the liberation fund. We are glad that there are so many people who share our values about freedom and yet recognize that we deserved a compensation for the work that we have put into this project.
ar_ma: نود توجيه شكر خاص للذين ساهموا بـ €35 على الأقل (وأكثر من ذلك بكثير في بعض المرات!) لمبلغ التحرير. نحن مسرورون بوجود كثير من الأشخاص يشاركوننا قيمنا عن الحرية وفي نفس الوقت يتفهمون أننا نستحق تعويضاً مقابل العمل الذي بذلناه في هذا المشروع.
el_gr: Θέλουμε ν'απευθύνουμε ενα πολύ σπέσιαλ ευχαριστώ σ'αυτούς που συνέβαλαν με €35 (μερικές φορές πιό πολύ) στο ποσό απελευθέρωσης. Είμαστε χαρούμενοι που τόσο πολλοί άνθρωποι μοιράστηκαν τις αξίες μας για ελευθερία και ακόμη αναγνώρισαν το οτι αξίζουμε κάποια αποζημίωση για τον κόπο που κάναμε με το έργο αυτό.
es_es: Queremos dar las gracias especialmente a aquellos que han contribuido con al menos 35 € (¡a veces mucho más!) al fondo para la liberación del libro. Estamos encantados de que haya tantas personas que compartan nuestros valores de libertad y sin embargo reconocen que merecíamos una compensación por el trabajo realizado en este proyecto.
fr_fr: Nous tenons à remercier particulièrement tous ceux qui ont contribué 35 € ou plus (parfois beaucoup plus !) au fonds de libération. Nous sommes heureux de constater qu'autant de monde partage nos valeurs de liberté tout en reconnaissant que nous méritions une compensation pour le travail que nous avons fourni pour mener ce projet à bien.
it_it: Vogliamo indirizzare il nostro speciale ringraziamento a chi ha contribuito con almeno 35 € (a volte anche molto di più!) al fondo per la pubblicazione libera. Siamo lieti ci siano tante persone che condividano i nostri valori di libertà e tuttavia ci abbiano voluto riconoscere un compenso per il lavoro che abbiamo dedicato a questo progetto.
ja_jp: 我々は解放基金に少なくとも €35 (それ以上の人もいらっしゃいます!) の寄付をしていただいた人々に深く感謝しています。非常に多くの人々が自由に関する我々の価値観を共有し、このプロジェクトで我々の成した仕事は対価を与えるに値すると認めてくださったことを嬉しく思っています。
pl_pl: Chcielibyśmy zaadresować specjalne podziękowania do tych, którzy wpłacili przynajmniej €35 (czasem znacznie więcej!) na "fundusz wyzwolenia". Jesteśmy zadowoleni, że jest tak wiele osób, które podzielają nasze wartości dotyczące wolności, jednocześnie uznając, że zasłużyliśmy na wynagrodzenie za pracę włożoną w ten projekt.
pt_br: Nós queremos enviar nossos agradecimentos especiais a todos aqueles que contribuíram com pelo menos €35 (algumas vezes muito mais!) para o fundo de liberação. Nós estamos contentes que existam tantas pessoas que compartilham nossos valores de liberdade e ainda reconhecem que nós merecíamos uma compensação pelo trabalho que dedicamos neste projeto.
zh_cn: 我们要对那些捐助解放基金超过35欧元（有些是远远超过！）的个人表示特别感谢。我们很高兴有这么多人共享我们关于自由的价值观，并且认识到我们为这项工作付出的努力应得到补偿。
