Repository: Neamar/KISS
Catalog: */00b_foreword.po
Languages: ar_ma, el_gr, es_es, fr_fr, it_it, ja_jp, pl_pl, pt_br, zh_cn

source: Then, once the English version was liberated, of course we got plenty of feedback and suggestions and fixes from the readers, and even more from the many teams who undertook to translate this book into other languages. Thanks!
ar_ma: بعدئذ، تلقينا الكثير من الملاحظات والاقتراحات والتصحيحات من القراء بعد تحرير النسخة الإنكليزية، كما تلقينا ملاحظات أكثر من الفرق العديدة التي شرعت تترجم الكتاب إلى لغات أخرى. شكراً!
es_es: Luego, una vez que se liberó la versión en inglés, por supuesto que obtuvimos muchos comentarios y sugerencias de los lectores, y aún más de los varios equipos que trabajaron en la traducción de este libro a sus idiomas. ¡Gracias!
fr_fr: Enfin, une fois que le livre anglais a été libéré, nous avons naturellement eu de nombreux retours, suggestions et corrections de lecteurs, et encore plus des nombreuses équipes qui ont entrepris de traduire ce livre dans d'autres langues. Merci !
ja_jp: そして英語版がフリーになると、もちろん我々は読者だけでなくこの本を他の言語に翻訳すると約束した多くのチームからたくさんのフィードバック、提案と修正をいただきました。ありがとうございます!
pt_br: Então, uma vez que a versão em Inglês foi liberada, é claro que tivemos muitos comentários, sugestões e correções dos leitores, e mais ainda das muitas equipes que se comprometeram a traduzir este livro para outros idiomas. Obrigado!

source: We would also like to thank the readers of the French book who provided us some nice quotes to confirm that the book was really worth being translated: thank you Christian Perrier, David Bercot, Étienne Liétart, and Gilles Roussi. Stefano Zacchiroli — who was Debian Project Leader during the crowdfunding campaign — also deserves a big thank you, he kindly endorsed the project with a quote explaining that free (as in freedom) books were more than needed.
ar_ma: نرغب أيضاً بشكر قراء الكتاب باللغة الفرنسية الذين أمدونا ببعض التعليقات الجميلة التي أكدت لنا أن الكتاب يستحق الترجمة شكراً لك Christian Perrier، ‏David Bercot، ‏Étienne Liétart، وGilles Roussi. كما يستحق Stefano Zacchiroli —الذي كان قائد مشروع دبيان في وقت حملة التمويل الجماهيري— الشكر الجزيل، فقد تكرّم بدعم المشروع باقتباس أوضح مدى الحاجة للكتب الحرة.
es_es: Nos gustaría agradecer también a los lectores del libro en francés, quienes nos proporcionaron lindas citas para confirmar que el libro realmente valía la pena ser traducido: gracias a Christian Perrier, David Bercot, Étienne Liétart y a Gilles Roussi. Stefano Zacchiroli — el líder del proyecto Debian durante la campaña de financiación — también se merece un gran agradecimiento, avalando el proyecto con una cita explicando que hacían mucha falta libros libres.
fr_fr: Nous voudrions aussi remercier les lecteurs français qui nous ont témoigné que le livre méritait vraiment d'être traduit : merci à Christian Perrier, David Bercot, Étienne Liétart et Gilles Roussi. Stefano Zacchiroli — qui était leader du projet Debian pendant la campagne de financement — a toute notre gratitude, pour avoir encouragé notre projet et lui avoir donné la publicité nécessaire, avec un message mettant en lumière le besoin de livres libres.
it_it: Vogliamo anche ringraziare i lettori della versione francese che con i loro commenti ci hanno confermato sarebbe veramente stato importante tradurlo in inglese: grazie a voi Christian Perrier, David Bercot, Étienne Liétart e Gilles Roussi. Stefano Zacchiroli, che era Project Leader di Debian durante la campagna di finanziamento, merita un grande ringraziamento, ha approvato il progetto con una citazione spiegando come libri liberi (come in libertà) erano più che necessari.
ja_jp: この本が本当に翻訳されるだけの価値があるということを確認できる良いコメントを我々に知らせてくださったフランス語版の読者に感謝します: Christian Perrier さん、David Bercot さん、Étienne Liétart さん、Gilles Roussi さん。Stefano Zacchiroli さん (クラウドファンディングキャンペーン中の Debian プロジェクトリーダー) には深く感謝しています。彼は我々のプロジェクトを、(自由を意味する) フリーな本が必要とされているというコメントを発表することで、快く推薦しました。
pl_pl: Chcielibyśmy również podziękować czytelnikom francuskiego wydania, którzy dostarczyli nam pozytywnych opinii potwierdzających potrzebę przetłumaczenia tej książki: dziękujemy wam Christian Perrier, David Bercot, Étienne Liétart i Gilles Roussi. Stefano Zacchiroli - który był Liderem Projektu Debian podczas kampanii zbierania funduszy - również zasługuje na wielkie podziękowanie, przychylnie poparł projekt swoją opinią, wyjaśniając, że wolne (jak wolność) książki były więcej niż potrzebne.
pt_br: Gostaríamos também de agradecer aos leitores do livro francês, que nos forneceram algumas citações interessantes para confirmar que o livro era realmente digno de ser traduzido: obrigado Christian Perrier, David Bercot, Étienne Liétart, e Gilles Roussi. Stefano Zacchiroli - que era o Líder do Projeto Debian durante a campanha de financiamento coletivo - também merece um grande obrigado, ele gentilmente aprovou o projeto com uma citação explicando que livros livres eram mais do que necessários.
zh_cn: 我们也要感谢几位法文版的读者，他们给了我们不错的评价，让我们知道我们的翻译是值得的，感谢你们：Christian Perrier，David Bercot，Étienne Liétart 和 Gilles Roussi。Stefano Zacchiroli 是在大集市募捐活动时的 Debian 项目领导人，感谢他支持我们的活动，并解释了为什么自由版权的书是非常重要的。

source: If you have the pleasure to read these lines in a paperback copy of the book, then you should join us to thank Benoît Guillon, Jean-Côme Charpentier, and Sébastien Mengin who worked on the interior book design. Benoît is the upstream author of <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — the tool we used to convert DocBook into LaTeX (and then PDF). Sébastien is the designer who created this nice book layout and Jean-Côme is the LaTeX expert who implemented it as a stylesheet usable with dblatex. Thank you guys for all the hard work!
ar_ma: إذا كنت مسروراً لقراءتك هذه السطور من النسخة الورقية إذن يفترض أن تشاركنا بشكر Benoît Guillon، ‏Jean-Côme Charpentier و Sébastien Mengin الذين أنجزوا التصميم الداخلي للكتاب . Benoît هو المؤلف الأساسي للأداة <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — وهي الأداة التي استخدمناها لتحويل صيغة DocBook إلى LaTeX ثم إلى PDF. ‏Sébastien هو المصمم الذي أنشأ التصميم الطباعي الجميل لهذا الكتاب وJean-Côme هو خبير LaTeX الذي استخدمه كأوراق تنسيق يمكن استخدامها مع dblatex. شكراً لكم شباب على كل العمل الصعب!
el_gr: Εάν έχεις τη χαρά να διαβάσεις όλ' αυτά απο αντίγραφο βιβλίου(βιβλιοδεσία), τότε πρέπει να ευχαριστήσουμε τους Benoît Guillon, Jean-Côme Charpentier, και Sébastien Mengin οι οποίοι δούλεψαν τον εσωτερικό σχεδιασμό. Ο Benoît ειναι ο upstream συγγραφέας του <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> - το εργαλείο που χρησιμοποιούμε για την μετατροπή του DocBook σε LaTeX (και μετά σε PDF). Ο Sébastien ειναι ο σχεδιαστής που δημιούργησε την ωραία διαρρύθμιση του βιβλίου και ο Jean-Côme ειναι ο ειδικός στο LaTeX ο οποίος εφάρμοσε αυτό σε ειδικό εργαλείο ώστε να ειναι χρήσιμο για το dblatex. Σας ευχαριστώ φίλοι για την σκληρή δουλειά!
es_es: Si tiene el placer de leer estas líneas en papel impreso, entonces únase a nosotros en el agradecimiento a Benoît Guillon, Jean-Côme Charpentier y a Sébastien Mengin quienes trabajaron en el diseño interior del libro. Benoît es el autor original de <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — la herramienta que usamos para convertir DocBook en LaTeX (y luego en PDF). Sébastien es el diseñador que creó el bonito diseño de este libro y Jean-Côme es el experto en LaTeX que lo implementó como una hoja de estilo usable con dblatex. ¡Gracias chicos por el duro trabajo que realizaron!
fr_fr: Si vous lisez ces lignes sur un vrai livre en vrai papier, c'est aussi grâce à Benoît Guillon, Jean-Côme Charpentier et Sébastien Mengin, qui ont travaillé à la mise en page intérieure du livre. Benoît est l'auteur principal de <ulink url="http://dblatex.sourceforge.net">dblatex</ulink>, l'outil que nous utilisons pour convertir du format DocBook en LaTeX puis en PDF ; Sébastien est le concepteur graphique qui a créé la maquette du livre et Jean-Côme est l'expert LaTeX qui l'a exprimée en feuille de style utilisable avec dblatex. Merci à tous les trois pour votre travail !
it_it: Chi ha il piacere di leggere queste righe in una copia tascabile del libro, dovrebbe unirsi a noi per ringraziare Benoît Guillon, Jean-Côme Charpentier e Sébastien Mengin che hanno lavorato al design interno del libro. Benoît è l'autore di <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — lo strumento che ci ha permesso di convertire il testo in Latex (e poi in PDF). Sébastien è il designer che ha creato l'impaginazione di questo bel libro e Jean-Côme è l'esperto di LaTeX che lo ha implementato come foglio di stile usabile con dblatex. Grazie ragazzi per tutto il duro lavoro!
ja_jp: もしあなたがこの本のペーパーバック版を読んでいるのなら、我々と一緒に本の内部デザインを担当した Benoît Guillon さん、Jean-Côme Charpentier さん、Sébastien Mengin さんに感謝しましょう。Benoît さんは <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> (DocBook を LaTeX さらに PDF に変換するツール) の上流開発者です。Sébastien さんは素晴らしいレイアウトを作成したデザイナーで、Jean-Côme さんはレイアウトを dblatex で利用可能なスタイルシートに実装した LaTeX の専門家です。皆さんの大変な努力に感謝しています!
pl_pl: Jeżeli masz przyjemność czytać te wersy z papierowego egzemplarza książki, to powinieneś razem z nami podziękować Benoît Guillon, Jean-Côme Charpentier i Sébastien Mengin, którzy pracowali nad projektem wnętrza książki. Benoît jest wiodącym autorem <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> - narzędzia, którego używaliśmy, aby skonwertować DocBook na LaTeX (a później PDF). Sébastien jest projektantem, który stworzył ten ładny wygląd książki oraz Jean-Côme jest ekspertem LaTeX, który zaimplementował go jako arkusz stylów użyteczny z dblatex. Dzięki wam panowie za waszą ciężką pracę!
pt_br: Se você tiver o prazer de ler estas linhas num exemplar de bolso do livro, então você deve se juntar a nós para agradecer a Benoît Guillon, Jean-Côme Charpentier, e Sébastien Mengin que trabalharam no projeto interno do livro. Benoît é o autor principal do <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> - a ferramenta que usamos para converter o DocBook em LaTeX (e em PDF). Sébastien é o designer que criou este bom layout do livro e Jean-Côme é o especialista em LaTeX que implementou ele como uma folha de estilo utilizável com dblatex. Obrigado rapazes por todo o trabalho duro!
zh_cn: 如果你有幸是在看本书的纸质版，那么你要和我们一起感谢 Benoît Guillon，Jean-Côme Charpentier 和 Sébastien Mengin，他们为书本内页做了设计。Benoît 是 <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> 的上游作者，我们就是用它来把 DocBook 格式转换成 LaTeX 格式（再转成 PDF 格式）。Sébastien 是创造了这个优美布局的设计师，Jean-Côme 则是把它实现成 dblatex 可用的样式表的 LaTeX 专家。感谢你们的辛勤工作！

source: Finally, thank you to Thierry Stempfel for the nice pictures introducing each chapter, and thank you to Doru Patrascu for the beautiful book cover.
ar_ma: أخيراً، شكراً لك Thierry Stempfel على الصور التقديمية الجميلة بين الفصول، وشكراً لك Doru Patrascu على غلاف الكتاب الجميل.
el_gr: Τέλος, ευχαριστώ τον Thierry Stempfel για τις ωραίες φωτογραφίες που εισάγουν κάθε κεφάλαιο και ευχαριστώ τον Doru Patrascu για το ωραίο εξώφυλλο.
es_es: Finalmente, gracias a Thierry Stempfel por las bonitas imágenes que aparecen en la presentación de cada capítulo y gracias a Doru Patrascu por la bonita cubierta del libro.
fr_fr: Pour finir, merci à Thierry Stempfel pour les belles photos qui ornent chaque début de chapitre, et à Doru Patrascu pour la belle couverture.
it_it: Infine, grazie a Thierry Stempfel per le belle immagini che introducono ogni capitolo e grazie a Doru Patrascu per la bellissima copertina.
ja_jp: 最後に、各章に挿入されている素晴らしい挿絵を担当した Thierry Stempfel さん、美しい本の表紙を担当した Doru Patrascu さんに感謝します。
pl_pl: Wreszcie, podziękowania dla Thierry Stempfel za ładne obrazki wprowadzające do każdego rozdziału i podziękowania dla Doru Patrascu za piękną okładkę książki.
pt_br: Finalmente, obrigado a Thierry Stempfel pelas belas figuras inseridas em cada capítulo, e obrigado a Doru Patrascu pela bela capa do livro.
zh_cn: 最后，感谢 Thierry Stempfel 为每一章带来的精美图片，感谢 Doru Patrascu 的漂亮的封面。

source: Personal Acknowledgments from Raphaël
ar_ma: شكر وتقدير شخصي من رافائيل
el_gr: Προσωπικές Παραδοχές του Raphaël
es_es: Reconocimientos personales de Raphaël
fr_fr: Remerciements personnels de Raphaël
it_it: Ringraziamenti personali di Raphaël
ja_jp: Raphaël さんからの個人的なお礼
pl_pl: Osobiste Podziękowania od Raphaël'a
pt_br: Agradecimentos pessoais de Raphaël
zh_cn: Raphaël 的个人致谢

source: First off, I would like to thank Nat Makarévitch, who offered me the possibility to write this book and who provided strong guidance during the year it took to get it done. Thank you also to the fine team at Eyrolles, and Muriel Shan Sei Fan in particular. She has been very patient with me and I learned a lot with her.
ar_ma: أولاً، أود أن أشكر Nat Makarevitch، الذي أتاح لي فرصة تأليف هذا الكتاب، والذي وفر توجيهات سديدة أثناء العام الذي أنفقناه على إنجازه .شكراً أيضاً للفريق الرائع في Eyrolles، وشكراً لكِ Muriel Shan Sei Fan على وجه الخصوص. لقد كانت صبورة جداً معي وقد تعلمت الكثير معها.
es_es: En primer lugar me gustaría dar las gracias a Nat Makarévitch, quien me ofreció la posibilidad de escribir este libro y quien me orientó durante el año que tomó hacerlo. Gracias también al buen equipo de Eyrolles y a Muriel Shan Sei Fan en particular. Ella ha sido muy paciente conmigo y he aprendido mucho con ella.
fr_fr: Tout d'abord, je voudrais remercier Nat Makarévitch, qui m'a offert la possibilité de rédiger ce livre et qui m'a guidé tout au long de l'année où je l'ai écrit. Merci aussi à toute la fine équipe d'Eyrolles, et en particulier Muriel Shan Sei Fan. Elle a été très patiente avec moi et j'ai appris beaucoup d'elle. Et je n'oublie bien sûr pas Sophie Hincelin et Anne Bougnoux.
ja_jp: 最初に私は、この本を書く機会と仕事を完遂するまでの間に重要な助言を頂いた、Nat Makarévitch さんに感謝します。さらに Eyrolles の素晴らしいチーム、特に Muriel Shan Sei Fan さんに感謝します。彼女は辛抱強く、私は彼女から多くのことを学びました。
pt_br: Primeiro, eu gostaria de agradecer a Nat Makarévitch, que me ofereceu a possibilidade de escrever este livro e que forneceu uma orientação muito forte durante o ano que levou para fazê-lo. Obrigado também à boa equipe da Eyrolles, e Muriel Shan Sei Fan em particular. Ela foi muito paciente comigo e eu aprendi muito com ela.
zh_cn: 首先，我要感谢 Nat Makarévitch，是他给了我写这本书的机会，并且在我写它的这些年给了我强而有力的指导。也感谢 Eyrolles 的优秀团队，特别是 Muriel Shan Sei Fan。她对我很有耐心，我也从她那里学到很多。

source: The period of the Ulule campaigns were very demanding for me but I would like to thank everybody who helped to make them a success, and in particular the Ulule team who reacted very quickly to my many requests. Thank you also to everybody who promoted the operations. I don't have any exhaustive list (and if I had it would probably be too long) but I would like to thank a few people who were in touch with me: Joey-Elijah Sneddon and Benjamin Humphrey of OMG! Ubuntu, Florent Zara of LinuxFr.org, Manu of Korben.info, Frédéric Couchet of April.org, Jake Edge of Linux Weekly News, Clement Lefebvre of Linux Mint, Ladislav Bodnar of Distrowatch, Steve Kemp of Debian-Administration.org, Christian Pfeiffer Jensen of Debian-News.net, Artem Nosulchik of LinuxScrew.com, Stephan Ramoin of Gandi.net, Matthew Bloch of Bytemark.co.uk, the team at Divergence FM, Rikki Kite of Linux New Media, Jono Bacon, the marketing team at Eyrolles, and numerous others that I have forgotten (sorry about that).
ar_ma: على الرغم من أن فترة حملات Ulule كانت متعبة لي ولكن أوّد أن أشكر كل من ساعدني على إنجاحها، خصوصاً فريق Ulule الذي كان يتفاعل بشكل سريع جداً مع كل طلباتي. وشكراً لكل من ساهم بالترويج لهذه العمليات. لا أملك لائحة شاملة (لكن لو كانت موجودة فسوف تكون طويلة جداً على الأغلب) ولكن أرغب بشكر أشخاص قلائل كانوا على اتصال بي: Joey-Elijah Sneddon و Benjamin Humphrey من OMG! Ubuntu، و Frédéric Couchet من April.org و Jake Edge من Linux Weekly News و Clement Lefebvre من لينكس منت و Ladislav Bodnar من Distrowatch و Steve Kemp من Debian-Administration.org و Christian Pfeiffer Jensen من Debian-News.net و Artem Nosulchik من LinuxScrew.com و Stephan Ramoin من Gandi.net و Matthew Bloch من Bytemark.co.uk وفريق Divergence FM و Rikki Kite من Linux New Media و Jono Bacon وفريق التسويق في Eyrolles، والكثيرون الذين نسيت أسمائهم (أعتذر عن ذلك).
es_es: El período de tiempo que duraron las campañas de Ulule fue muy exigente para mí, pero me gustaría dar las gracias a todos los que colaboraron para que fueran un éxito y, en particular, al equipo de Ulule que respondió muy rápidamente a mis muchas peticiones. Gracias también a todos los que promocionaron los proyectos. No tengo ninguna lista donde se recoja de forma exhaustiva todas las personas que me ayudaron (y si la tuviera problablemente sería demasiado larga), pero me gustaría dar las gracias a algunas personas que estuvieron en contacto conmigo: Joey-Elijah Sneddon y Benjamin Humphrey de OMG! Ubuntu, Florent Zara de LinuxFr.org, Manu de Korben.info, Frédéric Couchet de April.org, Jake Edge de Linux Weekly News, Clement Lefebvre de Linux Mint, Ladislav Bodnar de Distrowatch, Steve Kemp de Debian-Administration.org, Christian Pfeiffer Jensen de Debian-News.net, Artem Nosulchik de LinuxScrew.com, Stephan Ramoin de Gandi.net, Matthew Bloch de Bytemark.co.uk, el equipo de Divergence FM, Rikki Kite de Linux New Media, Jono Bacon, el equipo de márketing de Eyrolles y otros muchos que me he olvidado (siento haberlos olvidado).
fr_fr: La période de la campagne Ulule a été très éprouvante pour moi, mais je voudrais remercier tous ceux qui en ont fait un succès, en particulier l'équipe d'Ulule, qui a toujours réagi très rapidement à mes nombreuses demandes. Merci également à tous ceux qui ont fait la promotion de l'opération. Je n'ai pas de liste exhaustive (et elle serait de toute façon trop longue si j'en avais une), mais je voudrais remercier quelques-unes des personnes qui m'ont contacté : Joey-Elijah Sneddon et Benjamin Humphrey d'OMG! Ubuntu, Florent Zara de LinuxFr.org, Manu de Korben.info, Frédéric Couchet de l'April, Jake Edge de Linux Weekly News, Clement Lefebvre de Linux Mint, Ladislav Bodnar de Distrowatch, Steve Kemp de Debian-Administration.org, Christian Pfeiffer Jensen de Debian-News.net, Artem Nosulchik de LinuxScrew.com, Stephan Ramoin de Gandi.net, Matthew Bloch de Bytemark.co.uk, l'équipe de Divergence FM, Rikki Kite de Linux New Media, Jono Bacon, l'équipe du marketing chez Eyrolles et les nombreux autres que j'oublie malheureusement.
ja_jp: Ulule でのキャンペーン期間は私にとって大変な努力が必要でしたが、キャンペーン成功の手助けをしてくれた全ての方々、特にたび重なる要求に応えてくれた Ulule チームに感謝しています。このキャンペーンを宣伝してくれたすべての人に感謝しています。完全なリストを持ってませんが (持っていたらたぶんそれは長すぎるものになるでしょう)、私に連絡をくれた幾人かの人に感謝します。OMG! Ubuntu の Joey-Elijah Sneddon さんと Benjamin Humphrey さん、LinuxFr.org の Florent Zara さん、Korben.info の Manu さん、April.org の Frédéric Couchet さん、Linux Weekly News の Jake Edge さん、Linux Mint の Clement Lefebvre さん、Distrowatch の Ladislav Bodnar さん、Debian-Administration.org の Steve Kemp さん、Debian-News.net の Christian Pfeiffer Jensen さん、LinuxScrew.com の Artem Nosulchik さん、Gandi.net の Stephan Ramoin さん、Bytemark.co.uk の Matthew Bloch さん、Divergence FM のチーム、Linux New Media の Rikki Kite さん、Jono Bacon さん、Eyrolles のマーケティングチーム、そして忘れてしまった非常に多くの人々 (ごめんなさい)。
pt_br: O período das campanhas na Ulule exigiu muito de mim, mas eu gostaria de agradecer a todos que ajudaram a torná-la um sucesso, e em particular à equipe da Ulule que respondeu muito rapidamente aos meus pedidos. Obrigado também a todos que promoveram as operações. Eu não tenho qualquer lista exaustiva (e se eu tivesse seria provavelmente muito longa), mas eu gostaria de agradecer a algumas pessoas que estavam em contato comigo: Joey-Elias Sneddon e Benjamin Humphrey da OMG! Ubuntu, Florent Zara da LinuxFr.org, Manu da Korben.info, Frédéric Couchet da April.org, Jake Edge da Linux Weekly News, Clement Lefebvre do Linux Mint, Ladislav Bodnar do Distrowatch, Steve Kemp do Debian-Administration.org, Christian Pfeiffer Jensen do Debian-News.net, Artem Nosulchik de LinuxScrew.com, Stephan Ramoin do Gandi.net, Matthew Bloch do Bytemark.co.uk, a equipe da Divergence FM, Rikki Kite da Linux New Media, Jono Bacon, a equipe de marketing da Eyrolles, e muitos outros que esqueci ( me desculpem por isto).

source: I would like to address a special thanks to Roland Mas, my co-author. We have been collaborating on this book since the start and he has always been up to the challenge. And I must say that completing the Debian Administrator's Handbook has been a lot of work…
ar_ma: وأرغب في توجيه شكر خاص لرولاند ماس، المؤلف المشارك.حيث تعاونّا على هذا الكتاب منذ البداية وقد كان دائماً على مستوى التحدي. ويجب أن أقول أن إكمال دفتر مدير دبيان تطلب الكثير من العمل…
el_gr: Θα ήθελα ν' απευθύνω πολλά-πολλά ευχαριστώ στον Roland Mas, συνεργάτη-συγγραφής. Έχουμε συνεργαστεί απο την αρχή γι' αυτό το βιβλίο και που ήταν πάνω απο κάθε πρόκληση και πρέπει να πώ ότι το να τελειώσει το Debian Administrator's Handbook είχε όντως πολύ δουλειά...
es_es: Me gustaría hacer llegar mi agradecimiento personal a Roland Mas, mi co-autor. Hemos estado colaborando en este libro desde el principio y siempre ha estado a la altura del desafío. Y debo decir que completar el Libro del administrador de Debian ha sido un montón de trabajo…
fr_fr: Je voudrais remercier tout spécialement Roland Mas, mon co-auteur. Nous avons travaillé ensemble sur ce livre depuis le début et il a toujours été à la hauteur du défi. Et je dois avouer que terminer ce cahier de l'administrateur Debian a été un sacré défi…
it_it: Voglio indirizzare un ringraziamento speciale a Roland Mas, mio co-autore. Abbiamo collaborato a questo libro sin dall'inizio e lui è sempre stato all'altezza della sfida, devo anche dire che il completamento del Debian Administrator's Handbook ha comportato un sacco di lavoro…
ja_jp: 共著者である Roland Mas さんには特に感謝したいです。我々は初めからずっとこの本を共同で制作し、彼は常に挑戦的な課題に対して意欲的でした。Debian 管理者ハンドブックを完成させることは大変な仕事でしたと言っておかなければいけません。
pl_pl: Specjalne podziękowania dedykuję Roland Mas, współautorowi. Współpracowaliśmy nad tą książką od samego początku i zawsze był gotów podejmować wyzwania. Muszę przyznać, że ukończenie Podręcznika Administratora Debiana wymagało dużo pracy...
pt_br: Gostaria de enviar um agradecimento especial a Roland Mas, meu co-autor. Temos tido a colaboração neste livro desde o início e ela sempre esteve à altura do desafio. E devo dizer que a conclusão do Manual do Administrador Debian foi muito trabalhosa…
zh_cn: 我要特别感谢我的共同执笔人 Roland Mas。我们从一开始就合作这本书，他总是敢于直面挑战。我必须承认，完成这本书 《Debian 管理员手册》的工作量真是大……
