Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: At the end of the journey, our hypothetical package is now included in the stable distribution. This journey, not without its difficulties, explains the significant delays separating the Debian Stable releases. This contributes, over all, to its reputation for quality. Furthermore, the majority of users are satisfied using one of the three distributions simultaneously available. The system administrators, concerned above all about the stability of their servers, don't need the latest and greatest version of GNOME; they can choose Debian <emphasis role="distribution">Stable</emphasis>, and they will be satisfied. End users, more interested in the latest versions of GNOME or KDE than in rock-solid stability, will find Debian <emphasis role="distribution">Testing</emphasis> to be a good compromise between a lack of serious problems and relatively up to date software. Finally, developers and more experienced users may blaze the trail, testing all the latest developments in Debian <emphasis role="distribution">Unstable</emphasis> right out of the gate, at the risk of suffering the headaches and bugs inherent in any new version of a program. To each their own Debian!
ja_jp: 最後に、仮想パッケージが安定版ディストリビューションに取り込まれます。ここに到達するまでには大変な苦労があり、Debian 安定版のリリースが極めてゆっくりと進む理由がお分かりになったと思います。この遅さは品質評価に貢献します。しかも、大多数のユーザは同時に利用可能な 3 つのディストリビューションのうち 1 つを使えば満足です。システム管理者は、何よりもまず彼らのサーバの安定性を重要視しており、最新バージョンの GNOME は必要ありません; 彼らは Debian <emphasis role="distribution">安定版</emphasis>を選んで、それに満足するでしょう。エンドユーザは、強固な安定性よりも最新バージョンの GNOME や KDE に興味があり、Debian <emphasis role="distribution">テスト版</emphasis>を選ぶでしょう。このディストリビューションは深刻な問題が少なく、比較的新しいソフトウェアが使えるという意味で両者の良い妥協点です。最後に、開発者と経験豊富なユーザは道を切り開くかもしれません。彼らは Debian <emphasis role="distribution">不安定版</emphasis>になされた全ての最新の開発を真っ先にテストし、面倒事とプログラムの新しいバージョンにつきものであるバグに苦しむという危険を冒します。人それぞれ好みの Debian があるのです!
pt_br: No fim da viagem: Nosso pacote hipotético está agora incluído na distribuição estável. Esta viagem, não sem dificuldades, explica os atrasos significativos que separam os lançamentos do Debian Estável. Isso contribui, sobretudo, para sua reputação de qualidade. Além disso, a maioria dos usuários está satisfeita usando uma das três distribuições simultaneamente disponíveis. Os administradores de sistema, preocupados acima de tudo com a estabilidade de seus servidores, não precisam da última e melhor versão do GNOME; eles podem escolher o Debian <emphasis role="distribution">Estável</emphasis>, e estarão satisfeitos. Os usuários finais, mais interessados nas versões mais recentes do GNOME ou KDE do que em uma estabilidade sólida, acharão o Debian <emphasis role="distribution">Teste</emphasis> um bom meio-termo entre a ausência de problemas graves e softwares relativamente mais atuais. Finalmente, os desenvolvedores e usuários mais experientes podem desbravar a trilha, testando todos os últimos desenvolvimentos no Debian <emphasis role="distribution">Instável</emphasis> direto da fonte, correndo o risco de sofrer as dores de cabeça e erros inerentes a qualquer nova versão de um programa. Cada um com o seu Debian!

source: <emphasis>CULTURE</emphasis> GNOME and KDE, graphical desktop environments
ja_jp: <emphasis>CULTURE</emphasis> GNOME と KDE、グラフィカルデスクトップ環境
pt_br: <emphasis>CULTURA</emphasis> GNOME and KDE, ambientes gráficos de desktop

source: GNOME (GNU Network Object Model Environment) and KDE (K Desktop Environment) are the two most popular graphical desktop environments in the free software world. A desktop environment is a set of programs grouped together to allow easy management of the most common operations through a graphical interface. They generally include a file manager, office suite, web browser, e-mail program, multimedia accessories, etc. The most visible difference resides in the choice of the graphical library used: GNOME has chosen GTK+ (free software licensed under the LGPL), and KDE has selected Qt (a company-backed project, available nowadays both under the GPL and a commercial license). <ulink type="block" url="http://www.gnome.org/" /> <ulink type="block" url="http://www.kde.org/" />
ja_jp: GNOME (GNU Network Object Model Environment) と KDE (K Desktop Environment) はフリーソフトウェア世界で最も人気のあるグラフィカルデスクトップ環境です。デスクトップ環境とは、グラフィカルインターフェイスに対する最も一般的な操作を簡単に管理できるようにするための、プログラム集です。一般にデスクトップ環境には、ファイルマネージャ、オフィススイート、ウェブブラウザ、電子メールプログラム、マルチメディアアクセサリなどが含まれています。もっとも明らかな違いは使用しているグラフィカルライブラリの違いにあります: GNOME は GTK+ (LGPL のフリーソフトウェア) を使い、KDE は Qt (企業が支援するプロジェクト、現在は GPL と商用ライセンスの両方で利用可能) を使っています。<ulink type="block" url="http://www.gnome.org/" /> <ulink type="block" url="http://www.kde.org/" />
pt_br: GNOME (GNU Network Object Model Environment) e KDE (K Desktop Environment) são os dois ambientes gráficos mais populares de desktop no mundo do software livre. Um ambiente de desktop é um conjunto de programas agrupados para permitir o fácil gerenciamento das operações mais comuns através de uma interface gráfica. Eles geralmente incluem um gerenciador de arquivos, suíte de escritório, navegador web, programa de e-mail, acessórios multimídia, etc. A diferença mais visível reside na escolha da biblioteca gráfica utilizada: GNOME escolheu GTK + (software livre licenciado sob a LGPL), e o KDE selecionou o Qt (um projeto mantido por uma empresa, agora licenciada sob a licença GPL euma licença comercial). <ulink type="block" url="http://www.gnome.org/" /> <ulink type="block" url="http://www.kde.org/" />

source: Chronological path of a program packaged by Debian
ja_jp: Debian のパッケージ化するプログラムが時間ごとに辿る経路
pt_br: Trilha Cronológica de um pacote de programas do Debian

source: <primary>GNU</primary><secondary>General Public License</secondary>
ja_jp: <primary>GNU</primary><secondary>一般公衆利用許諾書</secondary>

source: <primary>General Public License</primary>
ja_jp: <primary>一般公衆利用許諾書</primary>

source: <primary>copyleft</primary>
ja_jp: <primary>コピーレフト</primary>

source: <primary>copyrights</primary>
ja_jp: <primary>著作権</primary>

source: <primary>Toy Story</primary>
ja_jp: <primary>トイ・ストーリー</primary>

source: <primary>flamewar</primary>
ja_jp: <primary>罵り合戦</primary>

source: <primary>patch</primary>
ja_jp: <primary>パッチ</primary>

source: <primary><emphasis role="distribution">Testing</emphasis></primary>
ja_jp: <primary><emphasis role="distribution">テスト版</emphasis></primary>

source: <primary><emphasis role="distribution">Experimental</emphasis></primary>
ja_jp: <primary><emphasis role="distribution">実験版</emphasis></primary>

source: <primary>autobuilder</primary>
ja_jp: <primary>自動ビルドロボット</primary>
