Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: More general (and regular) news about Debian are sent to the <email>debian-news@lists.debian.org</email> list. The traffic on this list is quite reasonable too (usually around a handful of messages a month), and it includes the semi-regular “Debian Project News”, which is a compilation of various small bits of information about what happens in the project. Since all Debian developers can contribute these news when they think they have something noteworthy to make public, the DPN gives a valuable insight while staying rather focused on the project as a whole.
ja_jp: Debian に関するより一般的 (定期的) なニュースは <email>debian-news@lists.debian.org</email> を通じて送られます。このメーリングリストの流量もまた極めて合理的 (通常 1 か月に数通) で、準定期的な「Debian プロジェクトニュース (DPN)」はこのメーリングリストを通じて発信されます。プロジェクトニュースには、プロジェクトで起きたことに関するさまざまなちょっとした情報が載せられています。全ての Debian 開発者は、公開するに値する情報があると感じたら、このニュースに寄稿することができます、DPN はプロジェクト全体を俯瞰し続けると同時に、有益な本質を提供しています。
pt_br: Mais notícias em geral (e regular) sobre o Debian são enviados para a lista <email>debian-news@lists.debian.org</email>. O tráfego nesta lista é bastante razoável também (geralmente em torno de um punhado de mensagens por mês), e inclui o semi-regular "Notícias do Projeto Debian", que é uma compilação de várias pequenas partes de informação sobre o que acontece no projeto. Uma vez que todos os desenvolvedores Debian pode contribuir nestas notícias, quando eles pensam que têm algo notável para tornar público, o DPN dá uma visão valiosa enquanto se mantém bastante focado no projeto como um todo.

source: <emphasis>COMMUNITY</emphasis> The publicity and press teams
ja_jp: <emphasis>COMMUNITY</emphasis> 広報と出版チーム
pt_br: <emphasis>COMUNIDADE</emphasis> Os times de publicidade e imprensa

source: Debian's official communication channels are managed by volunteers of the Debian publicity team and of the press team. Members of the latter are delegates of the Debian Project Leader and handle official press releases. The publicity team is much less formal and welcomes contributions from everybody, be it to write articles for “Debian Project News” or to animate the <emphasis>@debian</emphasis> Identi.ca microblogging account. <ulink type="block" url="http://wiki.debian.org/Teams/Press" /> <ulink type="block" url="http://wiki.debian.org/Teams/Publicity" />
ja_jp: Debian 公式の連絡チャンネルは Debian の広報チームと出版チームのボランティアによって管理されています。チームのメンバーは Debian プロジェクトリーダーの代理人であり、公式プレスリリースを担当しています。広報チームはかなりざっくばらんで、誰からの貢献でも歓迎しています。このチームが「Debian プロジェクトニュース」の記事を書いたり、<emphasis>@debian</emphasis> Identi.ca マイクロブログアカウントを活気づけています。<ulink type="block" url="http://wiki.debian.org/Teams/Press" /> <ulink type="block" url="http://wiki.debian.org/Teams/Publicity" />
pt_br: Os canais de comunicação oficiais do Debian são gerenciados por voluntários do time de publicidade Debian e do time de imprensa. Membros deste último são delegados do líder do projeto Debian e lidam com com os lançamentos oficiais de imprensa. O time de publicidade é muito menos formal e aceita contribuições de todo mundo, seja para escrever artigos para a “Notícias do Projeto Debian” ou para animar a conta de microblog do Identi.ca <emphasis>@debian</emphasis>. <ulink type="block" url="http://wiki.debian.org/Teams/Press" /> <ulink type="block" url="http://wiki.debian.org/Teams/Publicity" />

source: For more information about the evolution of Debian and what is happening at some point in time in various teams, there's also the <email>debian-devel-announce@lists.debian.org</email> list. As its name implies, the announcements it carries will probably be more interesting to developers, but it also allows interested parties to keep an eye on what happens in more concrete terms than just when a stable version is released. While <email>debian-announce</email> gives news about the user-visible results, <email>debian-devel-announce</email> gives news about how these results are produced. As a side note, “d-d-a” (as it is sometimes referred to) is the only list that Debian developers must be subscribed to.
ja_jp: Debian の進化とある時点に個々のチームで何が起きているのかについてより詳しい情報を得るには、<email>debian-devel-announce@lists.debian.org</email> メーリングリストを参照してください。その名前が意味する通り、送られてくる告知は恐らく開発者がより興味を持ちそうなものでしょう、しかしこのメーリングリストを使って、関係者はより具体的なチームで起きていることから、安定版がリリースされたときだけでなく、常に目を離さないでいることも可能です。<email>debian-announce</email> はユーザが見ることができる結果についてニュースを配信するのに対して、<email>debian-devel-announce</email> はその結果がどのようにして引き起こされたかについてニュースを配信します。注釈として、「d-d-a」(このメーリングリストはときどきそう呼ばれます) だけは Debian 開発者ならば誰でも必ず購読しなければいけません。
pt_br: Para mais informações sobre a evolução do Debian e o que está acontecendo num momento em vários times, existe também a lista <email>debian-devel-announce@lists.debian.org</email>. Como o próprio nome indica, os anúncios publicados lá são mais interessantes para desenvolvedores, mas também serve para que parceiros interessados mantenham um olho no que acontece em termos mais concretos do que apenas ver quando a versão estável é lançada. Enquanto a <email>debian-announce</email> dá notícias sobre resultados visíveis para usuários, a <email>debian-devel-announce</email> dá notícias sobre como estes resultados foram produzidos. Uma observação, a “d-d-a” (como é às vezes chamada) é a única lista na qual desenvolvedores Debian devem estar inscritos.

source: <primary>Planet Debian</primary>
pt_br: <primary>Planeta Debian</primary>

source: A more informal source of information can also be found on Planet Debian, which aggregates articles posted by Debian contributors on their respective blogs. While the contents do not deal exclusively with Debian development, they provide a view into what is happening in the community and what its members are up to. <ulink type="block" url="http://planet.debian.org/" />
ja_jp: より非公式な情報ソースが Planet Debian にあります。これは Debian 貢献者が自分のブログに投稿した記事を収集しています。内容は Debian 開発の話題に限ったものではありませんが、貢献者たちは、コミュニティの中で何が起きているか、メンバーが何をする予定であるか、について見解を示します。<ulink type="block" url="http://planet.debian.org/" />
pt_br: Pode encontrar também uma fonte de informações no Planeta Debian, que agrega artigos postados por colaboradores do Debian em seus respectivos blogs. Embora o conteúdo não lidam exclusivamente com o desenvolvimento do Debian, eles fornecem uma visão sobre o que está acontecendo na comunidade e quais seus membros estão fazendo. <ulink type="block" url="http://planet.debian.org/" />

source: <primary>social networks</primary>
ja_jp: <primary>ソーシャルネットワーク</primary>
pt_br: <primary>redes sociais</primary>

source: <primary>network</primary><secondary>social networks</secondary>
ja_jp: <primary>ネットワーク</primary><secondary>ソーシャルネットワーク</secondary>
pt_br: <primary>redes</primary><secondary>redes sociais</secondary>

source: The project is also well represented on social networks. While Debian only has an official presence on platforms built with free software (like the Identi.ca microblogging platform, powered by <emphasis>pump.io</emphasis>), there are many Debian contributors who are animating Twitter accounts, Facebook pages, Google+ pages, and more. <ulink type="block" url="https://identi.ca/debian" /> <ulink type="block" url="https://twitter.com/debian" /> <ulink type="block" url="https://www.facebook.com/debian" /> <ulink type="block" url="https://plus.google.com/111711190057359692089" />
ja_jp: ソーシャルネットワーク上では頻繁に Debian プロジェクトを見かけることもあります。Debian が公式に存在するのはフリーソフトウェアで作り上げられたサービス (<emphasis>pump.io</emphasis> で動く Identi.ca マイクロブログサービス) 上だけですが、多くの Debian 貢献者が Twitter アカウント、Facebook ページ、Google+ ページなどを賑わしています。<ulink type="block" url="https://identi.ca/debian" /> <ulink type="block" url="https://twitter.com/debian" /> <ulink type="block" url="https://www.facebook.com/debian" /> <ulink type="block" url="https://plus.google.com/111711190057359692089" />
pt_br: O projeto também está bem representado nas redes sociais. Enquanto o Debian só tem uma presença oficial nas plataformas construídas com software livre (como a plataforma de microblogging Identi.ca, que funciona com <emphasis>pump.io</emphasis>), há muitos colaboradores Debian que mantém contas de Twitter, páginas do Facebook, páginas Google+ e muito mais. <ulink type="block" url="https://identi.ca/debian" /> <ulink type="block" url="https://twitter.com/debian" /> <ulink type="block" url ="https://www.facebook.com/debian"/> <ulink type="block" url="https://plus.google.com/111711190057359692089" />

source: The Role of Distributions
ja_jp: ディストリビューションの役割
pt_br: O Papel das Distribuições

source: <primary>Linux distribution</primary><secondary>role</secondary>
ja_jp: <primary>Linux ディストリビューション</primary><secondary>役割</secondary>
pt_br: <primary>distribuição Linux</primary><secondary>papel</secondary>

source: A GNU/Linux distribution has two main objectives: install a free operating system on a computer (either with or without an existing system or systems), and provide a range of software covering all of the users' needs.
ja_jp: GNU/Linux ディストリビューションには 2 つの目標があります: フリーなオペレーティングシステムをコンピュータにインストールすること (すでにシステムが存在しているか否かにかかわらず)、そしてすべてのユーザからの必要性を満足する広範なソフトウェアを提供すること、です。
pt_br: Uma distribuição GNU / Linux tem dois objetivos principais: instalar um sistema operacional livre em um computador (com ou sem um sistema existente ou sistemas), e fornecer uma gama de software que abrange todas necessidades dos usuários.

source: The Installer: <command>debian-installer</command>
ja_jp: インストーラ: <command>debian-installer</command>
pt_br: O Instalador: <command>debian-installer</command>

source: The <command>debian-installer</command>, designed to be extremely modular in order to be as generic as possible, targets the first objective. It covers a broad range of installation situations and in general, greatly facilitates the creation of a derivative installer corresponding to a particular case.
ja_jp: <command>debian-installer</command> は可能な限り一般性を保ちつつモジュール式に設計されており、上で述べた 1 つ目の目標を達成しています。このインストーラは多様なインストール状況に対応しており、一般に、特定の事例向けに作られた派生物がインストーラを作成することを非常に容易にしています。
pt_br: O <command>debian-installer</command>, projetado para ser extremamente modular, a fim de ser o mais genérico possível, destina-se ao primeiro objetivo. Abrange ampla gama de situações de instalação e em geral facilita grandemente a criação de um instalador derivado adequando-se a um caso particular.

source: This modularity, which also makes it very complex, may be daunting for the developers discovering this tool; but whether used in graphical or text mode, the user's experience is still similar. Great efforts have been made to reduce the number of questions asked at installation time, in particular thanks to the inclusion of automatic hardware detection software.
ja_jp: モジュール性はインストーラをとても複雑にしており、開発者がこのツールの詳細を探ることが難しくなっているかもしれません; しかし、グラフィカルとテキストモードのどちらを使っても、ユーザ体験は同じ状態が保たれています。インストール時に感じる疑問の数を減らすために、多大な努力が費やされました。とくに自動ハードウェア検知ソフトウェアはこれに大きく貢献しました。
pt_br: Esta modularidade, que o torna também muito complexo, pode incomodar os desenvolvedores que estão descobrindo esta ferramenta; queira utilizando no modo gráfico ou modo texto, a experiência do usuário ainda é semelhante. Grandes esforços têm sido feitos para reduzir o número de perguntas em tempo de instalação, em particular graças a inclusão do software de detecção automática de hardware.

source: It is interesting to note that distributions derived from Debian differ greatly on this aspect, and provide a more limited installer (often confined to the i386 or amd64 architectures), but more user-friendly for the uninitiated. On the other hand, they usually refrain from straying too far from package contents in order to benefit as much as possible from the vast range of software offered without causing compatibility problems.
ja_jp: ここで興味を持って注目すべき点は、Debian から派生したディストリビューションは一般化と全く違う姿勢を取り、提供するインストーラをさらに制限して (i386 と amd64 アーキテクチャに限定していることが多い)、初心者にとってさらに使いやすくしているという点です。他方で、パッケージの中身については派生ディストリビューションはこれを改変し過ぎないようにしています、これは提供されている様々なソフトウェアから互換性問題を起こさずに可能な限り大きな恩恵を受けるためです。
pt_br: É interessante notar que as distribuições derivadas do Debian diferem muito sobre este aspecto, e fornecem um instalador mais limitado (muitas vezes confinado à arquitetura i386 ou amd64), mas mais amigável para os não iniciados. Por outro lado, eles costumam se abster de se afastar muito do conteúdo do pacote, a fim de se beneficiar tanto quanto possível da vasta gama de softwares oferecidos sem causar problemas de compatibilidade.

source: The Software Library
ja_jp: ソフトウェアライブラリ
pt_br: A Biblioteca de Software

source: Quantitatively, Debian is undeniably the leader in this respect, with over 17,300 source packages. Qualitatively, Debian’s policy and long testing period prior to releasing a new stable version justify its reputation for stability and consistency. As far as availability, everything is available on-line through many mirrors worldwide, with updates pushed out every six hours.
ja_jp: 量的な意味で、17,300 を超えるソースパッケージを備える Debian がリーダーなのは間違いありません。質的な意味で、Debian のポリシーと新しい安定版のりリス前に設けられる長いテスト期間は安定度と整合性の評判に嘘がないこと証明しています。入手可能性に関する限り、全ては世界中の多くのミラーを通じてオンライン上で入手可能で、更新は 6 時間ごとに配信されます。
pt_br: Quantitativamente, o Debian é inegavelmente o líder nesse aspecto, com mais de 17.300 pacotes fonte. Qualitativamente, a política do Debian e o longo período de testes antes de liberar uma nova versão estável justificam a sua reputação para a estabilidade e consistência. Quanto a disponibilidade, tudo está disponível online através de muitos espelhos ao redor do mundo atualizados a cada seis horas.

source: Many retailers sell CD-ROMs on the Internet at a very low price (often at cost), the “images” for which are freely available for download. There is only one drawback: the low frequency of releases of new stable versions (their development sometimes takes more than two years), which delays the inclusion of new software.
ja_jp: 多くの小売業者がインターネット上で CD-ROM を極めて低価格 (通常実費のみ) で販売しており、「イメージ」は自由にダウンロードできます。欠点は 1 つしかありません: 新しい安定版のリリース頻度が低いこと (開発には 2 年以上かかる場合もあります) です、この欠点により新しいソフトウェアが導入される時期が後ろにずれます。
pt_br: Muitos varejistas vendem CD-ROMs na Internet a um preço muito baixo (muitas vezes a preço de custo), para as quais as "imagens" estão disponíveis gratuitamente para download. Há apenas um inconveniente: a baixa frequência de lançamentos de novas versões estáveis (o seu desenvolvimento, às vezes leva mais de dois anos), o que atrasa a inclusão de um novo software.

source: Most new free software programs quickly find their way into the development version which allows them to be installed. If this requires too many updates due to their dependencies, the program can also be recompiled for the stable version of Debian (see <xref linkend="debian-packaging" /> for more information on this topic).
ja_jp: 新しいフリーソフトウェアプログラムの多くは素早く開発版に取り込まれます、開発版では新しいソフトウェアをインストールできます。新しいソフトウェアから依存パッケージに対して要求する更新が多すぎる場合、Debian の安定版用にプログラムを再コンパイルすることもできます。(この話題に関するより詳しい情報は <xref linkend="debian-packaging" /> を参照してください)。
pt_br: A maioria dos novos programas de software livre rapidamente encontra o caminho para a versão em desenvolvimento que lhes permite ser instalado. Se isso requer muitas atualizações, devido às suas dependências, o programa também pode ser recompilado para a versão estável do Debian (ver <xref linkend="debian-packaging" /> para obter mais informações sobre este tópico).

source: Lifecycle of a Release
ja_jp: リリースライフサイクル
pt_br: Ciclo de vida de um Lançamento

source: <primary>lifecycle</primary>
ja_jp: <primary>ライフサイクル</primary>
pt_br: <primary>ciclo de vida</primary>

source: <primary><emphasis role="distribution">Unstable</emphasis></primary>
ja_jp: <primary><emphasis role="distribution">不安定版</emphasis></primary>
pt_br: <primary><emphasis role="distribution">Instável</emphasis></primary>

source: <primary><emphasis role="distribution">Stable</emphasis></primary>
ja_jp: <primary><emphasis role="distribution">安定版</emphasis></primary>
pt_br: <primary><emphasis role="distribution">Estável</emphasis></primary>

source: The project will simultaneously have three or four different versions of each program, named <emphasis role="distribution">Experimental</emphasis>, <emphasis role="distribution">Unstable</emphasis>, <emphasis role="distribution">Testing</emphasis>, and <emphasis role="distribution">Stable</emphasis>. Each one corresponds to a different phase in development. For a good understanding, let us take a look at a program's journey, from its initial packaging to inclusion in a stable version of Debian.
ja_jp: Debian プロジェクトは同時にそれぞれのプログラムの 3 か 4 つの異なるバージョンを持っており、<emphasis role="distribution">実験版</emphasis>、<emphasis role="distribution">不安定版</emphasis>、<emphasis role="distribution">テスト版</emphasis>、<emphasis role="distribution">安定版</emphasis>、のように名づけられています。各バージョンは開発の異なる段階に相当します。違いを十分に理解するために、どのような順序でプログラムが最初のパッケージ化から Debian の安定版に取り込まれるかを見てみましょう。
pt_br: O projeto vai ter simultaneamente três ou quatro versões diferentes de cada programa, chamadas <emphasis role="distribution">Experimental</emphasis>, <emphasis role="distribution">Instável</emphasis>, <emphasis role="distribution">Teste</emphasis> e <emphasis role="distribution">Estável</emphasis>. Cada uma corresponde a uma fase diferente em desenvolvimento. Para um entendimento claro, vamos dar uma olhada no caminho de um programa, do seu empacotamento inicial à inclusão em uma versão estável do Debian.

source: <emphasis>VOCABULARY</emphasis> Release
ja_jp: <emphasis>VOCABULARY</emphasis> リリース
pt_br: <emphasis>VOCABULÁRIO</emphasis> Lançamento

source: <primary>release</primary>
ja_jp: <primary>リリース</primary>
pt_br: <primary>lançamento</primary>

source: The term “release”, in the Debian project, indicates a particular version of a distribution (e.g., “unstable release” means “the unstable version”). It also indicates the public announcement of the launch of any new version (stable).
ja_jp: Debian プロジェクトにおいて「リリース」という用語はディストリビューションの特定のバージョンを示しています (例:「不安定リリース」は「不安定版」を意味しています)。さらに、新しいバージョン (安定版) の公開を一般に発表することも意味しています。
pt_br: O termo "lançamento" , no projeto do Debian, indica uma versão especial de uma distribuição (por exemplo, "versão instável" significa "a versão instável"). Ele também indica o anúncio público de lançamento de qualquer nova versão (estável).

source: The <emphasis role="distribution">Experimental</emphasis> Status
ja_jp: <emphasis role="distribution">実験版</emphasis> 状態
pt_br: O Estado <emphasis role="distribution">Experimental</emphasis>

source: First let us take a look at the particular case of the <emphasis role="distribution">Experimental</emphasis> distribution: this is a group of Debian packages corresponding to the software currently in development, and not necessarily completed, explaining its name. Not everything passes through this step; some developers add packages here in order to get feedback from more experienced (or braver) users.
ja_jp: まず最初に特殊な例である<emphasis role="distribution">実験版</emphasis>ディストリビューションについて見てみましょう: これは現在開発中のソフトウェアに相当する Debian パッケージのグループで、名前の示す通り開発を終えている必要はありません。全てのパッケージがこのステップを踏む必要はありません; 一部の開発者はより経験豊かな (優れた) ユーザからのフィードバックを得るためにパッケージをここに追加します。
pt_br: Primeiro vamos dar uma olhada no caso particular da distribuição <emphasis role="distribution"> Experimental </emphasis>: este é um grupo de pacotes Debian correspondente ao software atualmente em desenvolvimento, e não necessariamente concluído, explicando o seu nome . Nem tudo passa por esta etapa, alguns desenvolvedores adicionam aqui os pacotes a fim de obter o feedback dos mais experientes (ou mais valentes) usuários.

source: Otherwise, this distribution frequently houses important modifications to base packages, whose integration into <emphasis role="distribution">Unstable</emphasis> with serious bugs would have critical repercussions. It is, thus, a completely isolated distribution, its packages never migrate to another version (except by direct, express intervention of the maintainer or the ftpmasters). It is also not self-contained: only a subset of the existing packages are present in <emphasis role="distribution">Experimental</emphasis>, and it generally does not include the base system. This distribution is therefore mostly useful in combination with another, self-contained, distribution such as <emphasis role="distribution">Unstable</emphasis>.
ja_jp: 別の面では、このディストリビューションは、基盤パッケージに対する重要な変更を一時的に取り込む際に、よく使われます。深刻なバグを含む基盤パッケージを<emphasis role="distribution">不安定版</emphasis>に取り込むと深刻な影響があります。そんなわけで、このディストリビューションは完全に隔離されたディストリビューションです、ここに含まれるパッケージは決して他のバージョンに移行することはありません (メンテナまたは ftp 管理者からの介入という例外を除きます)。また、このディストリビューションは自己完結していません: <emphasis role="distribution">実験版</emphasis>の中には既存のパッケージの一部だけが含まれており、基盤システムは含まれません。それゆえこのディストリビューションは通常、<emphasis role="distribution">不安定版</emphasis>などの自己完結している他のディストリビューションと組み合わせて利用されます。
pt_br: Por outro lado, essa distribuição frequentemente abriga importantes modificações para pacotes básicos, cuja integração na <emphasis role="distribution">Instável (Unstable)</emphasis> com erros graves teria repercussões críticas. Portanto, é uma distribuição completamente isolada, com seus pacotes nunca migrando para outra versão (exceto pela intervenção direta e expressa do mantenedor ou dos ftpmasters). Ela também não é auto-suficiente: apenas um subconjunto dos pacotes existentes estão presentes na <emphasis role="distribution">Experimental</emphasis>, e geralmente não incluem o sistema de base. Esta distribuição é, portanto, útil principalmente em combinação com uma outra distribuição auto-suficiente, como a <emphasis role="distribution">Instável (Unstable)</emphasis>.

source: The <emphasis role="distribution">Unstable</emphasis> Status
ja_jp: <emphasis role="distribution">不安定版</emphasis>状態
pt_br: O Estado <emphasis role="distribution">Instável</emphasis>

source: Let us turn back to the case of a typical package. The maintainer creates an initial package, which they compile for the <emphasis role="distribution">Unstable</emphasis> version and place on the <literal>ftp-master.debian.org</literal> server. This first event involves inspection and validation from the ftpmasters. The software is then available in the <emphasis role="distribution">Unstable</emphasis> distribution, which is the “cutting edge” distribution chosen by users who are more concerned with having up to date packages than worried about serious bugs. They discover the program and then test it.
ja_jp: 典型的なパッケージの場合に戻りましょう。メンテナが<emphasis role="distribution">不安定版</emphasis>用にコンパイルされた最初のパッケージを作成し、<literal>ftp-master.debian.org</literal> サーバに置きます。その後、ftp 管理者がパッケージを検査検証します。そうすると、ソフトウェアは<emphasis role="distribution">不安定版</emphasis>ディストリビューションで利用可能になります。このディストリビューションは深刻なバグを心配するよりも、パッケージを最新にすることに関心があるユーザの選択する、「最先端の」ディストリビューションです。そのようなユーザがプログラムを見つけて、テストします。
pt_br: Vamos voltar para o caso de um pacote típico. O mantenedor cria um pacote inicial, que compila para a versão <emphasis role="distribution">Instável</emphasis> e coloca no servidor <literal>ftp-master.debian.org</literal>.Este primeiro evento envolve a inspeção e validação dos ftpmasters. O software fica então disponível na distribuição <emphasis role="distribution">Instável</emphasis>, que é a distribuição de ponta escolhida pelos usuários que estão mais preocupados em manter seus pacotes atualizados invés de se preocupar com bugs graves. Eles descobrem o programa e o testam.

source: If they encounter bugs, they report them to the package's maintainer. The maintainer then regularly prepares corrected versions, which they upload to the server.
ja_jp: ユーザはバグに遭遇すると、バグをパッケージメンテナに報告します。メンテナは定期的に修正済みバージョンを用意し、サーバにアップロードします。
pt_br: Se encontrarem bugs, reportam para o mantenedor do pacote. O mantenedor então elabora regularmente versões corrigidas que envia (por upload) para o servidor.
