Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: Debian doesn't own any server in its own name, since it is only a project within the <emphasis>Software in the Public Interest</emphasis> association, and SPI manages the hardware and financial aspects (donations, purchase of hardware, etc.). While initially created specifically for the Debian project, this association now hosts other free software projects, especially the PostgreSQL database, Freedesktop.org (project for standardization of various parts of modern graphical desktop environments, such as GNOME and KDE), and the Libre Office office suite. <ulink type="block" url="http://www.spi-inc.org/" />
ja_jp: Debian は自分名義のサーバを所有していません、なぜなら Debian は <emphasis>Software in the Public Interest</emphasis> 内の 1 プロジェクトに過ぎず、SPI がハードウェアと財務的な側面 (寄付、ハードウェアの購入、など) を管理しているからです。SPI は当初 Debian プロジェクト専用に設立されましたが、今や他のフリーソフトウェアプロジェクトも主催しています。とりわけ、PostgreSQL データベース、Freedesktop.org (例えば GNOME や KDE などの現代的なグラフィカルデスクトップ環境のさまざまな要素を標準化するプロジェクト)、Libre Office オフィススイート。<ulink type="block" url="http://www.spi-inc.org/" />
pt_br: O Debian não possui qualquer servidor em seu próprio nome, uma vez que é apenas um projeto dentro da associação <emphasis>Software in the Public Interest</emphasis> (SPI), e a SPI gerencia o hardware e os aspectos financeiros (doações, compra de hardware, etc). Embora inicialmente criada especificamente para o projeto do Debian, esta associação agora hospeda outro projetos de software livre, especialmente o banco de dados PostgreSQL, Freedesktop.org (projeto de padronização de várias partes dos modernos ambientes de desktop gráficos, tais como GNOME e KDE) e a suíte de escritório Libre Office. <ulink type="block" url="http://www.spi-inc.org/"/>

source: In addition to SPI, various local associations collaborate closely with Debian in order to generate funds for Debian, without centralizing everything in the U.S.A: they are known as “Trusted Organizations” in the Debian jargon. This setup avoids prohibitive international transfer costs, and fits well with the decentralized nature of the project.
ja_jp: SPI に加えて、さまざまな現地組織がアメリカ合衆国の中で中央集権化することなく Debian 向けの基金を設立する目的で Debian と緊密に連携しています: そのような組織は Debian 用語で言うところの「Trusted Organizations」としても知られています。この機構は法外な国際送金コストを避け、一極集中を避けるという Debian プロジェクトの性質にぴったり一致します。
pt_br: Além da SPI, várias associações locais colaboram estreitamente com o Debian, a fim de gerar fundos para o Debian, sem centralizar tudo nos EUA: são conhecidas como "Organizações de Confiança" no jargão do Debian.Essa configuração evita custos proibitivos de transferência internacional, e se encaixa bem com a natureza descentralizada do projeto.

source: While the list of trusted organizations is rather short, there are many more Debian-related associations whose goal is to promote Debian: <emphasis>Debian France</emphasis>, <emphasis>Debian-UK</emphasis>, <emphasis>Debian-ES</emphasis>, <emphasis>debian.ch</emphasis>, and others around the world. Do not hesitate to join your local association and support the project! <ulink type="block" url="http://wiki.debian.org/Teams/Auditor/Organizations" /> <ulink type="block" url="http://france.debian.net/" /> <ulink type="block" url="http://wiki.earth.li/DebianUKSociety" /> <ulink type="block" url="http://www.debian-es.org/" /> <ulink type="block" url="http://debian.ch/" />
ja_jp: 信頼された組織のリストはある程度小さなものですが、Debian の普及を目標に掲げる Debian 関連組織は数多くあります: <emphasis>Debian France</emphasis>、<emphasis>Debian-UK</emphasis>、<emphasis>Debian-ES</emphasis>、<emphasis>debian.ch</emphasis>、そのほかにも世界中に。どうかご遠慮なく現地組織に参加し Debian プロジェクトを支援してください!<ulink type="block" url="http://wiki.debian.org/Teams/Auditor/Organizations" /> <ulink type="block" url="http://france.debian.net/" /> <ulink type="block" url="http://wiki.earth.li/DebianUKSociety" /> <ulink type="block" url="http://www.debian-es.org/" /> <ulink type="block" url="http://debian.ch/" />
pt_br: Embora a lista de organizações de confiança é bastante curta, existem muitas mais associações relacionadas com o Debian, cujo objetivo é promover o Debian: <emphasis>Debian France</emphasis>, <emphasis>Debian-UK</emphasis>, <emphasis>Debian-ES</emphasis>, <emphasis>debian.ch</emphasis> e outras ao redor do mundo. Não hesite em participar da sua associação local e apoiar o projeto! <ulink type="block" url="http://wiki.debian.org/Teams/Auditor/Organizations"/><ulink type="block" url="http://france.debian.net/"/> <ulink type="block" url="http://wiki.earth.li/DebianUKSociety"/> <ulink type="block" url="http://www.debian-es.org/"/><ulink type="block" url="http://debian.ch/"/>

source: The Foundation Documents
ja_jp: 基礎的文書
pt_br: Os Documentos da fundação

source: <primary>Foundation Documents</primary>
ja_jp: <primary>基礎的文書</primary>
pt_br: <primary>Documentos de Fundação</primary>

source: A few years after its initial launch, Debian formalized the principles that it should follow as a free software project. This deliberately activist decision allows orderly and peaceful growth by ensuring that all members progress in the same direction. To become a Debian developer, any candidate must confirm and prove their support and adherence to the principles established in the project's Foundation Documents.
ja_jp: 最初のリリースから数年後、Debian はフリーソフトウェアプロジェクトが従うべき指針をまとめました。この指針を細心の注意を払って決定したことで、すべてのメンバーが同じ目標に進むようになり、秩序的かつ平和的に成長するようになりました。Debian 開発者になるためには、どんな候補者もプロジェクトの基礎的文書に確立されている指針を支持し順守することを認めて証明しなければいけません。
pt_br: Uns anos depois do seu lançamento inicial, o Debian formalizou os princípios que deviam seguir como um projeto de software livre. Esta decisão ativista permite um crescimento ordeiro e pacífico, garantindo que todos os membros progridam na mesma direção. Para se tornar um desenvolvedor Debian, qualquer candidato deve confirmar e provar o seu apoio e adesão aos princípios estabelecidos nos documentos do projeto da Fundação.

source: The development process is constantly debated, but these Foundation Documents are widely and consensually supported, thus rarely change. The Debian constitution also offers other guarantees for their stability: a three-quarters qualified majority is required to approve any amendment.
ja_jp: この開発プロセスは定期的に議論されていますが、これらの基礎的文書は広く合意が得られているため、めったに変わりません。Debian 憲章は安定度に関するまた別の点を保障しています: いかなる修正案であっても承認には 4 分の 3 の特定多数票が必要です。
pt_br: O processo de desenvolvimento é constantemente debatido, mas estes Documentos de Fundação são amplamente consensualmente apoiados, assim, raramente mudam. A constituição da Debian também oferece outras garantias para sua estabilidade: uma maioria qualificada de três quartos é necessária para aprovar qualquer alteração.

source: The Commitment towards Users
ja_jp: ユーザに向けた約束
pt_br: O Compromisso dos Usuários

source: <primary>social contract</primary>
ja_jp: <primary>社会契約</primary>
pt_br: <primary>contrato social</primary>

source: <primary>contract, social</primary>
ja_jp: <primary>契約、社会</primary>
pt_br: <primary>contrato, social</primary>

source: The project also has a “social contract”. What place does such a text have in a project only intended for the development of an operating system? That is quite simple: Debian works for its users, and thus, by extension, for society. This contract summarizes the commitments that the project undertakes. Let us study them in greater detail:
ja_jp: Debian プロジェクトには「社会契約」もあります。この文書はオペレーティングシステムの開発のみを対象にしているプロジェクトの中でどのような位置を占めているのでしょうか? これは非常に単純です: Debian はユーザに役立ち、つまりこの考えをさらに進めると、社会に役立ちます。この規約は Debian プロジェクトが負う責任を要約しています。より詳しく見ていきましょう:
pt_br: O projeto também tem um "contrato social". Qual o lugar que tal texto tem em um único projeto destinado ao desenvolvimento de um sistema operacional? Isso é bastante simples: Debian funciona para seus usuários e, portanto, por extensão, para a sociedade. Este contrato resume os compromissos que o projeto compromete . Vamos estudá-los em maior detalhe:

source: Debian will remain 100% free.
ja_jp: Debian は 100% フリーであり続けます。
pt_br: Debian permanecerá 100% livre.

source: This is Rule No. 1. Debian is and will remain composed entirely and exclusively of free software. Additionally, all software development within the Debian project, itself, will be free.
ja_jp: 第一のルール。Debian は今もこれからも完全にフリーソフトウェアだけを使います。その上、Debian プロジェクト内の全てのソフトウェア開発は他人からの束縛を受けません。
pt_br: Esta é a Regra n º 1. O Debian é e continuará a ser inteiramente composto e exclusivamente de softwares livres. Além disso, todo o desenvolvimento de softwares dentro do projeto do Debian, por si só, será livre.

source: <emphasis>PERSPECTIVE</emphasis> Beyond software
ja_jp: <emphasis>PERSPECTIVE</emphasis> ソフトウェアだけでなく
pt_br: <emphasis>PERSPECTIVA</emphasis> Além do software

source: The first version of the Debian Social Contract said “Debian Will Remain 100% Free <emphasis>Software</emphasis>”. The disappearance of this word (with the ratification of Version 1.1 of the contract in April of 2004) indicates the will to achieve freedom, not only in software, but also in the documentation and any other element that Debian wishes to provide within its operating system.
ja_jp: Debian 社会契約の最初のバージョンには「Debian は 100% フリー<emphasis>ソフトウェア</emphasis>であり続けます」とありました。2004 年 4 月にバージョン 1.1 を批准したことに伴いこの言葉はなくなりましたが、これはソフトウェアのみならず、Debian がオペレーティングシステムの一部として提供したいと望んでいる、文書やそのほかの要素の自由を達成するための意思を表しています。
pt_br: A primeira versão do Contrato Social Debian disse "O <emphasis>Software </emphasis> Debian permanecerá 100% Livre >". O desaparecimento desta palavra (com a ratificação da versão 1.1 do contrato em abril de 2004) indica a vontade de conseguir a liberdade, não só em softwares, mas também na documentação e qualquer outro elemento que os desejos da Debian para fornecer dentro do seu sistema operacional .

source: This change, which was only intended as editorial, has, in reality, had numerous consequences, especially with the removal of some problematic documentation. Furthermore, the increasing use of firmware in drivers poses problems: many are non-free, yet they are necessary for proper operation of the corresponding hardware.
ja_jp: この変更は単なる編集だったのですが、実際のところは、一部の問題がある文書が削除されるなど、多くの影響がありました。また、ドライバ内のファームウェアの使用が増えたことで問題が起こりました: 問題の多くは non-free で起こりましたが、対応するハードウェアに適切な操作を行うためには必要です。
pt_br: Esta mudança, que só foi concebido como editorial, tem, na realidade, tido inúmeras consequências, especialmente com a remoção de alguma documentação problemática. Além disso, o uso crescente de firmware em drivers coloca problemas: muitos são não-livres, são, ainda que sejam necessários para o funcionamento adequado do hardware correspondente.

source: We will give back to the free software community.
ja_jp: 我々はフリーソフトウェアコミュニティに成果を還元します。
pt_br: Nós iremos retribuir à comunidade de software livre.

source: Any improvement contributed by the Debian project to a work integrated in the distribution is sent back to the author of the work (called “upstream”). In general, Debian will cooperate with the community rather than work in isolation.
ja_jp: Debian プロジェクトが寄与してディストリビューションに組み込まれた成果はどんなことでも、元の作者 (「上流」と呼ばれる) に還元されます。一般に Debian は独立して仕事をするのではなく、コミュニティと協力するのです。
pt_br: Qualquer melhoria contribuída pelo projeto do Debian para um trabalho integrado na distribuição é enviado de volta ao autor do trabalho (chamado de "original"). Em geral, o Debian vai cooperar com a comunidade em vez de trabalhar isoladamente.

source: <emphasis>COMMUNITY</emphasis> Upstream author, or Debian developer?
ja_jp: <emphasis>COMMUNITY</emphasis> 上流開発者とは Debian 開発者のこと?
pt_br: <emphasis>COMUNIDADE</emphasis> Autor original, ou desenvolvedor Debian?

source: <primary>upstream author</primary>
ja_jp: <primary>上流開発者</primary>
pt_br: <primary>autor original</primary>

source: <primary>author, upstream</primary>
ja_jp: <primary>開発者、上流</primary>
pt_br: <primary>autor, original</primary>

source: <primary>upstream</primary>
ja_jp: <primary>上流</primary>
pt_br: <primary>original</primary>

source: The term “upstream author” means the author(s)/developer(s) of a work, those who write and develop it. On the other hand, a “Debian developer” uses an existing work to make it into a Debian package (the term “Debian maintainer” is better suited).
ja_jp: 「上流開発者」という用語はある作品の作者/開発者を意味しており、彼らが作品を制作し開発しています。一方で、「Debian 開発者」は存在する作品を使い、その作品を Debian パッケージにします (「Debian メンテナ」という用語がより適しています)。
pt_br: O termo "autor original" significa o(s) autor (es) / desenvolvedor(es) de uma obra, aqueles que escrevem e desenvolvê-la. Por outro lado, um "desenvolvedor Debian" usa uma obra já existente para torná-lo em um pacote Debian (o termo "mantenedor do Debian" é mais adequado).

source: In practice, the distinction is often not as clear-cut. The Debian maintainer may write a patch, which benefits all users of the work. In general, Debian encourages those in charge of a package in Debian to get involved in “upstream” development as well (they become, then, contributors, without being confined to the role of simple users of a program).
ja_jp: 実際のところ、上流開発者と Debian 開発者の違いは明確でないことが多いです。Debian メンテナはパッチを書くこともあり、その作品のすべてのユーザはこのパッチによる恩恵を受けます。一般に、Debian は Debian におけるそのパッケージの責任者が「上流」開発にも参加することをことを推奨しています (パッケージ責任者は、あるプログラムの単なるユーザではなく、貢献者になるのです)。
pt_br: Na prática, a demarcação não é clara. O mantenedor do Debian pode escrever um patch, que beneficia todos os usuários do trabalho. Em geral, o Debian encoraja àqueles responsáveis por um pacote no Debian que se envolvam no desenvolvimento original (eles se tornam, então, contribuintes, sem estar confinado ao papel de simples usuários de um programa).

source: We will not hide problems.
ja_jp: 我々は問題を隠しません。
pt_br: Nós não escondemos problemas.

source: Debian is not perfect, and, we will find new problems to fix every day. We will keep our entire bug report database open for public view at all times. Reports that people file on-line will promptly become visible to others.
ja_jp: Debian は完全なものではありません、修正するべき新しい問題が毎日見つかっています。我々はバグレポートデータベースを誰もが見れるように公開しています。オンラインに提出されたレポートはすぐさま他の人にも読めるようになります。
pt_br: Debian não é perfeito, e, vamos encontrar novos problemas para corrigir todos os dias. Iremos manter nosso banco de dados de relatórios de bugs aberto para a visualização pública todo o tempo. Relatórios que os usuários arquivam on-line, prontamente, se tornam visíveis para os outros.

source: Our priorities are our users and free software.
ja_jp: 我々はユーザとフリーソフトウェアを最優先に考えます。
pt_br: Nossas prioridades são nossos usuários e software livre.

source: This commitment is more difficult to define. Debian imposes, thus, a bias when a decision must be made, and will discard an easy solution for the developers that will jeopardize the user experience, opting for a more elegant solution, even if it is more difficult to implement. This means to take into account, as a priority, the interests of the users and free software.
ja_jp: これは最も定義が難しい条項です。Debian は決断を下す際に偏った考え方を強要します。Debian はたとえ開発者から見れば簡単な解決策であったとしてもユーザが使いにくくなるような解決策ならばそれを採用せず、たとえ実装が困難であったとしてもユーザが簡潔と感じるような解決策を採用します。これはユーザとフリーソフトウェアの利益を最優先事項と考えていることを意味しています。
pt_br: Esse compromisso é mais difícil de definir. Debian impõe, assim, um viés quando uma decisão deve ser tomada, e irá descartar uma solução fácil para os desenvolvedores que coloquem em risco a experiência do usuário, optando por uma solução mais elegante, mesmo que seja mais difícil de implementar. Isto significa levar em conta, prioritariamente, os interesses dos usuários e software livre.

source: Works that do not meet our free software standards.
ja_jp: 我々のフリーソフトウェア基準に合致しない著作物。
pt_br: Obras que não atendem nossos padrões de software livre.

source: Debian accepts and understands that users may want to use some non-free programs. That's why the project allows usage of parts of its infrastructure to distribute Debian packages of non-free software that can safely be redistributed.
ja_jp: Debian はユーザからの一部の非フリープログラムが使いたいとの要求を受け入れて理解しています。そのため、Debian プロジェクトは、再配布することに支障のない非フリーソフトウェアの Debian パッケージを配布するために、自分たちのインフラの一部を使うことを許しています。
pt_br: Debian aceita e entende que os usuários podem querem usar alguns programas que muitas vezes são não-livres. É por isso que projeto permite a utilização de parte da sua infraestrutura para distribuir pacotes Debian de software não-livre que podem ser redistribuídos com segurança.

source: <emphasis>COMMUNITY</emphasis> For or against the non-free section?
ja_jp: <emphasis>COMMUNITY</emphasis> non-free セクションに賛成?反対?
pt_br: <emphasis>COMMUNIDADE</emphasis> A favor ou contra a seção não-livres?

source: <primary>non-free</primary>
pt_br: <primary>não-livre</primary>

source: <primary>section</primary><secondary>non-free</secondary>
ja_jp: <primary>セクション</primary><secondary>non-free</secondary>
pt_br: <primary>seção</primary><secondary>não-livre</secondary>

source: The commitment to maintain a structure to accommodate non-free software (i.e. the “non-free” section, see the sidebar <xref linkend="sidebar.sections" />) is frequently a subject of debate within the Debian community.
ja_jp: non-free ソフトウェア (すなわち「non-free」セクション、傍注をご覧ください <xref linkend="sidebar.sections" />) を受け入れる枠組みを維持するという約束は Debian コミュニティの中でしばしば議論の対象になります。
pt_br: O compromisso de manter uma estrutura para acomodar software não-livre (ou seja, a seção "non-free", consulte a barra lateral <xref linkend="sidebar.sections"/>) é frequentemente um tema de debate dentro da comunidade Debian.

source: Detractors argue that it turns people away from free software equivalents, and contradicts the principle of serving only the free software cause. Supporters flatly state that most of the non-free packages are “nearly free”, and held back by only one or two annoying restrictions (the most common being the prohibition against commercial usage of the software). By distributing these works in the non-free branch, we indirectly explain to the author that their creation would be better known and more widely used if they could be included in the main section. They are, thus, politely invited to alter their license to serve this purpose.
ja_jp: 枠組みの維持に反対する人は、こうすることでフリーソフトウェアに対する公平性が軽視されるようになり、フリーソフトウェアだけを提供するという原則にも違反している、と異論を唱えます。賛成する人は、ほとんどの non-free パッケージは「ほぼフリー」であり、高々 1 つか 2 つの厄介な例外 (最もよくある例外はソフトウェアの商用利用の禁止) があるためにフリーでなくなっている、ときっぱりと言い切っています。このような著作物を non-free ブランチで配布することは、作者に対する間接的な説明 (main セクションに彼らの作品を含めることができれば、作品はより広く知られて使われるようになる) の役割を果たしています。このようにして我々は、作品をより広く使われるようにするためには作品のライセンスを変更することが必要であると、作者に対して丁寧に依頼しているのです。
pt_br: Os detratores argumentam que deixa as pessoas distantes dos equivalentes de software livre, e contradiz o princípio de servir apenas a causa do software livre. Os defensores afirmam categoricamente que a maioria dos pacotes não-livres são "quase livres", exceto por apenas uma ou duas restrições irritantes (o mais comum seria a proibição contra o uso comercial do software). Ao distribuir essas obras no ramo não-livre, explica-se indiretamente para os autores que suas criações seriam melhor conhecidas e mais amplamente utilizadas se pudessem ser incluídas na seção principal. Eles são, assim, educadamente convidados a alterar a sua licença para servir a esse propósito.

source: After a first, unfruitful attempt in 2004, the complete removal of the non-free section should not return to the agenda for several years, especially since it contains many useful documents that were moved simply because they did not meet the new requirements for the main section. This is especially the case for certain software documentation files issued by the GNU project (in particular, Emacs and Make).
ja_jp: 2004 年に non-free セクションは初めて完全に削除されました。これは実りのない試みで、数年間は再度議題に挙げないほうがよいでしょう、なにせ non-free セクションには、単純に main セクションの条件を満たしていなかったために移動されていた数多くの役立つ文書が含まれていたのですから。特に GNU プロジェクトが作成した特定のソフトウェア (特に、Emacs と Make) に関する文書ファイルはこれに当てはまるものでした。
pt_br: Depois de uma primeira tentativa infrutífera, em 2004, a remoção completa da seção não-livre não deve voltar à agenda durante vários anos, especialmente desde que ela contém muitos documentos úteis que foram movidos simplesmente porque eles não atendem às novas exigências para a seção principal . Isto é especialmente o caso de arquivos de documentação de determinados softwares emitidos pelo projeto GNU (em particular, Emacs e Make).

source: The continued existence of the non-free section is a source of occasional friction with the Free Software Foundation, and is the main reason it refuses to officially recommend Debian as an operating system.
ja_jp: non-free セクションが存続することで、Debian とフリーソフトウェア財団との間には時折摩擦が生まれます。フリーソフトウェア財団が Debian をオペレーティングシステムとして公的に推奨しないのはこれが主な理由です。
pt_br: A existência contínua da seção non-free é uma fonte esporádica de atritos com a Free Software Foundation, e é a principal razão dela recomendar oficialmente o Debian como sistema operacional.

source: The Debian Free Software Guidelines
ja_jp: Debian フリーソフトウェアガイドライン
pt_br: As Orientações de Software Livre Debian

source: <primary>free software principles</primary>
ja_jp: <primary>フリーソフトウェア基準</primary>
pt_br: <primary>princípios do softare livre</primary>

source: <primary>Debian Free Software Guidelines</primary>
ja_jp: <primary>Debian フリーソフトウェアガイドライン</primary>
pt_br: <primary>Definição Debian de Software Livre</primary>

source: <primary>free</primary><secondary>software</secondary>
ja_jp: <primary>フリー</primary><secondary>ソフトウェア</secondary>
pt_br: <primary>software</primary><secondary>livre</secondary>

source: This reference document defines which software is “free enough” to be included in Debian. If a program's license is in accordance with these principles, it can be included in the main section; on the contrary, and provided that free distribution is permitted, it may be found in the non-free section. The non-free section is not officially part of Debian; it is an added service provided to users.
ja_jp: この参考文書は Debian に含める際にソフトウェアが「十分にフリー」であるかを定義しています。もしあるプログラムのライセンスがこの基準に合致するならば、main セクションに含めることができます; 合致しないものの、自由な配布が認められているならば、non-free セクションに含めることができます。non-free セクションは公式には Debian の一部ではありません; ユーザ向けに提供されている付加サービスです。
pt_br: Este documento de referência define qual software é "suficiente livre" para ser incluído no Debian. Se umaa licença de um programa está de acordo com estes princípios, ele pode ser incluído na seção principal; do contrário, e desde que a distribuição livre é permitida, pode ser encontrado na seção non-free. A seção non-free não é oficialmente parte do Debian; é um serviço adicional prestado aos usuários.

source: More than a selection criteria for Debian, this text has become an authority on the subject of free software, and has served as the basis for the “Open Source Definition”. Historically, it is therefore one of the first formal definitions of the concept of “free software”.
ja_jp: このテキストは Debian におけるセクションの選択基準だけにとどまらず、フリーソフトウェアの屋台骨になり、「Open Source Definition」の基礎を担う役割を果たし続けています。そんなわけで歴史的にいって、このテキストは「フリーソフトウェア」の概念を定義した最初の正式なものの 1 つです。
pt_br: Mais do que um critério de seleção para o Debian, este texto se converteu em referência no assunto de software livre, e tem servido como base para a "definição de Código Aberto" (Open Source). Historicamente é uma das primeiras definições formais do conceito de "software livre".

source: The GNU General Public License, the BSD License, and the Artistic License are examples of traditional free licenses that follow the 9 points mentioned in this text. Below you will find the text as it is published on the Debian website. <ulink type="block" url="http://www.debian.org/social_contract#guidelines" />
ja_jp: GNU 一般公衆利用許諾書、BSD ライセンス、Artistic ライセンスは伝統的なフリーライセンスの例であり、以下のテキストで言及する 9 個の事項に従います。以下に Debian ウェブサイトで公開されているものをそのまま引用します。<ulink type="block" url="http://www.debian.org/social_contract#guidelines" />
pt_br: A GNU General Public License, a licença BSD, e a Licença Artística são exemplos de licenças livres tradicionais que seguem os 9 pontos mencionados neste texto. Abaixo você encontrará o texto conforme está publicado no site do Debian. <ulink type="block" url="http://www.debian.org/social_contract#guidelines" />

source: Free redistribution.
ja_jp: 自由な再配布。
pt_br: Redistribuição Livre.
