Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: Documentation for each package is stored in <filename>/usr/share/doc/<replaceable>package</replaceable>/</filename>. This directory often contains a <filename>README.Debian</filename> file describing the Debian specific adjustments made by the package maintainer. It is, thus, wise to read this file prior to any configuration, in order to benefit from their experience. We also find a <filename>changelog.Debian.gz</filename> file describing the changes made from one version to the next by the Debian maintainer. This is not to be confused with the <filename>changelog.gz</filename> file (or equivalent), which describes the changes made by the upstream developers. The <filename>copyright</filename> file includes information about the authors and the license covering the software. Finally, we may also find a file named <filename>NEWS.Debian.gz</filename>, which allows the Debian developer to communicate important information regarding updates; if <emphasis>apt-listchanges</emphasis> is installed, then these messages are automatically displayed. All other files are specific to the software in question. We especially like to point out the <filename>examples</filename> sub-directory, which frequently contains examples of configuration files.
ja_jp: それぞれのパッケージに関する文書は <filename>/usr/share/doc/<replaceable>package</replaceable>/</filename> に保存されています。多くの場合このディレクトリには <filename>README.Debian</filename> ファイルが含まれています。このファイルにはパッケージメンテナが行った Debian 特有の修正について説明が書かれています。つまり、メンテナの経験から恩恵を受けるためには、設定の前にこのファイルを読むことが賢明です。また、このディレクトリに含まれる <filename>changelog.Debian.gz</filename> ファイルにはあるバージョンから次のバージョンに更新した際に Debian メンテナが行った変更についての説明が書かれています。このファイルを <filename>changelog.gz</filename> ファイル (または同等のファイル、上流開発者が行った変更に関する説明が書かれたファイル) と混同してはいけません。<filename>copyright</filename> ファイルにはソフトウェアの作者とそのライセンスに関する情報が書かれています。最後に、このディレクトリに含まれる <filename>NEWS.Debian.gz</filename> と名付けられたファイルには Debian 開発者からの更新に関する重要な情報が含まれています; <emphasis>apt-listchanges</emphasis> がインストール済みの場合、これらのメッセージが自動的に表示されます。そのほかのファイルはここで注目しているソフトウェアに固有のファイルです。特に注目すべきは <filename>examples</filename> サブディレクトリで、ここには設定ファイルの例が含まれています。
pt_br: A documentação de cada pacote é armazenada em <filename>/usr/share/doc/<replaceable>pacote</replaceable>/</filename>. Este diretório normalmente contém um arquivo <filename>README.Debian</filename> que descreve os ajustes específicos do Debian feitas pelo mantenedor do pacote. É, portanto, aconselhável ler este arquivo antes de qualquer configuração, a fim de se beneficiar da sua experiência. Também encontramos um aquivo <filename>changelog.Debian.gz</filename> que descreve as mudanças feitas de uma versão para a próxima pelo mantenedor do Debian. Não é para confundir com o arquivo <filename>changelog.gz</filename> (ou equivalente), que descreve as mudanças feitas pelos desenvolvedores originais. O arquivo <filename>copyrigth</filename> inclue informações sobre os autores e a cobertura da licença do software. Finalmente, podemos também encontrar um arquivo chamado <filename>NEWS.Debian.gz</filename>, que permite ao desenvolvedor Debian comunicar informações importantes a respeito das atualizações (se <emphasis>apt-listchanges</emphasis> está instalado, as mensagens são exibidas automaticamente). Todos os outros arquivos são específicos para o software em questão. Gostamos especialmente de salientar o subdiretório <filename>examples</filename>, que frequentemente contém exemplos dos arquivos de configuração.

source: The Policy covers very well the technical aspects of packaging. The size of the project also raises organizational problems; these are dealt with by the Debian Constitution, which establishes a structure and means for decision making. In other words, a formal governance system.
ja_jp: Debian ポリシーはパッケージ化の技術的側面をうまくカバーしています。プロジェクトの大きさは組織の問題を引き起こします; 問題は Debian 憲章にしたがって対処されます。Debian 憲章は組織体制と意思決定の手段を定めています。これは言い換えれば、組織的な管理システムといえます。
pt_br: A Política cobre muito bem os aspectos técnicos do empacotamento. O tamanho do projeto também levanta problemas organizacionais, que são tratados pela Constituição Debian, que estabelece uma estrutura e meios para tomada de decisão. Em outras palavras, um sistema formal de governança.

source: <primary>constitution</primary>
ja_jp: <primary>憲章</primary>
pt_br: <primary>constituição</primary>

source: <primary>Debian Project Leader</primary>
ja_jp: <primary>Debian プロジェクトリーダー</primary>
pt_br: <primary>Líder de Projeto Debian</primary>

source: <primary>leader</primary><secondary>role</secondary>
ja_jp: <primary>リーダー</primary><secondary>役割</secondary>
pt_br: <primary>líder</primary><secondary>papel</secondary>

source: <primary>leader</primary><secondary>election</secondary>
ja_jp: <primary>リーダー</primary><secondary>選挙</secondary>
pt_br: <primary>líder</primary><secondary>eleição</secondary>

source: This constitution defines a certain number of roles and positions, plus responsibilities and authorities for each. It is particularly worth noting that Debian developers always have ultimate decision making authority by a vote of general resolution, wherein a qualified majority of three quarters (75%) of votes is required for significant alterations to be made (such as those with an impact on the Foundation Documents). However, developers annually elect a “leader” to represent them in meetings, and ensure internal coordination between varying teams. This election is always a period of intense discussions. This leader's role is not formally defined by any document: candidates for this post usually propose their own definition of the position. In practice, the leader's roles include serving as a representative to the media, coordinating between “internal” teams, and providing overall guidance to the project, within which the developers can relate: the views of the DPL are implicitly approved by the majority of project members.
ja_jp: Debian 憲章は一定の役割と役職、併せてそれぞれに対する責任と権限を定義しています。特筆すべきは Debian 開発者は一般決議に投票することで最終決定を行う権限を常に持っているということです、重大な変化 (基本文書に影響を与えるようなもの) を起こすには特定多数の 4 分の 3 (75%) が投票すること必要です。しかしながら、開発者は会議で彼らを代表して、様々なチーム間の連携を確保する「リーダー」を毎年選びます。この選挙は常に活発な議論になります。リーダーの役割は何かの文書で正式に定義されたものではありません: 通常、この役職の候補者は役割を自分自身で定義し、それを提案します。実際のところ、リーダーの役割には開発者からの共感を得るように、メディアに対する代表者として働くこと、「内部」チーム間の連携をとること、プロジェクトに対する包括的な指導を提供すること、が含まれています: DPL の見解はプロジェクトメンバーの大多数から暗黙のうちに認められているのです。
pt_br: Esta constituição define um certo número de papéis e posições, além de responsabilidades e autoridades para cada um. É particularmente interessante notar que os desenvolvedores do Debian sempre tem a decisão definitiva tomada autoridade por uma votação de resolução geral, em que uma maioria qualificada de três quartos (75%) de votos é necessária para as alterações significativas a serem feitas (como aquelas com um impacto sobre os Documentos de Fundação). No entanto, os desenvolvedores anualmente elegem um "líder" para representá-los em reuniões, e assegurar a coordenação interna entre equipes diferentes. Esta eleição é sempre um período de intensas discussões. Este papel do líder não é formalmente definido por qualquer documento: os candidatos para esse posto normalmente propõe sua própria definição da posição. Na prática, os papéis do líder incluem servir como um representante para os meios de comunicação, de coordenação entre equipes "interno" , e fornecer orientação geral para o projeto, dentro do qual os desenvolvedores podem se relacionar: as opiniões do DPL são implicitamente aprovado pela maioria dos membros do projeto .

source: Specifically, the leader has real authority; his vote resolves tie votes; he can make any decision which is not already under the authority of someone else and can delegate part of his responsibilities.
ja_jp: 具体的にいえば、リーダーは本当の意味での権力を持っています; 賛否同数の場合にはリーダーの投票が決定票となります; リーダーはまだ誰の権限下にもなっていない決定を下し、自身の権限の一部を委任することができます。
pt_br: Especificamente, o líder tem autoridade real; seu voto resolve votações empatadas, ele pode tomar qualquer decisão que não esteja sob a autoridade de alguém e pode delegar parte das suas responsabilidades.

source: Since its inception, the project has been successively led by Ian Murdock, Bruce Perens, Ian Jackson, Wichert Akkerman, Ben Collins, Bdale Garbee, Martin Michlmayr, Branden Robinson, Anthony Towns, Sam Hocevar, Steve McIntyre, Stefano Zacchiroli and Lucas Nussbaum.
ja_jp: Debian が始まって以来ずっと、プロジェクトは Ian Murdock さん、Bruce Perens さん、Ian Jackson さん、Wichert Akkerman さん、Ben Collins さん、Bdale Garbee さん、Martin Michlmayr さん、Branden Robinson さん、Anthony Towns さん、Sam Hocevar さん、Steve McIntyre さん、Stefano Zacchiroli さん、Lucas Nussbaum さんに率いられてきました。
pt_br: Desde a sua criação, o projeto foi sucessivamente liderado por Ian Murdock, Bruce Perens, Ian Jackson, Wichert Akkerman, Ben Collins, Bdale Garbee, Martin Michlmayr, Branden Robinson, Anthony Towns, Sam Hocevar, Steve McIntyre, Stefano Zacchiroli e Lucas Nussbaum.

source: <primary>technical committee</primary>
ja_jp: <primary>技術委員会</primary>
pt_br: <primary>comitê técnico</primary>

source: The constitution also defines a “technical committee”. This committee's essential role is to decide on technical matters when the developers involved have not reached an agreement between themselves. Otherwise, this committee plays an advisory role for any developer who fails to make a decision for which they are responsible. It is important to note that they only get involved when invited to do so by one of the parties in question.
ja_jp: Debian 憲章では「技術委員会」もまた定義されています。技術委員会の本質的な役割とは、関係する開発者の間で合意に達しなかった場合に技術的な事柄を決定することです。技術委員会の他の役割として、責任を負っている決定で間違いを犯す開発者に対する顧問役があります。ただし、技術委員会は問題になっているグループの一員から参加するように求められた場合のみそこに参加するということに注意しなければいけません。
pt_br: A Constituição também define uma "comissão técnica". O papel essencial desta comissão é o de decidir sobre questões técnicas, quando os desenvolvedores envolvidos não chegaram a um acordo entre si. Caso contrário, esta comissão tem um papel consultivo para qualquer desenvolvedor que não consegue tomar uma decisão para os quais são responsáveis. É importante notar que eles só se envolvem quando convidados a fazê-lo por uma das partes em questão.

source: <primary>the project secretary</primary>
ja_jp: <primary>プロジェクト秘書</primary>
pt_br: <primary>secretário de projeto</primary>

source: Finally, the constitution defines the position of “project secretary”, who is in charge of the organization of votes related to the various elections and general resolutions.
ja_jp: 最後に、Debian 憲章では「プロジェクト秘書」の役職も定義しています、この役職はさまざまな選挙と一般決議に関連する投票の運営に責任を負っています。
pt_br: Finalmente, a Constituição define a posição de " secretário de projeto", que é responsável pela organização dos votos relacionados às várias eleições e resoluções gerais.

source: The “general resolution” procedure is fully detailed in the constitution, from the initial discussion period to the final counting of votes. For further details see: <ulink type="block" url="http://www.debian.org/devel/constitution.en.html" />
ja_jp: 「一般決議」手続きは Debian 憲章の中で最初の議論期間から最後の開票まで詳細に説明されています。より詳しい情報は: <ulink type="block" url="http://www.debian.org/devel/constitution.en.html" />
pt_br: O "resolução geral " é o processo totalmente detalhado na Constituição, a partir do período de discussão inicial à contagem final de votos. Para mais detalhes ver: <ulink type="block" url="http://www.debian.org/devel/constitution.en.html" />

source: <primary>general resolution</primary>
ja_jp: <primary>一般決議</primary>
pt_br: <primary>resolução geral</primary>

source: <primary>vote</primary>
ja_jp: <primary>投票</primary>
pt_br: <primary>voto</primary>

source: <emphasis>CULTURE</emphasis> Flamewar, the discussion that catches fire
ja_jp: <emphasis>CULTURE</emphasis> 罵り合戦、炎上する議論
pt_br: <emphasis>CULTURA</emphasis> Flamewar, a discussão que incendeia

source: <primary>heated debate</primary>
ja_jp: <primary>白熱した議論</primary>
pt_br: <primary>debate aquecido</primary>

source: A “flamewar” is an exceedingly impassioned debate, which frequently ends up with people attacking each other once all reasonable argumentation has been exhausted on both sides. Certain themes are more frequently subject to polemics than others (the choice of text editor, “do you prefer <command>vi</command> or <command>emacs</command>?”, is an old favorite). The matters often provoke very rapid e-mail exchanges due to the sheer number of people with an opinion on the matter (everyone) and the very personal nature of such questions.
ja_jp: 「罵り合戦」とはきわめて熱のこもった討論であり、多くの場合、双方が合理的な討論をした後、互いを攻撃して終わります。他のテーマに比べてより頻繁に論争になりやすいテーマがあります (エディタの選択、「<command>vi</command> と <command>emacs</command> のどっちが好き?」、は昔からよく槍玉に挙げられるテーマです)。あるテーマに対して一家言ある人々が非常に多いこと (全員) や質問内容が極めて個人的なものであることが原因で、多くの場合極めて素早く電子メールが交換されることになります。
pt_br: Um "flamewar" é um debate extremamente ardoroso, que muitas vezes acaba com pessoas atacando umas às outras uma vez que toda a argumentação razoável tenha sido esgotada em ambos os lados. Alguns temas são frequentemente mais sujeitos a polêmica do que outros (a escolha do editor de texto, "você prefere <command>vi</command> ou <command>emacs</command>?", é um velho favorito). As questões muitas vezes provocam trocas de emails extremamente rápidas devido ao grande número de pessoas com uma opinião sobre o assunto (todos) e da natureza muito pessoal de tais questões.

source: Nothing particularly useful generally comes from such discussions; the general recommendation is to stay out of such debates, and maybe rapidly skim through their content, since reading them in full would be too time-consuming.
ja_jp: そのような議論からは一般的で特別有益な結論は 1 つも出てきません; 一般的には、そのような議論にかかわらないこと、必要なら議論の内容を素早く流し読みすること (全ての内容を読むことは多大な時間を必要としすぎるでしょうから)、をお勧めします。
pt_br: Geralmente nada particularmente útil vem de tais discussões; a recomendação geral é ficar fora destes debates, e talvez percorrer rapidamente seu conteúdo já que ler tudo seria muito demorado.

source: Even if this constitution establishes a semblance of democracy, the daily reality is quite different: Debian naturally follows the free software rules of the do-ocracy: the one who does things gets to decide how to do them. A lot of time can be wasted debating the respective merits of various ways to approach a problem; the chosen solution will be the first one that is both functional and satisfying… which will come out of the time that a competent person did put into it.
ja_jp: たとえ Debian 憲章の規定する民主制がうわべだけのものであったとしても、毎日の現実はまったく違ったものです: Debian は当然ながらフリーソフトウェアにおける能動主義 (do-ocracy) のルールに従います: 物事はそれを行った者がどの様に行うかを決めます。問題に対処するさまざまな方法のそれぞれの価値について議論することで、多くの時間が無駄にならないとも限りません; 選ばれし解決策は、機能性と要件満足度を両立する初めての解決策になるでしょう... しかしそういう解決策は有能な人物が努力した後に出てくるものです。
pt_br: Embora esta constituição se assemelhe a uma aparente democracia, a realidade cotidiana é muito diferente: O Debian naturalmente segue as regras da meritocracia do software livre: aquele que faz as coisas decide como fazê-las. Muito tempo pode ser desperdiçado debatendo os méritos de várias formas de abordar um problema; a solução escolhida será a primeira que é funcional e satisfatória... que honrará o tempo que uma pessoa competente colocou nela.

source: This is the only way to earn one's stripes: do something useful and show that one has worked well. Many Debian “administrative” teams operate by appointment, preferring volunteers who have already effectively contributed and proved their competence. This method is practical, because the most of the work these teams do is public, therefore, accessible to any interested developer. This is why Debian is often described as a “meritocracy”.
ja_jp: 地位にふさわしい業績を上げる唯一の方法とは: 何か有益なことをして、それがうまくいったことを示すことです。多くの Debian 「管理」チームは実績を上げていない者を採用しません、つまり、これまでの貢献が効果を挙げており、本人の能力が証明されているボランティアを好むということです。この方法は現実的です、なぜならこれらのチームのが行うほとんどの仕事は公共の (したがって、興味のある開発者は誰でもアクセスできる) ものだからです。そのため、Debian は 「業績主義」と言われています。
pt_br: Esta é a única maneira de obter reconhecimento: fazer algo de útil e mostrar que funciona bem. Muitas equipes "administrativas" Debian operam por indicação, preferindo voluntários que já contribuíram efetivamente e provaram sua competência. Este método é prático, porque a maior parte do trabalho feito por essas equipes é público, portanto, acessível a qualquer desenvolvedor interessado. É por isso que o Debian é frequentemente descrito como uma "meritocracia".

source: <emphasis>CULTURE</emphasis> Meritocracy, the reign of knowledge
ja_jp: <emphasis>CULTURE</emphasis> 業績主義、知識の統治
pt_br: <emphasis>CULTURA</emphasis> Meritocracia, o reino do conhecimento

source: <primary>meritocracy</primary>
ja_jp: <primary>業績主義</primary>
pt_br: <primary>meritocracia</primary>

source: Meritocracy is a form of government in which authority is exercised by those with the greatest merit. For Debian, merit is a measure of competence, which is, itself, assessed by observation of past actions by one or more others within the project (Stefano Zacchiroli, the previous project leader, speaks of “do-ocracy”, meaning “power to those who get things done”). Their simple existence proves a certain level of competence; their achievements generally being free software, with available source code, which can easily be reviewed by peers to assess their quality.
ja_jp: 業績主義とは、最も高い業績をもつものが権力を行使するという政治の形態です。Debian においては、業績は能力を測る物差しであり、能力はプロジェクトの単独または複数のメンバーが過去の行動を観察して評価されます (元プロジェクトリーダーの Stefano Zacchiroli さんは「do-ocracy」の意味は「物事を成し遂げた人に与えられる権力」を意味すると言っています)。単に業績があるということで能力が一定レベルに達していることを証明するのです; 成果は一般にソースコードが入手可能なフリーソフトウェアに対するもので、同業者はソースコードから成果の品質を評価することが容易に可能です。
pt_br: A meritocracia é uma forma de governo em que autoridade é exercida por aqueles com o maior mérito. Para o Debian, o mérito é uma medida de competência, que é, em si, avaliado pela observação das ações passadas por um ou mais dentro do projeto (Stefano Zacchiroli, o líder anterior do projeto, fala de "do-ocracy", que significa "poder para aqueles que fazem as coisas acontecerem"). Sua simples existência demonstra um certo nível de competência; suas realizações sendo geralmente um software livre, com código fonte disponível, que pode facilmente ser revisto pelos seus pares para avaliar sua qualidade.

source: This effective operational method guarantees the quality of contributors in the “key” Debian teams. This method is by no means perfect and occasionally there are those who do not accept this way of operating. The selection of developers accepted in the teams may appear a bit arbitrary, or even unfair. Furthermore, not everybody has the same definition of the service expected from these teams. For some, it is unacceptable to have to wait eight days for inclusion of a new Debian package, while others will wait patiently for three weeks without a problem. As such, there are regular complaints from the disgruntled about the “quality of service” from some teams.
ja_jp: この効果的な運営方法のおかげで「重要な」Debian チーム内では貢献者の品質が保証されています。この方法は決して完璧ではありませんし、時々この運営方法を受け入れられない人もいます。チーム内で採用されている開発者の選択基準は少し気まぐれかもっと言えば不公平なものに見えるかもしれません。その上、チームから受けられるサービスの定義が皆同じであるとも限りません。新しい Debian パッケージを含めるのに 8 日間待たなければいけないのは受け入れがたい人もいれば、なんの問題もなく 3 週間気長に待つ人もいます。そんなわけで、いくつかのチームからは「サービス品質」の不満に関する苦情が常に寄せられています。
pt_br: Este efetivo método operacional garante a qualidade dos contribuintes "chave" Debian do Debian. Este método é de forma alguma perfeita e, ocasionalmente, há aqueles que não aceitam esta forma de operar. A seleção dos desenvolvedores aceitos nas equipes pode parecer um pouco arbitrária, ou mesmo injusta. Além disso, nem todo mundo tem a mesma definição do serviço esperado das equipes. Para alguns, é inaceitável ter que esperar oito dias para a inclusão de um pacote novo, enquanto outros vão esperar pacientemente por três semanas sem nenhum problema. Como tal, há queixas regulares a partir de descontentes com a "qualidade de serviço" de algumas equipes.

source: <emphasis>COMMUNITY</emphasis> Integration of new maintainers
ja_jp: <emphasis>COMMUNITY</emphasis> 新しいメンテナの参加
pt_br: <emphasis>COMUNIDADE</emphasis> Integração de novos mantenedores

source: <primary>maintainer</primary><secondary>new maintainer</secondary>
ja_jp: <primary>メンテナ</primary><secondary>新メンテナ</secondary>
pt_br: <primary>mantenedor</primary><secondary>novo mantenedor</secondary>

source: The team in charge of admitting new developers is the most regularly criticized. One must acknowledge that, throughout the years, the Debian project has become more and more demanding of the developers that it will accept. Some people may see some injustice in that, but we must confess that what were only little challenges at the beginning have become much greater in a community of over 1,000 people, when it comes to ensuring the quality and integrity of everything that Debian produces for its users.
ja_jp: 新しい開発者の受け入れに責任を持つチームは最も定期的に批判されているチームです。ここ数年、Debian プロジェクトはますます開発者を要求するようになっており、さらにその要求が受け入れられるであろうことを認めなければいけません。一部の人々はこれに不公平さを見出すかもしれません。しかし我々は、Debian がユーザに向けて作り出したすべての物に対する品質と整合性を保証するという点について言えば、はじめは小さな挑戦だったとしても 1,000 人を超えるコミュニティ内でその挑戦はより大きなものになる、ということを打ち明けなければいけません。
pt_br: A equipe responsável pela admissão de novos desenvolvedores é a mais regularmente criticada. É preciso reconhecer que, ao longo dos anos, o projeto se tornou cada vez mais exigente dos desenvolvedores que aceita. Algumas pessoas podem ver alguma injustiça nisso, mas devemos confessar que, o que eram apenas pequenos desafios no início tornaram-se muito maiores em uma comunidade de mais de 1.000 pessoas, quando se trata de garantir a qualidade e integridade de tudo o que o Debian produz para seus usuários.

source: <primary>Debian Account Managers</primary>
ja_jp: <primary>Debian アカウントマネージャ</primary>
pt_br: <primary>Administradores dsa Contas do Debian</primary>

source: Furthermore, the acceptance procedure is concluded by review of the candidacy by a small team, the Debian Account Managers. These managers are, thus, particularly exposed to criticism, since they have final say in the inclusion or rejection of a volunteer within the Debian developers community. In practice, sometimes they must delay the acceptance of a person until they have learned more about the operations of the project. One can, of course, contribute to Debian before being accepted as an official developer, by being sponsored by current developers.
ja_jp: その上、受け入れ手続きの最終的な判断は小さなチーム、Debian アカウントマネージャ、による立候補者の審査に委ねられています。マネージャはボランティアを Debian 開発者コミュニティに受け入れるか拒否するかについて最終的な決定権を持っているため、特に批判を浴びるのです。実際問題として、マネージャはプロジェクトの活動についてより多くを学ぶまでの間、ある人の受け入れを遅らせなければならないことがあります。もちろん、現在の開発者を支援することで、公式開発者として受け入れられる前に Debian に対して貢献することもできます。
pt_br: Além disso, o processo de aceitação, conclui-se pela revisão da candidatura por uma equipe pequena, os Gerentes de Contas Debian (Debian Account Managers). Esses gerentes são, portanto, particularmente expostos à crítica, uma vez que tem a palavra final sobre a inclusão ou rejeição de um voluntário dentro da comunidade de desenvolvedores Debian. Na prática, às vezes, devem adiar a aceitação de uma pessoa até que tenha aprendido mais sobre as operações do projeto. Pode-se, naturalmente, contribuir para o Debian antes de ser aceito como um desenvolvedor oficial, por ter sido indicado por desenvolvedores atuais.

source: The Active Role of Users
ja_jp: ユーザの積極的役割
pt_br: O Papel Ativo dos Usuários
