Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: Another web interface, known as <emphasis>Debian Developer's Packages Overview</emphasis> (DDPO), provides each developer a synopsis of the status of all Debian packages placed under their charge. <ulink type="block" url="http://qa.debian.org/developer.php" />
ja_jp: もうひとつのウェブインターフェイスは <emphasis>Debian 開発者のパッケージ一覧</emphasis> (DDPO) として知られています。これはある開発者が責任を持つ全ての Debian パッケージの概要を提供します。<ulink type="block" url="http://qa.debian.org/developer.php" />
pt_br: Outra interface web, conhecida como <emphasis> Supervisão de Pacotes do Desenvolvedor Debian (Debian Developer's Packages Overview) </emphasis> (DDPO), fornece a cada desenvolvedor uma sinopse do estado de todos os pacotes Debian colocados sob a sua carga. <ulink type="block" url="http://qa.debian.org/developer.php" />

source: These two websites are tools used by Debian QA (Quality Assurance), the group responsible for quality assurance within Debian.
ja_jp: Debian QA (品質保証) はこれら 2 つのウェブサイトとツールを使っており、このグループは Debian の品質保証に責任を負っています。
pt_br: Estes dois sites são ferramentas usadas pela Debian QA (Quality Assurance), o grupo responsável pela garantia de qualidade no Debian.

source: <primary>assurance</primary><secondary>quality assurance</secondary>
ja_jp: <primary>保証</primary><secondary>品質保証</secondary>
pt_br: <primary>garantia</primary><secondary>garantia de qualidade</secondary>

source: <primary>quality</primary><secondary>assurance</secondary>
ja_jp: <primary>品質</primary><secondary>保証</secondary>
pt_br: <primary>qualidade</primary><secondary>garantia</secondary>

source: The <emphasis>listmasters</emphasis> administer the e-mail server that manages the mailing lists. They create new lists, handle bounces (delivery failure notices), and maintain spam filters (unsolicited bulk e-mail).
ja_jp: <emphasis>listmasters</emphasis> はメーリングリストを運営する電子メールサーバを管理します。彼らが新しいメーリングリストを作成し、宛先不明 (配送失敗通知) を処理し、スパムフィルタ (迷惑メールフィルタ) をメンテナンスします。
pt_br: A equipe <emphasis>listmasters </emphasis> administra o servidor de e-mail que gerencia as listas de discussão. Eles criam novas listas , tratam das quicadas (avisos de falha na entrega), e mantem os filtros de spam (massa não solicitada de e-mail).

source: <emphasis>CULTURE</emphasis> Traffic on the mailing lists: some figures
ja_jp: <emphasis>CULTURE</emphasis> メーリングリストの流量: some figures
pt_br: <emphasis>CULTURA</emphasis> Tráfego nas listas de discussão: alguns números

source: <primary>lists</primary><secondary>mailing lists</secondary>
ja_jp: <primary>リスト</primary><secondary>メーリングリスト</secondary>
pt_br: <primary>listas</primary><secondary>listas de discussão</secondary>

source: <primary>mailing lists</primary>
ja_jp: <primary>メーリングリスト</primary>
pt_br: <primary>listas de email</primary>

source: The mailing lists are, without a doubt, the best testimony to activity on a project, since they keep track of everything that happens. Some statistics (from 2012) regarding our mailing lists speak for themselves: Debian hosts more than 260 lists, totaling 190,000 individual subscriptions. The 22,000 messages sent each month generate 600,000 e-mails daily.
ja_jp: メーリングリストがプロジェクトの活発度を証明する最良の方法であることは間違いありません、なぜなら、起きたことをすべて記録しているからです。我々のメーリングリストに関するいくつかの統計 (2012 年に行われた) が雄弁に語っています; Debian は 260 を超えるメーリングリストをホストしており、合計で 190,000 のユニークアドレスが登録されています。毎月 22,000 のメッセージが送信され、毎日 600,000 の電子メールが配送されています。
pt_br: As listas de discussão são, sem dúvida, o melhor testemunho para a atividade em um projeto, uma vez que mantém o controle de tudo o que acontece. Algumas estatísticas (de 2012) sobre nossas listas falam por si: o Debian hospeda mais de 260 listas, totalizando 190.000 assinaturas individuais. As 22.000 mensagens enviadas a cada mês geram 600.000 e-mails diariamente.

source: Each specific service has its own administration team, generally composed of volunteers who have installed it (and also frequently programmed the corresponding tools themselves). This is the case of the bug tracking system (BTS), the package tracking system (PTS), <literal>alioth.debian.org</literal> (FusionForge server, see sidebar), the services available on <literal>qa.debian.org</literal>, <literal>lintian.debian.org</literal>, <literal>buildd.debian.org</literal>, <literal>cdimage.debian.org</literal>, etc.
ja_jp: それぞれのサービスには自身の管理チームがあり、ほとんどの場合サービスを設置したボランティア (しばしばサービスで利用しているツールをプログラムしたボランティア) がチームのメンバーになっています。これに当てはまるケースとして、バグ追跡システム (BTS)、パッケージ追跡システム (PTS)、<literal>alioth.debian.org</literal> (FusionForge サーバ、傍注参照)、<literal>qa.debian.org</literal> で利用できるサービス、<literal>lintian.debian.org</literal>、<literal>buildd.debian.org</literal>、<literal>cdimage.debian.org</literal> などがあります。
pt_br: Cada serviço específico tem sua própria equipe de administração, geralmente composta de voluntários que o instalaram (e também frequentemente programam as ferramentas correspondentes eles mesmos). Este é o caso do sistema de acompanhamento de bugs (BTS), o sistema de rastreamento de pacotes (PTS), <literal>alioth.debian.org</literal> (servidor FusionForge, consulte a barra lateral), os serviços disponíveis no <literal>qa.debian.org</literal>, <literal>lintian.debian.org</literal>, <literal>buildd.debian.org</literal>, <literal>cdimage.debian.org</literal>, etc.

source: Development Teams, Transversal Teams
ja_jp: 開発チーム、横断チーム
pt_br: Equipes de Desenvolvimento, Equipes Transversais

source: Unlike administrative teams, the development teams are rather widely open, even to outside contributors. Even if Debian does not have a vocation to create software, the project needs some specific programs to meet its goals. Of course, developed under a free software license, these tools make use of methods proven elsewhere in the free software world.
ja_jp: 管理チームとは異なり、開発チームの門戸は外部の貢献者に向けてかなり大きく開かれています。Debian の使命がソフトウェアを作成することではないとしても、目標を達成するためにはプロジェクトは特定のプログラムを必要としています。もちろん、フリーソフトウェアライセンスの下で開発されたそれらのソフトウェアはフリーソフトウェア世界の他の場所で保証されている方法を活用します。
pt_br: Diferente das equipes administrativas, as equipes de desenvolvimento são bem amplamente abertas, mesmo para os contribuintes de fora. Mesmo que se o Debian não tem vocação para criar um software, o projeto necessita de alguns programas específicos para atender seus objetivos. Claro, desenvolvido sob uma licença de software livre, essas ferramentas fazem uso de métodos comprovados em outras partes do mundo do software livre.

source: <emphasis>CULTURE</emphasis> CVS
pt_br: <emphasis>CULTURA</emphasis> CVS

source: <primary>Concurrent Versions System</primary>
ja_jp: <primary>並行バージョンシステム</primary>
pt_br: <primary>Sistema de Versões Concorrentes</primary>

source: <primary>configuration management</primary>
ja_jp: <primary>構成管理</primary>
pt_br: <primary>gerenciamento de configuração</primary>

source: CVS (Concurrent Versions System) is a tool for collaborative work on multiple files, while maintaining a history of modifications. The files in question are generally text files, such as a program's source code. If several people work together on the same file, <command>cvs</command> can only merge the alterations made if they were made to different portions of the file. Otherwise, these “conflicts” must be resolved by hand. This system manages modifications, line by line, by storing diff patches from one version to another.
ja_jp: CVS (並行バージョンシステム) は複数のファイルで共同作業をする際のツールで、変更の歴史を管理するものです。対象となるファイルは通常プログラムのソースコードなどのテキストファイルです。もし数人が同じファイルに対して一緒に仕事を行った場合、<command>cvs</command> がマージできるのは、同じファイルの別の場所に行われた修正だけです。それ以外の場合、手作業で「衝突」を解決しなければいけません。このシステムは、あるバージョンからほかのバージョンになる際の diff パッチを保存することで、行ごとの変更を管理しています。
pt_br: CVS (Concurrent Versions System | Sistema de Versões Concorrentes) é uma ferramenta para o trabalho colaborativo em vários arquivos, mantendo um histórico de modificações. Os arquivos em questão são geralmente arquivos de texto, como o código de um programa fonte. Se várias pessoas trabalham juntas no mesmo arquivo, <command> cvs </command> apenas podem mesclar as alterações feitas, se elas foram feitos para diferentes partes do arquivo. Caso contrário, esses "Conflitos" devem ser resolvidos com a mão. Este sistema gerencia as modificações, linha por linha, armazenando os patches diff de uma versão para outra.

source: CVS uses a central archive (called a CVS repository) to store files and the history of their modifications (each revision is recorded in the form of a <emphasis>diff</emphasis> patch file, intended to be used on the prior version). Everyone checks out a particular version (working copy) to work on. The tool allows one to view the modifications made to the working copy (<command>cvs diff</command>), to record them in the central repository by creating a new entry in the versions history (<command>cvs commit</command>), to update the working copy to include modifications made in parallel by other uses (<command>cvs update</command>), and to record a particular configuration in the history in order to be able to easily extract it later on (<command>cvs tag</command>).
ja_jp: CVS は中央アーカイブ (CVS リポジトリと呼ばれる) を使い、ファイルと変更履歴を保存します (それぞれのリビジョンはひとつ前のバージョンに対して適用する <emphasis>diff</emphasis> パッチファイルの形で記憶されます)。あるバージョンに対して作業を行うときは、作業コピーにそれをチェックアウトします。このツールを使うことで、作業コピーに対して行われた変更を見たり (<command>cvs diff</command>)、バージョン履歴に新しいエントリを追加することで中央リポジトリに変更を記録したり (<command>cvs commit</command>)、他のユーザが並行して行った変更を適用して作業コピーを更新したり (<command>cvs update</command>)、後から簡単に取り出すことができるように履歴に特別な設定を記録する (<command>cvs tag</command>)、ことができます。
pt_br: CVS utiliza um arquivo central (chamado de repositório CVS) para armazenar arquivos e o histórico de suas modificações (cada revisão é registrada na forma de um patch de arquivo <emphasis>diff</emphasis> , destinado a ser utilizado na versão anterior) . Todos verificam uma determinada versão (cópia de trabalho) para trabalhar. A ferramenta permite visualizar as modificações feitas na cópia de trabalho (<command> cvs diff </command>), para gravá-los no repositório central através da criação de uma nova entrada no histórico das versões (<command> cvs commit </command >), para atualizar a cópia de trabalho para incluir modificações feitas em paralelo por outros usos (<command> cvs update </command>), para gravar uma configuração especial na história, a fim de ser capaz de facilmente extraí-lo mais tarde (<command> cvs tag </command>).

source: <command>CVS</command> experts will know how to handle multiple concurrent versions of a project in development without them interfering with each other. These versions are called <emphasis>branches</emphasis>. This metaphor of a tree is fairly accurate, since a program is initially developed on a common trunk. When a milestone has been reached (such as version 1.0), development continues on two branches: the development branch prepares the next major release, and the maintenance branch manages updates and fixes for version 1.0.
ja_jp: <command>CVS</command> の達人は、開発中互いに干渉することなく、あるプロジェクトの複数の並行バージョンを操作する方法を知っているでしょう。これは<emphasis>ブランチ (枝)</emphasis> と呼ばれています。このように木で例えることはかなり正確です、なぜならプログラムは同じトランク (幹) に対して開発が始まっているからです。節目 (バージョン 1.0 など) に到達したら、2 つのブランチで開発が続けられます: 開発ブランチでは次のメジャーリリースを準備し、メンテナンスブランチではバージョン 1.0 に対する更新と修正を管理します。
pt_br: <command> CVS </command> peritos sabem como lidar com várias versões simultâneas de um projeto em desenvolvimento sem que interfiram uns com os outros. Estas versões são chamados <emphasis> ramos </emphasis>. Esta metáfora de uma árvore é bastante precisa, uma vez que um programa é desenvolvido inicialmente em um tronco comum. Quando um marco foi alcançado (como a versão 1.0), o desenvolvimento continua em dois ramos: o ramo de desenvolvimento prepara o próximo grande lançamento, e o ramo de manutenção gerencia as atualizações e correções para a versão 1.0.

source: <command>cvs</command>, however, does have some limitations. It is unable to manage symbolic links, changes in file or directory names, the deletion of directories, etc. It has contributed to the appearance of more modern free alternatives which have filled in most of these gaps. These include, especially, <command>subversion</command> (<command>svn</command>), <command>git</command>, <command>bazaar</command> (<command>bzr</command>), and <command>mercurial</command> (<command>hg</command>). <ulink type="block" url="http://subversion.apache.org/" /> <ulink type="block" url="http://git-scm.com/" /> <ulink type="block" url="http://bazaar.canonical.com/" /> <ulink type="block" url="http://mercurial.selenic.com/" />
ja_jp: しかしながら、<command>cvs</command> にはいくつかの制限があります。シンボリックリンク、ファイルまたはディレクトリ名の変更、ディレクトリの削除、などを管理することができません。これらの制限により、さらに現代的なフリーの代替選択肢の出現が促され、代替選択肢ではこれらの制限の多くが解決されました。代替選択肢の中では特に <command>subversion</command> (<command>svn</command>)、<command>git</command>、<command>bazaar</command> (<command>bzr</command>)、<command>mercurial</command> (<command>hg</command>)、が挙げられます。<ulink type="block" url="http://subversion.apache.org/" /> <ulink type="block" url="http://git-scm.com/" /> <ulink type="block" url="http://bazaar.canonical.com/" /> <ulink type="block" url="http://mercurial.selenic.com/" />
pt_br: <command>cvs</command>, no entanto, tem algumas limitações. É incapaz de gerenciar links simbólicos, mudanças em nomes de arquivo ou diretório, a exclusão de diretórios, etc. Ele contribuiu para o aparecimento de alternativas mais modernas e livres que preencheram a maioria dessas lacunas. Estas incluem, especialmente, <command>subversion</command> (<command>svn</command>), <command>git</command>, <command>bazaar</command> (<command>bzr</command> ), e <command>mercurial</command> (<command>hg</command>). <ulink type="block" url="http://subversion.apache.org/" /> <ulink type="block" url="http://git-scm.com/" /> <ulink type = "bloco" url = "http://bazaar.canonical.com" /> <ulink type="block" url="http://mercurial.selenic.com/" />

source: <primary><command>subversion</command></primary>
pt_br: <primary><command>subversão</command></primary>

source: Debian has developed little software of its own, but certain programs have assumed a starring role, and their fame has spread beyond the scope of the project. Good examples are <command>dpkg</command>, the Debian package management program (it is, in fact, an abbreviation of Debian PacKaGe, and generally pronounced as “dee-package”), and <command>apt</command>, a tool to automatically install any Debian package, and its dependencies, guaranteeing the consistency of the system after an upgrade (its name is an acronym for Advanced Package Tool). Their teams are, however, much smaller, since a rather high level of programming skill is required to gain an overall understanding of the operations of these types of programs.
ja_jp: Debian は自分用に小さなソフトウェアを開発し続けてきましたが、一部のプログラムは重要な役割を担っており、そのようなプログラムの名声は Debian プロジェクトよりも大きく広がっています。Debian パッケージ管理プログラムの <command>dpkg</command> (実際のところ、これは Debian PacKaGe の 略称で、「dee-package」と発音されます) と、任意の Debian パッケージとそのパッケージが依存しているパッケージを、更新後のシステムの継続性を保障しながら、自動的にインストールする <command>apt</command> (名前は Advanced Package Tool の頭字語) がそのよい例です。一方で、これらのプログラムの働きを全面的に理解するには極めて高いプログラミング能力が必要であるため、チームの規模は極めて小さなものです。
pt_br: Debian desenvolveu poucos softwares por si só, mas certos programas têm assumido um papel importante, sua fama se espalhou para além escopo do projeto. Bons exemplos são <command>dpkg</command>, o programa de gerenciamento de pacotes do Debian (é, na verdade, uma abreviatura de Debian PacKaGe -- pacote do Debian), e <command>apt</command>, uma ferramenta para instalação automática de qualquer pacote Debian, e suas dependências, garantindo a coesão do sistema após a atualização (seu nome é uma sigla para Advanced Package Tool -- Ferramenta Avançada de Pacotes). Os seus times são, no entanto, muito pequenos, uma vez que um nível bastante elevado de habilidade de programação é necessária para a compreensão do conjunto de ações destes tipos de programas.

source: The most important team is probably that for the Debian installation program, <command>debian-installer</command>, which has accomplished a work of momentous proportions since its conception in 2001. Numerous contributors were needed, since it is difficult to write a single program able to install Debian on a dozen different architectures. Each one has its own mechanism for booting and its own bootloader. All of this work is coordinated on the <email>debian-boot@lists.debian.org</email> mailing list, under the direction of Joey Hess and Cyril Brulebois. <ulink type="block" url="http://www.debian.org/devel/debian-installer/" /> <ulink type="block" url="http://kitenet.net/~joey/blog/entry/d-i_retrospective/" />
ja_jp: Debian インストールプログラム <command>debian-installer</command> の開発チームは最も重要なチームです。2001 年の構想以来ずっと、開発チームは極めて重要度の高い仕事を達成し続けています。たくさんの異なるアーキテクチャに Debian をインストールできるたった 1 つのプログラムを書くのは難しいため、数多くの貢献者が必要でした。それぞれのアーキテクチャではそれぞれ異なる起動メカニズムと異なるブートローダを使っています。この仕事のすべては Joey Hess さんと Cyril Brulebois さんの指揮の下 <email>debian-boot@lists.debian.org</email> メーリングリストで組織的に行われています。<ulink type="block" url="http://www.debian.org/devel/debian-installer/" /> <ulink type="block" url="http://kitenet.net/~joey/blog/entry/d-i_retrospective/" />
pt_br: A equipe mais importante é provavelmente a do programa de instalação do Debian, <command>debian-installer</command>, que realizou uma obra de proporções monumentais, desde a sua concepção em 2001. Vários colaboradores foram necessários, uma vez que é difícil escrever um único programa capaz de instalar o Debian em uma dúzia de diferentes arquiteturas. Cada um tem seu próprio mecanismo para inicialização e seu próprio bootloader. Todo este trabalho é coordenado na lista de discussão <email>debian-boot@lists.debian.org</email>, sob a direção de Joey Hess e Cyril Brulebois. <ulink type="block" url="http://www.debian.org/devel/debian-installer/" /> <ulink type="block" url="http://kitenet.net/~joey/entry/d-i_retrospective/"/>

source: The (very small) <command>debian-cd</command> program team has an even more modest objective. Many “small” contributors are responsible for their architecture, since the main developer can not know all the subtleties, nor the exact way to start the installer from the CD-ROM.
ja_jp: <command>debian-cd</command> プログラム (とても小さい) のチームはさらにいっそう控えめな目的を持っています。数多くの「小」貢献者は彼らのアーキテクチャに対して責任を負います、それは主開発者はすべての細かな差異や CD-ROM からインストーラを起動する正確な方法を知ることはできないからです。
pt_br: A (muito pequena) equipe do programa <command>debian-cd</command> tem um objetivo ainda mais modesto. Muitos "pequenos" colaboradores são responsáveis pela sua arquitetura, já que o principal desenvolvedor pode não saber todas as sutilezas, nem a forma exata para iniciar o instalador a partir do CD-ROM.

source: Many teams must collaborate with others in the activity of packaging: <email>debian-qa@lists.debian.org</email> tries, for example, to ensure quality at all levels of the Debian project. The <email>debian-policy@lists.debian.org</email> list develops Debian Policy according to proposals from all over the place. The teams in charge of each architecture (<email>debian-<replaceable>architecture</replaceable>@lists.debian.org</email>) compile all packages, adapting them to their particular architecture, if needed.
ja_jp: 多くのチームは他のチームと一緒にパッケージ化を行わなければいけません: たとえば、 <email>debian-qa@lists.debian.org</email> は Debiab プロジェクトのあらゆるレベルで品質を保証しようと試みます。<email>debian-policy@lists.debian.org</email> メーリングリストはあちこちからの提案に従って Debian ポリシーを成長させます。アーキテクチャごとの違いに対して責任を負うチームは (<email>debian-<replaceable>architecture</replaceable>@lists.debian.org</email>) 全てのパッケージをコンパイルし、必要ならばそれらを自分たちのアーキテクチャに適合させます。
pt_br: Muitas equipes devem colaborar com outras na atividade de empacotamento: <email> debian-qa@lists.debian.org </email> tenta, por exemplo, garantir a qualidade em todos os níveis do projeto Debian. A equipe do lista do programa <email>debian-policy@lists.debian.org </email> desenvolve A Política do Debian de acordo com propostas de todo o lugar. A equipe encarregada de cada arquitetura (<email> debian-<replaceable> arquitetura </replaceable> @ lists.debian.org </email>) compila todos os pacotes, adaptando-os à sua arquitetura particular, se necessário.

source: Other teams manage the most important packages in order to ensure maintenance without placing too heavy a load on a single pair of shoulders; this is the case with the C library and <email>debian-glibc@lists.debian.org</email>, the C compiler on the <email>debian-gcc@lists.debian.org</email> list, or Xorg on the <email>debian-x@lists.debian.org</email> (this group is also known as the X Strike Force, and coordinated by Cyril Brulebois).
ja_jp: メンテナンスを保証する際に 1 チームの負担が大きくなりすぎないよう、他のチームが最も重要なパッケージを管理しています; そのようなケースとして、C ライブラリと <email>debian-glibc@lists.debian.org</email>、C コンパイラと <email>debian-gcc@lists.debian.org</email>、Xorg と <email>debian-x@lists.debian.org</email> (このグループはX Strike Force としても知られており、Cyril Brulebois さんが指揮しています)、の関係が挙げられます。
pt_br: Outras equipes gerenciam os pacotes mais importantes, a fim de garantir a manutenção sem colocar uma carga muito pesada sobre um único par de ombros, este é o caso com a biblioteca C a <email>debian-glibc@lists.debian.org</email>, o compilador C na lista <email>debian-gcc@lists.debian.org</email>, ou o Xorg na <email>debian-x@lists.debian.org</email> (este grupo também é conhecido como o X Strike Force, e é coordenado por Cyril Brulebois).

source: Follow Debian News
ja_jp: Debian ニュースを追いかける
pt_br: Siga as notícias do Debian

source: As already mentioned, the Debian project evolves in a very distributed, very organic way. As a consequence, it may be difficult at times to stay in touch with what happens within the project without being overwhelmed with a never-ending flood of notifications.
ja_jp: すでに述べたとおり、Debian プロジェクトは極めて分散的で有機的な方法で発展しています。その結果、プロジェクトの内部で起きた出来事について絶えず情報を得るようにすると、終わらない洪水のごとく通知が溢れ返ることになります。
pt_br: Como já mencionado, o projeto Debian evolui muito distribuído, de forma muito orgânica. Como consequência, pode ser difícil às vezes para ficar em contato com o que acontece dentro do projeto sem ser sobrecarregado por uma torrente interminável de notificações.

source: If you only want the most important news about Debian, you probably should subscribe to the <email>debian-announce@lists.debian.org</email> list. This is a very low-traffic list (around a dozen messages a year), and only gives the most important announcements, such as the availability of a new stable release, the election of a new Project Leader, or the yearly Debian Conference.
ja_jp: 最も重要なニュースだけを知りたいのなら、<email>debian-announce@lists.debian.org</email> メーリングリストを購読することをお勧めします。このメーリングリストはきわめて流量が少なく (1 年に数通程度)、たとえば新しい安定版のリリース、新しいプロジェクトリーダーの選挙、年 1 回の Debian カンファレンスなど、最重要の発表だけが載せられます。
pt_br: Se você quer somente as notícias mais importantes sobre o Debian, você provavelmente deve se inscrever na lista <email>debian-announce@lists.debian.org</email>. Esta é uma lista de muito baixo tráfego (cerca de uma dúzia de mensagens por ano), e apenas dá os anúncios mais importantes, tais como a disponibilidade de uma nova versão estável, a eleição de um novo líder do projeto, ou a conferência anual do Debian.

source: <primary>Debian Project News</primary>
ja_jp: <primary>Debian プロジェクトニュース</primary>
pt_br: <primary>Projeto Debian de Notícias</primary>
