Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: Last anecdotal point, it was Bruce who was responsible for inspiring the different “codenames” for Debian versions (1.1 — <emphasis role="distribution">Rex</emphasis>, 1.2 — <emphasis role="distribution">Buzz</emphasis>, 1.3 — <emphasis role="distribution">Bo</emphasis>, 2.0 — <emphasis role="distribution">Hamm</emphasis>, 2.1 — <emphasis role="distribution">Slink</emphasis>, 2.2 — <emphasis role="distribution">Potato</emphasis>, 3.0 — <emphasis role="distribution">Woody</emphasis>, 3.1 — <emphasis role="distribution">Sarge</emphasis>, 4.0 — <emphasis role="distribution">Etch</emphasis>, 5.0 — <emphasis role="distribution">Lenny</emphasis>, 6.0 — <emphasis role="distribution">Squeeze</emphasis>, 7 — <emphasis role="distribution">Wheezy</emphasis>, <emphasis role="distribution">Testing</emphasis> — <emphasis role="distribution">Jessie</emphasis>, <emphasis role="distribution">Unstable</emphasis> — <emphasis role="distribution">Sid</emphasis>). They are taken from the names of characters in the Toy Story movie. This animated film entirely composed of computer graphics was produced by Pixar Studios, with whom Bruce was employed at the time that he led the Debian project. The name “Sid” holds particular status, since it will eternally be associated with the <emphasis role="distribution">Unstable</emphasis> branch. In the film, this character was the neighbor child, who was always breaking toys — so beware of getting too close to <emphasis role="distribution">Unstable</emphasis>. Otherwise, <emphasis role="distribution">Sid</emphasis> is also an acronym for “Still In Development”.
ja_jp: 最後に指摘しておきたい事例は Bruce が Debian のバージョンにつけられるさまざまな「コードネーム」のモチーフを作ったという点です (1.1 - <emphasis role="distribution">Rex</emphasis>、1.2 - <emphasis role="distribution">Buzz</emphasis>、1.3 - <emphasis role="distribution">Bo</emphasis>、2.0 - <emphasis role="distribution">Hamm</emphasis>、2.1 - <emphasis role="distribution">Slink</emphasis>、2.2 - <emphasis role="distribution">Potato</emphasis>、3.0 - <emphasis role="distribution">Woody</emphasis>、3.1 - <emphasis role="distribution">Sarge</emphasis>、4.0 - <emphasis role="distribution">Etch</emphasis>、5.0 - <emphasis role="distribution">Lenny</emphasis>、6.0 - <emphasis role="distribution">Squeeze</emphasis>、7 - <emphasis role="distribution">Wheezy</emphasis>、<emphasis role="distribution">テスト版</emphasis> - <emphasis role="distribution">Jessie</emphasis>、<emphasis role="distribution">不安定版</emphasis> - <emphasis role="distribution">Sid</emphasis>)。これらは映画トイ・ストーリーのキャラクター名から採られています。この全編コンピュータグラフィックスで構成されたアニメーション映画は、Bruce が Debian プロジェクトを率いていた当時に働いていた Pixar スタジオによって製作されました。「Sid」の名前は永久に<emphasis role="distribution">不安定版</emphasis>と関連付けられているため、特別な状態を意味しています。映画の中で、このキャラクターは常におもちゃを壊している隣の子供です、<emphasis role="distribution">不安定版</emphasis> に近づき過ぎるのには用心してください。別の見方では <emphasis role="distribution">Sid</emphasis> は「Still In Development (いまだに開発中)」を意味する頭字語でもあります。
pt_br: O último detalhe anedótico foi Bruce quem foi o responsável por inspirar os diferentes "codinomes" para as versões Debian (1.1 — <emphasis role="distribution">Rex</emphasis>, 1.2 — <emphasis role="distribution">Buzz</emphasis>, 1.3 — <emphasis role="distribution">Bo</emphasis>, 2.0 — <emphasis role="distribution">Hamm</emphasis>, 2.1 — <emphasis role="distribution">Slink</emphasis>, 2.2 — <emphasis role="distribution">Potato</emphasis>, 3.0 — <emphasis role="distribution">Woody</emphasis>, 3.1 — <emphasis role="distribution">Sarge</emphasis>, 4.0 — <emphasis role="distribution">Etch</emphasis>, 5.0 — <emphasis role="distribution">Lenny</emphasis>, 6.0 — <emphasis role="distribution">Squeeze</emphasis>, 7 — <emphasis role="distribution">Wheezy</emphasis>, <emphasis role="distribution">Testing</emphasis> — <emphasis role="distribution">Jessie</emphasis>, <emphasis role="distribution">Unstable</emphasis> — <emphasis role="distribution">Sid</emphasis>). Eles tomam os nomes dos personagens do filme Toy Story. Este filme de animação composto inteiramente por computação gráfica foi produzida pela Pixar Studios, onde Bruce foi funcionário no momento em que esse liderou o projeto Debian. O nome "Sid" tem status especial, uma vez que será eternamente associado ao ramo <emphasis role="distribution">Unstable (Instável)</emphasis>. No filme, esse personagem era o filho vizinho que sempre quebrava os brinquedos - por isso tenha cuidado de ficar muito próximo do <emphasis role="distribution">Unstable (Instável)</emphasis>. De outra forma, <emphasis role="distribution">Sid</emphasis> também é um acrônimo de "Still In Development".

source: The Inner Workings of the Debian Project
ja_jp: Debian プロジェクトの内部の仕組み
pt_br: O Funcionamento interno do Projeto Debian

source: <primary>operations, internal</primary>
ja_jp: <primary>内部操作</primary>
pt_br: <primary>operações, internas</primary>

source: <primary>organization, internal</primary>
ja_jp: <primary>内部組織</primary>
pt_br: <primary>organização, interna</primary>

source: The abundant end results produced by the Debian project derive simultaneously from the work on the infrastructure performed by experienced Debian developers, from the individual or collective work of developers on Debian packages, and from user feedback.
ja_jp: Debian プロジェクトの優れた最終結果は、Debian 開発経験者によるインフラ整備作業とDebianパッケージの個々またはグループ開発者の作業の集約、そしてユーザからのフィードバックの同時進行により成り立っています。
pt_br: Os resultados abundantes produzidos pelo projeto Debian derivam simultaneamente do trabalho na infraestrutura realizado pelos experientes desenvolvedores Debian, de trabalho individual ou coletivo dos desenvolvedores de pacotes Debian e dos comentários dos usuários.

source: The Debian Developers
ja_jp: Debian 開発者
pt_br: Os Desenvolvedores Debian

source: <primary>developers</primary><secondary>Debian developers</secondary>
ja_jp: <primary>開発者</primary><secondary>Debian 開発者</secondary>
pt_br: <primary>desenvolvedores</primary><secondary>desenvolvedores Debian</secondary>

source: Debian developers have various responsibilities, and as official project members, they have great influence on the direction the project takes. A Debian developer is generally responsible for at least one package, but according to their available time and desire, they are free to become involved in numerous teams, acquiring, thus, more responsibilities within the project. <ulink type="block" url="http://www.debian.org/devel/people" /> <ulink type="block" url="http://www.debian.org/intro/organization" /> <ulink type="block" url="http://wiki.debian.org/Teams" />
ja_jp: Debian 開発者には公式プロジェクトメンバーとしてのさまざまな責任があります。彼らはプロジェクトの方針に重大な影響を与えます。一般に Debian 開発者は最低一つのパッケージに対して責任がありますが、時間がありそうしたいと思えば、多数のチームに参加することでプロジェクト内でより重い責任を負うことも自由にできます。<ulink type="block" url="http://www.debian.org/devel/people" /> <ulink type="block" url="http://www.debian.org/intro/organization" /> <ulink type="block" url="http://wiki.debian.org/Teams" />
pt_br: Os desenvolvedores Debian tem várias responsabilidades, e como membros oficiais do projeto, eles têm grande influência sobre a direção que o projeto leva. Um desenvolvedor Debian é geralmente responsável por pelo menos um pacote, mas de acordo com seu tempo disponível e vontade, eles são livres para se envolver em numerosas equipes, adquirindo, assim, mais responsabilidades dentro do projeto. <ulink type="block" url="http://www.debian.org/devel/people" /> <ulink type = "block" url = "http://www.debian.org/intro/organization" /> <ulink type="block" url="http://wiki.debian.org/Teams" />

source: <emphasis>TOOL</emphasis> Developer's database
ja_jp: <emphasis>TOOL</emphasis> 開発者データベース
pt_br: <emphasis>FERRAMENTA</emphasis> banco de dados de Desenvolvedores

source: <primary>developers</primary><secondary>developer's database</secondary>
ja_jp: <primary>開発者</primary><secondary>開発者データベース</secondary>
pt_br: <primary>desenvolvedores</primary><secondary>banco de dados de desenvolvedores</secondary>

source: <primary>database</primary><secondary>developer's database</secondary>
ja_jp: <primary>データベース</primary><secondary>開発者データベース</secondary>
pt_br: <primary>banco de dados</primary><secondary>banco de dados de desenvolvedores</secondary>

source: Debian has a database including all developers registered with the project, and their relevant information (address, telephone, geographical coordinates such as longitude and latitude, etc.). Some of the information (first and last name, country, username within the project, IRC username, GnuPG key, etc.) is public and available on the Web. <ulink type="block" url="http://db.debian.org/" />
ja_jp: Debian にはプロジェクトに登録されている全ての開発者と関連する情報 (アドレス、電話番号、緯度と経度などの地理座標、等々) のデータベースがあります。一部の情報 (姓名、国籍、プロジェクト内でのユーザ名、IRC ユーザ名、GnuPG 鍵、等々) は公開されておりウェブから入手することができます。<ulink type="block" url="http://db.debian.org/" />
pt_br: O Debian possui um banco de dados que inclui todos os desenvolvedores registrados com o projeto, e suas informações relevantes (endereço, telefone, coordenadas geográficas como longitude e latitude, etc.). Algumas informações (nome e sobrenome, país, nome de usuário dentro do projeto, nome de usuário no IRC, chave GnuPG, etc) são públicos e disponíveis na web. <ulink type="block" url="http://db.debian.org/" />

source: The geographical coordinates allow the creation of a map locating all of the developers around the globe. Debian is truly an international project: its developers can be found on all continents, although the majority are in “Western countries”.
ja_jp: この地理座標を使えば、世界中の開発者全員の位置を載せた地図が作れます。Debian は本当の意味で国際的なプロジェクトです: 全ての大陸 (大部分は「欧米」ですが) に開発者がいます。
pt_br: As coordenadas geográficas permitem a criação de um mapa localizando todos os desenvolvedores ao redor do mundo. O Debian é realmente um projeto internacional: seus desenvolvedores podem ser encontrados em todos os continentes, embora a maioria estão no ocidente.

source: World-wide distribution of Debian developers
ja_jp: 世界的に広がる Debian 開発者
pt_br: rede de distribuição mundial de desenvolvedores Debian

source: <primary>world-wide distribution</primary>
ja_jp: <primary>世界分布</primary>
pt_br: <primary>rede de distribuição mundial</primary>

source: Package maintenance is a relatively regimented activity, very documented or even regulated. It must, in effect, comply with all the standards established by the <emphasis>Debian Policy</emphasis>. Fortunately, there are many tools that facilitate the maintainer's work. The developer can, thus, focus on the specifics of their package and on more complex tasks, such as squashing bugs. <ulink type="block" url="http://www.debian.org/doc/debian-policy/" />
ja_jp: パッケージ管理は比較的厳格に管理された活動で、よく文書化されており、もっと言えばルールが決められています。事実上、パッケージ管理に係るルールは <emphasis>Debian ポリシー</emphasis>の定めるすべての基準と適合します。幸いなことに、パッケージ管理の仕事を手助けする多くのツールが存在します。それゆえ、開発者は担当パッケージに固有の作業や例えばバグ潰しなどのより複雑な作業に集中することができます。<ulink type="block" url="http://www.debian.org/doc/debian-policy/" />
pt_br: Manutenção de pacotes é uma atividade relativamente organizada, muito documentada ou mesmo regulamentada. Deve, de fato, obedecer todas as normas estabelecidas pela <emphasis>Política Debian</emphasis>. Felizmente, existem muitas ferramentas que facilitam o trabalho do mantenedor. O desenvolvedor pode, assim, se concentrar nas especificidades do seu pacote e em tarefas mais complexas, tais como correção de erros. <ulink type="block" url="http://www.debian.org/doc/debian-policy/"/>

source: <emphasis>BACK TO BASICS</emphasis> Package maintenance, the developer's work
ja_jp: <emphasis>BACK TO BASICS</emphasis> パッケージ管理、開発者の仕事
pt_br: <emphasis>VOLTA PARA O BÁSICO</emphasis> Manutenção de Pacotes, o trabalho do desenvolvedor

source: <primary>maintenance</primary><secondary>package maintenance</secondary>
ja_jp: <primary>管理</primary><secondary>パッケージ管理</secondary>
pt_br: <primary>manutenção</primary><secondary>manutenção de pacotes</secondary>

source: <primary>package</primary><secondary>maintenance</secondary>
ja_jp: <primary>パッケージ</primary><secondary>メンテナンス</secondary>
pt_br: <primary>pacotes</primary><secondary>manutenção de</secondary>

source: Maintaining a package entails, first, “packaging” a program. Specifically, this means to define the means of installation so that, once installed, this program will operate and comply with the rules the Debian project sets for itself. The result of this operation is saved in a <filename>.deb</filename> file. Effective installation of the program will then require nothing more than extraction of this compressed archive and execution of some pre-installation or post-installation scripts contained therein.
ja_jp: パッケージ管理とはまず初めにあるプログラムを「パッケージ化すること」です。具体的に言うと、これはあるプログラムをインストールする方法を定義することを意味しています。このため、インストール後すぐにプログラムは動作するようになり、Debian プロジェクトが自身のために設定したルールを順守するでしょう。この操作の結果が <filename>.deb</filename> ファイルに保存されています。事実上、プログラムのインストールに必要なのは、圧縮されたアーカイブを展開すること、インストール前およびインストール後にスクリプトを実行すること、だけです。
pt_br: A manutenção de um pacote implica, primeiro, "empacotar" um programa. Especificamente, isso significa definir o meio de instalação para que, uma vez instalado, este programa funcione e cumpra as regras que o projeto Debian definiu para si mesmo. O resultado dessa operação é salvo em um arquivo <filename>.deb</filename>. A instalação efetiva do programa irá exigir nada mais do que a extração deste arquivo compactado e execução de alguns scripts de pré-instalação ou pós-instalação nele contido.

source: After this initial phase, the maintenance cycle truly begins: preparing updates to follow the latest version of the Debian Policy, fixing bugs reported by users, and including new “upstream” versions of the program which naturally continues to develop simultaneously. For instance, at the time of the initial packaging, the program was at version 1.2.3. After some months of development, the original authors release a new stable version, numbered 1.4.0. At this point, the Debian maintainer should update the package, so that users can benefit from its latest stable version.
ja_jp: この最初の段階の後、メンテナンスサイクルが本当に始まります: Debian ポリシーの最新版に従うようにアップデートを準備すること、ユーザが報告したバグを修正すること、プログラムの新しい「上流」バージョン (開発を自然に継続したバージョン) を含めること。例えば、最初のパッケージ化の際、プログラムのバージョンは 1.2.3 だったとしましょう。数か月の開発の後、オリジナルの作者は新しい安定版バージョン 1.4.0 を発表しました。この時点で、Debian メンテナはパッケージをアップデートするべきです、そうすればユーザは最新安定版の恩恵を受けられるようになります。
pt_br: Após esta fase inicial, o ciclo de manutenção realmente começa: preparação de atualizações para seguir a versão mais recente da Política Debian, correção de erros reportados pelos usuários, e a inclusão de uma nova versão do programa que, naturalmente, continua a desenvolver-se simultaneamente. Por exemplo, no momento do empacotamento inicial, o programa estava na versão 1.2.3. Após alguns meses de desenvolvimento, os autores originais lançam uma nova versão estável, numerada como 1.4.0. Neste ponto, o mantenedor do Debian deve atualizar o pacote, para que os usuários possam se beneficiar de sua última versão estável.

source: <primary>Debian Policy</primary>
ja_jp: <primary>Debian ポリシー</primary>
pt_br: <primary>Política Debian</primary>

source: <primary>policy</primary>
ja_jp: <primary>ポリシー</primary>
pt_br: <primary>política</primary>

source: The Policy, an essential element of the Debian Project, establishes the norms ensuring both the quality of the packages and perfect interoperability of the distribution. Thanks to this Policy, Debian remains consistent despite its gigantic size. This Policy is not fixed in stone, but continuously evolves thanks to proposals formulated on the <email>debian-policy@lists.debian.org</email> mailing list. Amendments that are agreed upon by all interested parties are accepted and applied to the text by a small group of maintainers who have no editorial responsibility (they only include the modifications agreed upon by the Debian developers that are members of the above-mentioned list). You can read current amendment proposals on the bug tracking system: <ulink type="block" url="http://bugs.debian.org/debian-policy" />
ja_jp: Debian プロジェクトの重要な要素である Debian ポリシーはパッケージの品質とディストリビューションの完全な相互運用性の両方を確保するための規範を定めています。このポリシーのおかげで、Debian は巨大にも関わらずその一貫性を保っています。このポリシーは決定事項ではありません、<email>debian-policy@lists.debian.org</email> メーリングリストに寄せられた提案を練ることで絶え間なく進化しています。関係者全員からの同意を得た修正は承認され、編集責任を持たないメンテナの小集団がこれを文章に反映します (上に挙げたメーリングリストのメンバーである Debian 開発者ができるのは、同意された修正を盛り込むことだけです)。現在寄せらている修正の提案を読むにはバグ追跡システムをご確認ください: <ulink type="block" url="http://bugs.debian.org/debian-policy" />
pt_br: A política, um elemento essencial do Projeto Debian, estabelece as normas que asseguram a qualidade dos pacotes e interoperabilidade perfeita da distribuição. Graças a esta Política, o Debian permanece consistente apesar de seu tamanho gigantesco. Esta Política não é cláusula pétrea, mas continuamente evolui graças às propostas formuladas na lista de discussão <email>debian-policy@lists.debia.org</email>. As alterações acordadas por todas as partes interessadas são aprovadas e aplicadas ao texto por um reduzido grupo de mantenedores que não têm qualquer responsabilidade editorial (eles somente incluem as modificações acordadas pelos desenvolvedores do Debian que são membros da lista acima referida). Você pode ler as propostas de alteração em andamento no sistema de rastreamento de erros: <ulink type="block" url="http://bugs.debian.org/debian-policy"/>

source: <emphasis>COMMUNITY</emphasis> Policy editorial process
ja_jp: <emphasis>COMMUNITY</emphasis> ポリシー編集手続き
pt_br: <emphasis>COMUNIDADE</emphasis> Processo de política editorial

source: Anyone can propose an amendment to the Debian Policy just by submitting a bug report with a severity level of “wishlist” against the <emphasis role="pkg">debian-policy</emphasis> package. The process that then starts is documented in <filename>/usr/share/doc/debian-policy/Process.html</filename>: if it is acknowledged that the problem revealed must be resolved by creating a new rule in the Debian Policy, a discussion begins on the <email>debian-policy@lists.debian.org</email> mailing list until consensus is reached and a proposal issued. Someone then drafts a desired amendment and submits it for approval (in the form of a patch to review). As soon as two other developers approve the fact that the proposed amendment reflects the consensus reached in the previous discussion (they “second” it), the proposal can be included in the official document by one of the <emphasis role="pkg">debian-policy</emphasis> package maintainers. If the process fails at one of these steps, the maintainers close the bug, classifying the proposal as rejected.
ja_jp: 重要度を「wishlist」にして <emphasis role="pkg">debian-policy</emphasis> パッケージにバグ報告を投稿すれば誰でも Debian ポリシーに修正を提案できます。この手続きは <filename>/usr/share/doc/debian-policy/Process.html</filename> に書かれています: もし Debian ポリシーに新しいルールを作ることで投稿された問題を解決しなければいけないと認知されたら、合意に達して提案が公表されるまで <email>debian-policy@lists.debian.org</email> メーリングリストで議論されます。この後、誰かが要求された修正に対する草稿を書いて、承認を求めるために投稿します (パッチレビューの形で)。2 人の他の開発者が、提案された修正は以前の議論で達せられた合意を反映したものであると承認したら (彼らが修正に「賛同」したら) すぐに、<emphasis role="pkg">debian-policy</emphasis> パッケージメンテナの 1 人がこの提案を公式文書に盛り込みます。これらの手続きのどれか 1 つでも失敗したら、メンテナは提案を却下に分類して、バグを閉じます。
pt_br: Qualquer pessoa pode propor uma emenda à Política Debian apenas mediante a apresentação de um relatório de erro com um nível de gravidade "wishlist" (desejo) contra o pacote <emphasis role="pkg">debian-policy</emphasis>. O processo que começa está documentado em <filename>/usr/share/doc/debian-policy/Process.html</filename>: se é reconhecido como problema deve ser resolvido através da criação de uma nova regra na Política Debian, uma discussão começa na na lista de discussão <email>debian-policy@lists.debian.org </email> até que um consenso seja alcançado e uma proposta emitida. Alguém redige a alteração pretendida e envia para aprovação (na forma de um patch para revisão). Tão logo que dois outros desenvolvedores aprovem o fato de que a alteração proposta reflete o consenso alcançado na discussão anterior, a proposta pode ser incluída no documento oficial por um dos mantenedores do pacote <emphasis role="pkg">debian-policy</emphasis>. Se o processo falhar em um destes passos, os mantenedores fecham o erro, classificando a proposta como rejeitada.

source: <emphasis>DEBIAN POLICY</emphasis> The documentation
ja_jp: <emphasis>DEBIAN POLICY</emphasis> 文書
pt_br: <emphasis>POLÍTICA DEBIAN</emphasis> A documentação

source: <primary>documentation</primary><secondary>location</secondary>
ja_jp: <primary>文書</primary><secondary>場所</secondary>
pt_br: <primary>documentação</primary><secondary>localização</secondary>

source: <primary>location of the documentation</primary>
ja_jp: <primary>文書の場所</primary>
pt_br: <primary>localização da documentação</primary>
