Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: One might wonder if it is relevant to mention the users among those who work within the Debian project, but the answer is a definite yes: they play a critical role in the project. Far from being “passive”, some users run development versions of Debian and regularly file bug reports to indicate problems. Others go even further and submit ideas for improvements, by filing a bug report with a severity level of “wishlist”, or even submit corrections to the source code, called “patches” (see sidebar <xref linkend="sidebar.patch" />).
ja_jp: Debian プロジェクト内で働く人の中でもユーザに言及する必要があるのではないかと思うかもしれません、その答えは間違いなく yes です: ユーザは重要な役割を果たしています。「受け身」の状態から一歩進んで、 Debian の開発版を使い、問題を説明するバグレポートを出すユーザもいます。さらに深く立ち入り、重要度「wishlist」のバグレポートを出すことで改善案を投稿したり、「patches」でソースコードの修正を投稿するユーザもいます (傍注 <xref linkend="sidebar.patch" /> をご覧ください)。
pt_br: Alguém pode se perguntar se é relevante mencionar os usuários entre aqueles que trabalham dentro do projeto Debian, mas a resposta é com certeza "sim". eles desempenham um papel fundamental no projeto. Longe de ser "passivos", alguns usuários executam versões de desenvolvimento do Debian e regularmente apresentam relatórios de bugs para indicar problemas. Outros vão ainda mais longe e apresentam idéias de melhorias, mediante a apresentação de um relatório de bug com um nível de gravidade "wishlist", ou mesmo apresentam correções no código fonte, chamadas de "patches" (veja a barra lateral <xref linkend="sidebar.patch" /> ).

source: <emphasis>TOOL</emphasis> Bug tracking system
ja_jp: <emphasis>TOOL</emphasis> バグ追跡システム
pt_br: <emphasis>FERRAMENTA</emphasis> Bug tracking system

source: <primary>system</primary><secondary>Bug Tracking System</secondary>
ja_jp: <primary>システム</primary><secondary>バグ追跡システム</secondary>
pt_br: <primary>sistema</primary><secondary>Sistema de Acompanhamento de Bug</secondary>

source: <primary>Bug Tracking System</primary>
ja_jp: <primary>バグ追跡システム</primary>
pt_br: <primary>Sistema de Acompanhamento de Bug</primary>

source: The Debian Bug Tracking System (Debian BTS) is used by large parts of the project. The public part (the web interface) allows users to view all bugs reported, with the option to display a sorted list of bugs selected according to various criteria, such as: affected package, severity, status, address of the reporter, address of the maintainer in charge of it, tag, etc. It is also possible to browse the complete historical listing of all discussions regarding each of the bugs.
ja_jp: Debian バグ追跡システム (Debian BTS) はプロジェクトで広く使われています。公開部分 (ウェブインターフェイス) を使ってユーザは報告されたバグを全て見ることができます、必要であれば、さまざまな基準に従ってソート済みのバグリストを表示することができます、例えば: 影響を受けるパッケージ、重要度、状態、報告者のアドレス、パッケージの責任を負うメンテナのアドレス、タグ、などなど。あるバグに関連する全ての議論の完全な履歴リストを閲覧することも可能です。
pt_br: Grandes partes do projeto usam o Sistema de Acompanhamento de Bugs (Debian BTS). A parte pública (a interface web) permite aos usuários visualizarem todos os bugs reportados, com a opção de mostrar uma lista ordenada de erros selecionados de acordo com vários critérios, tais como: pacote afetado, gravidade, estado, endereço do relator, endereço do mantenedor no comando, etiquetas, etc. Também é possível navegar pela lista completa do histórico de todas as discussões sobre cada um dos bugs.

source: Below the surface, the Debian BTS communicates via e-mail: all information that it stores come from messages sent by the various persons involved. Any e-mail sent to <email>12345@bugs.debian.org</email> will, thus, be assigned to the history for bug no. 12345. Authorized persons may “close” a bug by writing a message describing the reasons for the decision to close to <email>12345-done@bugs.debian.org</email> (a bug is closed when the indicated problem is resolved or no longer relevant). A new bug is reported by sending an e-mail to <email>submit@bugs.debian.org</email> according to a specific format which identifies the package in question. The address <email>control@bugs.debian.org</email> allows editing of all the “meta-information” related to a bug.
ja_jp: 内部的には Debian BTS は電子メールを経由して連絡を取っています: 関係するさまざまな人が送信したメッセージが情報として全て保存されています。このため <email>12345@bugs.debian.org</email> 宛に送信された電子メールは番号 12345 のバグに関する連絡履歴に割り当てられます。議論を終わらせる理由を説明したメッセージを <email>12345-done@bugs.debian.org</email> 宛に書くことで、権限のある人がバグを「閉じる」ことがあります (バグを閉じるのは、報告された問題が解決されたか、もはや意味のない場合です)。新しいバグを報告するには、問題になっているパッケージの特定に必要である特殊な書式に従い、<email>submit@bugs.debian.org</email> 宛に電子メールを送ってください。アドレス <email>control@bugs.debian.org</email> はバグに関連する全ての「メタ情報」を編集するために設けられています。
pt_br: Sutilmente, a BTS Debian comunica via e-mail: todas informações que armazena vêm de mensagens enviadas pelas pessoas envolvidas. Qualquer e-mail enviado para <email> 12345@bugs.debian.org </email> irá, portanto, ser atribuída à história de bug número. 12345. Pessoas autorizadas podem "fechar" um erro ao escrever uma mensagem descrevendo as razões para a decisão de fechar o <email> 12345-done@bugs.debian.org </email> (um bug é fechado quando o problema indicado foi resolvido ou não é mais relevante). Um novo bug é relatada através do envio de um e-mail para <email> submit@bugs.debian.org </email> de acordo com um formato específico que identifica o pacote em questão. O endereço <email> control@bugs.debian.org </email> permite a edição de todos as "meta-informação" relacionado a um bug.

source: Debian BTS has other functional features, as well, such as the use of tags for labeling bugs. For more information, see <ulink type="block" url="http://www.debian.org/Bugs/" />
ja_jp: Debian BTS に他にも機能的特色 (バグにラベルを貼るための便利なタグ機能など) があります。詳しい情報を見るには以下の URL を参照してください <ulink type="block" url="http://www.debian.org/Bugs/" />
pt_br: O BTS Debian tem outras características funcionais, tais como o uso de tags para erros de rotulagem. Para mais informações, consulte <ulink type="block" url="http://www.debian.org/Bugs/" />

source: <emphasis>VOCABULARY</emphasis> Severity of a bug
ja_jp: <emphasis>VOCABULARY</emphasis> バグの重要度
pt_br: <emphasis>VOCABULÁRIO</emphasis> Severidade de um bug

source: <primary>severity</primary>
ja_jp: <primary>重要度</primary>
pt_br: <primary>severidade</primary>

source: <primary>bug</primary><secondary>severity</secondary>
ja_jp: <primary>バグ</primary><secondary>重要度</secondary>
pt_br: <primary>bug</primary><secondary>severidade</secondary>

source: The severity of a bug formally assigns a degree of gravity to the reported problem. Effectively, not all bugs have the same importance; for instance, a typo in a manual page is not comparable to a security vulnerability in server software.
ja_jp: バグの重要度とは堅苦しく言うと報告された問題の重要性の度合いを意味しています。実際のところ、全てのバグの重要性は同一ではありません; 例えば、マニュアルの誤植とサーバソフトウェアのセキュリティ脆弱性を比較することはできません。
pt_br: A severidade de um bug atribui formalmente um grau de severidade para o problema relatado. Efetivamente, nem todos os bugs têm a mesma importância, por exemplo, um erro de digitação em uma página de manual não é comparável a uma vulnerabilidade de segurança no software do servidor.

source: Debian uses an extended scale to describe the severity of a bug. Each level is defined precisely in order to facilitate the selection thereof. <ulink type="block" url="http://www.debian.org/Bugs/Developer#severities" />
ja_jp: Debian はバグの重要度を類型化するために等級の意味を拡大して使用しています。それぞれのレベルは、重要度の選択がしやすいよう、明確に定義されています。<ulink type="block" url="http://www.debian.org/Bugs/Developer#severities" />
pt_br: O Debian usa uma escala estendida para indicar com precisão a severidade de um bug. Cada nível é definido com precisão a fim de facilitar a seleção dos mesmos. <ulink type="block" url="http://www.debian.org/Bugs/Developer#severities" />

source: Additionally, numerous satisfied users of the service offered by Debian like to make a contribution of their own to the project. As not everyone has appropriate levels of expertise in programming, they may choose to assist with the translation and review of documentation. There are language-specific mailing lists to coordinate this work. <ulink type="block" url="https://lists.debian.org/i18n.html" /> <ulink type="block" url="http://www.debian.org/international/" />
ja_jp: 加えて、Debian の提供するサービスに満足している数多くのユーザが彼ら自身の手でプロジェクトに貢献をしたいと思っています。プログラミングの専門知識レベルが十分でない人は翻訳や文書のレビューを行うことで手助けを行うことを選ぶかもしれません。このような仕事を行うために言語固有のメーリングリストがあります。<ulink type="block" url="https://lists.debian.org/i18n.html" /> <ulink type="block" url="http://www.debian.org/international/" />
pt_br: Além disso, inúmeros usuários satisfeitos do serviço oferecido pelo Debian gostariam de fazer uma contribuição própria para o projeto. Como nem todos tem níveis apropriados de experiência em programação, eles escolhem ajudar com a tradução e revisão de documentação. Há listas de discussão específicas para vários idiomas. <ulink type="block" url="https://lists.debian.org/i18n.html" /> <ulink type="block" url="http://www.debian.org/international/" />

source: <emphasis>BACK TO BASICS</emphasis> What are i18n and l10n?
ja_jp: <emphasis>BACK TO BASICS</emphasis> i18n (国際化) と l10n (地域化) とは?
pt_br: <emphasis>VOLTA PARA O BÁSICO</emphasis> O que são i18n e l10n?

source: <primary>internationalization</primary>
ja_jp: <primary>国際化</primary>
pt_br: <primary>internaciolização</primary>

source: <primary>localization</primary>
ja_jp: <primary>地域化</primary>
pt_br: <primary>localização</primary>

source: “i18n” and “l10n” are the abbreviations for the words “internationalization” and “localization”, respectively, preserving the initial and last letter of each word, and the number of letters in the middle.
ja_jp: 「i18n」と「l10n」は「internationalization (国際化)」と「localization (地域化)」の略語です。それぞれの単語の最初と最後の文字を取って、真ん中の文字の数を数字で表しています。
pt_br: "I18n" e "l10n" são as abreviaturas (em inglês) para as palavras "internacionalização" e "regionalização", respectivamente, preservando a letra inicial e final de cada palavra, e o número de letras no meio.

source: To “internationalize” a program consists of modifying it so that it can be translated (localized). This involves partially rewriting a program initially written to work in one language in order to be able to open it to all languages.
ja_jp: あるプログラムの「国際化を行う」ということは、そのプログラムを翻訳 (地域化) できるように変更を加えることを含んでいます。これは最初ある言語で動くように書かれたプログラムを一部書き換えて、どんな言語でも動くようにすることを伴います。
pt_br: "Internacionalizar" um programa consiste em modificá-lo para que ele possa ser traduzido (regionalizado). Isso envolve reescrever parcialmente um programa inicialmente escrito para trabalhar em uma língua, a fim de ser capaz de abri-lo para todos os idiomas.

source: To “localize” a program consists of translating the original messages (frequently in English) to another language. For this, it must have already been internationalized.
ja_jp: あるプログラムの「地域化を行う」ということは、元のメッセージ (英語の場合が多い) を他の言語に翻訳することを含んでいます。地域化を行うには先にプログラムを国際化しておかなければいけません。
pt_br: "Regionalizar" um programa consiste em traduzir as mensagens originais (frequentemente em Inglês) para outro idioma. Para isso, já deve ter sido internacionalizado.

source: In summary, internationalization prepares the software for translation, which is then executed by localization.
ja_jp: まとめると、国際化とはソフトウェアを翻訳するための準備で、翻訳することにより地域化が行われます。
pt_br: Em resumo, a internacionalização prepara o software para a tradução, que é então executada pela regionalização.

source: <emphasis>BACK TO BASICS</emphasis> Patch, the way to send a fix
ja_jp: <emphasis>BACK TO BASICS</emphasis> パッチ、修正を送る方法
pt_br: <emphasis>DE VOLTA AO BÁSICO</emphasis> Patch, a forma de enviar uma correção

source: A patch is a file describing changes to be made to one or more reference files. Specifically, it will contain a list of lines to be removed or added to the code, as well as (sometimes) lines taken from the reference text, replacing the modifications in context (they allow identification of the placement of the changes if the line numbers have been changed).
ja_jp: パッチとは単独または複数のファイルに対する変更内容を記述したファイルです。具体的に言うと、パッチはコードを修正後の内容に置き換えるために、コードから削除された行と追加された行と (ときどき) それらの行位置の目印となるテキストのリスト (これは行番号が変わった場合に変更の場所を特定するためのものです) を含んでいます。
pt_br: Um patch é um arquivo que descreve mudanças a serem feitas a um ou mais arquivos de referência. Especificamente, ele irá conter uma lista de linhas a serem removidos ou adicionado ao código, bem como (por vezes) linhas tomadas a partir do texto de referência, substituindo as modificações no contexto (que permitem identificar o posicionamento das alterações, se os números de linha foram alterados).

source: The tool used for applying the modifications given in such a file is simply called <command>patch</command>. The tool that creates it is called <command>diff</command>, and is used as follows:
ja_jp: パッチファイルの提供する修正を適用するためのツールは <command>patch</command> と呼ばれています。パッチファイルを作成するためのツールは <command>diff</command> と呼ばれており、以下のように使います:
pt_br: O instrumento utilizado para aplicar as modificações dadas em tal arquivo é simplesmente chamado de <command> patch</command>. A ferramenta que o cria é chamado <command>diff</command>, e é utilizado como se segue:

source: The <filename>file.patch</filename> file contains the instructions for changing the content of <filename>file.old</filename> into <filename>file.new</filename>. We can send it to someone, who can then use it to recreate <filename>file.new</filename> from the two others, like this:
ja_jp: <filename>file.patch</filename> ファイルには <filename>file.old</filename> の内容を <filename>file.new</filename> の内容に変更するための指示が含まれています。我々はこのパッチファイルを送信することができ、受け取った人はパッチファイルを適用して <filename>file.new</filename> を再作成することができます、これを行うには以下のようにします:
pt_br: O arquivo <filename> file.patch </filename> contém as instruções para alterar o conteúdo do <filename> file.old </filename> em <filename> File.new </filename>. Podemos enviá-lo para alguém, que pode usá-lo para recriar <filename> File.new </filename> a partir dos outros dois, como este:

source: The file, <filename>file.old</filename>, is now identical to <filename>file.new</filename>.
ja_jp: こうすることで <filename>file.old</filename> ファイルは <filename>file.new</filename> とまったく同じものになります。
pt_br: O arquivo, <filename> file.old </filename>, é agora idêntico ao <filename> File.new </filename>.

source: <emphasis>TOOL</emphasis> Report a bug with <command>reportbug</command>
ja_jp: <emphasis>TOOL</emphasis> <command>reportbug</command> を使ったバグ報告
pt_br: <emphasis> FERRAMENTA </emphasis> Assinalar um bug com <command> reportbug </command>

source: <primary>bug</primary><secondary>report a bug</secondary>
ja_jp: <primary>バグ</primary><secondary>バグ報告</secondary>
pt_br: <primary>bug</primary><secondary>relatar um bug</secondary>

source: <primary>report a bug</primary>
ja_jp: <primary>バグ報告</primary>
pt_br: <primary>relatar um bug</primary>

source: The <command>reportbug</command> tool facilitates sending bug reports on a Debian package. It helps making sure the bug in question hasn't already been filed, thus preventing redundancy in the system. It reminds the user of the definitions of the severity levels, for the report to be as accurate as possible (the developer can always fine-tune these parameters later, if needed). It helps writing a complete bug report without the user needing to know the precise syntax, by writing it and allowing the user to edit it. This report will then be sent via an e-mail server (local, by default, but <command>reportbug</command> can also use a remote server).
ja_jp: <command>reportbug</command> ツールは Debian パッケージに対するバグ報告を簡単に送信できるようにするためのものです。このツールは問題になっているバグがすでに報告されていないかを確認する際に役立ち、同じバグがシステムに報告されることを防いでいます。このツールは可能な限り正確に報告するために、ユーザに重要度レベルの定義を思い出させます (開発者は後から必要になればいつでもレベルを微調整することができます)。このツールはバグ報告を適切な書式に整形する機能と内容をユーザが編集できる機能を提供しているので、このツールを使えばユーザはバグ報告の正確な書式を知らなくても完全なバグ報告を書くことができます。その後、この報告は電子メールサーバを経由して送信されます (デフォルトではローカルサーバを使いますが、<command>reportbug</command> はリモートサーバを使うことも可能です)。
pt_br: A ferramenta <command>reportbug</command> facilita o envio de relatórios de bugs em um pacote Debian. Ela ajuda a assegurar que o bug em questão já não tenha sido relatado, e assim, prevenir redundância no sistema. Lembra o usuário da definição dos níveis de gravidade, para o relatório ser tão preciso quanto possível (o desenvolvedor pode ajustar sempre esses parâmetros mais tarde, se necessário). Ajuda a escrever um relatório de bug completo sem o usuário precisar conhecer a sintaxe exata, escrevendo-o e permitindo que o usuário possa editá-lo. Este relatório será enviado através de um servidor de e-mail (local, por padrão, mas o <command>reportbug</command> também pode usar um servidor remoto).

source: This tool first targets the development versions, which is where the bugs will be fixed. Effectively, changes are not welcome in a stable version of Debian, with very few exceptions for security updates or other important updates (if, for example, a package is not working at all). A correction of a minor bug in a Debian package must, thus, wait for the next stable version.
ja_jp: このツールは最初にバグを修正する場である開発版を対象にします。実際のところ、Debian の安定版では、セキュリティアップデートやその他の重要なアップデート (例えば、あるパッケージが全く動かない) などのごく少数の例外を除いて、修正を歓迎しません。そんなわけで Debian パッケージの深刻でないバグの修正は次の安定版まで待たなければいけません。
pt_br: Esta ferramenta tem como primeiro alvo as versões de desenvolvimento, onde os bugs são corrigidos. Efetivamente, as mudanças não são bem-vindas na versão estável do Debian, com poucas exceções para as atualizações de segurança ou outras atualizações importantes (se, por exemplo, um pacote não funciona de forma alguma). A correção de um pequeno bug em um pacote Debian deve, portanto, esperar pela próxima versão estável.

source: All of these contribution mechanisms are made more efficient by users' behavior. Far from being a collection of isolated persons, users are a true community within which numerous exchanges take place. We especially note the impressive activity on the user discussion mailing list, <email>debian-user@lists.debian.org</email> (<xref linkend="solving-problems" /> discusses this in greater detail).
ja_jp: ユーザの行動によって、上で述べた全ての貢献の仕組みはさらに効果的なものになります。孤立したユーザの集合体から一歩進んで、ユーザ間の交流が数多くの起こるコミュニティこそが本物のコミュニティなのです。ユーザが議論するメーリングリスト <email>debian-user@lists.debian.org</email> で行われる素晴らしい活動について触れておきます (<xref linkend="solving-problems" /> ではこの件に関する詳細な議論がなされています)。
pt_br: Todos esses mecanismos de colaboração são mais eficientes com o comportamento dos usuários. Longe de serem uma coleção de pessoas isoladas, os usuários são uma verdadeira comunidade aonde ocorrem numerosas trocas. Notamos especialmente a impressionante atividade na lista de discussão de usuários, <email>debian-user@lists.debian.org</email> (<xref linkend="solving-problems" /> discute isso com mais detalhe).

source: Not only do users help themselves (and others) on technical issues that directly affect them, but they also discuss the best ways to contribute to the Debian project and help it move forward — discussions that frequently result in suggestions for improvements.
ja_jp: ユーザ同士が本人に直接影響のある技術的な問題について互いに助け合う (または誰かが助ける) だけでなく、ユーザが Debian プロジェクトに貢献するための最良の方法を話し合い、プロジェクトが前進するための手助け - 高い頻度で改良が提案されるような議論を行います。
pt_br: Não só os usuários se ajudam entre si (e outros) com questões técnicas que afetam diretamente a eles, mas também discutem as melhores formas de contribuir para o projeto Debian e ajudá-lo a avançar - discussões que frequentemente resultam em sugestões para melhorias.

source: Since Debian does not expend funds on any self-promoting marketing campaigns, its users play an essential role in its diffusion, ensuring its notoriety via word-of-mouth.
ja_jp: Debian は自己アピールによる普及キャンペーンに資金を使わないため、Debian のユーザは Debian の普及に重要な役割を果たし、Debian の評判は口コミで伝わることが保障されています。
pt_br: Já que o Debian não gasta fundos em todas campanhas de auto-promoção de marketing, seus usuários têm um papel essencial na sua difusão, assegurando a sua notoriedade através da propaganda boca a boca.

source: This method functions quite well, since Debian fans are found at all levels of the free software community: from install parties (workshops where seasoned users assist newcomers to install the system) organized by local LUGs or “Linux User Groups”, to association booths at large tech conventions dealing with Linux, etc.
ja_jp: この方法は極めてうまくいきます、なぜならフリーソフトウェアコミュニティのあらゆる層に Debian の支持者がいるからです: 地域の LUG 「Linux ユーザグループ」が企画したインストールパーティ (ベテランユーザが新しいユーザにシステムのインストールの補助を行うワークショップ) から、Linux などについて取り扱う大きな技術会議のアソシエーションブースにも浸透しています。
pt_br: Este método funciona muito bem, uma vez que fãs do Debian são encontrados em todos os níveis da comunidade de software livre: a partir de festas de instalação (oficinas onde os usuários experientes ajudam os recém-chegados para instalar o sistema) organizados por GULs locais ou "Grupos de Usuários de Linux", para estandes de associação em grandes convenções que lidam com tecnologias como o Linux, etc.

source: Volunteers make posters, brochures, stickers, and other useful promotional materials for the project, which they make available to everyone, and which Debian provides freely on its website: <ulink type="block" url="http://www.debian.org/events/material" />
ja_jp: ボランティアがポスター、パンフレット、ステッカーなどのプロジェクトの宣伝に役立つ資料をを作り、彼らは宣伝資料を誰でも利用できるようにしており、Debian はウェブサイトで宣伝資料を無制限に提供しています: <ulink type="block" url="http://www.debian.org/events/material" />
pt_br: Voluntários fazem cartazes, folhetos, adesivos e outros materiais promocionais úteis para o projeto, que colocam à disposição de todos, e que o Debian oferece gratuitamente em seu portal web: <ulink type="block" url="http://www.debian.org/events/material" />

source: Teams and Sub-Projects
ja_jp: チームとサブプロジェクト
pt_br: Equipes e Sub-Projetos

source: Debian has been organized, right from the start, around the concept of source packages, each with its maintainer or group of maintainers. Many work teams have emerged over time, ensuring administration of the infrastructure, management of tasks not specific to any package in particular (quality assurance, Debian Policy, installer, etc.), with the latest series of teams growing up around sub-projects.
ja_jp: Debian は最初からずっと、ソースパッケージの概念を中心に組織化され続けており、ソースパッケージにはそのメンテナとメンテナのグループがいます。チームが担当する仕事の多くは長い時間をかけて明らかにされてきました、確実にインフラを運営すること、特定のパッケージに依存しないタスク (品質保証、Debian ポリシー、インストーラなど) を管理すること、そして最近サブプロジェクトの周りで成長している数多くのチームと一緒にそれを行うことです。
pt_br: O Debian é organizado inicialmente em torno do conceito de pacotes de código fonte, cada um com seu mantenedor ou grupo de mantenedores. Numerosas equipes de trabalho lentamente apareceram, garantindo a administração da infra-estrutura, gestão de tarefas não específicas para qualquer pacote em particular (garantia de qualidade, Política Debian, instalador, etc), com as últimas equipes crescendo ao redor dos sub-projetos.

source: Existing Debian Sub-Projects
ja_jp: 存在する Debian サブプロジェクト
pt_br: Sub-Projetos Debian Existentes

source: To each their own Debian! A sub-project is a group of volunteers interested in adapting Debian to specific needs. Beyond the selection of a sub-group of programs intended for a particular domain (education, medicine, multimedia creation, etc.), sub-projects are also involved in improving existing packages, packaging missing software, adapting the installer, creating specific documentation, and more.
ja_jp: 人それぞれ好みの Debian があります! サブプロジェクトは Debian を特定のニーズに適応することに興味のあるボランティアのグループです。特定の領域 (教育、医療、マルチメディア制作など) を対象としたプログラム群の選定だけでなく、サブプロジェクトはまた、既存パッケージの改良、不足ソフトウェアのパッケージ化、インストーラの適応作業、特定文書の作成、などに従事しています。
pt_br: Cada um com seu próprio Debian! Um subprojeto é um grupo de voluntários interessados em adaptar o Debian para necessidades específicas. Além da seleção de um subgrupo de programas destinados a um domínio particular (educação, medicina, criação multimídia, etc), os subprojetos estão também envolvidos em melhorar os pacotes existentes, empacotar software faltando, adaptar o instalador, criação de documentação específica, e mais.

source: <emphasis>VOCABULARY</emphasis> Sub-project and derivative distribution
ja_jp: <emphasis>VOCABULARY</emphasis> サブプロジェクトと派生ディストリビューション
pt_br: <emphasis>VOCABULÁRIO</emphasis> Sub-projeto e distribuição derivada

source: <primary>derivative distribution</primary>
ja_jp: <primary>派生ディストリビューション</primary>
pt_br: <primary>distruibuição derivada</primary>
