Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: Every newly updated package is updated on all Debian mirrors around the world within six hours. The users then test the corrections and search for other problems resulting from the modifications. Several updates may then occur rapidly. During these times, autobuilder robots come into action. Most frequently, the maintainer has only one traditional PC and has compiled his package on the amd64 (or i386) architecture; the autobuilders take over and automatically compile versions for all the other architectures. Some compilations may fail; the maintainer will then receive a bug report indicating the problem, which is then to be corrected in the next versions. When the bug is discovered by a specialist for the architecture in question, the bug report may come with a patch ready to use.
ja_jp: 新たに更新されたパッケージは全て、6 時間以内に世界中の全ての Debian ミラーで更新されます。そしてユーザが修正をテストし、変更したことで生じる別の問題を探します。いくつかの更新は素早くなされるかもしれません。これらの間、自動ビルドロボットが活動を始めます。多くの場合、メンテナは古い PC を一台だけ持っており、amd64 (または i386) アーキテクチャでパッケージをコンパイルしています。自動ビルドロボットはコンパイル作業を引き受け、すべての他のアーキテクチャ向けのバージョンを自動的にコンパイルします。いくつかのコンパイルは失敗するかもしれません; メンテナは問題の内容を含んだバグ報告を受け取り、このバグは次のバージョンで修正されます。問題となっているアーキテクチャの専門家がバグを発見した場合、そのバグ報告にはすぐに使えるパッチが添えられているかもしれません。
pt_br: Cada pacote recém-atualizado é atualizado em todos os espelhos do Debian ao redor do mundo em seis horas. Os usuários então testam as correções e procuram outros problemas resultantes das modificações. Várias atualizações então podem ocorrer rapidamente. Durante esses momentos, os robôs de compilação automática (autobuilder) entram em ação. Na maioria das vezes, o mantenedor tem apenas um PC tradicional e compilou seu pacote na arquitetura amd64 (ou i386); os autobuilders assumem o comando e compilam automaticamente versões para todas as outras arquiteturas. Algumas compilações podem falhar; o mantenedor receberá um relatório de bug indicando o problema que deve ser corrigido nas próximas versões. Quando o erro é descoberto por um especialista para a arquitetura em questão, o relatório de bug pode vir com um patch pronto para uso.

source: Compilation of a package by the autobuilders
ja_jp: 自動ビルドロボットによるパッケージのコンパイル
pt_br: Compilação de um pacote pelos autobuilders

source: <emphasis>QUICK LOOK</emphasis> <command>buildd</command>, the Debian package recompiler
ja_jp: <emphasis>QUICK LOOK</emphasis> <command>buildd</command>、Debian パッケージ再コンパイルロボット
pt_br: <emphasis>VISTA RÁPIDA</emphasis> <command>buildd</command>, O recompilador de pacotes do Debian

source: <primary>build daemon</primary>
ja_jp: <primary>ビルドデーモン</primary>
pt_br: <primary>serviço de construção (build daemon)</primary>

source: <emphasis>buildd</emphasis> is the abbreviation of “build daemon”. This program automatically recompiles new versions of Debian packages on the architectures on which it is hosted (cross-compiling not always being sufficient) .
ja_jp: <emphasis>buildd</emphasis> は「ビルドデーモン」の略語です。このプログラムは Debian パッケージの新しいバージョンをホストされているアーキテクチャ上で自動的に再コンパイルします (クロスコンパイルは常に十分であるとは限りません)。
pt_br: <emphasis> buildd </emphasis> é a abreviação de "build daemon". Este programa automaticamente recompila novas versões de pacotes Debian nas arquiteturas em que está hospedado (compilação cruzada nem sempre é suficiente).

source: Thus, to produce binaries for the <literal>sparc</literal> architecture, the project has <literal>sparc</literal> machines available (specifically, Sun brand). The <emphasis>buildd</emphasis> program runs on them continuously and creates binary packages for <literal>sparc</literal> from source packages sent by Debian developers.
ja_jp: このため、<literal>sparc</literal> アーキテクチャ用のバイナリを作成するために、プロジェクトはを利用可能な <literal>sparc</literal> マシン (具体的に言うと Sun ブランドのマシン) を持っています。<emphasis>buildd</emphasis> プログラムはマシン上で常に起動しており、Debian 開発者の送信したソースパッケージから <literal>sparc</literal> 用のバイナリパッケージを作成します。
pt_br: Assim, para produzir binários para a arquitetura <literal>sparc</literal>, o projeto tem máquinas <literal>sparc</literal> disponíveis (especificamente, da marca Sun). O programa <emphasis>buildd</emphasis> é executado nelas continuamente e cria os pacotes de binários para <literal>sparc</literal> do pacotes fonte enviados pelos desenvolvedores Debian.

source: This software is used on all the computers serving as autobuilders for Debian. By extension, the term <emphasis>buildd</emphasis> frequently is used to refer to these machines, which are generally reserved solely for this purpose.
ja_jp: このソフトウェアは Debian 向けの自動ビルドロボットを提供しているすべてのコンピュータで使われます。転じて、<emphasis>buildd</emphasis> という用語はこれらのマシンを表すために使われることが多く、ほとんどの場合これらマシンは自動ビルド専用機として準備されています。
pt_br: Este software é usado em todos os computadores que servem como autobuilders para o Debian. Por extensão, o termo <emphasis>buildd</emphasis> é frequentemente usado para se referir a estas máquinas, que geralmente são reservadas somente para este propósito.

source: Migration to <emphasis role="distribution">Testing</emphasis>
ja_jp: <emphasis role="distribution">テスト版</emphasis> への移行
pt_br: Migração para <emphasis role="distribution">Teste</emphasis>

source: A bit later, the package will have matured; compiled on all the architectures, it will not have undergone recent modifications. It is then a candidate for inclusion in the <emphasis role="distribution">Testing</emphasis> distribution — a group of <emphasis role="distribution">Unstable</emphasis> packages chosen according to some quantifiable criteria. Every day a program automatically selects the packages to include in <emphasis role="distribution">Testing</emphasis>, according to elements guaranteeing a certain level of quality:
ja_jp: しばらくするとパッケージは成熟するでしょう; すべてのアーキテクチャ上でコンパイルされ、最近行った変更が無くなるでしょう。こうなると、将来<emphasis role="distribution">テスト版</emphasis>ディストリビューションに組み込まれる対象になります - <emphasis role="distribution">不安定版</emphasis>パッケージのグループが定量化可能な基準に従って選ばれます。毎日あるプログラムが、一定の品質水準を保証する要素を基に、<emphasis role="distribution">テスト版</emphasis>に組み込むためのパッケージを自動的に選びます:
pt_br: Um pouco mais tarde, o pacote terá amadurecido; compilados em todas arquiteturas, não vai ter sofrido modificações recentes. É então um candidato de inscrição na distribuição <emphasis role="distribution"> Teste </emphasis> - um grupo de pacotes <emphasis role="distribution"> instáveis </emphasis> escolhidos de acordo com alguns critérios quantificáveis. Todos os dias um programa seleciona automaticamente os pacotes para incluir em <emphasis role="distribution">Teste </emphasis>, de acordo com os elementos que garantem um certo nível de qualidade:

source: lack of critical bugs, or, at least fewer than the version currently included in <emphasis role="distribution">Testing</emphasis>;
ja_jp: 深刻なバグが無いこと、もしくは現時点で<emphasis role="distribution">テスト版</emphasis>に組み込まれているバージョンよりも少ないこと;
pt_br: carece de bugs críticos, ou, pelo menos, menos do que a versão atualmente incluído no <emphasis role="distribution">Teste </emphasis>;

source: at least 10 days spent in <emphasis role="distribution">Unstable</emphasis>, which is sufficient time to find and report any serious problems;
ja_jp: <emphasis role="distribution">不安定版</emphasis>に組み込まれてから少なくとも10日経っていること、これは深刻な問題が発見されて報告されるのに十分な時間です;
pt_br: pelo menos 10 dias em <emphasis role="distribution">Instável </emphasis> , que é tempo suficiente para encontrar e relatar quaisquer problemas graves;

source: successful compilation on all officially supported architectures;
ja_jp: 公式にサポートされている全てのアーキテクチャ上でコンパイルに成功していること;
pt_br: compilação bem-sucedida em todas arquiteturas suportadas oficialmente;

source: dependencies that can be satisfied in <emphasis role="distribution">Testing</emphasis>, or that can at least be moved there together with the package in question.
ja_jp: <emphasis role="distribution">テスト版</emphasis>で依存関係を満たすことができること、そうでなければ少なくとも問題となっているパッケージの準備ができたら一緒に移動することが可能です。
pt_br: dependências que podem ser satisfeitas em <emphasis role="distribution">Instável </emphasis>, ou que podem pelo menos ser mudadas para lá junto com o pacote em questão.

source: This system is clearly not infallible; critical bugs are regularly found in packages included in <emphasis role="distribution">Testing</emphasis>. Still, it is generally effective, and <emphasis role="distribution">Testing</emphasis> poses far fewer problems than <emphasis role="distribution">Unstable</emphasis>, being for many, a good compromise between stability and novelty.
ja_jp: このシステムは明らかに絶対確実なものではありません; 深刻なバグは通常<emphasis role="distribution">テスト版</emphasis>に組み込まれたパッケージから見つかります。とはいっても、このシステムは有効で、<emphasis role="distribution">テスト版</emphasis>は<emphasis role="distribution">不安定版</emphasis>に比べて問題がはるかに少なく、長い間安定性と新規性の良い妥協案でした。
pt_br: É claro que este sistema não é infalível; bugs críticos são encontrados regularmente em pacotes incluídos na <emphasis role="distribution">Teste </emphasis>. Ainda assim, é geralmente eficaz, <emphasis role="distribution">Teste </emphasis> apresenta muito menos problemas do que a <emphasis role="distribution">Instável </emphasis> , sendo para muitos, um bom compromisso entre estabilidade e novidade.

source: <emphasis>NOTE</emphasis> Limitations of <emphasis role="distribution">Testing</emphasis>
ja_jp: <emphasis>NOTE</emphasis> <emphasis role="distribution">テスト版</emphasis>の制限
pt_br: <emphasis> NOTA </emphasis> Limitações da <emphasis role="distribution">Teste </emphasis>

source: While very interesting in principle, <emphasis role="distribution">Testing</emphasis> does have some practical problems: the tangle of cross-dependencies between packages is such that a package can rarely move there completely on its own. With packages all depending upon each other, it is sometimes necessary to migrate a large number of packages simultaneously, which is impossible when some are uploading updates regularly. On the other hand, the script identifying the families of related packages works hard to create them (this would be an NP-complete problem, for which, fortunately, we know some good heuristics). This is why we can manually interact with and guide this script by suggesting groups of packages, or imposing the inclusion of certain packages in a group, even if this temporarily breaks some dependencies. This functionality is accessible to the Release Managers and their assistants.
ja_jp: 原理的な面白さの一方で、<emphasis role="distribution">テスト版</emphasis>は実用上いくつかの問題を抱えています: パッケージ間の相互依存性のもつれは、完全に独力で移動するのはほぼ不可能なパッケージがあるということを意味しています。パッケージ同士が互いに依存し合っていると、数多くのパッケージを同時に移行することが必要になる場合がありますが、一部のパッケージが定期的に更新されていると、それは不可能です。一方で、関連するパッケージ群を識別するスクリプトはこれを作成しようと熱心に働いています (これは NP 完全問題ですが、ありがたいことに、いくつかの良い経験則が知られています)。これが、このスクリプトと手作業で情報をやり取りしたり、パッケージのグループを示唆するか、これにより一時的に依存関係が壊れることになったとしても特定のパッケージをあるグループ内に含めるよう強要することで、スクリプトを手引きしたりしている理由です。この機能はリリースマネージャとその助手でも利用しやすいです。
pt_br: Muito interessante em princípio, a <emphasis role="distribution">Teste</emphasis> coloca alguns problemas práticos: o emaranhado de dependências entre os pacotes é tal que um pacote raramente pode mover-se para lá totalmente por conta própria. Com os pacotes, dependendo uns dos outros, as vezes é necessário uma grande quantidade de pacotes simultaneamente, o que é impossível quando alguns são atualizados regularmente. Por outro lado, o script de identificação das famílias de pacotes relacionados trabalha duro para criá-los (isso seria um problema NP-completo, para o que, felizmente, sabemos de algumas boas heurísticas). É por isso que podemos interagir manualmente com e orientar esse script, sugerindo grupos de pacotes, ou impor a inclusão de certos pacotes em um grupo, mesmo que temporariamente quebre algumas dependências. Esta funcionalidade é acessível para os gerentes de lançamento e os seus assistentes.

source: Recall that an NP-complete problem is of an exponential algorithmic complexity according to the size of the data, here being the length of the code (the number of figures) and the elements involved. The only way to resolve it is frequently to examine all possible configurations, which could require enormous means. A heuristic is an approximate, but satisfying, solution.
ja_jp: NP 完全問題はデータのサイズ (コードの長さ (桁数) や関連する要素の数が含まれます) によってはアルゴリズムに指数的複雑性があるということを思い出してください。この問題を解く唯一の方法は全ての可能性を頻繁に検査することですが、そうするには膨大な財力が必要です。経験則で得られるのは近似解ですが十分な解です。
pt_br: Recorde-se que um problema NP-completo é de uma complexidade exponencial algorítmica de acordo com o tamanho dos dados, sendo aqui o comprimento do código (o número de figuras) e os elementos envolvidos. A única maneira de resolver é freqüentemente examinar todas configurações possíveis que podem exigir meios enormes. Uma heurística é uma aproximada, mas satisfatória, solução.

source: <emphasis>COMMUNITY</emphasis> The Release Manager
ja_jp: <emphasis>COMMUNITY</emphasis> リリースマネージャ
pt_br: <emphasis>COMUNIDADE</emphasis> O Gerente de Lançamento

source: <primary>Release Manager</primary>
ja_jp: <primary>リリースマネージャ</primary>
pt_br: <primary>Gerente de Lançamento</primary>

source: <primary>Stable Release Manager</primary>
ja_jp: <primary>安定版リリースマネージャ</primary>
pt_br: <primary>Gerente de Lançamento Estável</primary>

source: Release Manager is an important title, associated with heavy responsibilities. The bearer of this title must, in effect, manage the release of a new, stable version of Debian, and define the process for development of <emphasis role="distribution">Testing</emphasis> until it meets the quality criteria for <emphasis role="distribution">Stable</emphasis>. They also define a tentative schedule (not always followed).
ja_jp: リリースマネージャは重い責任を伴う重要な役職です。事実上、この役職を持つ人が新しい Debian 安定版のリリースを管理し、<emphasis role="distribution">テスト版</emphasis>が<emphasis role="distribution">安定版</emphasis>の品質基準に達するまでの開発工程を決めます。さらにリリースマネージャは暫定的なスケジュール (必ずしも従う必要はない) も定義します。
pt_br: Gerente de lançamento é um título importante, associado com grandes responsabilidades. O portador deste título deve ter, de fato, de gerenciar a liberação de uma nova versão estável do Debian, definir o processo de de desenvolvimento do Debian <emphasis role="distribution">Teste </emphasis> até que ele atenda aos critérios de qualidade para <emphasis role="distribution"> Estável</emphasis>. Eles também definir um cronograma preliminar (nem sempre seguido).

source: We also have Stable Release Managers, often abbreviated SRM, who manage and select updates for the current stable version of Debian. They systematically include security patches and examine all other proposals for inclusion, on a case by case basis, sent by Debian developers eager to update their package in the stable version.
ja_jp: 安定版リリースマネージャ (通常 SRM と略される) は現在の Debian 安定版に対する更新を管理、選別します。彼らはセキュリティパッチを取り込み、個々の場合に応じて、安定版に含まれるパッケージをしきりに更新したがっている Debian 開発者から送られてくる全ての取り込み提案を検査します。
pt_br: Nós também temos Gerentes de versão estável (Stable Release Managers), muitas vezes abreviado SRM, que gerenciam e selecionam as atualizações para a atual versão estável do Debian. Eles sistematicamente incluem patches de segurança e examinam todas outras propostas de inclusão, numa base caso a caso, enviados por desenvolvedores da Debian ansiosos para atualizar seu pacote na versão estável.

source: The Promotion from <emphasis role="distribution">Testing</emphasis> to <emphasis role="distribution">Stable</emphasis>
ja_jp: <emphasis role="distribution">テスト版</emphasis>から<emphasis role="distribution">安定版</emphasis>への昇格
pt_br: A Promoção de <emphasis role="distribution">Teste </emphasis> para <emphasis role="distribution"> Estável </emphasis>

source: Let us suppose that our package is now included in <emphasis role="distribution">Testing</emphasis>. As long as it has room for improvement, its maintainer must continue to improve it and restart the process from <emphasis role="distribution">Unstable</emphasis> (but its later inclusion in <emphasis role="distribution">Testing</emphasis> is generally faster: unless it changed significantly, all of its dependencies are already available). When it reaches perfection, the maintainer has completed their work. The next step is the inclusion in the <emphasis role="distribution">Stable</emphasis> distribution, which is, in reality, a simple copy of <emphasis role="distribution">Testing</emphasis> at a moment chosen by the Release Manager. Ideally this decision is made when the installer is ready, and when no program in <emphasis role="distribution">Testing</emphasis> has any known critical bugs.
ja_jp: 我々のパッケージが今現在<emphasis role="distribution">テスト版</emphasis>に組み込まれたと仮定しましょう。改善の余地がある限り、メンテナはパッケージを改善し続け、<emphasis role="distribution">不安定版</emphasis>からの一連の手順を最初からやり直さなければいけません (その後<emphasis role="distribution">テスト版</emphasis>へは素早く取り込まれることが多いです: 大きく修正されておらず、全ての依存関係が既に利用可能な場合に限ります)。パッケージが完成の域に達すると、メンテナの仕事は完了です。次のステップは<emphasis role="distribution">安定版</emphasis>ディストリビューションへの取り込みです、実際のところこれはリリースマネージャが選んだ時点における<emphasis role="distribution">テスト版</emphasis>の単純なコピーです。理想的にはこの決断はインストーラの準備が整った時点、そして全ての<emphasis role="distribution">テスト版</emphasis>に含まれるプログラムで既知の致命的バグが解決された時点に行われます。
pt_br: Vamos supor que o nosso pacote agora está incluído no <emphasis role="distribution">Teste</emphasis>. Embora tenha espaço para melhorias, o mantenedor do mesmo deve continuar a melhorá-lo e reiniciar o processo a partir da <emphasis role="distribution">Instável</emphasis> (mas a sua inclusão posterior na <emphasis role="distribution">Teste</emphasis> é geralmente mais rápido: a menos que tenha mudanças significativas, todas suas dependências já estão disponíveis). Quando se atinge a perfeição, o mantenedor conclui seu trabalho. O próximo passo é a inclusão na distribuição <emphasis role="distribution">Estável</emphasis>, que é, na realidade, uma cópia simples da <emphasis role="distribution"> Teste</emphasis> em um momento escolhido pelo Gerente de Lançamento. Idealmente esta decisão é tomada quando o instalador está pronto, e quando nenhum programa na <emphasis role="distribution">Teste</emphasis> tem qualquer bugs críticos conhecidos.

source: Since this moment never truly arrives, in practice, Debian must compromise: remove packages whose maintainer has failed to correct bugs on time, or agree to release a distribution with some bugs in the thousands of programs. The Release Manager will have previously announced a freeze period, during which each update to <emphasis role="distribution">Testing</emphasis> must be approved. The goal here is to prevent any new version (and its new bugs), and to only approve updates fixing bugs.
ja_jp: このような理想的瞬間は絶対に来ないので、実際問題として Debian は妥協しています: メンテナが時間どおりにバグを修正できなかったパッケージを削除したり、多数のプログラムが数個のバグを抱えた状態でディストリビューションをリリースすることに同意したり、します。リリースマネージャは事前にフリーズ期間をアナウンスし、<emphasis role="distribution">テスト版</emphasis>への更新はこの期間中に承認されなければいけません。フリーズ期間を設ける目的は、バージョンが新しくなる更新 (と新たなバグの混入) を禁止し、現在のバージョンに対するバグ修正の更新だけを受け入れることです。
pt_br: Como esse momento nunca chega verdadeiramente, na prática, o Debian deve se comprometer a: remover pacotes cujo mantenedor não tiver corrigido bugs a tempo, ou concorda em publicar uma distribuição com alguns bugs nos milhares de programas. O Gerente de lançamento vai previamente anunciar um período de congelamento, durante o qual cada atualização para <emphasis role="distribution"> Teste</emphasis> deve ser aprovado. O objetivo aqui é evitar qualquer nova versão (e seus novos bugs), e só aprovar as atualizações com correção de bugs.

source: A package's path through the various Debian versions
ja_jp: 様々な Debian バージョンの間をパッケージが移行される様子
pt_br: Caminho de um pacote através das várias versões Debian

source: <emphasis>VOCABULARY</emphasis> Freeze: the home straight
ja_jp: <emphasis>VOCABULARY</emphasis> フリーズ: 最後の追い込み
pt_br: <emphasis> VOCABULÁRIO </emphasis> Freeze: a casa arrumada

source: <primary>freeze</primary>
ja_jp: <primary>フリーズ</primary>
pt_br: <primary>congelamento</primary>

source: During the freeze period, development of the <emphasis role="distribution">Testing</emphasis> distribution is blocked; no more automatic updates are allowed. Only the Release Managers are then authorized to change packages, according to their own criteria. The purpose is to prevent the appearance of new bugs by introducing new versions; only thoroughly examined updates are authorized when they correct significant bugs.
ja_jp: フリーズ期間中、<emphasis role="distribution">テスト版</emphasis>ディストリビューションの開発は妨げられます; もはやアップデートは自動的に行われません。リリースマネージャだけが、自身の基準に従って、パッケージを変更する権限を持っています。この目的は新しいバージョンによって新しいバグが混入するのを防ぐことにあります; 更新は完全に検査され、重大なバグの修正を除き変更は認められません。
pt_br: Durante o período de congelamento, o desenvolvimento do <emphasis role="distribution"> Teste </emphasis> é bloqueado; nenhuma atualização mais recente é permitida. Apenas os gerentes de lançamento são, então, autorizado a alterar , de acordo com seus próprios critérios. O objetivo é prevenir o aparecimento de novos bugs através da introdução de novas versões; apenas atualizações minuciosamente examinadas são autorizadas quando corrigir bugs significativos.

source: After the release of a new stable version, the Stable Release Manager manages all further development (called “revisions”, ex: 5.0.1, 5.0.2, 5.0.3 for version 5.0). These updates systematically include all security patches. They will also include the most important corrections (the maintainer of a package must prove the gravity of the problem that they wish to correct in order to have their updates included).
ja_jp: 新しい安定版のリリース後、安定版リリースマネージャが全ての追加的開発を管理します (「リビジョン」と呼ばれます、例: バージョン 5 のリビジョンは 5.0.1、5.0.2、5.0.3 など)。これらの更新にはすべてのセキュリティパッチが体系的に組み込まれています。更新には最も重要な修正も含まれています (パッケージのメンテナが、更新を含めてもらうためには、修正を望む問題の重大性を証明しなければいけません)。
pt_br: Após o lançamento de uma nova versão estável, o gerente da distribuição estável gerencia todo o desenvolvimento posterior (chamado de "revisões", ex: 5.0.1, 5.0.2, 5.0.3 para a versão 5.0). Essas atualizações incluem sistematicamente todos os patches de segurança. Eles também incluem as correções mais importantes (o mantenedor de um pacote deve comprovar a gravidade do problema que deseja corrigir a fim de ter suas atualizações incluídas).
