Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: The license of a Debian component may not restrict any party from selling or giving away the software as a component of an aggregate software distribution containing programs from several different sources. The license may not require a royalty or other fee for such sale.
ja_jp: Debian を構成する要素が定めるライセンスでは、いかなる組織であっても複数の異なる提供元からのプログラムを含んでいるソフトウェア集約的ディストリビューションの構成要素であるソフトウェアを自由に販売または配布することが許されている、としています。このライセンスでは、販売の際に使用料およびその他の料金を要求してはならない、としています。
pt_br: A licença de um componente Debian não pode restringir nenhuma parte de vender ou doar o software como um componente de uma distribuição agregada de software contendo programas de várias fontes diferentes. A licença não pode exigir um royalty ou outra taxa para tal venda.

source: <emphasis>BACK TO BASICS</emphasis> Free licenses
ja_jp: <emphasis>BACK TO BASICS</emphasis> 自由ライセンス
pt_br: <emphasis>VOLTA PARA O BÁSICO</emphasis> Licenças Livres

source: <primary>license</primary><secondary>BSD</secondary>
ja_jp: <primary>ライセンス</primary><secondary>BSD</secondary>
pt_br: <primary>licença</primary><secondary>BSD</secondary>

source: <primary>BSD license</primary>
ja_jp: <primary>BSD ライセンス</primary>
pt_br: <primary>licença BSD</primary>

source: <primary>license</primary><secondary>GPL</secondary>
ja_jp: <primary>ライセンス</primary><secondary>GPL</secondary>
pt_br: <primary>licença</primary><secondary>GPL</secondary>

source: <primary>license</primary><secondary>artistic</secondary>
ja_jp: <primary>ライセンス</primary><secondary>artistic</secondary>
pt_br: <primary>licença</primary><secondary>artística</secondary>

source: <primary>artistic license</primary>
ja_jp: <primary>artistic ライセンス</primary>
pt_br: <primary>licença artistíca license</primary>

source: The GNU GPL, the BSD license, and the Artistic License all comply with the Debian Free Software Guidelines, even though they are very different.
ja_jp: GNU GPL、BSD ライセンス、Artistic ライセンスは各々が全く別物であるにもかかわらず Debian フリーソフトウェアガイドラインに適合します。
pt_br: A GNU GPL, a licença BSD, e a Licença Artística estão todas em conformidade com a Definição Debian de Software Livre, embora serem muito diferentes.

source: The GNU GPL, used and promoted by the FSF (Free Software Foundation), is the most common. Its main feature is that it also applies to any derived work that is redistributed: a program incorporating or using GPL code can only be distributed according to its terms. It prohibits, thus, any reuse in a proprietary application. This poses serious problems for the reuse of GPL code in free software incompatible with this license. As such, it is sometimes impossible to link a program published under another free software license with a library distributed under the GPL. On the other hand, this license is very solid in American law: FSF lawyers have participated in the drafting thereof, and have often forced violators to reach an amicable agreement with the FSF without going to court. <ulink type="block" url="http://www.gnu.org/copyleft/gpl.html" />
ja_jp: FSF (フリーソフトウェア財団) が利用し推進する GNU GPL は最も一般的なライセンスです。GPL の主な特徴は、再配布される二次製作物にも GPL が適用されるということです: GPL コードを組み込んでいるまたは利用しているプログラムは GPL の定める条件に従って配布されなければいけないのです。それゆえ GPL ではプロプライエタリなアプリケーションで GPL コードを再利用することを禁止しています。このことにより GPL ライセンスに適合しないフリーソフトウェアで GPL コードを再利用すると重大な問題になります。それゆえ GPL の下に配布されているライブラリと別のフリーソフトウェアライセンスの下に公開されているプログラムをリンクするのは不可能な場合があります。他方で、GPL は米国法に強く一致しています。FSF の弁護士は GPL の起草からずっと参加し続け、違反者に対して法廷で争わずに FSF と友好的な合意を得ることを強いる場合が多かったのです。<ulink type="block" url="http://www.gnu.org/copyleft/gpl.html" />
pt_br: A GNU GPL, utilizada e promovida pela FSF (Free Software Foundation), é a mais comum. Sua principal característica é que ela também se aplica a qualquer trabalho derivado que é redistribuído: um programa de incorporação ou usando o código GPL só pode ser distribuído de acordo com seus termos. Proíbe, assim, qualquer reutilização em um aplicativo proprietário. Isto coloca sérios problemas para a reutilização de código GPL em software livre incompatível com esta licença. Como tal, às vezes é impossível ligar um programa publicado sob outra licença de de software livre com uma biblioteca distribuída sob a GPL. Por outro lado, essa licença é muita sólida na legislação americana: advogados FSF têm participado na elaboração da mesma, e muitas vezes forçado violadores a chegar a um acordo amigável com a FSF, sem ir a tribunal. <ulink type="block" url="http://www.gnu.org/copyleft/gpl.html" />

source: The BSD license is the least restrictive: everything is permitted, including use of modified BSD code in a proprietary application. Microsoft even uses it, basing the TCP/IP layer of Windows NT on that of the BSD kernel. <ulink type="block" url="http://www.opensource.org/licenses/bsd-license.php" />
ja_jp: BSD ライセンスは最も制限が緩いライセンスです: プロプライエタリアプリケーションで修正 BSD コードを利用することなど、何もかも許されています。Microsoft でさえ BSD コードを使っています、Windows NT の TCP/IP レイヤでは BSD カーネルの TCP/IP コードが使われているのです。<ulink type="block" url="http://www.opensource.org/licenses/bsd-license.php" />
pt_br: A licença BSD é menos restritiva: tudo é permitido, inclusive o uso de código BSD modificada em uma aplicação proprietária. Microsoft ainda usa, baseando a camada TCP / IP do Windows NT na do kernel do BSD. <ulink type="block" url="http://www.opensource.org/licenses/bsd-license.php" />

source: Finally, the Artistic License reaches a compromise between these two others: integration of code in a proprietary application is permitted, but any modification must be published. <ulink type="block" url="http://www.opensource.org/licenses/artistic-license-2.0.php" />
ja_jp: 最後に、Artistic ライセンスは上記 2 つのライセンスの妥協案です: プロプライエタリアプリケーションにコードを統合することは許可されていますが、いかなる変更も公開しなければいけません。<ulink type="block" url="http://www.opensource.org/licenses/artistic-license-2.0.php" />
pt_br: Finalmente, a Licença Artística alcança um compromisso entre estas duas outras: a integração do código em uma aplicação proprietária é autorizada, mas qualquer modificação deve ser publicada. <ulink type="block" url="http://www.opensource.org/licenses/artistic-license-2.0.php" />

source: The complete text of these licenses is available in <filename>/usr/share/common-licenses/</filename> on any Debian system.
ja_jp: これらのライセンスの完全な原文は Debian システムの <filename>/usr/share/common-licenses/</filename> に置かれています。
pt_br: O texto completo dessas licenças está disponível em <filename> / usr / share / common-licenses / </filename> em qualquer sistema Debian.

source: Source code.
ja_jp: ソースコード。
pt_br: Código Fonte.

source: The program must include source code, and must allow distribution in source code as well as compiled form.
ja_jp: プログラムはソースコードを含まなければならず、さらにコンパイルされた形だけでなくソースコードを配布することも許可しなければいけません。
pt_br: O programa deve incluir código fonte e deve permitir a distribuição em código fonte, bem como em formato compilado.

source: Derived works.
ja_jp: 二次作品。
pt_br: Trabalhos derivados.

source: The license must allow modifications and derived works, and must allow them to be distributed under the same terms as the license of the original software.
ja_jp: ライセンスは修正物および二次製作物を許可しなければいけませんし、修正物および二次製作物のライセンスは元になったソフトウェアのライセンスと同じ条件の下に再配布することも許可しなければいけません。
pt_br: A licença deve permitir modificações e trabalhos derivados e deve permitir que estes sejam distribuídos sob os mesmos termos da licença do software original.

source: Integrity of the author's source code.
ja_jp: 作者のソースコードの組み込み。
pt_br: integridade do autor do código fonte.

source: The license may restrict source-code from being distributed in modified form <emphasis>only</emphasis> if the license allows the distribution of “patch files” with the source code for the purpose of modifying the program at build time. The license must explicitly permit distribution of software built from modified source code. The license may require derived works to carry a different name or version number from the original software (<emphasis>This is a compromise. The Debian group encourages all authors not to restrict any files, source or binary, from being modified</emphasis>).
ja_jp: ライセンスがビルド時にプログラムを修正する目的でソースコードと一緒に「パッチファイル」を配布することを許可している場合に<emphasis>限り</emphasis>、ライセンスはソースコードを修正した形で再配布することを禁止できます。ライセンスは修正されたソースコードからビルドしたソフトウェアの配布を明確に許可しなければいけません。ライセンスは二次作品が元になったソフトウェアとは別の名前もしくはバージョン番号を使うことを要求するかもしれません (<emphasis>これは妥協案です。Debian グループはすべての著者に対して、ソースやバイナリに限らずいかなるファイルに対する変更も制限しないように勧めています</emphasis>)。
pt_br: A licença pode restringir código fonte de ser distribuído em forma modificada <emphasis>apenas</emphasis> se a licença permitir a distribuição de "patch files" com o código fonte para o propósito de modificar o programa em tempo de compilação. A licença deve permitir explicitamente a distribuição de software construído a partir do código fonte modificado. A licença pode exigir que trabalhos derivados tenham um nome diferente ou número de versão do software original (<emphasis>Este é um compromisso. O grupo Debian encoraja todos os autores a não restringir nenhum arquivo, fonte ou binário, de ser modificado</emphasis>).

source: No discrimination against persons or groups.
ja_jp: 個人やグループに対する平等性。
pt_br: Nenhuma discriminação contra pessoas ou grupos.

source: The license must not discriminate against any person or group of persons.
ja_jp: ライセンスはいかなる個人もしくは個人のグループに対して差別してはいけません。
pt_br: A licença não deve discriminar qualquer pessoa ou grupo de pessoas.

source: No discrimination against fields of endeavor.
ja_jp: 力を入れる分野に対する平等性。
pt_br: Nenhuma discriminação contra campos de atuação.

source: The license must not restrict anyone from making use of the program in a specific field of endeavor. For example, it may not restrict the program from being used in a business, or from being used for genetic research.
ja_jp: ライセンスは誰かが特定の力を入れる分野に対してプログラムを活用することについて制限を加えてはいけません。例えば、プログラムが商用や遺伝子研究で利用されることを制限してはいけません。
pt_br: A licença não deve restringir ninguém de fazer uso do programa em um campo específico de atuação. Por exemplo, ela não pode restringir o programa de ser usado em uma empresa, ou de ser usado para pesquisa genética.

source: Distribution of license.
ja_jp: ライセンスの配布。
pt_br: Distribuição da licença.

source: The rights attached to the program must apply to all to whom the program is redistributed without the need for execution of an additional license by those parties.
ja_jp: プログラムに付随する権利は、そのプログラムを受け取った全ての人に対しても追加のライセンスを要求することなく適用されなければならない。
pt_br: Os direitos associados ao programa devem se aplicar a todos a quem o programa é redistribuído, sem a necessidade de execução de uma licença adicional por essas pessoas.

source: License must not be specific to Debian.
ja_jp: ライセンスは Debian にだけ当てはまるものであってはならない。
pt_br: Licença não deve ser específica para Debian.

source: The rights attached to the program must not depend on the program being part of a Debian system. If the program is extracted from Debian and used or distributed without Debian but otherwise within the terms of the program's license, all parties to whom the program is redistributed should have the same rights as those that are granted in conjunction with the Debian system.
ja_jp: プログラムに付随する権利は、そのプログラムが Debian システムの一部であるかどうかに依存してはいけません。プログラムが Debian から分離され、Debian に依存することなくプログラムのライセンスの定める条件に従って利用および配布される場合、プログラムの再配布に関わるすべての関係者はそのプログラムが Debian システムでつかわれる場合に許されるのと同一の権利を持つべきです。
pt_br: Os direitos associados ao programa não devem depender do programa ser parte de um sistema Debian. Se o programa for extraído do Debian e usado ou distribuído sem o Debian mas por outro lado, dentro dos termos da licença do programa, todas partes para quem o programa é redistribuído devem ter os mesmos direitos que são concedidos em conjunto com o sistema Debian.

source: License must not contaminate other software.
ja_jp: ライセンスは他のソフトウェアをを汚染してはならない。
pt_br: Licença não deve contaminar outros softwares.

source: The license must not place restrictions on other software that is distributed along with the licensed software. For example, the license must not insist that all other programs distributed on the same medium must be free software.
ja_jp: ライセンスはそのライセンスに従うソフトウェアと一緒に配布されている別のソフトウェアに制限を加えてはいけません。例えば、ライセンスは同じ媒体を通じて配布される全ての他のプログラムがフリーソフトウェアでなければいけないと主張してはいけません。
pt_br: A licença não deve colocar restrições em outro software que é distribuído juntamente com o software licenciado. Por exemplo, a licença não deve impor que todos os outros programas distribuídos na mesma mídia sejam software livre.

source: <emphasis>BACK TO BASICS</emphasis> Copyleft
ja_jp: <emphasis>BACK TO BASICS</emphasis> コピーレフト
pt_br: <emphasis>VOLTA PARA O BÁSICO</emphasis> Copyleft

source: Copyleft is a principle that consists in using copyrights to guarantee the freedom of a work and its derivatives, rather than restrict the rights of uses, as is the case with proprietary software. It is, also, a play of words on the term “copyright”. Richard Stallman discovered the idea when a friend of his, fond of puns, wrote on an envelope addressed to him: “copyleft: all rights reversed”. Copyleft imposes preservation of all initial liberties upon distribution of an original or modified version of a work (usually a program). It is, thus, not possible to distribute a program as proprietary software if it is derived from code from a copyleft released program.
ja_jp: コピーレフトとはプロプライエタリソフトウェアと同様に作品とその派生物の、利用を制限するというよりもむしろ、自由を保証するために著作権を利用するという原則です。コピーレフトとは「コピーライト」という用語のダジャレになっています。Richard Stallman はダジャレ好きな彼の友人が彼宛の封筒に次のように書いた際にこの概念を発見しました:「コピーレフト: すべての権利は逆さにされている」。コピーレフトは元の作品およびその変更版 (通常はプログラム) の配布に際して定められた最初の権利の全てが維持されることを強制します。つまりこれは、もしプログラムがコピーレフトとして配布されたプログラムからコードを派生させているなら、プログラムをプロプライエタリソフトウェアとして配布することができないということを意味しています。
pt_br: Copyleft é um princípio que consiste em utilizar os direitos autorais para garantir a liberdade de uma obra e os seus derivados, em vez de limitar os direitos de utilizações, como é o caso com o software proprietário. É, também, um jogo de palavras sobre o termo "copyright" . Richard Stallman descobriu a idéia quando um amigo dele, apaixonado por trocadilhos, escreveu em um envelope endereçado a ele: "copyleft: todos os direitos revertidos". Copyleft impõe a preservação de todas liberdades iniciais sobre a distribuição de uma versão original ou modificada de um trabalho (geralmente um programa). Portanto, não é possível distribuir um programa como software proprietário, se ele é derivado do código de um programa liberado como copyleft.

source: The most well-known family of copyleft licenses is, of course, the GNU GPL and its derivatives, the GNU LGPL or GNU Lesser General Public License, and the GNU FDL or GNU Free Documentation License. Sadly, the copyleft licenses are generally incompatible with each other. Consequently, it is best to use only one of them.
ja_jp: 最もよく知られているコピーレフトライセンス群はもちろん GNU GPL とその派生物、そして GNU LGPL (GNU Lesser General Public License)、GNU FDL (GNU Free Documentation License) などです。残念なことにこれらのコピーレフトライセンスは通常相互に互換性のないものです。それ故、これらのうちどれか 1 つを利用するのが最良です。
pt_br: A família de licença copyleft mais conhecida é, naturalmente, a GNU GPL, e seus derivados, a GNU LGPL ou GNU Lesser General Public License, e a GNU FDL ou GNU Free Documentation License. Infelizmente, as licenças copyleft são geralmente incompatíveis entre si. Consequentemente, o melhor é usar somente uma delas.

source: <emphasis>COMMUNITY</emphasis> Bruce Perens, a controversial leader
ja_jp: <emphasis>COMMUNITY</emphasis> Bruce Perens、賛否の分かれるリーダー
pt_br: <emphasis>COMUNIDADE</emphasis> Bruce Perens, um líder controverso

source: <primary>Open Source</primary>
ja_jp: <primary>オープンソース</primary>
pt_br: <primary>Código Aberto</primary>

source: Bruce Perens was the second leader of the Debian project, just after Ian Murdock. He was very controversial in his dynamic and authoritarian methods. He nevertheless remains an important contributor to Debian, to whom Debian is especially indebted for the editing of the famous “Debian Free Software Guidelines” (DFSG), an original idea of Ean Schuessler. Subsequently, Bruce would derive from it the famous “Open Source Definition”, removing all references to Debian from it. <ulink type="block" url="http://www.opensource.org/" />
ja_jp: Bruce Perens は Ian Murdock の直後に Debian プロジェクトの 2 代目のリーダーになりました。彼は彼の活動的で独裁的な方針により非常に賛否の分かれるリーダーでした。それにもかかわらず、彼は Debian の重要な貢献者であり続けています、Debian は特に彼のおかげで Ean Schuessler の独創的アイディアであるかの有名な「Debian フリーソフトウェアガイドライン」(DFSG) を編集することができました。その後、Bruce は DFSG から Debian に言及された部分を削除することにより DFSG を基にかの有名な「オープンソースの定義」を作りました。<ulink type="block" url="http://www.opensource.org/" />
pt_br: Bruce Perens foi o segundo líder do projeto Debian, logo após Ian Murdock. Ele foi muito controverso em seus métodos dinâmicos e autoritários. Ele, no entanto, continua a ser um importante contribuinte para o Debian, para quem o Debian é especialmente grato pela edição das famosas "Orientações do Software Livre Debian" (DFSG), uma ideia original de Ean Schuessler. Posteriormente, Bruce derivaria a parti desta a famosa "Definição de Código Aberto", removendo todas referências ao Debian dela. <ulink type="block" url="http://www.opensource.org/"/>

source: His departure from the project was quite emotional, but Bruce has remained strongly attached to Debian, since he continues to promote this distribution in political and economic spheres. He still sporadically appears on the e-mail lists to give his advice and present his latest initiatives in favor of Debian.
ja_jp: Bruce は非常に感情的になってプロジェクトを去りましたが、彼は Debian に強い愛着を持ち続けています、なぜなら彼は政治経済の領域に向けて Debian の普及を訴え続けているからです。彼はいまだに、アドバイスを与え、Debian を支持する最新のイニシアティブを発揮するために、時折電子メールリストに現れることがあります。
pt_br: Sua partida do projeto foi bastante emocional, mas Bruce continuava fortemente ligado ao Debian, já que ele continua a promover essa distribuição nos âmbitos político e econômico. Ele ainda esporadicamente aparece nas listas de e-mail para dar o seu conselho e apresentar suas mais recentes iniciativas em favor do Debian.

source: <primary>codename</primary>
ja_jp: <primary>コードネーム</primary>
pt_br: <primary>codinome</primary>

source: <primary>name</primary><secondary>codename</secondary>
ja_jp: <primary>名前</primary><secondary>コードネーム</secondary>
pt_br: <primary>nome</primary><secondary>codinome</secondary>

source: <primary><emphasis role="distribution">Rex</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Rex</emphasis></primary>

source: <primary><emphasis role="distribution">Buzz</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Buzz</emphasis></primary>

source: <primary><emphasis role="distribution">Bo</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Bo</emphasis></primary>

source: <primary><emphasis role="distribution">Hamm</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Hamm</emphasis></primary>

source: <primary><emphasis role="distribution">Slink</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Slink</emphasis></primary>

source: <primary><emphasis role="distribution">Potato</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Potato</emphasis></primary>

source: <primary><emphasis role="distribution">Woody</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Woody</emphasis></primary>

source: <primary><emphasis role="distribution">Sarge</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Sarge</emphasis></primary>

source: <primary><emphasis role="distribution">Etch</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Etch</emphasis></primary>

source: <primary><emphasis role="distribution">Lenny</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Lenny</emphasis></primary>

source: <primary><emphasis role="distribution">Squeeze</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Squeeze</emphasis></primary>

source: <primary><emphasis role="distribution">Wheezy</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Wheezy</emphasis></primary>

source: <primary><emphasis role="distribution">Sid</emphasis></primary>
pt_br: <primary><emphasis role="distribuição">Sid</emphasis></primary>
