Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: The development process for a derivative distribution consists in starting with a particular version of Debian and making a number of modifications to it. The infrastructure used for this work is completely external to the Debian project. There isn't necessarily a policy for contributing improvements. This difference explains how a derivative distribution may “diverge” from its origins, and why they have to regularly resynchronize with their source in order to benefit from improvements made upstream.
ja_jp: 派生ディストリビューションの開発プロセスとは、Debian の特定のバージョンを土台としてそれにたくさんの変更を加えることです。派生ディストリビューションを支える基礎構造は Debian プロジェクトとは全く別物です。改良に貢献するポリシーを定める必要はありません。この違いは、どのようにして派生ディストリビューションはオリジナルから「分岐」する可能性があるか、なぜ派生ディストリビューションは開発の上流側でなされた改良の恩恵を受けるために自身のソースを定期的に再同期しなければいけないのか、を説明します。
pt_br: O processo de desenvolvimento para uma distribuição derivada consiste em começar com uma versão específica do Debian e fazer uma série de modificações nela. A infra-estrutura utilizada para este trabalho é completamente externa ao projeto Debian. Não há necessariamente uma política de contribuição de melhorias. Esta diferença explica como uma distribuição derivada pode "divergir" de suas origens, e por que têm que sincronizar regularmente com sua fonte de modo a se beneficiar de melhorias feitas no upstream.

source: On the other hand, a sub-project can not diverge, since all the work on it consists of directly improving Debian in order to adapt it to a specific goal.
ja_jp: 一方でサブプロジェクトは分岐できません、なぜなら特定の目的に対して適用するためにサブプロジェクトで行ったすべての仕事は直接的に Debian の改善になるからです。
pt_br: Por outro lado, um sub-projeto pode não divergir, uma vez que todo o trabalho consiste em melhorar diretamente o Debian de modo a adaptá-lo para um objetivo específico.

source: The most known distribution derived from Debian is, without a doubt, Ubuntu, but there are many. See <xref linkend="derivative-distributions" /> to learn about their particularities and their positioning in relationship to Debian.
ja_jp: Debian から派生したディストリビューションはたくさんありますが、最も知られているものは間違いなく Ubuntu でしょう。派生ディストリビューションの詳細と Debian との関連性における立ち位置について学ぶには <xref linkend="derivative-distributions" /> をご覧ください。
pt_br: A distribuição derivada mais conhecida é, sem dúvida, o Ubuntu, mas existem muitas. Veja <xref linkend="derivative-distributions" /> para aprender sobre suas particularidades e seu posicionamento em relação ao Debian.

source: Here is a small selection of current sub-projects:
ja_jp: 現在のサブプロジェクトを一部抜粋したものが以下です:
pt_br: Aqui está uma pequena seleção dos sub-projetos correntes:

source: Debian-Junior, by Ben Armstrong, offering an appealing and easy to use Debian system for children;
ja_jp: Debian-Junior、Ben Armstrong さん、子供向けに魅力的で使いやすい Debian システムを提供;
pt_br: Debian-Junior, por Ben Armstrong, oferecendo um atraente e fácil de usar sistema Debian para crianças;

source: Debian-Edu, by Petter Reinholdtsen, focused on the creation of a specialized distribution for the academic world;
ja_jp: Debian-Edu、Petter Reinholdtsen さん、学問の世界向けに特化したディストリビューションの作成を重視;
pt_br: Debian-Edu, por Petter Reinholdtsen, focada na criação de uma distribuição especializada para o mundo acadêmico;

source: Debian Med, by Andreas Tille, dedicated to the medical field;
ja_jp: Debian Med、Andreas Tille さん、医療分野に特化;
pt_br: Debian Med, por Andreas Tille, dedicada para o campo medicinal;

source: Debian-Multimedia, from the creators of Agnula, which deals with multimedia creation;
ja_jp: Debian-Multimedia、Agnula の作者、マルチメディア制作を取り扱う;
pt_br: Debian-Multimedia, dos criadores do AGNULA, que trata da criação multimídia;

source: Debian-Desktop, by Colin Walters, focuses on the desktop;
ja_jp: Debian-Desktop、Colin Walters さん、デスクトップを重視;
pt_br: Debian-Desktop, por Colin Walters, focada no desktop;

source: Debian-Ham, created by Bruce Perens, targets ham radio enthusiasts;
ja_jp: Debian-Ham、Bruce Perens さん、アマチュア無線が好きな人向け;
pt_br: Debian-Ham, criado por Bruce Perens, tem como alvo os entusiastas de rádio amador;

source: Debian-NP (Non-Profit) is for not-for-profit organizations;
ja_jp: Debian-NP (Non-Profit) は非営利組織向けです;
pt_br: Debian-NP (Non-Profit) é para organizações sem fins lucrativos;

source: Debian-Lex, finally, is intended for work within the legal field.
ja_jp: 最後に Debian-Lex は法律分野の仕事を対象とします。
pt_br: Debian-Lex, finalmente, destina-se para o trabalho dentro do campo legal.

source: This list will most likely continue to grow with time and improved perception of the advantages of Debian sub-projects. Fully supported by the existing Debian infrastructure, they can, in effect, focus on work with real added value, without worrying about remaining synchronized with Debian, since they are developed within the project.
ja_jp: このリストは時間が経過するに従って増え続け、Debian サブプロジェクト良さに対する認識を改良し続けることは間違いありません。既存の Debian のインフラがサブプロジェクトを完全にサポートしているので、実質的に、サブプロジェクトは真の付加価値を上げるための仕事に集中しています。サブプロジェクトは Debian プロジェクト内で開発しているため Debian との同期について心配することはありません。
pt_br: Esta lista provavelmente irá continuar a crescer com o tempo e melhor percepção das vantagens dos sub-projetos. Totalmente suportados pela infra-estrutura Debian existente , eles podem, com efeito, se concentrar no trabalho com valor acrescentado real, sem se preocupar em permanecer sincronizado com o Debian, uma vez que são desenvolvidos dentro do projeto.

source: <emphasis>PERSPECTIVE</emphasis> Debian in academia
ja_jp: <emphasis>PERSPECTIVE</emphasis> 学術界における Debian
pt_br: <emphasis> PERSPECTIVA </emphasis> Debian na academia

source: Debian-Edu was, initially, a French project, created by Stéphane Casset and Raphaël Hertzog as part of their jobs at Logidée, on behalf of a pedagogical documentation departmental center. Raphaël then integrated it in Debian as a sub-project. Due to time constraints, it has not progressed further, as is often the case with free software projects lacking contributors.
ja_jp: Debian-Edu は当初フランスのプロジェクトで、pedagogical documentation departmental center (教育記録部門センター) を代表して Stéphane Casset さんと Raphaël Hertzog さんが Logidée での仕事の一部としてこれを作りました。これをサブプロジェクトとして Debian に統合したのが Raphaël さんです。フリーソフトウェアプロジェクトにおいて貢献者が不足する事例はよくあるのですが、このプロジェクトは時間的制約のためさらなる進展を遂げませんでした。
pt_br: Debian-Edu era, inicialmente, um projeto francês, criado por Stéphane Casset e Raphaël Hertzog, dentro da empresa Logidee, em nome de um centro de documentação pedagógica departamental. Raphaël então integrou-o no Debian como um sub-projeto. Devido a limitações de tempo, não tem progredido mais, como é frequentemente o caso de projetos de software livre em que faltam colaboradores.

source: Likewise, a team of Norwegians worked on a similar distribution, also based on the <command>debian-installer</command>. SkoleLinux's progress being significant, Raphaël suggested that it become part of the Debian family and to take over the Debian-Edu sub-project.
ja_jp: その上、ノルウェーのチームが <command>debian-installer</command> に基づく同じようなディストリビューションを開発していました。SkoleLinux は著しく進歩していたため、Raphaël さんは SkoleLinux に対して Debian ファミリーの一部になって、Debian-Edu サブプロジェクトを引き継ぐことを提案しました。
pt_br: Da mesma forma, uma equipe de noruegueses trabalhou em uma distribuição semelhante, também com base no debian-installer <command> reportbug </command>. Com o progresso do SkoleLinux sendo significativo, Raphaël sugeriu que ele se torne parte da família Debian e assuma o sub-projeto Debian-Edu.

source: <emphasis>PERSPECTIVE</emphasis> Debian for multimedia
ja_jp: <emphasis>PERSPECTIVE</emphasis> マルチメディア向け Debian
pt_br: <emphasis>PERSPECTIVA</emphasis> Debian para multimedia

source: Agnula was a European project, managed under the direction of an Italian team. It entailed, for the “DeMuDi” part, the development of a version of Debian dedicated to multimedia applications. Certain members of the project, especially Marco Trevisani, wanted to perpetuate it by integrating it within the Debian Project. The Debian-Multimedia sub-project was born. <ulink type="block" url="http://wiki.debian.org/DebianMultimedia" />
ja_jp: Agnula はヨーロッパのプロジェクトで、イタリアのチームが方向性を管理していました。「DeMuDi」の部分についてはマルチメディアアプリケーションに特化した Debian の開発版としていました。このプロジェクトの一部のメンバー、特に Marco Trevisani さんが Debian プロジェクトに統合させることで Agnula プロジェクトを存続したいと望みました。このようにして Debian-Multimedia サブプロジェクトが誕生しました。<ulink type="block" url="http://wiki.debian.org/DebianMultimedia" />
pt_br: AGNULA era um projeto europeu, gerido sob a direção de uma equipe italiana. Ela vinculou, para a parte "DeMuDi" , o desenvolvimento de uma versão do Debian dedicado a aplicações multimídia. Certos membros do projeto, especialmente Marco Trevisani, quis perpetuá-lo, integrando-o no âmbito do Projeto Debian. O sub-projeto Debian-Multimedia nasceu. <ulink type="block" url="http://wiki.debian.org/DebianMultimedia" />

source: The project, however, had difficulty in forging an identity and taking off. Free Ekanayaka did the work within Debian, but offered the results under the form of a derivative distribution, which is now known as 64Studio. This distribution is affiliated with a new company that offers technical support. <ulink type="block" url="http://www.64studio.com/" />
ja_jp: しかし、Agnula プロジェクトがアイデンティティを築き上げ、軌道に乗ることは難しいものでした。Debian 内でこの作業を担当したのは Free Ekanayaka さんでしたが、その成果は派生ディストリビューションの形で提供されることになりました。これは 64Studio として知られています。このディストリビューションは技術サポートを提供する新しい会社によって管理されています。<ulink type="block" url="http://www.64studio.com/" />
pt_br: O projeto, no entanto, teve dificuldade na formação de uma identidade e decolar. Free Ekanayaka fez o trabalho dentro do Debian, mas ofereceu os resultados sob a forma de uma distribuição derivada, que hoje é conhecido como 64Studio. Esta distribuição é afiliada a uma nova empresa que oferece suporte técnico. <ulink type="block" url="http://www.64studio.com/" />

source: Administrative Teams
ja_jp: 管理チーム
pt_br: Times Administrativos

source: Most administrative teams are relatively closed and recruit only by cooptation. The best means to become a part of one is to intelligently assist the current members, demonstrating that you have understood their objectives and methods of operation.
ja_jp: ほとんどの管理チームは比較的閉鎖的で新メンバーの採用は現メンバーからの選出で決まります。チームの一員になる最良の手段は現在のメンバーを賢明に手伝うこと、つまり自分がチームの目標とやり方を理解していることをはっきり示すことです。
pt_br: A maioria das equipes administrativas são relativamente fechadas e recrutam só por cooptação. O melhor meio para se tornar parte de uma é inteligentemente auxiliar os atuais membros, demonstrando que você tenha entendido seus objetivos e métodos de operação.

source: The ftpmasters are in charge of the official archive of Debian packages. They maintain the program that receives packages sent by developers and automatically stores them, after some checks, on the reference server (<literal>ftp-master.debian.org</literal>).
ja_jp: ftp 管理者は Debian パッケージの公式アーカイブの責任者です。管理者はあるプログラムのメンテナンスを担当しており、このプログラムは開発者が送信したパッケージを受け取り、何点か確認した後にパッケージを自動的に参照基準サーバ (<literal>ftp-master.debian.org</literal>) に保存しています。
pt_br: O ftpmasters estão a cargo do repositório oficial dos pacotes Debian. Eles mantêm o programa que recebe pacotes enviados por desenvolvedores e automaticamente armazenam eles, depois de algumas verificações no servidor de referência (<literal> ftp-master.debian.org </literal>).

source: They must also verify the licenses of all new packages, in order to ensure that Debian may distribute them, prior to including them in the corpus of existing packages. When a developer wishes to remove a package, they address this team through the bug tracking system and the <emphasis>ftp.debian.org</emphasis> “pseudo-package”.
ja_jp: 管理者はまた、パッケージデータベースの中に新しいパッケージを追加する前に、Debian がこのパッケージを配布しても問題ないことを確認するために、このパッケージのライセンスを確認します。開発者がパッケージの削除を希望する場合、開発者はバグ追跡システムから <emphasis>ftp.debian.org</emphasis>「擬似パッケージ」に対してバグ報告を行い、管理者と連絡を取ります。
pt_br: Eles devem igualmente verificar as licenças de todos os novos pacotes, a fim de assegurar que o Debian pode distribuí-los, antes da sua inclusão no corpo de pacotes existentes. Quando um desenvolvedor deseja remover um pacote, aborda esta equipe através do sistema de acompanhamento de bugs e o "pseudo-pacote" <emphasis> ftp.debian.org </emphasis>.

source: <emphasis>VOCABULARY</emphasis> The pseudo-package, a monitoring tool
ja_jp: <emphasis>VOCABULARY</emphasis> 擬似パッケージ、監視ツール
pt_br: <emphasis>VOCABULÁRIO</emphasis> O pseudo-pacote, uma ferramenta de monitoramento

source: <primary>pseudo-package</primary>
ja_jp: <primary>擬似パッケージ</primary>
pt_br: <primary>pseudo-pacote</primary>

source: The bug tracking system, initially designed to associate bug reports with a Debian package, has proved very practical to manage other matters: lists of problems to be resolved or tasks to manage without any link to a particular Debian package. The “pseudo-packages” allow, thus, certain teams to use the bug tracking system without associating a real package with their team. Everyone can, thus, report issues that needs to be dealt with. For instance, the BTS has a <emphasis>ftp.debian.org</emphasis> entry that is used to report and track problems on the official package archive or simply to request removal of a package. Likewise, the <emphasis>www.debian.org</emphasis> pseudo-package refers to errors on the Debian website, and <emphasis>lists.debian.org</emphasis> gathers all the problems concerning the mailing lists.
ja_jp: バグ追跡システムは当初 バグ報告を Debian パッケージと関連付けるために設計されましたが、そのほかの問題の管理にも非常に実用的であると証明し続けています: 特定の Debian パッケージに関係しない解決すべき問題のリスト化または作業管理です。一部のチームでは「擬似パッケージ」を使うことで、チームが実在のパッケージに関連が無くとも、バグ追跡システムを使うことができています。誰でも対処が必要な問題を報告できます。例えば、BTS の<emphasis>ftp.debian.org</emphasis> エントリは、公式パッケージアーカイブに関する問題を報告し追跡するため、もしくはパッケージの削除要求を出すために利用されます。同様に、<emphasis>www.debian.org</emphasis> 擬似パッケージは Debian ウェブサイトの誤りを指摘するためのもので、<emphasis>lists.debian.org</emphasis> ではメーリングリストに関する全ての問題を扱います。
pt_br: O sistema de acompanhamento de bugs, inicialmente concebido para associar relatórios de erros com um pacote Debian, revelou-se muito prático para gerenciar outros assuntos: as listas de problemas a serem resolvidos ou tarefas para gerenciar, sem qualquer ligação a um pacote Debian particular. "Pseudo-pacotes" permitem, assim, algumas equipes a usar o sistema de acompanhamento de bugs sem associar um pacote real com sua equipe. Todo mundo pode, portanto, relatar problemas que precisam ser tratados. Por exemplo, o BTS tem uma entrada <emphasis> ftp.debian.org </emphasis> para relatar problemas no repositório de pacotes oficiais ou simplesmente para solicitar a remoção de um pacote. Da mesma forma, o pseudo-pacote <emphasis>www.debian.org</emphasis> refere-se a erros no site do Debian, e <emphasis>lists.debian.org</emphasis> reúne todos os problemas relativos às listas de discussão.

source: <emphasis>TOOL</emphasis> FusionForge, the Swiss Army Knife of collaborative development
ja_jp: <emphasis>TOOL</emphasis> FusionForge、共同開発における万能ナイフ
pt_br: <emphasis> FERRAMENTA </emphasis> FusionForge, o canivete suíço do desenvolvimento colaborativo

source: FusionForge is a program that enables creation of sites similar to <literal>www.sourceforge.net</literal>, <literal>alioth.debian.org</literal>, or even <literal>savannah.gnu.org</literal>. It hosts projects and provides a range of services that facilitate collaborative development. Each project will have a dedicated virtual space there, including a web site, several “ticketing” systems to track — most commonly — bugs and patches, a survey tool, file storage, forums, version control system repositories, mailing lists and various other related services.
ja_jp: FusionForge は <literal>www.sourceforge.net</literal>、<literal>alioth.debian.org</literal>、<literal>savannah.gnu.org</literal> などと同様のサイトを作成することができるプログラムです。FusionForge はプロジェクトをホストし、容易に共同開発を行うためのさまざまなサービスを提供します。各プロジェクトは専用の仮想スペースを持ち、ここにはウェブサイト、一般にバグやパッチを追跡するための「チケット発行」システム、検査ツール、ファイルストレージ、フォーラム、リポジトリのバージョン操作システム、メーリングリスト、その他の様々な関連サービスが含まれています。
pt_br: FusionForge é um programa que permite a criação de sites semelhantes ao <literal>www.sourceforge.net</literal>, <literal>alioth.debian.org</literal>, ou mesmo <literal>savannah.gnu.org</literal>. Abriga projetos e fornece uma gama de serviços que facilitam o desenvolvimento colaborativo. Cada projeto terá um espaço virtual dedicado lá, incluindo um site, vários sistemas de tíquetes para aacompanhamento — principalmente — de bugs e patches, uma ferramenta de pesquisa, armazenamento de arquivos, fóruns, repositórios de sistemas de controle de versão, listas de discussão e diversos outros serviços relacionados.

source: <literal>alioth.debian.org</literal> is Debian's FusionForge server, administered by Tollef Fog Heen, Stephen Gran, and Roland Mas. Any project involving one or more Debian developers can be hosted there. <ulink type="block" url="http://alioth.debian.org/" />
ja_jp: <literal>alioth.debian.org</literal> は Debian の FusionForge サーバで、Tollef Fog Heen さん、Stephen Gran さん、Roland Mas さんが管理しています。Debian 開発者が 1 人以上参加しているプロジェクトならなんでもここでホストすることができます。<ulink type="block" url="http://alioth.debian.org/" />
pt_br: <literal> alioth.debian.org </literal> é um servidor Debian FusionForge, administrado por Tollef Fog Heen, Stephen Gran e Mas Roland. Qualquer projeto que envolve um ou mais desenvolvedores do Debian pode ser hospedado lá. <ulink type="block" url="http://alioth.debian.org/" />

source: Although rather complex internally, due to the broad range of services that it provides, FusionForge is otherwise relatively easy to install, thanks to the exceptional work of Roland Mas and Christian Bayle on the <emphasis role="pkg">fusionforge</emphasis> Debian package.
ja_jp: FusionForge にはいろいろな種類のサービスが含まれているため、内部的にかなり複雑であるにもかかわらず、FusionForge は比較的簡単にインストールできます。これは Roland Mas さんと Christian Bayle さんが <emphasis role="pkg">fusionforge</emphasis> Debian パッケージに対して行った非常に優れた成果のおかげです。
pt_br: Embora bastante complexo internamente, devido à ampla gama de serviços que ela oferece, o FusionForge é por outro lado relativamente fácil de instalar, graças ao trabalho excepcional de Roland Mas e Christian Bayle no <emphasis role="pkg"> fusionforge </emphasis> pacote Debian.

source: The <emphasis>Debian System Administrators</emphasis> (DSA) team (<email>debian-admin@lists.debian.org</email>), as one might expect, is responsible for system administration of the many servers used by the project. They ensure optimal functioning of all base services (DNS, Web, e-mail, shell, etc.), install software requested by Debian developers, and take all precautions in regards to security. <ulink type="block" url="http://dsa.debian.org" />
ja_jp: <emphasis>Debian システム管理者</emphasis> (DSA) チーム (<email>debian-admin@lists.debian.org</email>) は、あなたの予想通り、プロジェクトが利用する多くのサーバのシステム管理に対して責任があります。チームは、全ての基盤サービス (DNS、ウェブ、電子メール、シェルなど) を最適に機能させること、Debian 開発者から要求のあったソフトウェアをインストールすること、セキュリティ関連の予防策を適用すること、を保証します。<ulink type="block" url="http://dsa.debian.org" />
pt_br: A equipe <emphasis>Administradores de Sistema do Debian</emphasis> (DSA) (<email>debian-admin@lists.debian.org</email>), como se poderia esperar, é responsável pela administração do sistema de muitos servidores utilizados pelo projeto. Eles garantem o ótimo funcionamento de todos os serviços básicos (DNS, Web, e-mail, shell, etc), instalam o software solicitado por desenvolvedores Debian e tomam todas as precauções no que diz respeito à segurança. <ulink type="block" url="http://dsa.debian.org" />

source: <primary>DSA (Debian System Administrators)</primary>
ja_jp: <primary>DSA (Debian システム管理者)</primary>
pt_br: <primary>DSA (Administradores de Sistemas do Debian)</primary>

source: <emphasis>TOOL</emphasis> Package tracking system
ja_jp: <emphasis>TOOL</emphasis> パッケージ追跡システム
pt_br: <emphasis>FERRAMENTA</emphasis> Sistema de rastreamento de pacotes

source: <primary>package tracking system</primary>
ja_jp: <primary>パッケージ追跡システム</primary>
pt_br: <primary>sistema de rastreamento de pacotes</primary>

source: <primary>system</primary><secondary>package tracking system</secondary>
ja_jp: <primary>システム</primary><secondary>パッケージ追跡システム</secondary>
pt_br: <primary>sistema</primary><secondary>sistema de rastreamento de pacotes</secondary>

source: <primary>Debian Developer's Packages Overview</primary>
ja_jp: <primary>Debian 開発者のパッケージ一覧</primary>
pt_br: <primary>Visão geral do Desenvolvedor de Pacostes Debian</primary>

source: This is one of Raphaël's creations. The basic idea is, for a given package, to centralize as much information as possible on a single page. Thus, one can quickly check the status of a program, identify tasks to be completed, and offer one's assistance. This is why this page gathers all bug statistics, available versions in each distribution, progress of a package in the <emphasis role="distribution">Testing</emphasis> distribution, the status of translations of descriptions and debconf templates, the possible availability of a new upstream version, notices of noncompliance with the latest version of the Debian Policy, information on the maintainer, and any other information that said maintainer wishes to include. <ulink type="block" url="http://packages.qa.debian.org/" />
ja_jp: これは Raphaël さんの作ったものです。基本的な考え方は、あるパッケージに対して、可能な限り多くの情報を単一のページに集中させることです。こうすることで、素早くプログラムの状態を確認し、完了させなければいけない作業を特定し、援助を提供することができます。そのため、このページには、すべてのバグ統計、それぞれのディストリビューションで利用可能なバージョン、<emphasis role="distribution">テスト版</emphasis>ディストリビューションにおけるパッケージの進捗状況、パッケージ説明と debconf テンプレートの翻訳状況、新しい上流開発版を入手できるか否か、最新の Debian ポリシーに対する違反通知、メンテナに関する情報、その他メンテナが含めたいと望んだ情報、が集められています。<ulink type="block" url="http://packages.qa.debian.org/" />
pt_br: Esta é uma das criações do Raphaël. A idéia básica é, para um determinado pacote, centralizar as informações tanto quanto possível em uma única página. Assim, pode-se verificar rapidamente o estado de um programa, identificar tarefas a serem realizadas, e oferecer assistência de alguém. É por isso que esta página reúne todas estatísticas de erros, as versões disponíveis em cada distribuição, o progresso de um pacote na distribuição <emphasis role="distribution">Testing</emphasis>, o estado das traduções das descrições e modelos debconf, a possível disponibilidade de uma nova versão, avisos de não conformidade com a versão mais recente da Política Debian, informações sobre o mantenedor, e qualquer informação que o dito mantenedor deseja incluir. <ulink type="block" url="http://packages.qa.debian.org/" />

source: An e-mail subscription service completes this web interface. It automatically sends the following selected information to the list: bugs and related discussions, availability of a new version on the Debian servers, new translations available for proofreading, etc.
ja_jp: 電子メール購読サービスがこのウェブインターフェイスを完全なものにします。これは、以下に示す情報を選別して自動的に送信するサービスです: バグと関連する議論、Debian サーバから新しいバージョンが利用できるか否か、査読待ちの新しい翻訳など。
pt_br: Um serviço de assinatura de e-mail completa esta interface web. Ela envia automaticamente as seguintes informações selecionadas para a lista: bugs e discussões relacionadas, a disponibilidade de uma nova versão nos servidores Debian, novas traduções disponíveis para revisão, etc.

source: Advanced users can, thus, follow all of this information closely and even contribute to the project, once they've got a good enough understanding of how it works.
ja_jp: このため、上級ユーザはパッケージ追跡システムの機能を十分よく理解したら、すべての情報をしっかりと追いかけ、さらにプロジェクトに貢献することができます。
pt_br: Os usuários avançados podem, assim, seguir toda esta informação de perto e até mesmo contribuir para o projeto, uma vez que tiver um suficiente bom conhecimento de como ele funciona.
