Repository: Neamar/KISS
Catalog: */01_the-debian-project.po
Languages: ja_jp, pt_br

source: Objective
ja_jp: 目的
pt_br: Objetivo

source: Means
ja_jp: 方針
pt_br: Significado

source: Operation
ja_jp: 運営
pt_br: Funcionamento

source: Volunteer
ja_jp: ボランティア
pt_br: Voluntário

source: The Debian Project
ja_jp: Debian プロジェクト
pt_br: O Projeto Debian

source: Before diving right into the technology, let us have a look at what the Debian Project is, its objectives, its means, and its operations.
ja_jp: Debian のテクノロジーを見る前に、Debian プロジェクトとその目的、方針、運営の仕方について少し見てみましょう。
pt_br: Antes de nos aprofundar na tecnologia, vamos olhar o que o Projeto Debian é, seus objetivos, seus significados, e seu funcionamento.

source: What Is Debian?
ja_jp: Debian とは?
pt_br: O que é Debian?

source: <primary>association</primary>
ja_jp: <primary>団体</primary>
pt_br: <primary>associação</primary>

source: <emphasis>CULTURE</emphasis> Origin of the Debian name
ja_jp: <emphasis>CULTURE</emphasis> Debian という名前の由来
pt_br: <emphasis>CULTURA</emphasis> Origem do nome Debian

source: Look no further: Debian is not an acronym. This name is, in reality, a contraction of two first names: that of Ian Murdock, and his girlfriend at the time, Debra. Debra + Ian = Debian.
ja_jp: ここを見れば十分: Debian は何かの頭文字を並べたものではありません。名前で、実際には 2 人のファーストネームを短縮したものです: Ian Murdock さんと、当時彼のガールフレンドだった Debra さん。Debra + Ian = Debian。
pt_br: Não procure mais: Debian não é um acrônimo. Este nome é, na realidade, uma contração de dois nomes: o de Ian Murdock, e sua namorada na época, Debra. Debra + Ian = Debian.

source: Debian is a GNU/Linux and GNU/kFreeBSD distribution. We will discuss what a distribution is in further detail in <xref linkend="sect.role-of-distributions" />, but for now, we will simply state that it is a complete operating system, including software and systems for installation and management, all based on the Linux or FreeBSD kernel and free software (especially those from the GNU project).
ja_jp: Debian は GNU/Linux と GNU/kFreeBSD ディストリビューションです。ディストリビューションとは何かについては <xref linkend="sect.role-of-distributions" /> で詳しく議論していますが、今のところは以下の通り述べるだけにとどめます。ディストリビューションとは完成されたオペレーティングシステムで、インストールと管理に必要なソフトウェアとシステムを備えており、Linux または FreeBSD カーネルとフリーソフトウェア (特に GNU プロジェクトの場合) を基盤にしています。
pt_br: Debian é uma distribuição GNU/Linux e GNU/kFreeBSD. Vamos discutir o que é uma distribuição em mais detalhes em <xref linkend="sect.role-of-distributions" />, mas por enquanto, vamos simplesmente dizer que é um sistema operacional completo, incluindo software e sistemas para instalação e gestão, todos baseados no kernel Linux ou FreeBSD e softwares livres (especialmente os do projeto GNU).

source: When he created Debian, in 1993, under the leadership of the FSF, Ian Murdock had clear objectives, which he expressed in the <emphasis>Debian Manifesto</emphasis>. The free operating system that he sought would have to have two principal features. First, quality: Debian would be developed with the greatest care, to be worthy of the Linux kernel. It would also be a non-commercial distribution, sufficiently credible to compete with major commercial distributions. This double ambition would, in his eyes, only be achieved by opening the Debian development process just like that of Linux and the GNU project. Thus, peer review would continuously improve the product.
ja_jp: Ian Murdock さんが FSF の指導の下で Debian を作った 1993 年、彼は <emphasis>Debian マニフェスト</emphasis>の中で、彼の求めるフリーオペレーティングシステムは 2 つの重要な要素を持っていなければいけない、という明確な目標を設定しました。1 つ目は品質です。Debian は Linux カーネルからの信頼に値するべく、非常に注意深く開発されるでしょう。2 つ目は非商用ディストリビューションであるということです。Debian は主要な商用ディストリビューションと比較しても、十分に信頼できるものになるでしょう。彼の考えによれば、この 2 つの野望は Linux や GNU プロジェクトとよく似た Debian 開発プロセスに従うことでのみ達成されます。従って、相互審査は継続してプロジェクトを改善するでしょう。
pt_br: Quando ele criou o Debian, em 1993, sob a liderança da FSF, Ian Murdock teve objetivos claros, que ele expressa no <emphasis>Manifesto Debian</emphasis>. O sistema operacional livre que buscava teria que ter duas características principais. Primeiro, a qualidade: o Debian seria desenvolvido com o maior cuidado, para ser digno do kernel Linux. Também seria uma distribuição não-comercial, acreditável suficientemente para competir com as principais distribuições comerciais. Esta ambição dupla seria, em seus olhos, alcançada somente através da abertura do processo de desenvolvimento do Debian assim como a do Linux e o projeto GNU. Assim, a avaliação pelos pares continuamente melhora o produto.

source: <emphasis>CULTURE</emphasis> GNU, the project of the FSF
ja_jp: <emphasis>CULTURE</emphasis> FSF のプロジェクトである GNU
pt_br: <emphasis>CULTURA</emphasis> GNU, O projeto da FSF

source: <primary>GNU</primary><secondary>is Not Unix</secondary>
pt_br: <primary>GNU</primary><secondary>não é Unix</secondary>

source: The GNU project is a range of free software developed, or sponsored, by the Free Software Foundation (FSF), originated by its iconic leader, Dr. Richard M. Stallman. GNU is a recursive acronym, standing for “GNU is Not Unix”.
ja_jp: GNU プロジェクトとは神格化されているリーダー Dr. Richard M. Stallman が創設したフリーソフトウェア財団 (FSF) が開発したり支援している多様なフリーソフトウェアを指しています。GNU は “GNU is Not Unix” を意味する再帰的頭字語です。
pt_br: O projeto GNU é um conjunto de softwares livres desenvolvidos, ou patrocinados, pela Free Software Foundation (FSF), originada por seu célebre líder, Dr. Richard M. Stallman. GNU é um acrônimo recursivo, da citação "GNU não é Unix".

source: <emphasis>CULTURE</emphasis> Richard Stallman
pt_br: <emphasis>CULTURA</emphasis> Richard Stallman

source: <acronym>FSF</acronym>'s founder and author of the GPL license, Richard M. Stallman (often referred to by his initials, RMS) is a charismatic leader of the Free Software movement. Due to his uncompromising positions, he's not unanimously admired, but his non-technical contributions to Free Software (in particular at the legal and philosophical level) are respected by everybody.
ja_jp: <acronym>FSF</acronym> の創設者であり GPL ライセンスの著者でもある Richard M. Stallman (イニシャルで RMS と呼ばれることが多い) はフリーソフトウェア運動のカリスマ的なリーダーです。彼自身は強硬的な姿勢のおかげで全員から高い評価を得ていませんが、彼が行ったフリーソフトウェアに対する技術的でない貢献 (特に法律的、哲学的な水準において) は皆に尊敬されています。
pt_br: Fundador da <acronym>FSF</acronym> e autor da licença GPL, Richard M. Stallman (frequentemente referido por suas iniciais, RMS) é um líder carismático do movimento Software Livre. Devido a suas posições inflexíveis, ele não é admirado na unanimidade, mas suas contribuições não técnicas para o Software Livre (em particular no nível jurídico e filosófico) são respeitadas por todos.

source: A Multi-Platform Operating System
ja_jp: マルチプラットフォームオペレーティングシステム
pt_br: Um Sistema Operacional Multi-Plataforma

source: <primary>meta-distribution</primary>
pt_br: <primary>meta-distribuição</primary>

source: <emphasis>COMMUNITY</emphasis> Ian Murdock's journey
ja_jp: <emphasis>COMMUNITY</emphasis> Ian Murdock の旅
pt_br: <emphasis>COMUNIDADE</emphasis> A jornada de Ian Murdock

source: Ian Murdock, founder of the Debian project, was its first leader, from 1993 to 1996. After passing the baton to Bruce Perens, Ian took a less public role. He returned to working behind the scenes of the free software community, creating the Progeny company, with the intention of marketing a distribution derived from Debian. This venture was, sadly, a commercial failure, and development was abandoned. The company, after several years of scraping by, simply as a service provider, eventually filed for bankruptcy in April of 2007. Of the various projects initiated by Progeny, only <emphasis>discover</emphasis> still remains. It is an automatic hardware detection tool.
ja_jp: Debian プロジェクトの創設者である Ian Murdock さんは 1993 年から 1996 年までの間、最初のリーダーを務めました。Ian さんはリーダーの職を Bruce Perens さんに譲った後、公的活動への参加を減らし、フリーソフトウェアコミュニティの裏方の仕事に戻り、Debian の派生ディストリビューションをマーケティングする目的で Progeny 社を作りました。残念なことにこの冒険的事業は商業的に失敗し、それ以上の発展は断念されました。Progeny 社は単なるサービスプロバイダとして数年間運営されていましたが、最終的に 2007 年 4 月に破産しました。Progeny 社が始めたプロジェクトのうち、まだ残っているものは自動的にハードウェアを検知するツールである <emphasis>discover</emphasis> だけです。
pt_br: Ian Murdock, fundador do projeto Debian, foi o seu primeiro líder, de 1993 a 1996. Depois de passar o bastão para Bruce Perens, Ian teve um papel menos público. Ele voltou a trabalhar por trás dos bastidores da comunidade de software livre, criando a empresa Progeny, com a intenção de comercializar uma distribuição derivada do Debian. Este empreendimento foi, infelizmente, um fracasso comercial e seu desenvolvimento foi abandonado. A empresa, após alguns anos sobrevivendo apenas como prestador de serviços, finalmente pediu concordata em abril de 2007. Dos vários projetos iniciadas pela Progeny, apenas o <emphasis>discover</emphasis> ainda permanece. É uma ferramenta de detecção automática de hardware.

source: Debian, remaining true to its initial principles, has had so much success that, today, it has reached a tremendous size. The 13 architectures offered cover 11 hardware architectures and 2 kernels (Linux and FreeBSD). Furthermore, with more than 17,300 source packages, the available software can meet almost any need that one could have, whether at home or in the enterprise.
ja_jp: 草創期の理念に忠実であり続けている Debian は、今日驚異的な規模に達し、大きな成功を収めました。提供されている 13 のアーキテクチャで 11 のハードウェアアーキテクチャと 2 つのカーネル (Linux と FreeBSD) をサポートしています。さらに 17,300 を超えるソースパッケージを備え、家庭向けであるか企業向けであるかにかかわらず、どんな用途に対しても要求を満たすソフトウェアを入手できます。
pt_br: O Debian, permanecendo fiel aos seus princípios iniciais, teve tanto sucesso que, hoje, alcançou um tremendo tamanho. As 13 arquiteturas oferecidas cobrem 11 arquiteturas de hardware e 2 kernels (Linux e FreeBSD). Além disso, com mais de 17.300 pacotes fonte, os softwares disponíveis podem satisfazer praticamente qualquer necessidade que se poderia ter, seja em casa ou na empresa.

source: The sheer size of the distribution can be inconvenient: it is really unreasonable to distribute 70 CD-ROMs to install a complete version on a standard PC… This is why Debian is increasingly considered as a “meta-distribution”, from which one extracts more specific distributions intended for a particular public: Debian-Desktop for traditional office use, Debian-Edu for education and pedagogical use in an academic environment, Debian-Med for medical applications, Debian-Junior for young children, etc. A more complete list of the subprojects can be found in the section dedicated to that purpose, see <xref linkend="sect.sub-projects" />.
ja_jp: ディストリビューション全体の規模が大きいことは Debian にとって不利な要素です: 標準的な PC 向けの完全なバージョンをインストールするのに 70 枚の CD-ROM を配布するのには本当にばかげています。しかしこのために、Debian は次第に「メタディストリビューション」と考えられるようになってきています。メタディストリビューションとは個々の利用者向けにさらに特定用途に適したディストリビューション (例えば、従来のデスクトップ用途向けには Debian-Desktop 、学術環境で利用される教育および教育学的用途向けには Debian-Edu、医学的応用向けには Debian-Med、幼児向けには Debian-Junior、など) を作るための基盤になるものです。サブプロジェクトについて書かれたセクションにはより完全なリストが載っています、<xref linkend="sect.sub-projects" /> を参照してください。
pt_br: O tamanho total da distribuição pode ser inconveniente: realmente não é razoável distribuir 70 CD-ROMs para instalar uma versão completa em um PC padrão... Este é o porque o Debian é considerado cada vez mais como uma "meta-distribuição", a partir do qual se extrai as distribuições mais específicas destinadas a um público específico: Debian-Desktop para o uso tradicional no escritório, Debian-Edu para uso educacional e pedagógico em um ambiente acadêmico, Debian-Med para aplicações médicas, Debian-Junior para crianças, etc. Uma lista mais completa dos subprojetos pode ser encontrada na seção dedicada a esse propósito, veja em <xref linkend="sect.sub-projects"/>.

source: These partial views of Debian are organized in a well-defined framework, thus guaranteeing hassle-free compatibility between the various “sub-distributions”. All of them follow the general planning for release of new versions. And since they build on the same foundations, they can be easily extended, completed, and personalized with applications available in the Debian repositories.
ja_jp: Debian の各要素は明確に定義された枠組みに従って整理されているため、さまざまな「サブディストリビューション」間で手間をかけずに互換性が保証されています。Debian の各要素は新バージョンリリースの総合計画に追従します。そして、それらが同じ基盤の上に成り立っているため、Debian リポジトリから入手できるアプリケーションを使って簡単に拡張し、洗練し、特徴を出すことができます。
pt_br: Estas visões parciais do Debian são organizadas em uma estrutura bem definida, o que garante compatibilidade sem problemas entre as várias "sub-distribuições". Todas elas seguem o planejamento geral para o lançamento de novas versões. E como elas estão sendo construídas sobre a mesma base, elas podem ser facilmente estendidas, completadas, e personalizadas com as aplicações disponíveis nos repositórios do Debian.

source: <primary>subproject</primary>
ja_jp: <primary>サブプロジェクト</primary>
pt_br: <primary>subprojeto</primary>

source: All the Debian tools operate in this direction: <command>debian-cd</command> has for a long time now allowed the creation of a set of CD-ROMs containing only a pre-selected set of packages; <command>debian-installer</command> is also a modular installer, easily adapted to special needs. <command>APT</command> will install packages from various origins, while guaranteeing the overall consistency of the system.
ja_jp: すべての Debian ツールは以下の方針で動いています: <command>debian-cd</command> はずっと前からあらかじめ選択されたパッケージだけを含む CD-ROM を作成するために使われてきました; <command>debian-installer</command> も特別な用途向けに簡単に適応させることができるモジュール式のインストーラです。<command>APT</command> はシステムの総合的な整合性を保障したうえでさまざまな出所からパッケージをインストールします。
pt_br: Todas as ferramentas Debian operam neste sentido: <command>debian-cd</command> tem por muito tempo permitido criar um conjunto de CD-ROMs contendo apenas um conjunto de pacotes pré-selecionados; <command>debian-installer</command> é também um instalador modular, facilmente adaptado para necessidades especiais. <command>APT</command> irá instalar pacotes a partir de várias origens, garantindo ao mesmo tempo a consistência do sistema.

source: <emphasis>TOOL</emphasis> Creating a Debian CD-ROM
ja_jp: <emphasis>TOOL</emphasis> Debian CD-ROM の作成
pt_br: <emphasis>FERRAMENTA</emphasis> Criando um CD-ROM Debian

source: <command>debian-cd</command> creates ISO images of installation media (CD, DVD, Blu-Ray, etc.) ready for use. Any matter regarding this software is discussed (in English) on the <email>debian-cd@lists.debian.org</email> mailing list.
ja_jp: <command>debian-cd</command> はすぐに使えるインストールメディア (CD、DVD、Blu-Ray、など) の ISO イメージを作成します。このソフトウェアに関するあらゆる問題は <email>debian-cd@lists.debian.org</email> メーリングリストで (英語で) 話し合われています。
pt_br: <command>debian-cd</command> cria imagens ISO de mídias de instalação (CD, DVD, Blu-Ray, etc.) prontas para usar. Qualquer questão sobre este softwares é discutida (em inglês) na lista de discussão <email>debian-cd@lists.debian.org</email>.

source: <emphasis>BACK TO BASICS</emphasis> To each computer, its architecture
ja_jp: <emphasis>BACK TO BASICS</emphasis> 各コンピュータに対するアーキテクチャ
pt_br: <emphasis>VOLTANDO PARA O BÁSICO</emphasis> Para cada computador, sua arquitetura

source: The term “architecture” indicates a type of computer (the most known include Mac or PC). Each architecture is differentiated primarily according to its processor, usually incompatible with other processors. These differences in hardware involve varying means of operation, thus requiring that software be compiled specifically for each architecture.
ja_jp: 「アーキテクチャ」という用語はコンピュータの種類 (最もよく知られているのは Mac や PC) を表しています。それぞれのアーキテクチャは主にプロセッサによって区別され、通常異なるプロセッサ間に互換性はありません。ハードウェアが違うということは操作の仕方が違うということで、それぞれのアーキテクチャに対して個別にソフトウェアのコンパイルが必要です。
pt_br: O termo "arquitetura" indica um tipo de computador (o mais conhecido incluem o Mac ou PC). Cada arquitetura é diferenciada principalmente pelo seu processador, geralmente incompatível com outros processadores. Essas diferenças de hardware envolvem diferentes meios de funcionamento, exigindo assim que o software seja compilado especificamente para cada arquitetura.

source: <primary>architecture</primary>
ja_jp: <primary>アーキテクチャ</primary>
pt_br: <primary>arquitetura</primary>

source: <primary>processor</primary>
ja_jp: <primary>プロセッサ</primary>
pt_br: <primary>processador</primary>

source: Most software available in Debian is written in portable programming languages: the same source code can be compiled for various architectures. In effect, an executable binary, always compiled for a specific architecture, will not usually function on the other architectures.
ja_jp: Debian で利用可能なほとんどのソフトウェアは移植可能なプログラミング言語で書かれています: 同じソースコードをさまざまなアーキテクチャ向けにコンパイルすることができます。事実上、ある特定のアーキテクチャ向けにコンパイルされて実行可能なバイナリを他のアーキテクチャで動かすことは通常不可能です。
pt_br: A maioria dos softwares disponíveis no Debian é escrita em linguagens de programação portáveis: o mesmo código fonte pode ser compilado para várias arquiteturas. Na realidade, um binário executável, sempre compilado para uma arquitetura específica, geralmente não funcionará em outras arquiteturas.

source: Recall that each program is created by writing source code; this source code is a text file composed of instructions in a given programming language. Before you can use the software, it is necessary to compile the source code, which means transforming the code into a binary (a series of machine instructions executable by the processor). Each programming language has a specific compiler to execute this operation (for example, <command>gcc</command> for the C programming language).
ja_jp: それぞれのプログラムはソースコードを書いて作成されていることを思い出してください; ソースコードはテキストファイルで特定のプログラミング言語の規則に従って書かれています。ソフトウェアを使う前に、ソースコードをコンパイルする必要があります。これはコードをバイナリ (プロセッサが実行できる機械語命令) に変換することを意味しています。それぞれのプログラミング言語にはコンパイルを実行するために個別のコンパイラが (例えば C 言語には <command>gcc</command> が) あります。
pt_br: Lembre-se que cada programa é criado escrevendo o código fonte, este código-fonte é um arquivo texto composto de instruções em uma dada linguagem de programação. Antes de você poder usar o software, é necessário compilar o código fonte, o que significa transformar o código em um binário (uma série de instruções de máquina executável pelo processador). Cada linguagem de programação tem um compilador específico para executar essa operação (por exemplo, <command>gcc</command> para a linguagem de programação C).

source: <primary>source</primary><secondary>code</secondary>
ja_jp: <primary>ソース</primary><secondary>コード</secondary>
pt_br: <primary>fonte</primary><secondary>código</secondary>

source: <primary>binary code</primary>
ja_jp: <primary>バイナリコード</primary>
pt_br: <primary>código binário</primary>

source: <primary>compilation</primary>
ja_jp: <primary>コンパイル</primary>
pt_br: <primary>compilação</primary>

source: <primary>compiler</primary>
ja_jp: <primary>コンパイラ</primary>
pt_br: <primary>compilador</primary>

source: <emphasis>TOOL</emphasis> Installer
ja_jp: <emphasis>TOOL</emphasis> インストーラ
pt_br: <emphasis>FERRAMENTA</emphasis> Instalador

source: <command>debian-installer</command> is the name of the Debian installation program. Its modular design allows it to be used in a broad range of installation scenarios. The development work is coordinated on the <email>debian-boot@lists.debian.org</email> mailing list under the direction of Joey Hess and Cyril Brulebois.
ja_jp: <command>debian-installer</command> は Debian をインストールするためのプログラムの名前です。これはモジュール式に設計されれいるため、多様なインストール事例を広くサポートすることができます。これの開発は Joey Hess さんと Cyril Brulebois さんの指導の下 <email>debian-boot@lists.debian.org</email> メーリングリストで組織的に行われています。
pt_br: <command>debian-installer</command> é o nome do programa de instalação do Debian. A sua concepção modular permite que seja usada em uma ampla variedade de cenários de instalação. O trabalho de desenvolvimento é coordenado na lista de discussão <email>debian-boot@lists.debian.org</email> sob a direção de Joey Hess e Cyril Brulebois.

source: The Quality of Free Software
ja_jp: フリーソフトウェアの品質
pt_br: A Qualidade do Software Livre

source: Debian follows all of the principles of Free Software, and its new versions are not released until they are ready. Developers are not forced by some set schedule to rush to meet an arbitrary deadline. People frequently complain of the long time between Debian's stable releases, but this caution also ensures Debian's legendary reliability: long months of testing are indeed necessary for the full distribution to receive the “stable” label.
ja_jp: Debian はフリーソフトウェアの全ての原則に従い、準備が整うまで Debian の新バージョンはリリースされません。開発者は締め切りに間に合わせる目的で決められたスケジュールに従うことを強制されません。Debian が安定版のリリースに長い時間をかけている点はたびたび苦情の対象になってきましたが、Debian の伝説的な信頼性はこれを守ることで確保されてきました:「安定版」を冠する完全なディストリビューションにとっては、テストに長い時間をかけることが必須なのです。
pt_br: O Debian segue todos os princípios do Software Livre, e suas novas versões não são liberadas até que estejam prontas. Os desenvolvedores não estão pressionados por algum cronograma definido que corre para satisfazer um prazo arbitrário. As pessoas frequentemente se queixam do tempo entre as versões estáveis ​​do Debian, mas este cuidado também garante a confiabilidade lendária da Debian: longos meses de testes são realmente necessários para que a distribuição completa receba o rótulo de "estável".

source: Debian will not compromise on quality: all known critical bugs are resolved in any new version, even if this requires the initially forecast release date to be pushed back.
ja_jp: Debian は品質に関して妥協しません: たとえバグを修正することで当初計画されていたリリース日を遅らせることになったとしても、すべての既知のクリティカルバグは新しいバージョンで修正されます。
pt_br: Debian não irá comprometer a qualidade: todos os bugs críticos conhecidos são resolvidos em qualquer nova versão, ainda que isso implique que a data de lançamento inicialmente prevista seja adiada.

source: The Legal Framework: A Non-Profit Organization
ja_jp: 法律的枠組み: 非営利組織
pt_br: O Arranjo Legal: Uma Organização Não-Lucrativa

source: Legally speaking, Debian is a project managed by an American not-for-profit, volunteer association. The project has around a thousand <emphasis>Debian developers</emphasis>, but brings together a far greater number of contributors (translators, bug reporters, artists, casual developers, etc.).
ja_jp: 法律的に言えば Debian は米国の非営利、ボランティア組織が管理するプロジェクトです。このプロジェクトにはおよそ千人の <emphasis>Debian 開発者</emphasis>がいますが、はるかに多くの貢献者 (翻訳者、バグ報告者、アーティスト、一時的な開発者、など) が集まっています。
pt_br: Legalmente falando, o Debian é um projeto gerenciado por uma associação americana sem fins lucrativos e voluntária. O projeto tem em torno de mil <emphasis>desenvolvedores Debian</emphasis>, mas reúne um número muito maior de colaboradores (tradutores, relatores de bugs, artistas, desenvolvedores casuais, etc.).

source: To carry its mission to fruition, Debian has a large infrastructure, with many servers connected across the Internet, offered by many sponsors.
ja_jp: Debian は自身の使命を実現させるために、多くのスポンサーが提供するインターネットに接続された多数のサーバを含む大型の設備を持っています。
pt_br: Para desempenhar sua missão a bom termo, o Debian tem uma grande infraestrutura, com muitos servidores conectados através da Internet, oferecidos por muitos patrocinadores.

source: <emphasis>COMMUNITY</emphasis> Behind Debian, the SPI association, and local branches
ja_jp: <emphasis>COMMUNITY</emphasis> Debian の裏方 (SPI) と現地支部
pt_br: <emphasis>COMUNIDADE</emphasis> Por trás do Debian, a associação SPI, e ramificações locais

source: <primary>Debian France</primary>
pt_br: <primary>Debian França</primary>
