Repository: Neamar/KISS
Catalog: */02_case-study.po
Languages: de_de, it_it, ja_jp, pl_pl, pt_br, ro_ro

source: A survey of several French service companies specialized in free software has shown that all of them provide technical assistance for Debian; it is also, for many of them, their chosen distribution, internally. This diversity of potential providers is a major asset for Falcot Corp's independence.
de_de: Eine Umfrage unter verschiedenen französischen Firmen, die sich auf freie Software spezialisiert haben, zeigte, dass alle technische Unterstützung für Debian anbieten. Für viele von ihnen ist es auch die Distribution der Wahl für interne Systeme. Die Vielfalt der möglichen Anbieter ist ein wichtiger Grund für die Unabhängigkeit der Falcot Corp.
it_it: Un sondaggio su diverse aziende francesi di servizi specializzate nel software libero ha mostrato che tutte forniscono assistenza tecnica per Debian; è anche, per molte di esse, la distribuzione che hanno scelto internamente. Questa varietà di potenziali fornitori è uno dei principali asset per l'indipendenza della Falcot Corp.
ja_jp: フランスのフリーソフトウェアに特化したサービス会社を対象に行われた調査により、全社が Debian に対する技術支援を行っている事が明らかになりました; Debian は多くの管理者が社内で採用したディストリビューションというわけです。この将来性がある者の多様性は Falcot Corp の独立性に関して大きな資産です。
pl_pl: Ankieta przeprowadzona wśród kilku francuskich firm usługowych, specjalizujących się w darmowym oprogramowaniu, pokazała, że wszystkie z nich świadczą wsparcie techniczne dla Debiana. Jest to również, dla wielu z nich, ich wybrana wewnętrznie dystrybucja. Ta różnorodność potencjalnych dostawców jest dużym atutem dla niezależności firmy Falcot Corp.
pt_br: Uma pesquisa feitas com diversas companhias Francesas especializadas em programas livres mostrou que todas elas provêm assistência ao Debian; é também, para muitos deles, a sua distribuição escolhida, internalmente. Esta diversidade de provedores potenciais é um trunfo importante para a independência da Falcot Corp.
ro_ro: Un studiu al mai multor firme franțuzești care oferă servicii specializate pe programe libere a arătat că toate oferă asistență tehnică pentru Debian; de asemenea, este distribuția aleasă pentru utilizarea internă de multe dintre ele. Această diversitate de potențiali furnizori este o valoare importantă pentru independența firmei Falcot S.R.L.

source: Finally, Debian is available on a multitude of architectures, including Sparc; it will, thus, be possible to install it on Falcot Corp's several Sun servers.
de_de: Schließlich ist Debian auf einer breiten Basis von Architekturen verfügbar, inklusive Sparc. Es ist trotzdem möglich, Debian auf den verschiedenen Sun-Servern der Falcot Corp. zu installieren.
it_it: Infine, Debian è disponibile su una moltitudine di architetture, incluse Sparc; sarà, quindi, possibile installarla sui server Sun della Falcot Corp.
ja_jp: 最後に、Debian は Sparc を含む多数のアーキテクチャで利用可能です; そんなわけで Debian は Falcot Corp のいくつかの Sun サーバにもインストールできるでしょう。
pl_pl: Wreszcie, Debian jet dostępny na niezliczone architektury, włączając Sparc. Dzięki temu będzie możliwa jego instalacja na serwerach Sun należących do Falcot Corp.
pt_br: Finalmente, Debian está disponível em diversas arquiteturas, incluindo Sparc; o que irá; portanto, possível de instalar em diversos servidores Sun da Falcot Corp.
ro_ro: În sfârșit, Debian este disponibil pe o multitudine de arhitecturi, inclusiv pe Sparc; astfel, va putea fi instalată pe mai multe servere Sun deținute de Falcot S.R.L.

source: Once Debian has been chosen, the matter of which version to use must be decided. Let's see why the administrators have picked Debian Squeeze.
de_de: Nachdem Debian gewählt wurde, muss noch die Frage nach der richtigen Version geklärt werden. Sehen wir uns an, warum die Administratoren Debian Squeeze gewählt haben.
it_it: Una volta che Debian è stata scelta, si deve scegliere quale versione usare. Vediamo perché gli amministratori hanno scelto Debian Squeeze.
pl_pl: Kiedy Debian został już wybrany, trzeba zdecydować, której jego wersji używać. Zobaczmy, dlaczego administratorzy wybrali Debiana Squeeze.
pt_br: Uma vez o Debian sendo escolhido, a questão de qual versão a ser usada deve ser decidida. Vamos ver por que os administradores escolheram o Debian Squeeze.
ro_ro: După ce Debian a fost ales, trebuie decisă versiunea ce va fi folosită. Hai să vedem de ce administratorii au ales Debian Squeeze.

source: Why Debian Squeeze?
de_de: Warum Debian Squeeze?
it_it: Perché Debian Squeeze?
pl_pl: Dlaczego Debian Squeeze?
pt_br: Por que Debian Squeeze?
ro_ro: De ce Debian Squeeze?

source: At the time of this writing, Debian Squeeze was still the “<emphasis role="distribution">Testing</emphasis>” distribution, but now, while you are reading, it will be the new “<emphasis role="distribution">Stable</emphasis>” version of Debian. This is also the reason for which we speak of “Debian Squeeze”, rather than “Debian 6.0”, since the version number is not used prior to its effective release.
de_de: Als dieses Buch geschrieben wurde, war Debian Squeeze noch die "<emphasis role="distribution">Testing</emphasis>" Distribution, aber mittlerweile, während Sie dieses Buch in Händen halten, ist es die neue "<emphasis role="distribution">Stable</emphasis>" Version von Debian. Das ist auch der Grund warum wir von "Debian Squeeze" statt von "Debian 6.0" sprechen: Die Versionsnummern werden vor dem eigentlichen Release nicht verwendet.
it_it: Quando questo libro è stato scritto, Debian Squeeze era ancora la distribuzione “<emphasis role="distribution">Testing</emphasis>”, ma ora, quando si sta leggendo, sarà la nuova versione “<emphasis role="distribution">Stable</emphasis>” di Debian. Questa è anche la ragione per cui parliamo di “Debian Squeeze”, invece di “Debian 6.0”, dal momento che il numero di versione non viene usato prima del suo effettivo rilascio.
pl_pl: Podczas pisania Debian Squeeze był ciągle “<emphasis role="distribution">Testową</emphasis>” dystrybucją, ale teraz, kiedy czytasz, będzie nową “<emphasis role="distribution">Stabilną</emphasis>” wersją Debiana. Z tego również powodu mówimy o "Debianie Squeeze", a nie "Debianie 6.0", ponieważ numer wersji nie jest używany przed faktycznym wydaniem.
pt_br: Neste momento desta escrita, o Debian Squeeze ainda está marcado como distribuição “<emphasis role="distribution">Testing</emphasis>” , mas agora, enquanto você está lendo, ela será a versão “<emphasis role="distribution">Stable</emphasis>” do Debian. Está também é a razão pela qual falamos de "Debian Squeeze", ao invés de "Debian 6.0", já que o número da versão não é usado antes do seu lançamento.
ro_ro: Când această carte a fost scrisă, Debian Squeeze era încă distribuție „<emphasis role="distribution">în testare</emphasis>”, dar acum, în timp ce citești aceste rânduri probabil este noua versiune „<emphasis role="distribution">stabilă</emphasis>” de Debian. Acesta este și motivul pentru care vorbim de „Debian Squee” în loc de „Debian 6.0”, pentru că numărul versiunii nu este folosit înainte de lansarea propriu-zisă.

source: You may note a few minor differences between what is written here and what you observe in practice, even though we have limited these discrepancies as much as possible.
de_de: Sie könnten einige minimale Unterschiede zwischen dem, was hier geschrieben steht und dem, was sie in der Praxis beobachten, feststellen, obwohl wir diese Diskrepanzen so weit wie möglich reduziert haben.
it_it: Si noteranno alcune differenze marginali tra ciò che è scritto qui e ciò che si osserva in pratica, sebbene abbiamo limitato queste differenze il più possibile.
pl_pl: Możesz zauważyć kilka małych różnic pomiędzy tym co jest tu napisane, a tym co zaobserwujesz w praktyce, mimo że ograniczyliśmy te rozbieżności najbardziej jak to tylko możliwe.
pt_br: Você deve ter notado algumas pequenas diferenças entre o que está escrito aqui e o que é observado na prática, embora tenhamos limitado essas discrep6ancias o máximo possível.
ro_ro: S-ar putea să observi micile diferențe dintre ce este scris aici și ce vezi în practică, deși am limitat aceste discrepanțe pe cât posibil.

source: <emphasis>PARTICIPATE</emphasis>
de_de: <emphasis>MITMACHEN</emphasis>
it_it: <emphasis>PARTECIPA</emphasis>
pl_pl: <emphasis>WEŹ UDZIAŁ</emphasis>
pt_br: <emphasis>PARTICIPE</emphasis>
ro_ro: <emphasis>PARTICIPĂ</emphasis>

source: Do not hesitate to indicate any error herein to us by e-mail; You can reach Raphaël at <email>hertzog@debian.org</email>, and Roland at <email>lolando@debian.org</email>.
de_de: Scheuen Sie sich nicht, uns jeglichen Fehler in diesem Buch mitzuteilen; Sie können Raphaël unter <email>hertzog@debian.org</email> und Roland unter <email>lolando@debian.org</email> erreichen.
it_it: Non esitare ad indicarci per email qualsiasi errore. Puoi raggiungere Raphaël all'indirizzo <email>hertzog@debian.org</email> e Roland all'indirizzo <email>lolando@debian.org</email>.
pl_pl: Nie wahaj się, aby wskazać nam jakiekolwiek znalezione błędy wysyłając email. Możesz skontaktować się z Raphaël'em przez <email>hertzog@debian.org</email> i Roland'em przez <email>lolando@debian.org</email>.
pt_br: Não hesite em nos indicar qualquer erro por e-mail; você pode encontrar Raphaël em <email>hertzog@debian.org</email>, e Roland em <email>lolando@debian.org</email>.
ro_ro: Nu ezita să indici orice eroare cuprinsă aici prin poștă electronică; poți să dai de Raphaël la <email>hertzog@debian.org</email> și de Roland la <email>lolando@debian.org</email>.

source: The choice of Debian Squeeze is well justified based on the fact that any administrator concerned about the quality of their servers will naturally gravitate towards the stable version of Debian. Furthermore, this distribution introduces numerous interesting changes: support for the latest virtualization technologies (KVM), simplified PAM configuration, an improved installer supporting BTRFS, all bringing improvements that directly affect administrators.
de_de: Die Wahl von Debian Squeeze ist auf die Tatsache zurückzuführen, dass jeder Administrator, der auf die Qualität seines Servers achtet, eher zur "stable" Version von Debian tendiert. Weiterhin führt diese Distribution einige interessante Änderungen ein: Unterstützung für Virtualisierungstechnologien (KVM), vereinfachte PAM-Konfiguration, einen verbesserten Installer, der auch BTRFS unterstützt. Alles zusammen bringt Verbesserungen mit sich, welche die Arbeit eines Administrators direkt beeinflussen.
it_it: La scelta di Debian Squeeze è ben giustificata basandosi sul fatto che ogni amministratore interessato alla qualità dei propri server tenderà naturalmente verso la versione stabile di Debian. In più, questa distribuzione introduce numerosi cambiamenti interessanti: il supporto per le ultime tecnologie di virtualizzazione (KVM), la configurazione semplificata di PAM, un installatore migliorato che supporta BTRFS, tutti miglioramenti che toccano direttamente gli amministratori.
pl_pl: Wybór Debiana Squeeze jest dobrze uzasadniony na podstawie faktu, że każdy administrator troszczący się o jakość swoich serwerów w sposób naturalny skłoni się w stronę stabilnej wersji Debiana. Ponadto, dystrybucja wprowadza wiele interesujących zmian: wsparcie dla najnowszych technologii wirtualizacji (KVM), uproszczoną konfigurację PAM, ulepszony instalator wspierający BTRFS, przynoszących bezpośrednie ulepszenia dla administratorów.
pt_br: A escolha do Debian Squeeze é bem justificada e baseado em fatores que qualquer administrador preocupado com a qualidade dos seus servidores irá naturalmente gravitar ao redor da versão estável do Debian. Além disso, está distribuição introduz inúmeras mudanças interessantes: suporte a última tecnologia de virtualização (KVM), configuração simplificada do PAM, melhoria no instalador suportando BTRFS, todas trazendo melhorias que diretamente afetam os administradores.
ro_ro: Alegerea de a folosi Debian Squeeze este bine justificată, ținând cont de faptul că orice administrator preocupat de calitatea serverelor sale va gravita în mod natural spre ultima versiune stabilă de Debian. Mai mult, această distribuție introduce numeroase schimbări interesante: suportul pentru ultimele tehnologii de virtualizare (KVM), configurarea de PAM simplificată și un instalator îmbunătățit care are suport pentru BTRFS, toate aducând îmbunătățiri care-i influențează direct pe adminsitratori.

source: <primary>Linux</primary>
pl_pl: <primary>Linuks</primary>

source: Falcot Corp
ro_ro: Falcot S.R.L.

source: <primary>TCO</primary>
ro_ro: <primary>CTP</primary>

source: In the context of this book, you are the system administrator of a growing small business. The time has come for you to redefine the information systems master plan for the coming year in collaboration with your directors. You choose to progressively migrate to Debian, both for practical and economical reasons. Let's see into more detail what's in store for you…
ja_jp: この本の中では、あなたは成長中の小企業のシステム管理者です。重役と協力して来年度の情報システムの基本計画を再定義する時が迫っています。あなたは実務的および経済的な理由で Debian への移行を徐々に行う事を選択しています。ここであなたに何が起ころうとしているかを詳細に見てみましょう…

source: We have envisioned this case study to approach all modern information system services currently used in a medium sized company. After reading this book, you will have all of the elements necessary to install Debian on your servers and fly on your own wings. You will also learn how to efficiently find information in the event of difficulties.
ja_jp: 我々はこの事例研究に際し、中規模の企業で現在使われているすべての現代的な情報システムサービスを取り扱う事を想定しました。この本を読めば、Debian をサーバにインストールするために必要なすべての要素を会得し、独り立ちできることでしょう。また、困った時に有益な情報を見つける方法を理解するでしょう。

source: Falcot Corp is a manufacturer of high quality audio equipment. The company is growing strongly, and has two facilities, one in Saint-Étienne, and another in Montpellier. The former has around 150 employees; it hosts a factory for the manufacturing of speakers, a design lab, and all administrative office. The Montpellier site is smaller, with only about 50 workers, and produces amplifiers.
ja_jp: Falcot Corp は高品質な音響設備のメーカーです。この会社は力強く成長しており、サン-テティエンヌとモンペリエに 2 つの施設を持っています。サン-テティエンヌには 150 人の従業員がおり; スピーカを製造する工場、デザイン研究所、管理課があります。モンペリエは比較的小さく、50 人の従業員がおり、アンプを生産しています。

source: The Falcot Corp company used as an example here is completely fictional. Any resemblance to an existing company is purely coincidental. Likewise, some example data throughout this book may be fictional.
ja_jp: この例で使っている Falcot Corp 社は完全に架空のものです。現存する会社とは一切関係ありません。同様に、この本全体を通じて例として使われているデータは架空のものです。

source: significant improvement in security to better protect trade secrets related to new products.
ja_jp: 新製品に関する企業秘密をより強固に守るためのセキュリティに関する著しい改善。

source: The entire information system will be overhauled with these goals in mind.
ja_jp: すべての情報システムは、これらの目標を念頭に、徹底的に整備されるでししょう。

source: The switch to Debian will be gradual; a small business, with limited means, cannot reasonably change everything overnight. For starters, the IT staff must be trained in Debian administration. The servers will then be converted, starting with the network infrastructure (routers, firewalls, etc.) followed by the user services (file sharing, Web, SMTP, etc.). Then the office computers will be gradually migrated to Debian, for each department to be trained (internally) during the deployment of the new system.
ja_jp: Debian への切り替えは段階的に進められるでしょう; 小規模で資本が制限されている会社は、すべてを突然無理なく変更することはできません。まず最初に、IT 部員が Debian 管理の訓練を受けなければいけません。その後サーバ類が切り替えられるでしょう、まずネットワークインフラ (ルータ、ファイヤーウォールなど)、次にユーザサービス (ファイル共有、ウェブ、SMTP など) が続きます。最後に、オフィスコンピュータが段階的に Debian へ切り替えられるでしょう、それぞれの部署では新しいシステムが配備される間 (内部的に) 訓練が行われます。

source: Debian has chosen to follow this recommendation, and, thus, name its distributions accordingly (thus, the latest stable release is Debian GNU/Linux 7).
ja_jp: Debian はこの提言に従って、ディストリビューションを名付けることにしました (最新の安定版は Debian GNU/Linux 7 です)。

source: Several factors have dictated this choice. The system administrator, who was familiar with this distribution, ensured it was listed among the candidates for the computer system overhaul. Difficult economic conditions and ferocious competition have limited the budget for this operation, despite its critical importance for the future of the company. This is why Open Source solutions were swiftly chosen: several recent studies indicate they are less expensive than proprietary solutions while providing equal or better quality of service so long as qualified personnel are available to run them.
ja_jp: いくつかの要素がこの決定に影響しました。システム管理者は Debian に詳しく、コンピュータシステムの総入れ替え先候補に Debian を挙げる事を保証していました。これが企業の将来に決定的な重要性を持っているにもかかわらず、経済状況が厳しく、他社との競争が猛烈であったため、入れ替え作業に割ける予算は制限されていました。こような理由で、オープンソースという解決策が速やかに選択されました: 最近のいくつかの調査によって、適切な資格を持つ人間が運用する限り、オープンソースによる解決策はプロプライエタリによる解決策と比較して同等かより優れたサービスの品質を提供するにもかかわらず安上がりである、という事が明らかにされています。

source: This TCO, which varies according to the criteria chosen in the assessment thereof, is rarely significant when taken in isolation. However, it is very interesting to compare TCOs for different options if they are calculated according to the same rules. This assessment table is, thus, of paramount importance, and it is easy to manipulate it in order to draw a predefined conclusion. Thus, the TCO for a single machine doesn't make sense, since the cost of an administrator is also reflected in the total number of machines they manage, a number which obviously depends on the operating system and tools proposed.
ja_jp: TCO というものは、どのような基準で評価に依存して変化し、単独で購入する限り高額になることは珍しいです。しかしながら、同じ基準に従って計算できるのであれば、さまざまな選択肢間で TCO を比較することはとても興味深いです。このため、評価表は最も重要で、事前に用意された結論に達するためにそれを操作することは簡単です。単独の機材に対する TOC は意味がありません、なぜなら、管理者のコストは管理する機材の総数に依存し、総数は提案されるオペレーティングシステムとツールに依存するのは明らかだからです。

source: Among free operating systems, the IT department looked at the free BSD systems (OpenBSD, FreeBSD, and NetBSD), GNU Hurd, and Linux distributions. GNU Hurd, which has not yet released a stable version, was immediately rejected. The choice is simpler between BSD and Linux. The former have many merits, especially on servers. Pragmatism, however, led to choosing a Linux system, since its installed base and popularity are both very significant and have many positive consequences. One of these consequences is that it is easier to find qualified personnel to administer Linux machines than technicians experienced with BSD. Furthermore, Linux adapts to newer hardware faster than BSD (although they are often neck and neck in this race). Finally, Linux distributions are often more adapted to user-friendly graphical user interfaces, indispensable for beginners during migration of all office machines to a new system.
ja_jp: IT 部門は、数あるフリーオペレーティングシステムの中から、フリーの BSD システム (OpenBSD、FreeBSD、NetBSD)、GNU Hurd、Linux ディストリビューションを検討しました。GNU Hurd は安定版をまだリリースしておらず、すぐに却下されました。これで BSD か Linux の単純な二択に絞られました。BSD は特にサーバに対して多くのメリットがあります。しかしながら、実用的な観点から Linux システムを選ぶことになりました。なぜなら、Linux システムはインストール基盤と人口ともに大きく、良い結果が見込まれたからです。良い結果の 1 つとして、Linux マシンを管理する有能な人材を見つけるほうが、BSD の経験が豊富な専門家を見つけることに比べて簡単という点が挙げられます。さらに、Linux は BSD に比べて新しめのハードウェアに対応するのが早い (接戦になる事が多いですが) という点があります。最後に、Linux ディストリビューションはユーザフレンドリーなグラフィカルユーザインターフェースを採用している事が多いという点です。初心者にとっては、すべてのオフィスマシンを新しいシステムに移行するまでの間、この点は無視できません。

source: Since Debian <emphasis role="distribution">Squeeze</emphasis>, it is possible to use Debian with a FreeBSD kernel on 32 and 64 bit computers; this is what the <literal>kfreebsd-i386</literal> and <literal>kfreebsd-amd64</literal> architectures mean. While these architectures are labeled “experimental” (Technology Preview), about 90 % of the software packaged by Debian is available for them.
ja_jp: Debian <emphasis role="distribution">Squeeze</emphasis> 以降、32 および 64 ビットコンピュータ上で FreeBSD カーネルの Debian を使う事が可能です; <literal>kfreebsd-i386</literal> と <literal>kfreebsd-amd64</literal> アーキテクチャはこれを意味しています。これらのアーキテクチャは「実験的」(テクノロジープレビュー) とされていますが、約 90 % のソフトウェアが Debian によってパッケージ化され、利用可能です。

source: Once the Linux family has been selected, a more specific option must be chosen. Again, there are plenty of criteria to consider. The chosen distribution must be able to operate for several years, since the migration from one to another would entail additional costs (although less than if the migration were between two totally different operating systems, such as Windows or Mac OS).
ja_jp: Linux ファミリーを選ぶ事が決まったら、その中からどれを選ぶか決めなければいけません。この場合も同様に、考慮しなければいけないたくさんの基準があります。ディストリビューションは数年間稼働する事ができなければいけません、なぜなら、あるディストリビューションから他のものに移行することは追加コストを必要とするからです (2 つの完全に異なるオペレーティングシステム、例えば Windows と Mac OS を入れ替えるような場合に比べれば安くすみます)。

source: Of all community distributions, it is the most significant from many perspectives: in number of contributors, number of software packages available, and years of continuous existence. The size of its community is an incontestable witness to its continuity.
ja_jp: すべてのコミュニティディストリビューションの中でも、Debian は多くの観点から最も大きいといえます: 貢献者の数、利用可能なソフトウェアパッケージの数、長年にわたり存在し続けていること。コミュニティの大きさはコミュニティがある事を明らかに証明しています。

source: Once Debian has been chosen, the matter of which version to use must be decided. Let us see why the administrators have picked Debian Wheezy.
ja_jp: Debian を選んだら、どのバージョンを使うかを決めなければいけません。管理者が Debian Wheezy を使うと決めた理由をみてみましょう。

source: Why Debian Wheezy?
ja_jp: Debian Wheezy を選ぶ理由とは?

source: Every Debian release starts its life as a continuously changing distribution, also known as “<emphasis role="distribution">Testing</emphasis>”. But at the time when you will read those lines, Debian Wheezy should be the latest “<emphasis role="distribution">Stable</emphasis>” version of Debian.
ja_jp: すべての Debian リリースは「<emphasis role="distribution">テスト版</emphasis>」としても知られる変化を続けるディストリビューションとして出発します。しかし、あなたがこの行を読むときには既に、Debian Wheezy は Debian の最新<emphasis role="distribution">安定版</emphasis>になっているはずです。

source: The choice of Debian Wheezy is well justified based on the fact that any administrator concerned about the quality of their servers will naturally gravitate towards the stable version of Debian. Even if the previous stable release might still be supported for a while, Falcot administrators aren't considering it because its support period will not last long enough and because the latest version brings new interesting features that they care about.
ja_jp: サーバの品質に気を配っている管理者は自然に Debian の安定版を使いたがるという事実に基くと、Debian Wheezy を選ぶ行為を正当化できます。前の安定版はまだしばらくの間引き続きサポートされるかもしれませんが、Falcot の管理者は前の安定版の可能性を検討していません、その理由は、しばらくすればサポート期間が切れますし、最新版には関心のある新しく興味深い機能があるからです。
