Repository: Neamar/KISS
Catalog: */02_case-study.po
Languages: de_de, it_it, ja_jp, pl_pl, pt_br, ro_ro

source: These architectures may be an appropriate choice for Falcot Corp administrators, especially for a firewall (the kernel supports three different firewalls: IPF, IPFW, PF) or for a NAS (network attached storage system, for which the ZFS filesystem has been tested and approved).
de_de: Diese Architekturen könnten eine gute Wahl für die Administratoren der Falcot Corp. sein, speziell für eine Firewall (der Kernel unterstützt drei verschiedene Firewalls: PF, IPFW und PF) oder eine Netzwerkspeicher-Lösung (NAS; network attached storage system; hierfür wurde das ZFS-Dateisystem getestet und freigegeben).
it_it: Queste architetture possono essere una scelta appropriata per gli amministratori della Falcot Corp, specialmente per un firewall (il kernel supporta tre diversi firewall: IPF, IPFW, PF) o per un NAS (network attached storage system, per il quale il filesystem ZFS è stato provato e approvato).
ja_jp: これらのアーキテクチャは Falcot Corp の管理者からすると特にファイヤーウォール (このカーネルは 3 つの異なるファイヤーウォールをサポートしています: IPF、IPFW、PF) と NAS (ネットワークに接続されたストレージシステム、ZFS ファイルシステムがテスト、承認されています) 用途に対しては適切な選択かもしれません。
pl_pl: Te architektury mogą być odpowiednim wyborem dla administratorów Falcot Corp, szczególnie na zaporę sieciową (jądro wspiera trzy różne zapory: IPF, IPFW, PF) lub na NAS (system zasobów dyskowych podłączonych do sieci, dla których system plików ZFS został przetestowany i zatwierdzony).
pt_br: Estas arquiteturas podem ser apropriadas para serem escolhidas pelos administradores da Falcot Corp, especialmente para o firewall ( o kernel suporta três tipos de firewall: IPF, IPFW, PF) ou para um NAS (sistema de armazenamento por rede, para o qual o sistema de arquivos ZFS foi testado e aprovado).
ro_ro: Aceste arhitecturi pot reprezenta alegerea potrivită pentru administratorii firmei Falcot S.R.L., în special pentru un „firewall” (nucleul are suport pentru trei paravane diferite: IPF, IPFW, PF) sau pentru un NAS (sistem de stocare conectat la rețea, pentru care sistemul de fișiere ZFS a fost testat și avizat).

source: Why the Debian Distribution?
de_de: Warum die Debian Distribution?
it_it: Perché la distribuzione Debian?
ja_jp: Debian ディストリビューションを選ぶ理由とは?
pl_pl: Dlaczego Dystrybucja Debiana?
pt_br: Por que a Distribuição Debian?
ro_ro: De ce distribuția Debian?

source: Once Linux has been endorsed, a more specific option must be chosen. Again, the criteria to consider abound. The distribution chosen must be able to operate for several years, since the migration from one to another would entail additional costs (although less than if the migration were between two totally different operating systems, such as Windows or Mac OS).
de_de: Sobald eine Entscheidung für Linux gefallen ist, sind weitere Optionen zu betrachten. Und wieder sind zahlreiche Kriterien zu bedenken. Die gewählte Distribution muss mehrere Jahre betrieben werden können, weil eine Umstellung (Migration) weitere Kosten nach sich ziehen würde (obwohl diese nicht so hoch ausfallen wie bei einem Wechsel zu einem völlig unterschiedlichen Betriebssystem wie etwa Windows oder Mac OS).
it_it: Una volta che Linux è stato approvato, deve essere scelta un'opzione più specifica. Di nuovo, i criteri da considerare abbondano. La distribuzione scelta deve essere capace di funzionare per diversi anni, dal momento che la migrazione a un'altra comporterebbe dei costi aggiuntivi (sebbene minori che se la migrazione fosse tra due sistemi operativi completamente differenti, come Windows o Mac OS).
pl_pl: Kiedy już Linuks został zatwierdzony, należy dokonać bardziej szczegółowego wyboru. Ponownie pojawia się wiele kryteriów. Wybrana dystrybucja musi być w stanie działać przez kilka lat, ponieważ migracja z jednej na inną pociąga za sobą dodatkowe koszty (jednak mniej, niż w przypadku migracji pomiędzy dwoma zupełnie odmiennymi systemami operacyjnymi, takimi jak Windows lub Mac OS).
pt_br: Uma vez que o Linux foi endossado, uma opção mais específica deve ser feita. Novamente, os critérios a serem considerados são abundantes. A distribuição escolhida deve poder operar durante muitos anos, já que a migração de um para o outro implicaria custos adicionais (muito embora menores do que a migração entre dois sistemas operacionais completamente diferentes, como Windows ou Mac OS).
ro_ro: După ce Linux a fost aprobat, trebuie aleasă una din opțiunile mai particulare. Din nou, sunt multe criterii de luat în considerare. Distribuția aleasă trebuie să fie capabilă să funcționeze pentru mai mulți ani, pentru că migrarea de la una la alta ar presupune costuri suplimentare (deși mai puțin decât o migrare între două sisteme de operare complet diferite, ca Windows sau Mac OS).

source: Sustainability is, thus, essential, and it must guarantee regular updates and security patches over several years. The timing of updates is also significant, since, with so many machines to manage, Falcot Corp can not handle this complex operation too frequently. The IT department, therefore, insists on running the latest stable version of the distribution, benefiting from the best technical assistance, and guaranteed security patches. In effect, security updates are generally only guaranteed for a limited duration on older versions of a distribution.
de_de: Nachhaltigkeit ist sehr wichtig. Sie muss regelmäßige Updates und Sicherheitsupdates für mehrere Jahre garantieren. Auch die zeitliche Abfolge von Updates ist sehr wichtig, weil die Falcot Corp. diese komplexen Operationen bei der großen Anzahl der zu verwaltenden Rechner nicht allzu häufig durchführen kann. Die IT-Abteilung besteht daher darauf, die neueste stabile Version der Distribution einzusetzen, um von der besten technischen Unterstützung und garantierten Sicherheitsupdates zu profitieren. In der Tat werden Sicherheitsupdates nur für eine begrenzte Zeit für ältere Versionen einer Distribution angeboten.
it_it: La sostenibilità è perciò essenziale e deve garantire aggiornamenti regolari e correzioni di sicurezza nel corso di diversi anni. Anche la tempistica degli aggiornamenti è importante, dal momento che, con così tante macchine da gestire, Falcot Corp non può gestire questa operazione complessa troppo spesso. Il dipartimento IT, perciò, insiste nell'utilizzare l'ultima versione stabile della distribuzione, beneficiando della migliore assistenza tecnica e delle correzioni di sicurezza garantite. Infatti, le correzioni di sicurezza in genere sono garantite solo per un periodo limitato per le vecchie versioni di una distribuzione.
ja_jp: このため、持続可能性は絶対不可欠で、数年間にわたって定期的な更新とセキュリティパッチの供給が受けられる事も保証されていなければいけません。また、更新のタイミングも重要です、なぜなら管理するマシンがとても多い場合 Falcot Corp では頻繁すぎて更新という複雑な操作を処理できないからです。それゆえ、IT 部門は、ディストリビューションの最新安定版を使い、最高の技術援助の恩恵を享受し、セキュリティパッチの供給を確実に受ける事を主張します。実質的には、ディストリビューションの古いバージョンに対するセキュリティ更新はほとんどの場合期間限定で受けられます。
pl_pl: Trwałość jest więc kluczowa i musi zagwarantować regularne aktualizacje i łatki bezpieczeństwa przez kilka lat. Częstotliwość aktualizacji jest również ważna, gdyż z tyloma maszynami do zarządzania, Falcot Corp nie może wykonywać tej złożonej operacji zbyt często. Dział IT nalega jednak na używanie najnowszej stabilnej wersji dystrybucji, korzystającej z najlepszego wsparcia technicznego i gwarantowanych łatek bezpieczeństwa. W efekcie, aktualizacje bezpieczeństwa są zagwarantowane jedynie przez określony czas dla starszych wersji dystrybucji.
pt_br: Sustentabilidade é, portanto, essencial, e deve garantir atualizações regulares e patches de segurança durante muitos anos. O tempo de atualização também é significativo, já que, com tantas máquinas para administrar, Falcot Corp não pode manejar essa operação complexa muito frequentemente. O departamento de TI, entretanto, insiste em rodar a última versão estável da distribuição, beneficiando-se assim de uma assistência técnica melhor, e garantindo patches de segurança. Na realidade, atualizações de segurança geralmente apenas são garantidos por um tempo limitado em distribuições mais antigas.
ro_ro: Sustenabilitatea este, de aceea, esențială și trebuie să garanteze actualizări regulate și petice de securitate pentru mai mulți ani. Sincronizarea actualizărilor este și ea importantă, din moment ce, cu așa de multe mașini de gestionat, firma Falcot S.R.L. nu poate să facă față unei astfel de operațiuni complexe prea frecvent. Așa că, departamentul de TI insistă să ruleze ultima versiune stabilă a distribuției, beneficiând de cea mai bună asistență tehnică și petice de securitate garantate. În consecință, actualizările de securitate sunt în general garantate doar pe o durată limitată pentru versiunile mai vechi ale unei distribuții.

source: Finally, for reasons of homogeneity and ease of administration, the same distribution must run on all the servers (some of which are Sparc machines, currently running Solaris) and office computers.
de_de: Schließlich muss aus Gründen der Homogenität und der einfachen Administration die gleiche Distribution auf allen Servern (von denen einige Sparc-Rechner sind, die derzeit auf Solaris laufen) und Bürorechnern laufen.
it_it: Infine, per motivi di omogeneità e facilità di amministrazione, la stessa distribuzione deve girare su tutti i server (alcuni dei quali sono macchine Sparc che attualmente hanno installato Solaris) e computer degli uffici.
ja_jp: 最後に、均一性と管理を簡単にする目的で、すべてのサーバとオフィスコンピュータ (一部に現在 Solaris を実行している Sparc マシンが含まれます) では同じディストリビューションを動かさなければいけません。
pl_pl: Wreszcie, z powodów homogeniczności i łatwości w administracji, ta sama dystrybucja musi działać na wszystkich serwerach (niektóre z nich to maszyny Sparc, aktualnie działające na Solarisie) i komputerach biurowych.
pt_br: Finalmente, por razões de hegemonia e facilidade de administração, a mesma distribuição deve rodar em todos os servidores (alguns dos quais são máquinas Sparc, atualmente rodando Solaris) e computadores do escritório.
ro_ro: În sfârșit, din motive de omogenitate și ușurință în administrare, aceeași distribuție trebuie să ruleze pe toate serverele (unele dintre ele care sunt mașini Sparc, la momentul actual rulând Solaris) și calculatoare de birou.

source: Commercial and Community Driven Distributions
de_de: Kommerzielle und von der Gemeinschaft gewartete Distributionen
it_it: Distribuzioni commerciali e guidate dalla comunità
ja_jp: 商用とコミュニティ主導のディストリビューション
pl_pl: Dystrybucje Komercyjne i Prowadzone przez Społeczność
pt_br: Distribuições Dirigidas Comercialmente e por uma Comunidade
ro_ro: Distribuții comerciale sau conduse de comunitate

source: There are two main categories of Linux distributions: commercial and community driven. The former, developed by companies, are sold with commercial support services. The latter are developed according to the same open development model as the free software of which they are comprised.
de_de: Es gibt zwei Hauptkategorien von Linux-Distributionen: kommerzielle und von der Community entwickelte. Die Ersteren, die von Firmen entwickelt werden, werden mit dem entsprechenden Support verkauft. Die Letzteren werden nach den gleichen Regeln entwickelt wie die Software, aus denen sie besteht.
it_it: Ci sono due categorie principali di distribuzioni Linux: commerciali e guidate dalla comunità. Le prime, sviluppate da aziende, sono vendute con servizi di supporto commerciali. Le altre sono sviluppate secondo lo stesso modello aperto di sviluppo del software libero di cui sono composte.
ja_jp: Linux ディストリビューションは 2 つのカテゴリに分類されます: 商用とコミュニティ主導です。前者は企業が開発し、商用サポートサービスと一緒に販売されます。後者はディストリビューション含まれるフリーソフトウェアと同じオープン開発モデルに従って開発されます。
pl_pl: Istnieją dwie główne kategorie dystrybucji Linuksa: komercyjne i prowadzone przez społeczność. Pierwsze z nich są rozwijane przez firmy i sprzedawane z usługą komercyjnego wsparcia. Drugi typ jest rozwijany według tego samego otwartego modelu rozwoju co wolne oprogramowanie, z którego się składają.
pt_br: Há duas principais categorias de distribuições Linux: dirigidas por uma empresa ou por uma comunidade. A primeira, desenvolvidas por companhias, são vendidas com serviço comercial de suporte. A última é desenvolvida de acordo com o mesmo modelo aberto assim como os programas livres pelos quais é composta.
ro_ro: Există două categorii mari de distribuții de GNU/Linux: comerciale și conduse de comunitate. Prima, dezvoltată de firme, este vândută cu servicii de asistență comercială. A doua este dezvoltată conform aceluiași model de dezvoltare transparent folosit de programele libere pe care le include.

source: A commercial distribution will have, thus, a tendency to release new versions more frequently, in order to better market updates and associated services. Their future is directly connected to the commercial success of their company, and many have already disappeared (Caldera Linux, StormLinux, etc.).
de_de: Eine kommerzielle Distribution wird daher tendenziell öfter neue Versionen veröffentlichen, um näher am Marktgeschehen und den damit verbundenen Services zu bleiben. Ihre Zukunft ist direkt mit dem wirtschaftlichen Erfolg ihrer Firma verbunden, viele sind bereits wieder verschwunden (Caldera Linux, StormLinux usw.).
it_it: Una distribuzione commerciale avrà, perciò, la tendenza a rilasciare nuove versioni più di frequente per commercializzare meglio gli aggiornamenti e i servizi associati. Il loro futuro è collegato direttamente al successo commerciale della loro azienda e molte sono già scomparse (Caldera Linux, StormLinux, ecc.).
ja_jp: そんなわけで、商用ディストリビューションは市場と関連するサービスを活性化するために新しいバージョンを頻繁にリリースする傾向があります。彼らの将来は企業の商業的成功と直接の関係があり、既に消えてしまったもの (Caldera Linux、StormLinux など) も多いです。
pl_pl: Dystrybucje komercyjne mają tendencję do częstszego wydawania nowych wersji, w celu lepszej promocji aktualizacji i powiązanych usług. Ich przyszłość jest ściśle powiązana z komercyjnym sukcesem firmy i wiele z nich już zniknęło (Caldera Linux, StormLinux, etc.).
pt_br: Uma distribuição comercial terá, portanto, uma tendência a lançar versões mais frequentemente, afim de enfatizar atualizações e serviços associados. Seu futuro é diretamente associado ao sucesso comercial da companhia, e muitas já desapareceram (Caldera Linux, StormLinux, etc.).
ro_ro: O distribuție comercială va avea, astfel, o tendință să lanseze noi versiuni mai frecvent, pentru a îmbunătăți actualizările de pe piață și serviciile asociate. Viitorul lor depinde în mod direct de succesul comercial al firmei și multe deja au dispărut (Caldera Linux, StormLinux etc.).

source: A community distribution doesn't follow any schedule but its own. Like the Linux kernel, new versions are released when they are stable, never before. Its survival is guaranteed, as long as it has enough individual developers or third party companies to support it.
de_de: Eine nichtkommerzielle Distribution folgt nur ihrem eigenen Programm. Ähnlich dem Linux-Kernel werden neue Versionen freigegeben, sobald sie stabil sind, niemals vorher. Solange es genug unabhängige Entwickler oder dritte Unternehmen gibt, die sie unterstützen, ist ihr Überleben gesichert.
it_it: Una distribuzione comunitaria non segue un proprio calendario. Come il kernel Linux, le nuove versioni sono rilasciate quando sono stabili, mai prima. La sua sopravvivenza è garantita finché ci sono abbastanza sviluppatori individuali o aziende esterne che la supportano.
ja_jp: コミュニティディストリビューションはいかなるスケジュールにも従わない反面、自分で決めたスケジュールには従います。Linux カーネルのように、新しいバージョンはそれが安定したらリリースされ、安定する前にリリースされることはありません。十分な数の個人開発者またはサードパーティ企業がサポートする限り、生存が保証されています。
pl_pl: Dystrybucja społecznościowa nie kieruje się żadnym harmonogramem poza swoim. Podobnie jak jądro Linuksa, nowe wersje są wydawane dopiero, kiedy są stabilne, nie wcześniej. Ich przetrwanie jest zagwarantowane tak długo, jak mają indywidualnych deweloperów lub firmy trzecie, które je wspierają.
pt_br: Uma distribuição comunitária não segue nenhum calendário a não ser o seu próprio. Como o kernel do Linux, novas versões são lançadas quando estão estáveis, nunca antes. Sua sobrevivência é garantida, enquanto houver desenvolvedores ou companhias para suportá-la.
ro_ro: O distribuție condusă de comunitate urmează doar planificarea proprie. Ca nucleul Linux, versiunile noi sunt lansate când sunt stabile, niciodată mai devreme. Supraviețuirea lor este garantată, atâta timp cât are destui dezvoltatori sau firme terțe să o susțină.

source: <primary>distribution</primary><secondary>community Linux distribution</secondary>
de_de: <primary>Distributionen</primary><secondary>Nichtkommerzielle Distributionen</secondary>
it_it: <primary>distribuzione</primary><secondary>distribuzione Linux comunitaria</secondary>
ja_jp: <primary>ディストリビューション</primary><secondary>コミュニティ Linux ディストリビューション</secondary>
pl_pl: <primary>dystrybucja</primary><secondary>społecznościowa dystrybucja Linuksa</secondary>
pt_br: <primary>distribuição</primary><secondary>distribuição Linux comunitária</secondary>
ro_ro: <primary>distribution</primary><secondary>distribuții comunitare de GNU/Linux</secondary>

source: <primary>distribution</primary><secondary>commercial Linux distribution</secondary>
de_de: <primary>Distributionen</primary><secondary>Kommerzielle Distributionen</secondary>
it_it: <primary>distribuzione</primary><secondary>distribuzione Linux commerciale</secondary>
ja_jp: <primary>ディストリビューション</primary><secondary>商用 Linux ディストリビューション</secondary>
pl_pl: <primary>dystrybucja</primary><secondary>komercyjna dystrybucja Linuksa</secondary>
pt_br: <primary>distribuição</primary><secondary>distribuição Linux comercial</secondary>
ro_ro: <primary>distribution</primary><secondary>distribuții comerciale de GNU/Linux</secondary>

source: A comparison of various Linux distributions led to the choice of Debian for various reasons:
de_de: Bei einem Vergleich verschiedener Linux-Distributionen fiel aus folgenden Gründen die Wahl auf Debian:
it_it: Un confronto tra diverse distribuzioni Linux ha portato alla scelta di Debian per varie ragioni:
ja_jp: さまざまな Linux ディストリビューションを比較し、以下の理由から Debian を選びました:
pl_pl: Porównanie różnych dystrybucji Linuksa doprowadziła do wyboru Debiana z różnych powodów:
pt_br: Uma comparação de diversas distribuições Linux levou a escolha do Debian por diversos motivos:
ro_ro: O comparație între diferitele distribuții de GNU/Linux a condus la alegerea lui Debian din mai multe motive:

source: It is a community distribution, with development ensured independently from any commercial constraints; its objectives are, thus, essentially of a technical nature, which seem to favor the overall quality of the product.
de_de: Es ist eine Community-Distribution, deren Entwicklung unabhängig von kommerziellen Interessen gesichert ist. Ihre Ziele sind daher grundsätzlich technischer Natur, was für die generelle Qualität des Produkts spricht.
it_it: È una distribuzione comunitaria, con lo sviluppo assicurato indipendentemente da qualsiasi vincolo commerciale; i suoi obiettivi sono, quindi, essenzialmente di natura tecnica, il che sembra che favorisca la qualità complessiva del prodotto.
ja_jp: Debian はコミュニティディストリビューションであり、その開発はいかなる商業的制約に関係なく確保されています; その目標は基本的に技術本質であり、プロジェクトの全体的な品質に有利に働くようにみえます。
pl_pl: Jest to dystrybucja społecznościowa, z rozwojem zapewnionym niezależnie od jakichkolwiek komercyjnych ograniczeń. Jej cele są więc głównie natury technicznej, co daje korzyści dla ogólnej jakości produktu.
pt_br: É uma distribuição comunitária, com o desenvolvimento garantido independentemente de qualquer restrição comercial; seus objetivos são, portanto, essencialmente de natureza técnica, que parecem favorecer a qualidade geral do produto.
ro_ro: Este o distribuție comunitară, cu dezvoltarea asigurată independent de constrângerile comerciale; obiectivele sale sunt, astfel, esențial de natură tehnică, care pare să favorizeze calitatea de ansamblu a produsului.

source: Of all community distributions, it is the most significant from any perspective: in number of contributors, number of software packages available, and years of continuous existence. The size of its community is an incontestable witness to its continuity.
de_de: Community-Distributionen glänzen in vielen Aspekten: So etwa in der Anzahl der Mitwirkenden (Programmierer usw.), der Anzahl der verfügbaren Softwarepakete und der Jahre ihrer kontinuierlichen Existenz. Die Größe der Community ist dabei ein unbestreitbarer Zeuge und Garant für Kontinuität.
it_it: Di tutte le distribuzioni comunitarie, è la più significativa da qualunque prospettiva: nel numero dei contributori, numero di pacchetti software disponibili e anni di esistenza continua. La dimensione della sua comunità è una testimonianza incontrovertibile della sua continuità.
pl_pl: Wśród wszystkich dystrybucji społecznościowych jest najbardziej znaczącą pod każdym względem: liczby współpracowników, liczby dostępnych paczek oprogramowania i lat ciągłego istnienia. Wielkość jej społeczności jest niepodważalnym dowodem do jej kontynuacji.
pt_br: De todas distribuições comunitárias, é a mais significativa de qualquer perspectiva: em números de contribuidores, número de pacotes de programas disponíveis, e anos de existência continua. O tamanho de sua comunidade é testemunha incontestável de sua continuidade.
ro_ro: Dintre toate distribuțiile comunitare, este cea mai importantă din orice perspectivă: număr de contribuitori, număr de pachete de programe disponibile și ani de continuitate în existență. Dimensiunea comunității este un martor incontestabil al continuității sale.

source: Statistically, new versions are released every 18 to 24 months, a schedule which is agreeable to administrators.
de_de: Statistisch gesehen werden alle 18 bis 24 Monate neue Versionen herausgegeben. Mit dieser Geschwindigkeit können die meisten Administratoren leben.
it_it: Statisticamente, le nuove versioni sono rilasciate ogni 18-24 mesi, una cadenza che è gradita dagli amministratori.
ja_jp: 統計的に言って Debian の新しいバージョンは 18 ヶ月から 24 ヶ月毎にリリースされています、これは管理者にとって好ましいスケジュールです。
pl_pl: Statystycznie, nowe wersje są wydawane co 18 do 24 miesięcy, według harmonogramu, który jest do przyjęcia przez administratorów.
pt_br: Estaticamente, novas versões são lançadas a cada 18 a 24 meses, um planejamento que é agradável aos administradores.
ro_ro: Statistic vorbind, versiunile noi sunt lansate la fiecare 18-24 de luni, care este o planificare agreabilă de adminsitratori.
