Repository: Neamar/KISS
Catalog: */02_case-study.po
Languages: de_de, it_it, ja_jp, pl_pl, pt_br, ro_ro

source: Linux, as you already know, is only a kernel. The expressions, “Linux distribution” and “Linux system” are, thus, incorrect: they are, in reality, distributions or systems <emphasis>based on</emphasis> Linux. These expressions fail to mention the software that always complete this kernel, among which are the programs developed by the GNU Project. Dr. Richard Stallman, founder of this project, insists that the expression “GNU/Linux” be systematically used, in order to better recognize the important contributions made by the GNU Project and the principles of freedom upon which they are founded.
it_it: Linux, come già sai, è solo un kernel. Le espressioni “distribuzione Linux” e “sistema Linux” sono, perciò, scorrette: si tratta in realtà di distribuzioni o di sistemi <emphasis>basati su</emphasis> Linux. Queste espressioni omettono di menzionare il software che completa sempre questo kernel, tra cui i programmi sviluppati dal Progetto GNU. Richard Stallman, fondatore di questo progetto, insiste affinché l'espressione “GNU/Linux” sia usata sistematicamente, al fine di riconoscere meglio gli importanti contributi del Progetto GNU e i principi di libertà su cui essi sono fondati.
ja_jp: 既にご存じと思いますが、Linux はカーネルに過ぎません。そんなわけで「Linux ディストリビューション」や「Linux システム」は誤りです: 実際には、これらは Linux を<emphasis>基盤に据えた</emphasis>ディストリビューションまたはシステムです。この表現は、Linux カーネルを完成させているのは常に GNU プロジェクトの開発したソフトウェアであるという点を言い損なっています。Dr. Richard Stallman は GNU プロジェクトの創始者であり、GNU プロジェクトによってなされた重要な貢献と自分たちが築いた自由の原則をよりよく認識するために「GNU/Linux」という表現が系統的につかわれる事を求めています。
pl_pl: Linuks, jak już wiesz, to tylko jądro. Wyrażenia, "dystrybucja Linuksa" i "system Linuksowy", są z tego powodu nieprawidłowe. Są to, w rzeczywistości, dystrybucje lub systemy <emphasis>bazujące na</emphasis> Linuksie. Wyrażenia te nie wspominają o oprogramowaniu, które zawsze dopełnia jądro, wśród których są programy stworzone w ramach Projektu GNU. Dr. Richard Stallman, twórca tego projektu, nalega, aby wyrażenie "GNU/Linux" było systematycznie używane, w celu większego uznania dla ważnego wkładu ze strony Projektu GNU i zasad wolności, na których jest oparty.
pt_br: Linux, como você já deve saber, é somente um kernel. A expressão, "distribuição Linux" e "sistema Linux" é, portanto, incorreta: elas são, em realidade, distribuições ou sistemas <emphasis>baseadas no</emphasis> Linux. Estas expressões falham ao não mencionar os programas que sempre completam este kernel, entre eles os programas desenvolvidos pelo Projeto GNU. Dr. Richard Stallman, fundador deste projeto, insiste que a expressão "GNU/Linux" seja sistematicamente usada, de maneira a melhor reconhecer a importância das contribuições feitas pelo projeto GNU e seus princípios de liberdade nos quais foram fundados.
ro_ro: Linux, după cum știi deja, este doar un nucleu. Expresiile „distribuție de Linux” și „sistem Linux” sunt, de aceea, incorecte: sunt, în realitate, distribuții sau sisteme <emphasis>bazate pe</emphasis> Linux. Aceste expresii nu menționează programele care întotdeauna completează acest nucleu, printre care sunt programele dezvoltate de proiectul GNU. Dr. Richard Stallman, fondatorul acestui proiect, cere ca expresia „GNU/Linux” să fie folosită sistematic, ca să fie recunoscute mai bine contribuțiile importante făcute de proiectul GNU și principiile de libertate pe care acestea sunt bazate.

source: Debian has chosen to follow this recommendation, and, thus, name its distributions accordingly (thus, the latest stable release is Debian GNU/Linux 6.0).
de_de: Debian hat sich entschieden, dieser Empfehlung zu folgen, und so wird die Distributionen entsprechend benannt(daher lautet die aktuelle stabile Version Debian GNU/Linux 6.0).
it_it: Debian ha scelto di seguire questa raccomandazione e, perciò, chiama le proprie distribuzioni di conseguenza (perciò l'ultimo rilascio stabile è Debian GNU/Linux 6.0).
pl_pl: Debian wybrał przestrzeganie tego zalecenia i stosownie do tego nazywa swoje dystrybucje (stąd, ostatnie stabilne wydanie to Debian GNU/Linux 6.0).
pt_br: O Debian escolheu seguir essa recomendação, e, portanto, nomeou sua distribuição adequadamente (portando, o último lançamento estável é o Debian GNU/Linux 6.0).
ro_ro: Debian a ales să urmeze această recomandare și de aceea, își numește distribuțiile în consecință (astfel, ultima versiune stabilă este Debian GNU/Linux 6.0).

source: Several factors have dictated this choice. The system administrator, who was familiar with this distribution, ensured it was listed among the candidates for the computer system overhaul. Difficult economic conditions and ferocious competition have limited the budget for this operation, despite its critical importance for the future of the company. This is why Open Source solutions were swiftly chosen: several recent studies indicate they are less expensive than proprietary solutions, despite quality of service that is equal or better, so long as personnel qualified to run them are available.
de_de: Mehrere Faktoren haben diese Wahl bestimmt. Der Systemadministrator, der die Distribution kannte, sorgte dafür, dass sie als Kandidat für die EDV-Auswahl aufgenommen wurde. Schwierige wirtschaftliche Bedingungen und wilder Wettbewerb haben das Budget für diese Operation trotz ihrer kritischen Bedeutung für die Zukunft des Unternehmens eingeschränkt. Aus diesem Grunde wurde kurzerhand eine Open-Source-Lösung gewählt: Mehrere neuere Studien zeigen, dass sie günstiger als proprietäre Lösungen sind, während die Qualität der Dienstleistung gleich oder besser ist, solange qualifiziertes Personal zur Verfügung steht.
it_it: Diversi fattori hanno indicato questa scelta. L'amministratore di sistema, che aveva dimestichezza con questa distribuzione, si è assicurato che fosse elencata tra i candidati per la revisione del sistema informatico. Le difficili condizioni economiche e la feroce competizione hanno limitato il budget per questa operazione, nonostante l'importanza critica per il futuro dell'azienda. Questo è il motivo per cui le soluzioni Open Source sono state scelte velocemente: diversi studi recenti indicano che sono meno costose delle soluzioni proprietarie, nonostante una qualità del servizio uguale o migliore, se è disponibile del personale qualificato per gestirle.
pl_pl: Kilka czynników podyktowało taki wybór. Administrator systemu, który był obeznany z tą dystrybucją, upewnił się, że jest ona wpisana na listę wśród kandydatów do restrukturyzacji systemu komputerowego. Ciężkie warunki ekonomiczne i sroga konkurencja ograniczyły budżet tej operacji, mimo jej krytycznego znaczenia dla przyszłości firmy. Właśnie dlatego zostały szybko wybrane rozwiązania Open Source: kilka ostatnich badań wykazało, że są one tańsze niż rozwiązania własnościowe, mimo porównywalnej lub wyższej jakości usług, tak długo, jak dostępna jest wykwalifikowana kadra do ich utrzymania.
pt_br: Diversos fatores ditaram essa escolha. O administrador do sistema, que possui familiaridade com a distribuição, assegurou que a mesma estaria listada como candidata na revisão do sistema de computadores. Dificuldades econômicas e competição feroz tem limitado o orçamento para esta operação, apesar da sua importância crítica para o futuro da empresa. Este é o motivo ao qual soluções Open Source (Código Aberto) foram rapidamente escolhidas: diversos estudos recentes indicam que estes são menos caros do que as soluções proprietárias e com relação a qualidade do serviço é igual ou melhor, desde que pessoal qualificadas para operá-los estejam disponíveis.
ro_ro: Mai mulți factori au condus la această alegere. Administratorul de sistem, care era familiar cu această distribuție, s-a asigurat că aceasta a fost trecută pe lista de candidați pentru refacerea sistemului informatic. Condițiile economice dificile și competiția acerbă au limitat bugetul acestei operațiuni, deși este de o importanță critică pentru viitorul firmei. De aceea soluțiile bazate pe Programe Libere au fost alese fără a sta prea mult pe gânduri: mai multe studii recente arată că sunt mai ieftine decât soluțiile proprietărești, în ciuda calității serviciilor care este egală sau mai bună, atâta timp cât personalul calificat este disponibil să răspundă cererilor.

source: <emphasis>IN PRACTICE</emphasis> Total cost of ownership (TCO)
de_de: <emphasis>IN DER PRAXIS</emphasis> Total cost of ownership (TCO)
it_it: <emphasis>IN PRATICA</emphasis> Total cost of ownership (TCO)
ja_jp: <emphasis>IN PRACTICE</emphasis> 総保有コスト (TCO)
pl_pl: <emphasis>W PRAKTYCE</emphasis> Total cost of ownership (TCO)
pt_br: <emphasis>NA PRÁTICA</emphasis> Custo total da posse (TCO - Total cost of ownership)
ro_ro: <emphasis>ÎN PRACTICĂ</emphasis> Costul total de proprietate (CTP)

source: <primary>Total Cost of Ownership</primary>
ja_jp: <primary>総保有コスト</primary>
pt_br: <primary>Custo Total da Posse</primary>
ro_ro: <primary>Costul total de proprietate</primary>

source: The Total Cost of Ownership is the total of all money expended for the possession or acquisition of an item, in this case referring to the operating system. This price includes any possible license fee, costs for training personnel to work with the new software, replacement of machines that are too slow, additional repairs, etc. Everything arising directly from the initial choice is taken into account.
it_it: Il Total Cost of Ownership è il totale di tutto il denaro speso per il possesso o l'acquisizione di un oggetto, in questo caso con riferimento al sistema operativo. Questo prezzo comprende ogni possibile costo di licenza, costi per addestrare il personale a lavorare col nuovo software, sostituire macchine che sono troppo lente, eseguire riparazioni aggiuntive, ecc. Ogni cosa che deriva direttamente dalla scelta iniziale è tenuta in conto.
ja_jp: 総保有コストとは、あるモノ (今回の場合はオペレーティングシステムに関連するモノ) の所有および取得にかかる費用の総合計です。この値段には、ライセンス代、新しいソフトウェアで仕事する個人の訓練代、性能が低いマシンの交換代、追加の修理代などが含まれています。最初の選択から直接的に決まるすべてを考慮します。
pl_pl: Total Cost of Ownership to całkowity koszt posiadania lub pozyskania aktywów, w tym przypadku odnoszący się do systemu operacyjnego. Dana cena obejmuje wszelkie możliwe opłaty licencyjne, koszty szkoleń pracowników do pracy z nowym oprogramowaniem, wymianę maszyn, które są zbyt wolne, dodatkowe naprawy, itd. Uwzględnione jest wszystko wynikające bezpośrednio z początkowego wyboru.
pt_br: O Custo Total da Posse (TCO) é o total de dinheiro gasto com a posse ou aquisição de um item, neste caso referindo-se ao sistema operacional. Este preço incluí qualquer custo de licença, custo de treinamento de pessoas para trabalhar com o novo programa, a substituição das máquinas que são muito lentas, reparos adicionais, etc. Tudo decorrente diretamente da escolha inicial é levado em consideração.

source: This TCO, which varies according to the criteria chosen in the assessment thereof, is rarely significant, in itself. However, it is very interesting to compare the TCO calculated according to the same rules. This assessment table is, thus, of paramount importance, and it is easy to manipulate it in order to draw a predefined conclusion. Thus, the TCO for a single machine doesn't make sense, since the cost of an administrator is also reflected in the total number of machines they manage, a number which obviously depends on the operating system and tools proposed.
it_it: Questo TCO, che varia secondo il criterio scelto per la valutazione dello stesso, è raramente significativo da solo. Comunque, è molto interessante confrontare i TCO calcolati secondo le stesse regole. Questa tabella di valutazione è, perciò, di fondamentale importanza ed è facile manipolarla al fine di trarre una conclusione preordinata. Perciò, il TCO per una singola macchina non ha senso, dal momento che il costo di un amministratore si riflette anche nel numero di macchine che gestisce, un numero che ovviamente dipende dal sistema operativo e dagli strumenti proposti.
pl_pl: TCO, które zmienia się w zależności od wybranych kryteriów oceny jest, samo w sobie, mało znaczące. Jednakże bardzo interesujące jest porównanie TCO obliczonych według tych samych zasad. Ta tablica ocen jest przez to nadrzędnie ważna i bardzo łatwo zmanipulować ją w celu wyciągnięcia wcześniej ustalonych wniosków. Stąd TCO dla pojedynczej maszyny nie ma sensu, ponieważ koszt administratora jest odzwierciedleniem całkowitej liczby maszyn, którymi zarządza, liczby, która ewidentnie zależy od systemu operacyjnego i zaproponowanych narzędzi.
pt_br: Este TCO, o qual varia de acordo com o critérios escolhidos na avaliação da mesma, é raramente significativo, em si. Contudo, é muito interessante comparar o TCO calculado de acordo com as mesmas regras. Este quadro de avaliação, portanto, é de suprema importância, e é fácil de manipular em ordem para desenhar uma conclusão predefinida. Portanto, o TCO para uma única máquina não faz sentido, desde que o custo do administrador também é refletido no número total de máquina que ele administra, um número que obviamente depende do sistema operacional e das ferramentas propostas.
ro_ro: Acest CTP, care variază în funcție de criteriile alese în această evaluare, este rareori important în sine. Totuși, este interesant să comparăm CTP-ul calculat în funcție de aceleași reguli. Acest tabel de evaluare este, astfel, de o importanță uriașă și este ușor să-l manipulezi ca să obții o concluzie predefinită. Astfel, să calculezi CTP-ul pentru o singură mașină de calcul nu are sens, când costul unui administrator se reflectă în numărul total de mașini pe care le administrează, un număr care depinde, în mod evident, de sistemul de operare și de uneltele propuse.

source: Among free operating systems, the IT department looked at the free BSD systems (OpenBSD, FreeBSD, and NetBSD), GNU Hurd, and Linux distributions. GNU Hurd, which has not yet released a stable version, was immediately rejected. The choice is simpler between BSD and Linux. The former have many merits, especially on servers. Pragmatism indicates, however, the choice of a Linux system since, its installed base and popularity are both very significant and have numerous positive consequences. Consequent to this popularity, it is easier to find qualified personnel to administer Linux machines than technicians experienced with BSD. Furthermore, Linux adapts to newer hardware faster than BSD (although they are often neck and neck in this race). Finally, Linux distributions are often more adapted to user-friendly graphical user interfaces, indispensable for beginners during migration of all office machines to a new system.
de_de: Unter den freien Betriebssystemen untersuchte die IT-Abteilung die Free-BSD Systeme (OpenBSD, FreeBSD und NetBSD), GNU Hurd sowie Linux-Distributionen. GNU Hurd, das bisher noch keine stabile Version veröffentlicht hat, wurde sofort wieder verworfen. Die Wahl zwischen BSD und Linux war einfacher. Die erstgenannten haben viele Vorteile, speziell auf Servern. Pragmatisch gesehen ist die Wahl eines Linux-Systems jedoch sinnvoller, da sowohl die breite Installationsbasis als auch der Bekanntheitsgrad sehr signifikant sind und diese Systeme auch einige positive Nebeneffekte haben. Darüber hinaus ist es aufgrund der Verbreitung leichter, qualifiziertes Personal für Linux-Systeme zu finden, als Techniker, die sich auf BSD spezialisiert haben. Außerdem wird Linux schneller an neue Hardware angepasst als BSD (obwohl hier ein Kopf-an-Kopf-Rennen stattfindet). Und nicht zuletzt werden Linux-Distributionen häufiger mit benutzerfreundlichen grafischen Oberflächen ausgestattet, die für Anfänger während der Umstellung aller Bürorechner auf ein neues System unabdingbar sind.
it_it: Tra i sistemi operativi gratuiti, il dipartimento IT ha esaminato i sistemi BSD gratuiti (OpenBSD, FreeBSD, e NetBSD), GNU Hurd, e le distribuzioni Linux. GNU Hurd, che non ha ancora rilasciato una versione stabile è stato immediatamente scartato. La scelta è più semplice tra BSD e Linux. Il primo ha molti meriti, specialmente sui server. Il pragmatismo però ha indicato la scelta di un sistema Linux dal momento che sia la sua base installata che la sua popolarità sono molto significative e hanno numerose conseguenze positive. Grazie a questa popolarità, è più facile trovare personale qualificato per amministrare macchine Linux che tecnici esperti di BSD. In più, Linux si adatta al nuovo hardware più velocemente di BSD (anche se spesso sono alla pari in questa corsa). Infine, le distribuzioni Linux sono spesso più adattate alle interfacce grafiche amichevoli, indispensabili per i principianti durante la migrazione di tutte le macchine dell'ufficio al nuovo sistema.
pl_pl: Wśród darmowych systemów operacyjnych, dział IT przyjrzał się systemom BSD (OpenBSD, FreeBSD i NetBSD), GNU Hurd i dystrybucjom Linuksa. GNU Hurd, który nie posiada jeszcze stabilnej wersji, został natychmiast odrzucony. Pomiędzy BSD i Linuksem wybór jest prostszy. Pierwszy posiada wiele zalet, szczególnie w zastosowaniach serwerowych. Pragmatyzm wskazuje jednak wybór systemu Linuksowego, ponieważ jego baza instalacyjna i popularność są bardzo istotne i mają wiele pozytywnych następstw. Zaletą popularności jest większa łatwość znalezienia wykwalifikowanej kadry do administracji maszynami Linuksowymi, niż doświadczonych techników BSD. Ponadto Linuks szybciej przystosowuje się na nowy sprzęt niż BSD (chociaż często są łeb w łeb w tym wyścigu). Wreszcie, dystrybucje Linuksa są często bardziej przystosowane do przyjaznego użytkownikowi interfejsu graficznego, niezbędnego dla początkujących podczas migracji wszystkich maszyn biurowych na nowy system.
pt_br: Entre os sistemas operacionais livres, o departamento de TI olhou para os sistemas BSD (OpenBSD, FreeBSD, e NetBSD), GNU Hurd, e distribuições Linux. GNU Hurd, o qual não lançou nenhuma versão estável, foi rejeitado imediatamente. A escolha é simplesmente entre BSD e Linux. O primeiro têm muitos méritos, especialmente em servidores. Pragmatismo indica, entretanto, a escolha do sistema Linux já que, que a base instalada e a popularidade são ambos muito significativos e têm inúmeras consequências positivas. Consequente de sua popularidade, é mais fácil encontrar pessoas qualificadas para administrar máquinas Linux do que técnicos com experiência em BSD. Além disso, Linux se adapta mais rapidamente a novos hardwares do que os BSD (embora eles frequentemente fiquem pescoço a pescoço nessa corrida). Finalmente, as distribuições Linux são frequentemente mais adaptadas a interfaces gráficas amigáveis, indispensáveis aos novatos durante a migração de todas máquinas do escritório para o novo sistema.
ro_ro: Dintre sistemele de operare libere, departamentul de TI s-a uitat la sistemele libere BSD (OpenBSD, FreeBSD și NetBSD), GNU Hurd și distribuțiile bazate pe Linux. GNU Hurd, care nu a lansat încă o versiune stabilă, a fost imediat respins. Alegerea e mai ușor de făcut între BSD și Linux. Primul are multe calități, în special pe servere. Pragmatismul indică, totuși, alegerea unui sistem bazat pe Linux din moment ce numărul de instalări și popularitatea sunt amândouă criterii foarte importante și au numeroase consecințe pozitive. Ca o urmare a acestei popularități, este mai ușor să găsești personal calificat pentru administrarea mașinilor cu Linux decât tehnicieni experimentați cu BSD. Mai mult, Linux se adaptează la noile dispozitive mai repede decât BSD (deși de multe ori își suflă în ceafă unul altuia în această competiție). În sfârșit, distribuțiile bazate pe Linux sunt deseori mai bine adaptate la interfețele grafice prietenoase cu utilizatorul, indispensabile începătorilor în timpul migrării tuturor calculatoarelor de birou la noul sistem.

source: <emphasis>ALTERNATIVE</emphasis> Debian GNU/kFreeBSD
de_de: <emphasis>ALTERNATIV</emphasis> Debian GNU/kFreeBSD
it_it: <emphasis>ALTERNATIVA</emphasis> Debian GNU/kFreeBSD
pl_pl: <emphasis>ALTERNATYWA</emphasis> Debian GNU/kFreeBSD
pt_br: <emphasis>ALTERNATIVA</emphasis> Debian GNU/kFreeBSD

source: Since Debian <emphasis role="distribution">Squeeze</emphasis>, it is possible to use Debian with a FreeBSD kernel on 32 and 64 bit computers; this is what the architectures, <literal>kfreebsd-i386</literal> and <literal>kfreebsd-amd64</literal> mean. While these architectures are labeled “experimental” (Technology Preview), already 70 to 80% of software packaged by Debian is available for them.
de_de: Seit Debian <emphasis role="distribution">Squeeze</emphasis> ist es möglich, Debian mit einem FreeBSD-Kernel auf 32-bit und 64-bit Rechnern zu nutzen. Das ist die Aufgabe der Architekturen <literal>kfreebsd-i386</literal> und <literal>kfreebsd-amd64</literal>. Obwohl diese Architekturen als "experimentell" oder als "Technology Preview" gekennzeichnet sind, sind bereits 70-80% der Debian-Softwarepakete für sie verfügbar.
it_it: A partire da Debian <emphasis role="distribution">Squeeze</emphasis>, è possibile usare Debian con un kernel FreeBSD su computer a 32 e a 64 bit; questo è il significato delle architetture <literal>kfreebsd-i386</literal> e <literal>kfreebsd-amd64</literal>. Sebbene queste architetture siano etichettate “sperimentali” (Technology Preview), tra il 70 e l'80% del software pacchettizzato da Debian è già disponibile per esse.
pl_pl: Od Debiana <emphasis role="distribution">Squeeze</emphasis> możliwe jest używanie Debiana w jądrem FreeBSD na komputerach 32 i 64 bitowych. architektury te są oznaczone jako <literal>kfreebsd-i386</literal> i <literal>kfreebsd-amd64</literal>. Podczas, gdy są one oznaczone jako "eksperymentalne" (Technology Preview), aktualnie od 70 do 80% paczek oprogramowania Debiana jest na nie dostępne.
pt_br: Desde do Debian <emphasis role="distribution">Squeeze</emphasis>, é possível usar o Debian com o kernel do FreeBSD em computadores 32 e 64 bits; isto é o que as arquiteturas, <literal>kfreebsd-i386</literal> e <literal>kfreebsd-amd64</literal> significam. Enquanto estas arquiteturas são marcadas como "experimentais" (Prévia da Tecnologia), já 70 a 80% dos programas empacotados para o Debian estão disponíveis para o mesmo.
ro_ro: Începând cu Debian <emphasis role="distribution">Squeeze</emphasis>, este posibil să folosești Debian cu un nucleu FreeBSD pe calculatoare de 32 sau 64 de biți; asta înseamnă <literal>kfreebsd-i386</literal> și <literal>kfreebsd-amd64</literal>. În timp ce aceste arhitecturi sunt etichetate ca „experimentale” (indicativ tehnic), deja între 70% și 80% din programele împachetate de Debian sunt disponibile și pentru acestea.
