Repository: Neamar/KISS
Catalog: */02_case-study.po
Languages: de_de, it_it, ja_jp, pl_pl, pt_br, ro_ro

source: SMB
pt_br: PME

source: Strong Growth
de_de: starkes Wachstum
it_it: Forte crescita
ja_jp: 安定成長
pl_pl: Szybki Rozwój
pt_br: Forte Crescimento
ro_ro: Creștere rapidă

source: Master Plan
de_de: Gesamtkonzept
it_it: Strategia
ja_jp: 基本計画
pl_pl: Plan Zarządzania
pt_br: Plano Mestre
ro_ro: Strategie

source: Migration
it_it: Migrazione
ja_jp: 移行
pl_pl: Migracja
pt_br: Migração
ro_ro: Migrare

source: Cost Reduction
de_de: Kostenreduzierung
it_it: Riduzione dei costi
ja_jp: コスト削減
pl_pl: Redukcja Kosztów
pt_br: Redução de Custos
ro_ro: Reducerea costurilor

source: Presenting the Case Study
de_de: Vorstellung der Fallstudie
it_it: Presentazione del caso di studio
ja_jp: 事例研究の提示
pl_pl: Przedstawienie Studium Przypadku
pt_br: Apresentando o Caso de Estudo
ro_ro: Prezentarea studiului de caz

source: You are the system administrator of a growing small business. In collaboration with your directors, you come to redefine the information systems master plan for the coming year, and you choose to progressively migrate to Debian for reasons as much practical as economic. Let's see into more detail what's ahead of you...
de_de: Sie sind der Systemadministrator einer kleinen, wachsenden Firma. In Zusammenarbeit mit Ihren Direktoren wollen Sie einen Masterplan für die Informationssysteme für das kommende Jahr neu definieren und aus wirtschaftlichen Erwägungen schrittweise nach Debian migrieren. Lassen Sie uns im Detail sehen, was vor Ihnen liegt...
it_it: Sei l'amministratore di sistema di una piccola impresa in espansione. In collaborazione con i dirigenti, devi giungere a ridefinire la strategia per i sistemi informativi per il prossimo anno e scegli di migrare progressivamente a Debian per ragioni tanto pratiche quanto economiche. Vediamo nei dettagli ciò che ti aspetta...
pl_pl: Jesteś administratorem systemu małej, rozwijającej się firmy. We współpracy z przełożonymi zmieniłeś plan zarządzania systemem informatycznym na nadchodzący rok, wybierając stopniową migrację na Debiana, ze względów zarówno praktycznych i ekonomicznych. Przyjrzyjmy się bardziej szczegółowo co Cię czeka...
pt_br: Você é o administrador de sistemas de um pequeno negócio crescente. Em colaboração com seus diretores, você vem para redefinir o plano mestre de informação para o próximo ano, e você escolheu migrar progressivamente para o Debian por razões tanto práticas quanto econômicas. Vamos olhar com mais detalhes o que espera por você...
ro_ro: Ești administratorul de sistem al unei afaceri mici, dar în creștere. În colaborare cu directorii tăi, ajungi să redefinești strategia privind sistemele informatice pentru anul viitor și alegi să migrezi treptat spre Debian din motive pe cât de practice, pe atât de economice. Hai să vedem în detaliu ce te așteaptă...

source: We have envisioned this case study to approach all modern information system services currently used in a medium sized company. After reading this book, you will have all of the elements necessary to install Debian on your servers and fly on your own wings. You will also learn how to effectively find information in the event of difficulties.
de_de: Wir haben uns diese Fallstudie ausgedacht, um alle modernen Informationsdienste, die derzeit in einem mittelständischen Unternehmen eingesetzt werden, zu betrachten. Nach der Lektüre dieses Buches werden Sie über alle notwendigen Kenntnisse verfügen, um Debian auf Ihren Servern zu installieren und selbstständig weiterzuarbeiten. Sie erfahren auch, wie man im Falle von Schwierigkeiten effektiv Informationen erhält.
it_it: Abbiamo pensato questo caso di studio per avvicinare tutti i moderni servizi per sistemi informativi attualmente usati da una media azienda. Dopo aver letto questo libro, avrai tutti gli elementi necessari per installare Debian sui tuoi server e camminare da solo. Imparerai anche come trovare informazioni efficacemente in caso di difficoltà.
pl_pl: W poniższym studium przypadku staraliśmy się uwzględnić wszystkie usługi nowoczesnych systemów informatycznych używanych w średniej wielkości firmach. Po przeczytaniu tej książki będziesz znał wszelkie elementy wymagane do instalacji Debiana na swoich serwerach i ich późniejszego utrzymania. Nauczysz się również efektywnego znajdywania informacji w przypadku problemów.
pt_br: Nós imaginamos esse estudo de caso que se aproxima a todos os sistemas modernos que atualmente são usados em médias empresas. Após ler este livro, você terá todos os elementos necessários para instalar o Debian nos seus servidores e voar com suas própriasas. Você também aprenderá como buscar informações nos momentos de dificuldades.
ro_ro: Ne-am imaginat acest studiu de caz ca să putem aborda toate serviciile moderne de sistem informatic folosite în mod curent într-o întreprindere mijlocie. După ce termini de citit această carte, vei dispune de toate elementele necesare ca să instalezi sistemul Debian pe serverele tale și să te descurci pe cont propriu. Vei afla și cum să găsești eficient informațiile, dacă întâmpini dificultăți pe parcurs.

source: Fast Growing IT Needs
de_de: Schnell wachsende IT-Bedürfnisse
it_it: Necessità IT in veloce crescita
ja_jp: 急成長する IT の必要性
pl_pl: Szybko Rosnące Potrzeby IT
pt_br: Crescimento Rápidos das Necessidades de TI
ro_ro: Nevoi în TI care cresc repede

source: Falcot Corp is a manufacturer of high quality audio equipment. The company is growing strongly, and has two facilities, one in Saint-Étienne, and another in Pau. The first has around 150 employees; it hosts a factory for the manufacturing of speakers, a design lab, and all administrative office. The Pau site, which is smaller, only has about 50 workers, and produces amplifiers.
de_de: Falcot Corp ist ein Hersteller von hochwertigen Audiogeräten. Das Unternehmen wächst stark und hat zwei Standorte, einen in Saint-Étienne und einen weiteren in Pau. In Saint-Étienne sind rund 150 Mitarbeiter in einer Fabrik für die Herstellung von Lautsprechern, einem Designlabor sowie in der Verwaltung beschäftigt. Am Standort Pau, der kleiner ist, werden mit nur 50 Mitarbeitern Verstärker hergestellt.
it_it: Falcot Corp produce attrezzature audio di alta qualità. L'azienda è in forte crescita e ha due siti produttivi, uno a Saint-Étienne e l'altro a Pau. Il primo ha circa 150 dipendenti, ospita una fabbrica per la produzione di altoparlanti, un laboratorio di progettazione e tutti gli uffici amministrativi. Il sito di Pau, che è più piccolo, ha solo circa 50 lavoratori e produce amplificatori.
pl_pl: Falcot Corp jest producentem wysokiej jakości urządzeń audio. Firma szybko się rozwija i posiada dwa ośrodki, jeden w Saint-Étienne, a drugi w Pau. Pierwszy zatrudnia około 150 pracowników. Jest tam fabryka wytwarzająca głośniki, laboratorium projektowe i wszystkie biura administracji. Ośrodek w Pau, który jest mniejszy, posiada około 50 pracowników i produkuje wzmacniacze.
pt_br: Falcorp é uma fabricante de equipamentos de áudio de alta qualidade. A companhia está crescendo fortemente, e têm duas fábricas, uma em Saint-Étienne, e outra em Pau. A primeira têm por volta de 150 funcionários; e hospeda uma fábrica que produz alto-falantes, um laboratório de design, e todo o escritório administrativo. A fábrica de Pau, que é menor, e somente possui 50 funcionários, e produz amplificadores.
ro_ro: Falcot S.R.L. este un producător de echipamente audio de înaltă calitate. Firma crește repede și are două clădiri, una în Galați și alta în Găești. Prima are în jur de 150 de angajați; aceasta găzduiește o fabrică de difuzoare, un laborator de creație și toate birourile administrative. În clădirea din Găești, care este mai mică, lucrează vreo 50 de muncitori și se produc amplificatori.

source: <emphasis>NOTE</emphasis> Fictional company created for case study
de_de: <emphasis>Hinweis</emphasis> Dies ist nur eine fiktive Firma für die Fallstudie
it_it: <emphasis>NOTA</emphasis> Azienda di fantasia creata per il caso di studio
ja_jp: <emphasis>NOTE</emphasis> 事例研究用に作られた架空の企業
pl_pl: <emphasis>NOTATKA</emphasis> Fikcyjna firma stworzona na potrzeby studium przypadku
pt_br: <emphasis>NOTA</emphasis> Companhia fictícia criada para o estudo de caso
ro_ro: <emphasis>NOTĂ</emphasis> Firmă imaginară, creată pentru studiul de caz

source: The company, Falcot Corp, studied here, is completely fictional. Any resemblance to an existing company is purely coincidental. Likewise, certain example data throughout this book may be fictional.
de_de: Die Firma "Falcot Corp", welche hier betrachtet wird, ist rein fiktiv. Jede Ähnlichkeit mit einer existierenden Firma wäre rein zufällig. Ebenso sind einige der Beispieldaten in diesem Buch rein fiktiv.
it_it: L'azienda studiata qui, Falcot Corp, è interamente di fantasia. Qualsiasi somiglianza con aziende esistenti è solamente una coincidenza. Alla stessa maniera, alcuni dati di esempio in questo libro possono essere di fantasia.
pl_pl: Omawiana firma, Falcot Corp, jest zupełnie fikcyjna. Jakiekolwiek podobieństwo to istniejącej firmy jest zupełnie przypadkowe. Podobnie określone przykładowe dane w tej książce mogą być fikcyjne.
pt_br: A companhia, Falcot Corp, estudada aqui, é completamente fictícia. Qualquer semelhança com uma companhia existente é puramente coincidência. Igualmente, certos exemplos dados neste livro também podem ser fictícios.
ro_ro: Firma Falcot S.R.L. studiată aici este complet imaginară. Orice asemănare cu o firmă existentă este pur întâmplătoare. De asemenea, unele date oferite ca exemplu pe parcursul cărții pot fi imaginare.

source: The computer system has had difficulty keeping up with the company's growth, so they are now determined to completely redefine it to meet various goals established by management:
de_de: Die EDV hatte Mühe mit dem Wachstum der Firma mitzuhalten, und so ist die Geschäftsleitung nun fest entschlossen, diese Abteilung komplett neu zu definieren, um die verschiedenen Ziele zu erreichen, die von der Unternehmensführung vorgegeben wurden:
it_it: Il sistema informatico ha avuto difficoltà a stare al passo con la crescita dell'azienda, per cui ora sono decisi a ridefinirlo completamente per raggiungere i vari obiettivi stabiliti dal management:
ja_jp: 所有しているコンピュータシステムでは会社の成長に合わせて付いていく事が難しいため、管理上の観点から設定された様々な目標を達成するために、コンピュータシステムを完全に再定義する事が今決定されました:
pl_pl: System komputerowy napotkał trudności w nadążeniu za rozwojem firmy, dlatego zdecydowano całkowicie go zmienić, aby osiągnąć różne cele postawione przez zarząd:
pt_br: O sistema de computadores tem tido dificuldades de se manter junto ao crescimento da empresa, então agora eles estão determinados a completamente redefini-lo para se enquadrar nas metas estabelecidas pela gerência:
ro_ro: Sistemul informatic a întâmpinat dificultăți în încercarea de a ține pasul cu creșterea firmei, așă că acum sunt determinați să-l redefinească complet pentru a corespunde diferitelor cerințe stabilite de administrație:

source: modern, easily scalable infrastructure;
de_de: moderne, leicht skalierbare Infrastruktur;
it_it: infrastruttura moderna e facilmente ridimensionabile;
ja_jp: 現代的で、簡単に拡張可能なインフラ;
pl_pl: nowoczesna, łatwo skalowalna infrastruktura;
pt_br: moderna, uma infraestrutura facilmente escalável;
ro_ro: infrastructură modernă și ușor scalabilă;

source: reducing cost of software licenses thanks to use of Open Source software;
de_de: Reduzierung der Kosten für Softwarelizenzen dank Verwendung von Open-Source-Software;
it_it: riduzione del costo delle licenze del software grazie all'uso di software Open Source;
ja_jp: オープンソースソフトウェアを使うことによるソフトウェアライセンスのコスト削減;
pl_pl: obniżenie kosztów licencji dzięki użyciu oprogramowania Open Source;
pt_br: redução de custos de licenças graças ao uso de programas Open Source (Código Aberto);
ro_ro: reducerea costurilor licențelor de programe, datorată folosirii Programelor Libere;

source: installation of an e-commerce website, possibly B2B (business to business, i.e. linking of information systems between different companies, such as a supplier and its clients);
de_de: Installation einer E-Commerce-Website, möglicherweise B2B (business to business, d.h. Verknüpfung von IT-Systemen zwischen verschiedenen Unternehmen, wie zum Beispiel einem Zulieferer und den Abnehmern);
it_it: installazione di un sito web di ecommerce, eventualmente B2B (business to business, cioè che collega sistemi informativi tra aziende diverse, come un fornitore e i suoi clienti);
ja_jp: 電子商取引ウェブサイトの設置、可能な限り B2B (企業間取引、言い換えると、生産者と客など異なる企業間で情報システムをつなぎ合わせること);
pl_pl: instalacja witryny e-commerce, być może B2B (ang. Business To Business, np.: łączenie systemów informatycznych pomiędzy różnymi firmami, takimi jak dostawca i jego klienci);
pt_br: instalação de um comercio eletrônico, possivelmente B2B (negócio para negócio, i.e. conectando sistemas de informação entre diferentes empresas, como fornecedores e seus clientes);
ro_ro: instalarea unui sit de comerț electronic, posibil unul care face legătura dintre firme diferite, ca de exemplu dintre furnizor și clienți săi;

source: significant improvement in security to better protect industrial secrets related to new products.
de_de: signifikante Verbesserung der Sicherheit zum besseren Schutz der Betriebsgeheimnisse im Zusammenhang mit neuen Produkten.
it_it: significativo miglioramento della sicurezza per proteggere meglio i segreti industriali relativi ai nuovi prodotti.
pl_pl: znacząco poprawione bezpieczeństwo, aby lepiej chronić tajemnice przemysłowe związane z nowymi produktami.
pt_br: melhoria significativa na segurança para melhor proteger segredos industriais relacionados a seus novos produtos.
ro_ro: îmbunătățiri semnificative pe partea de securitate, pentru a proteja secretele industriale legate de noile produse.

source: Underlying these goals, the entire information system will be overhauled.
de_de: Aufgrund dieser Ziele wird das gesamte Informationssystem überarbeitet.
it_it: Sulle basi di questi obiettivi, l'intero sistema informativo sarà rivisto.
pl_pl: Podlegając tym celom, cały system informatyczny zostanie zrestrukturyzowany.
pt_br: Ressaltando esse objetivos, todo o sistema de informação deve ser reformulado.
ro_ro: Respectând aceste cerințe, întregul sistem informatic va fi refăcut.

source: <primary>master plan</primary>
de_de: <primary>Gesamtkonzept</primary>
it_it: <primary>strategia</primary>
ja_jp: <primary>基本計画</primary>
pl_pl: <primary>plan zarządzania</primary>
pt_br: <primary>plano mestre</primary>
ro_ro: <primary>strategie</primary>

source: <primary>migration</primary>
de_de: <primary>Die Migration</primary>
it_it: <primary>migrazione</primary>
ja_jp: <primary>移行</primary>
pl_pl: <primary>migracja</primary>
pt_br: <primary>migração</primary>
ro_ro: <primary>migrare</primary>

source: With your collaboration, IT management has conducted a slightly more extensive study, identifying some constraints and defining a plan for migration to the chosen Open Source system, Debian.
de_de: Mit Ihrer Hilfe hat das IT-Management eine recht umfangreiche Studie durchgeführt, in der einige Sachzwänge identifiziert wurden und ein Plan zur Migration auf das gewählte Open-Source-System Debian erstellt wurde.
it_it: Con la tua collaborazione, il management IT ha condotto uno studio leggermente più esteso, identificando alcuni vincoli e definendo un piano di migrazione al sistema Open Source scelto, Debian.
ja_jp: あなたの協力によって、IT 管理課は若干広めの範囲に対して調査を行い、いくつかの制限事項を確認して、オープンソースシステム Debian への移行計画を定義しました。
pl_pl: Przy Twojej współpracy zarząd IT przeprowadził bardziej obszerne badania, ukazujące pewne ograniczenia i definiujące plan migracji na wybrany system Open Source, Debiana.
pt_br: Com a sua colaboração, a gerência de TI conduziu um estudo ligeiramente mais intenso, identificando algumas restrições e definindo um plano de migração para o sistema Open Source (Código Aberto) escolhido, Debian.
ro_ro: Colaborând cu tine, conducerea departamentului de TI a condus un studiu puțin mai amplu, identificând câteva constrângeri și definind un plan pentru migrarea la sistemul liber ales, Debian.

source: A significant constraint identified is that the accounting department uses specific software, which only runs on <trademark>Microsoft Windows</trademark>. The laboratory, for its part, uses computer aided design software that runs on <trademark>MacOS X</trademark>.
de_de: Als signifikante Einschränkung wurde eine Buchhaltungssoftware identifiziert, die nur unter <trademark>Microsoft Windows</trademark> läuft. Das Labor hingegen nutzt eine CAD-Software, die nur auf <trademark> MacOS X </trademark> läuft.
it_it: Un vincolo significativo identificato è che la contabilità usa software specifico che gira solo su <trademark>Microsoft Windows</trademark>. Il laboratorio, da parte sua, usa software CAD che gira su <trademark>MacOS X</trademark>.
ja_jp: 確認された重大な制限事項として以下の点が挙げられます。管理課では特注のソフトウェアを使っており、これは <trademark>Microsoft Windows</trademark> 以外では動きません。研究所ではコンピュータを使った設計ソフトウェア (CAD) を使っており、これは<trademark>MacOS X</trademark> で動いています。
pl_pl: Znaczącym ograniczeniem jest to, że dział księgowy używa specyficznego oprogramowania, które działa tylko na <trademark>Microsoft Windows</trademark>. Natomiast laboratorium używa oprogramowania do projektowania wspomaganego komputerowo, które działa na <trademark>MacOS X</trademark>.
pt_br: Uma restrição significativa identificada é o departamento de contas que usa um software específico, que somente funcionada no <trademark>Microsoft Windows</trademark>. O laboratório, por sua vez, usa um programa para desenho que somente funciona no <trademark>MacOS X</trademark>.
ro_ro: O constrângere importantă identificată este că departamentul de contabilitate folosește programe de specialitate, care rulează doar pe <trademark>Microsoft Windows</trademark>. Laboratorul, pe partea lui, folosește programe de grafică asistată de calculator care rulează pe <trademark>MacOS X</trademark>.

source: Overview of the Falcot Corp network
de_de: Übersicht über das Falcot Corp Netzwerk
it_it: Panoramica della rete della Falcot Corp
ja_jp: Falcot Corp ネットワークの概要
pl_pl: Przegląd sieci Falcot Corp
pt_br: Visão global da rede da Falcot Corp
ro_ro: Privire de ansamblu asupra rețelei firmei Falcot S.R.L.

source: The switch to Debian will be gradual; a small business, with limited means, can not change everything overnight. For starters, the IT staff must be trained in Debian administration. The servers will then be converted, starting with the network infrastructure (routers, firewalls, etc.) followed by the user services (file sharing, Web, SMTP, etc.). Then the office computers will be gradually migrated to Debian, for each department to be trained (internally) during the deployment of the new system.
de_de: Der Umstieg auf Debian wird schrittweise erfolgen; ein kleines Unternehmen mit begrenzten Mitteln kann nicht alles über Nacht ändern. Zunächst einmal müssen die IT-Mitarbeiter in die Administration mit Debian geschult werden. Dann werden zuerst die Netzwerk-Infrastruktur-Server (Router, Firewalls, usw.) und anschließend die Anwenderdienste (File-Sharing, Web, SMTP, usw.) umgesetzt. Nach und nach werden dann die Bürocomputer auf Debian migriert und jede Abteilung wird während des Ausrollens der Systeme auf Debian (intern) geschult.
it_it: Il passaggio a Debian sarà graduale; una piccola impresa, con mezzi limitati, non può cambiare tutto da un giorno all'altro. Per iniziare lo staff IT deve essere addestrato all'amministrazione di Debian. Poi i server saranno convertiti, iniziando con l'infrastruttura di rete (router, firewall, ecc.) proseguendo coi servizi agli utenti (condivisione dei file, web, SMTP, ecc.). Poi i computer degli uffici saranno gradualmente migrati a Debian, affinché ogni dipartimento sia addestrato (internamente) durante l'installazione del nuovo sistema.
pl_pl: Przejście na Debiana będzie stopniowe. Mała firma, o ograniczonych środkach, nie zdoła zmienić wszystkiego w ciągu nocy. Na początku trzeba przeszkolić zespół IT w administracji Debianem. Wtedy zostaną zamienione serwery, zaczynając od infrastruktury sieciowej (routery, zapory sieciowe, itd.) następnie usługi użytkownika (udostępnianie plików, Web, SMTP, itd.). Dopiero wtedy komputery biurowe będą stopniowo migrowane na Debiana, w każdym oddziale przeprowadzając szkolenia (wewnętrzne) podczas wprowadzania nowego systemu.
pt_br: A mudança para o Debian será gradual; um negócio pequeno, com meios limitados, não pode mudar tudo do dia para a noite. Para começar, o pessoal de TI precisa ser treinado em administração do Debian. Os servidores precisam ser convertidos, começando pela infraestrutura (roteadores, firewall, etc.) seguidos pelos serviços ao usuário (compartilhamento de arquivos, Internet, SMTP, etc.). Então os computadores do escritório serão gradualmente migrados para Debian, para cada departamento ser treinado (internamente) durante o desenvolvimento do novo sistema.
ro_ro: Trecerea la Debian va fi treptată; o afacere mică, cu mijloace limitate, nu poate să schimbe totul peste noapte. Pentru început, echipa de TI trebuie să fie instruită în administrarea de Debian. Serverele vor fi transformate, începând cu infrastructura rețelei (rutere, firewalls etc.) urmată de serviciile pentru utilizatori (file sahring, Web, SMTP etc.). Apoi calculatoarele de birou vor fi trecute pe rând pe Debian, pentru fiecare departament care va fi instruit (intern) în timpul dispunerii noului sistem.

source: Why a GNU/Linux Distribution?
de_de: Warum eine GNU/Linux-Distribution?
it_it: Perché una distribuzione GNU/Linux?
ja_jp: GNU/Linux ディストリビューションを選ぶ理由とは?
pl_pl: Dlaczego Dystrybucja GNU/Linux?
pt_br: Por que uma Distribuição GNU/Linux?
ro_ro: De ce o distribuție de GNU/Linux?

source: <emphasis>BACK TO BASICS</emphasis> Linux or GNU/Linux?
de_de: <emphasis>Rückblick auf die Grundlagen</emphasis> Linux oder GNU/Linux?
it_it: <emphasis>TORNANDO ALLE BASI</emphasis> Linux or GNU/Linux?
ja_jp: <emphasis>BACK TO BASICS</emphasis> Linux それとも GNU/Linux?
pl_pl: <emphasis>WRACAJĄC DO PODSTAW</emphasis> Linuks, czy GNU/Linux?
pt_br: <emphasis>Volta ao Básico</emphasis> Linux ou GNU/Linux?
ro_ro: <emphasis>ÎNAPOI LA NOȚIUNILE DE BAZĂ</emphasis> Linux sau GNU/Linux?
