Repository: Neamar/KISS
Catalog: */03_existing-setup.po
Languages: it_it, ja_jp, pl_pl

source: Existing Setup
it_it: Impostazioni esistenti
ja_jp: 既存環境
pl_pl: Istniejące Ustawienie

source: Reuse
it_it: Riuso
ja_jp: 再利用
pl_pl: Użyj ponownie

source: Migration
it_it: Migrazione
ja_jp: 移行
pl_pl: Migracja

source: Analyzing the Existing Setup and Migrating
it_it: Analisi delle impostazioni esistenti e migrazione
ja_jp: 既存環境の解析と移行
pl_pl: Analizowanie istniejących Ustawień i Migracji

source: Any computer system overhaul should take the existing system into account. This allows reuse of available resources as much as possible and guarantees interoperability of the various elements comprising the system. This study will introduce a generic framework to follow in any migration of a computing infrastructure to Linux.
it_it: Qualsiasi revisione di un sistema di computer deve tenere in conto il sistema esistente. Ciò permette di riutilizzare il più possibile tutte le risorse disponibili e garantisce l'interoperabilità dei vari elementi che compongono il sistema. Questo studio presenterà uno schema generico da seguire in qualsiasi migrazione di una infrastruttura di calcolo verso Linux.
ja_jp: コンピュータシステムの総入れ替える際には既存のシステムを考慮に入れるべきです。これにより、可能な限り多くの利用可能な資源を再利用すること、システムを形作るさまざまな要素の相互運用性を保証することができます。この調査では、コンピュータインフラを Linux に移行する際に従うべき一般的な枠組みを紹介します。
pl_pl: Jakakolwiek reorganizacja systemu komputerowego powinna brać pod uwagę istniejący system. To pozwala na ponowne użycie dostępnych środków tak często jak to możliwe i i gwarantuje kooperację różnych elementów zawierających się w systemie. Ta koncepcja przedstawi standardową strukturę która nastąpi w jakiejś migracji infrastruktury obliczeniowej Linuxa.

source: Coexistence in Heterogeneous Environments
it_it: Coesistenza in ambienti eterogenei
ja_jp: 異機種環境の存在
pl_pl: Współistnienie heterognicznych środowisk

source: <primary>environment</primary><secondary>heterogeneous environment</secondary>
it_it: <primary>ambiente</primary><secondary>ambiente eterogeneo</secondary>
ja_jp: <primary>環境</primary><secondary>異機種環境</secondary>
pl_pl: <primary>środowisko</primary><secondary>heterogeniczne środowisko</secondary>

source: Debian integrates very well in all types of existing environments and plays well with any other operating system. This near-perfect harmony comes from market pressure which demands that software publishers develop programs that follow standards. Compliance with standards allow administrators to switch out programs: clients or servers, whether free or not.
it_it: Debian si integra molto bene in tutti i tipi di ambienti esistenti e si comporta bene con qualsiasi altro sistema operativo. Questa armonia quasi perfetta deriva dalla pressione di mercato che richiede che chi pubblica software sviluppi programmi che seguono gli standard. La conformità con gli standard permette di sostituire i programmi: client o server, gratuiti o meno.

source: Integration with Windows Machines
it_it: Integrazione con macchine Windows
ja_jp: Windows マシンとの統合
pl_pl: Integracja z maszynami Windows'a

source: Samba's SMB/CIFS support ensures excellent communication within a Windows context. It shares files and print queues to Windows clients and includes software that allow a Linux machine to use resources available on Windows servers.
it_it: Il supporto a SMB/CIFS di Samba assicura un'eccellente comunicazione all'interno di un contesto Windows. Condivide file e code di stampa con client Windows e include software che permette a una macchina Linux di usare risorse disponibili su dei server Windows.
ja_jp: Samba の SMB/CIFS サポートは Windows の枠組みの中で優れた通信を行うことを保証します。Samba はファイルと印刷キューを Windows クライアントと共有し、Linux マシンが Windows サーバで利用可能な資源を使えるようにするためのソフトウェア備えています。
pl_pl: Protokół SMB/CIFS Samby zapewnia wsparcie znakomitej komunikacji w kontekście Windows'a. Dzieli pliki i kolejki wydruku z klientem Windows'a i zawiera oprogramowanie które pozwala Linuxowi używania dostępnych zasobów na serwerach Windows'a.

source: <emphasis>TOOL</emphasis> Samba
it_it: <emphasis>STRUMENTO</emphasis> Samba
pl_pl: <emphasis>NARZĘDZIE</emphasis> Samba

source: Samba version 2 behaves like a Windows NT server (authentication, files, print queues, downloading printer drivers, DFS, etc.) Version 3 works with Active Directory, brings interoperability with NT4 domain controllers, and supports RPCs (Remote Procedure Calls). Version 4 is a rewrite (still experimental), the purpose of which is to provide functionality of a domain controller compatible with Active Directory.
it_it: La versione 2 di Samba si comporta come un server Windows NT (autenticazione, file, code di stampa, scaricamento dei driver per le stampanti, DFS, ecc.). La versione 3 funziona con Active Directory, introduce l'interoperabilità con controllori di dominio NT4 e supporta RPC (Remote Procedure Calls). La versione 4 è una riscrittura (ancora sperimentale), il cui scopo è di fornire funzionalità di controllore di dominio compatibile con Active Directory.

source: Integration with Mac OS machines
it_it: Integrazione con macchine Mac OS
ja_jp: Mac OS マシンとの統合
pl_pl: Integracja z maszynami Mac OS

source: Netatalk is a program which uses the Appletalk protocol (running on a Linux kernel) and allows Debian to interface with a Mac OS network. It ensures the operation of the file server and print queues, as well as time server (clock synchronization). Its router function allows interconnection with Appletalk networks.
it_it: Netatalk è un programma che usa il protocollo Appletalk (in esecuzione su un kernel Linux) e permette a Debian di interfacciarsi con una rete Mac OS. Assicura l'operatività sia del server dei file e delle code di stampa che del server dell'ora (sincronizzazione degli orologi). Le sue funzioni di router permettono l'interconnessione con reti Appletalk.

source: Integration with Other Linux/Unix Machines
it_it: Integrazione con altre macchine Linux/Unix
ja_jp: 他の Linux/Unix マシンとの統合
pl_pl: Integracja z innymi maszyn Linux / Unix

source: Finally, NFS and NIS, both included, guarantee interaction with Unix systems. NFS ensures file server functionality, while NIS creates user directories. The BSD printing layer, used by most Unix systems, also allows sharing of print queues.
it_it: Infine, NFS e NIS, entrambi inclusi, garantiscono l'interazione con sistemi Unix. NFS assicura la funzionalità di server dei file, mentre NIS crea le directory degli utenti. Il livello di stampa BSD, usato dalla maggior parte di sistemi Unix, permette anche la condivisione delle code di stampa.
ja_jp: 最後に、NFS と NIS によって Unix システムとのやり取りが可能になります。NFS はファイルサーバ機能を提供し、NIS はユーザディレクトリを作成します。多くの Unix システムで使われている BSD 印刷レイヤによって、印刷キューを共有することができます。
pl_pl: Wreszcie, NFS i NIS, obydwa załączone , gwarantujją interakcję z systemem Unix. NFS zapewnia funkcjonalność plików serwera, w momencie kiedy NIS tworzy katalogi użytkowników. Warstwa drukowania BSD, używana przez większość systemów unixowych, umożliwia również dzielenie się kolejek wydruku.

source: Coexistence of Debian with MacOS, Windows and Unix systems
it_it: Coesistenza di Debian con sistemi MacOS, Windows e Unix
ja_jp: Debian、MacOS、Windows、Unix システムの共存
pl_pl: Współistnienie Debiana z systemami MacOS, Windowsem i Unixem.

source: How To Migrate
it_it: Come migrare
ja_jp: 移行の方法
pl_pl: Jak migrować

source: <primary>migration</primary>
it_it: <primary>migrazione</primary>
ja_jp: <primary>移行</primary>
pl_pl: <primary>migracja</primary>

source: In order to guarantee continuity of the services, each computer migration must be planned and executed according to the plan. Whatever the operating system used, this principle never changes.
it_it: Al fine di garantire la continuità dei servizi, ogni migrazione di computer deve essere pianificata ed eseguita secondo il piano. Qualunque sia il sistema operativo usato, questo principio non cambia mai.

source: Survey and Identify Services
it_it: Rilevamento e identificazione dei servizi
ja_jp: サービスの調査と確認
pl_pl: Ankieta i identyfikacje usług

source: As simple as it seems, this step is essential. A serious administrator truly knows the principal roles of each server, but such roles can change, and sometimes experienced users may have installed “wild” services. Knowing that they exist will at least allow you to decide what to do with them, rather than delete them haphazardly.
it_it: Per quanto sembri semplice, questo passo è essenziale. Un amministratore scrupoloso conosce veramente i ruoli principali di ogni server, ma tali ruoli possono cambiare e talvolta utenti esperti possono aver installato servizi non “autorizzati”. Sapere che esistono permette almeno di decidere cosa farne, piuttosto che eliminarli inconsapevolmente.
ja_jp: 簡単そうに見えるかもしれませんが、この手順は絶対不可欠です。真面目な管理者はそれぞれのサーバの主たる役割をよく理解していますが、その役割が変わる可能性もありますし、経験豊かなユーザが「変わった」サービスをインストールしていたかもしれません。そのようなサービスが存在するとわかれば、少なくともこのようなサービスを場当たり的に削除するのではなく、どのように扱うか決めることができます。
pl_pl: Tak proste, jak się wydaje, ten krok jest niezbędny. Dobry administrator zna rolę każdego serwera, ale takie role mogą się zmienić, a czasem doświadczeni użytkownicy mogą mieć zainstalowane dziwne usługi. Wiedza o ich istnienu pozwoli ci zdecydować co z nimi zrobić, a nie usunąć je przypadkowo.

source: For this purpose, it is wise to inform your users of the project before migrating the server. To involve them in the project, it may be useful to install the most common free software programs on their desktops prior to migration, which they will come across again after the migration to Debian; OpenOffice.org and the Mozilla suite are the best examples here.
it_it: Per questo scopo, è saggio informare di questo progetto i propri utenti prima di migrare il server. Per coinvolgerli nel progetto, può essere utile installare i programmi liberi più comuni sui loro computer prima della migrazione, quelli che saranno incontrati di nuovo dopo la migrazione a Debian; OpenOffice.org e la suite Mozilla ne sono i migliori esempi.

source: Network and Processes
it_it: Rete e processi
ja_jp: ネットワークとプロセス
pl_pl: Sieć i Procesy

source: <indexterm><primary><command>nmap</command></primary></indexterm> The <command>nmap</command> tool (in the package with the same name) will quickly identify Internet services hosted by a network connected machine without even requiring to log in to it. Simply call the following command on another machine connected to the same network:
it_it: <indexterm><primary><command>nmap</command></primary></indexterm>Lo strumento <command>nmap</command> (nel pacchetto con lo stesso nome) identificherà velocemente i servizi Internet ospitati da una macchina connessa alla rete senza nemmeno aver bisogno di accedervi. Basta semplicemente eseguire il seguente comando su un'altra macchina connessa alla stessa rete:
ja_jp: <indexterm><primary><command>nmap</command></primary></indexterm> <command>nmap</command> ツール (パッケージも同じ名前) を使うことで、あるネットワークに接続されたマシンにログインすることなしにそのマシンががホストする Internet サービスを素早く特定できます。同じネットワークに接続されている他のマシンに対して以下のコマンドを実行するだけです:
pl_pl: <indexterm><primary><command>nmap</command></primary></indexterm>The <command>nmap</command> Narzędzie (w pakiecie o tej samej nazwie) będą szybko identyfikować usługi internetowe hostowane przez maszyne sieciową, nawet bez konieczności logowania się do niego. Wystarczy wywołać pod następujące polecenie na innym komputerze podłączonym do tej samej sieci:

source: <emphasis>ALTERNATIVE</emphasis> Use <command>netstat</command> to find the list of available services
it_it: <emphasis>ALTERNATIVA</emphasis> Usare <command>netstat</command> per trovare l'elenco dei servizi disponibili
ja_jp: <emphasis>ALTERNATIVE</emphasis> 利用可能なサービスのリストを表示するために <command>netstat</command> を使う
pl_pl: <emphasis>ALTERNATIVE</emphasis> Użyj <command>netstat</command> aby znależć listę dostępnych usług.

source: On a Linux machine, the <command>netstat -tupan</command> command will show the list of active or pending TCP sessions, as well UDP ports on which running programs are listening. This facilitates identification of services offered on the network.
it_it: Su una macchina Linux, il comando <command>netstat -tupan</command> mostrerà un elenco di sessioni TCP attive o pendenti e di porte UDP sulle quali i programmi in esecuzione sono in ascolto. Ciò facilita l'identificazione dei servizi offerti sulla rete.
ja_jp: Linux マシン上で <command>netstat -tupan</command> コマンドを実行すると、アクティブ状態および保留状態の TCP セッションと実行中のプログラムがリッスンしている UDP ポートのリストが表示されます。これはネットワーク上で提供されているサービスの識別を容易にします。
pl_pl: Na komputerze z systemem Linux, <command>netstat -tupan</command> wyświetli listę aktywnych i oczekujących sesji TCP, jak i UDP, na którym uruchomione programy są słuchane. Ułatwia to identyfikację oferowanych w sieci usług.

source: <emphasis>GOING FURTHER</emphasis> IPv6
it_it: <emphasis>PER APPROFONDIRE</emphasis> IPv6
pl_pl: <emphasis>Idąc dalej </emphasis> IPv6

source: Some network commands may work either with IPv4 (the default usually) or with IPv6. This is especially the case with the <command>nmap</command> and <command>netstat</command> commands, but also others, such as <command>route</command> or <command>ip</command>. The convention is that this behavior is enabled by the <parameter>-6</parameter> command-line option.
it_it: Alcuni comandi di rete possono funzionare sia con IPv4 (solitamente è quello predefinito) o con IPv6. Questo è specialmente il caso dei comandi <command>nmap</command> e <command>netstat</command>, ma anche altri, come <command>route</command> o <command>ip</command>. La convenzione è che questo comportamento è abilitato dall'opzione <parameter>-6</parameter> sulla riga di comando.

source: If the server is a Unix machine offering shell accounts to users, it is interesting to determine if processes are executed in the background in the absence of their owner. The command <command>ps auxw</command> displays a list of all processes with their user identity. By checking this information against the output of the <command>who</command> command, which gives a list of logged in users, it is possible to identify wild servers or programs running in the background. Looking at <filename>crontabs</filename> (tables listing automatic actions scheduled by users) will often provide interesting information on functions fulfilled by the server (a complete explanation of <command>cron</command> is available in <xref linkend="sect.task-scheduling-cron-atd" />).
it_it: Se il server è una macchina Unix che offre account di shell agli utenti, è interessante determinare se i processi sono eseguiti sullo sfondo in assenza del loro proprietario. Il comando <command>ps auxw</command> mostra un elenco di tutti i processi con l'identità degli utenti. Confrontando queste informazioni con l'output del comando <command>who</command>, che mostra un elenco degli utenti collegati, è possibile identificare server non autorizzati o programmi in esecuzione sullo sfondo. Guardare i <filename>crontab</filename> (tabelle che elencano le azioni automatiche programmate dagli utenti) fornirà spesso informazioni interessanti sulle funzioni ricoperte dal server (una spiegazione completa di <command>cron</command> è disponibile in <xref linkend="sect.task-scheduling-cron-atd" />).

source: In any case, it is essential to backup your servers: this allows recovery of information after the fact, when users will report specific problems due to the migration.
it_it: In ogni caso è essenziale fare il backup dei propri server: questo permette il recupero di informazioni a posteriori, quando gli utenti segnaleranno problemi specifici dovuti alla migrazione.
ja_jp: どんな場合でも、サーバのバックアップを行うことは絶対必要です: バックアップをしておけば、移行したことで生じた特定の問題がユーザから報告され、問題が起きた後でも情報を回復することができます。
pl_pl: W każdym przypadku konieczne jest tworzenie kopii zapasowych serwerów, pozwala na odzyskanie danych po fakcie, gdy użytkownicy będą zgłaszać konkretne problemy związane z migracją.

source: Backing up the Configuration
it_it: Fare il backup della configurazione
ja_jp: 設定のバックアップ
pl_pl: Robiąc kopię zapasową konfiguracji

source: It is wise to retain the configuration of every service identified in order to be able to install the equivalent on the updated server. The strict minimum is to print the configuration files and make a backup copy of them.
it_it: È saggio conservare la configurazione di ogni servizio identificato al fine di essere in grado di installare quello equivalente sul server aggiornato. Il minimo indispensabile è stampare i file di configurazione e farne una copia di backup.

source: For Unix machines, the configuration files are usually found in <filename>/etc/</filename>, but they may be located in a sub-directory of <filename>/usr/local/</filename>. This is the case if a program has been installed from sources, rather than with a package. One may also find them, in some cases, under <filename>/opt/</filename>.
it_it: Per le macchine Unix, i file di configurazione si trovano solitamente in <filename>/etc/</filename>, ma possono trovarsi in una sotto-directory di <filename>/usr/local/</filename>. Questo è il caso quando un programma è stato installato dai sorgenti, piuttosto che da un pacchetto. Si possono trovare, in alcuni casi, sotto <filename>/opt/</filename>.

source: For data managing services (such as databases), it is strongly recommended to export them to a standard format that will be easily imported by the new software. Such a format is usually in text mode and documented; it may be, for example, an SQL dump for a database, or an LDIF file for an LDAP server.
it_it: Per i servizi che gestiscono dati (come i database), è fortemente consigliato di esportarli in un formato standard che sarà facilmente importato dal nuovo software. Un tale formato è solitamente in modalità testo e documentato; può essere, per esempio, un dump SQL per un database o un file LDIF per un server LDAP.

source: Database backups
it_it: Backup di database
ja_jp: データベースのバックアップ
pl_pl: Kopie zapasowe bazy danych

source: Each server software is different, and it is impossible to detail all existing cases. See the new and current software documentation to identify the exportable (thus, re-importable) portions and those which will require manual manipulation. Reading this book will clarify the configuration of the main Linux server programs.
it_it: Il software di ogni server è differente ed è impossibile fornire dettagli su tutti i casi esistenti. Consultare la documentazione del software nuovo e di quello attuale per identificare le porzioni esportabili (perciò re-importabili) e quelle che richiedono manipolazioni manuali. La lettura di questo libro chiarirà la configurazione dei principali programmi per server Linux.

source: Taking Over an Existing Debian Server
it_it: Prendere il controllo di un server Debian esistente
ja_jp: 既存の Debian サーバの引き継ぎ
pl_pl: Przejmując obowiazki aktualnego servera Debiana

source: <primary>recovering a Debian machine</primary>
it_it: <primary>recupero di una macchina Debian</primary>
ja_jp: <primary>Debian マシンのリカバリ</primary>

source: <primary>exploring a Debian machine</primary>
it_it: <primary>esplorazione di una macchina Debian</primary>
ja_jp: <primary>Debian マシンの探索</primary>

source: <primary>taking over a Debian server</primary>
it_it: <primary>prendere il controllo di una macchina Debian</primary>
ja_jp: <primary>Debian サーバの引き継ぎ</primary>

source: To effectively take over its maintenance, one may analyze a machine already running with Debian.
it_it: Si può analizzare una macchina che già esegue Debian per prendere efficacemente il controllo della sua manutenzione.
ja_jp: 維持管理を効率的に引き継ぐために、すでに Debian が稼働中のマシンを解析する必要があるかもしれません。
pl_pl: Aby skutecznie go utrzymać, jeden może analizować maszynę aktualnie pracującą z Debianem

source: The first file to check is <filename>/etc/debian_version</filename>, which usually contains the version number for the installed Debian system (it is part of the <emphasis>base-files</emphasis> package). If it indicates <literal><replaceable>codename</replaceable>/sid</literal>, it means that the system was updated with packages coming from one of the development distributions (either testing or unstable).
it_it: Il primo file da controllare è <filename>/etc/debian_version</filename>, che solitamente contiene il numero di versione per il sistema Debian installato (fa parte del pacchetto <emphasis>base-files</emphasis>). Se indica <literal><replaceable>codename</replaceable>/sid</literal>, significa che il sistema è stato aggiornato con pacchetti provenienti da una delle distribuzioni di sviluppo (testing oppure unstable).
ja_jp: 最初に確認するファイルは<filename>/etc/debian_version</filename> で、これは通常インストールされた Debian システムのバージョン番号を含んでいます (<emphasis>base-files</emphasis> パッケージの一部です)。バージョン番号が <literal><replaceable>codename</replaceable>/sid</literal> となっていた場合、このシステムは開発版ディストリビューション (テスト版か不安定版のどちらか) のパッケージを使って更新されたことを意味しています。
pl_pl: Pierwszym plikiem do sprawdzenia jest <filename>/etc/debian_version</filename>, który zazwyczaj zawiera numer wersji dla zainstalowanego Debiana (jest to część <emphasis>base-files</emphasis> pakietu. Jeśli to wskazuje na <literal><replaceable>codename</replaceable>/sid</literal>, to oznacza, że system został zaaktualizowany z pakietem pochodzącym z jednej z dystrybucji (testowej albo niestabilnej).

source: The <command>apt-show-versions</command> program (from the Debian package of the same name) checks the list of packages installed and identifies the versions available. <command>aptitude</command> can also be used for these tasks, albeit in a less systematic manner.
it_it: Il comando <command>apt-show-versions</command> (dal pacchetto Debian con lo stesso nome) controlla l'elenco dei pacchetti installati e identifica le versioni disponibili. <command>aptitude</command> può anche essere usato per questi compiti, anche se in maniera meno sistematica.

source: A glance at the <filename>/etc/apt/sources.list</filename> file will show where the installed Debian packages likely came from. If many unknown sources appear, the administrator may choose to completely reinstall the computer's system to ensure optimal compatibility with the software provided by Debian.
it_it: Un'occhiata al file <filename>/etc/apt/sources.list</filename> mostrerà da dove probabilmente provengono i pacchetti Debian installati. Se appaiono molte sorgenti sconosciute, l'amministratore può scegliere di reinstallare completamente il sistema del computer per assicurare una compatibilità ottimale con il software fornito da Debian.
ja_jp: <filename>/etc/apt/sources.list</filename> ファイルをぱっと見ただけで、インストールされた Debian パッケージの取得元がわかります。ここにたくさんの未知のソースがあった場合、管理者は Debian が提供するソフトウェアとの最適な互換性を確保するために、コンピュータシステムを完全に再インストールするかもしれません。
pl_pl: Spójrzmy na <filename>/etc/apt/sources.list</filename> plik który pokaże nam, gdzie zainstalowane są pakiety Debiana. z Wielu nieznanych źródeł, administrator może wybrać kompletną reinstalacje systemu, żeby zyskać optymalną kompatybilność z oprogramowaniem dostarczonym przez Debiana.
