Repository: Neamar/KISS
Catalog: */03_existing-setup.po
Languages: it_it, ja_jp, pl_pl

source: The <filename>sources.list</filename> file is often a good indicator: the majority of administrators keep, at least in comments, the list of prior APT sources used. But you should not forget that sources used in the past might have been deleted, and that some random packages grabbed on the Internet might have been manually installed (with the <command>dpkg</command> command). In this case, the machine is misleading in its appearance of “standard” Debian. This is why you should pay attention to any indication that will give away the presence of external packages (appearance of <filename>deb</filename> files in unusual directories, package version numbers with a special suffix indicating that it originated from outside the Debian project, such as <literal>ubuntu</literal> or <literal>ximian</literal>, etc.)
it_it: Il file <filename>sources.list</filename> è spesso un buon indicatore: la maggior parte degli amministratori mantiene, almeno nei commenti, l'elenco delle fonti APT usate precedentemente. Ma non si dimentichi che le fonti usate in passato potrebbero essere state eliminate e che dei pacchetti qualsiasi scaricati da Internet potrebbero essere stati installati (con il comando <command>dpkg</command>). In questo caso la macchina è fuorviante nella sua apparenza di Debian “standard”. Questo è il motivo per cui si dovrebbe fare attenzione a ogni indizio della presenza di pacchetti esterni (presenza di file <filename>deb</filename> in directory non usuali, numeri di versione dei pacchetti con suffissi che indicano che hanno avuto origine all'esterno del progetto Debian, come <literal>ubuntu</literal> o <literal>ximian</literal>, ecc.)

source: Likewise, it is interesting to analyze the contents of the directory <filename>/usr/local/</filename>, intended to contain programs compiled and installed manually. Listing software installed in this manner is instructive, since this raises questions on the reasons for not using the corresponding Debian package, if such a package exists.
it_it: Allo stesso modo, è interessante analizzare il contenuto della directory <filename>/usr/local/</filename>, che ha lo scopo di contenere programmi compilati e installati manualmente. Elencare il software installato in questa maniera è istruttivo dal momento che solleva interrogativi sulle ragioni per cui non è stato usato il pacchetto Debian corrispondente, se un tale pacchetto esiste.

source: <emphasis>QUICK LOOK</emphasis> <emphasis role="pkg">cruft</emphasis>
it_it: <emphasis>A COLPO D'OCCHIO</emphasis> <emphasis role="pkg">cruft</emphasis>

source: The <emphasis role="pkg">cruft</emphasis> package proposes to list the available files that are not owned by any package. It has some filters (more or less effective, and more or less up to date) to avoid reporting some legitimate files (files generated by Debian packages, or generated configuration files not managed by <command>dpkg</command>, etc.).
it_it: Il pacchetto <emphasis role="pkg">cruft</emphasis> propone l'elenco dei file disponibili che non sono posseduti da alcun pacchetto. Ha alcuni filtri (più o meno efficaci e più o meno aggiornati) per evitare di riportare file legittimi (file generati da pacchetti Debian o file di configurazione generati non gestiti da <command>dpkg</command>, ecc.).
ja_jp: <emphasis role="pkg">cruft</emphasis> パッケージはいかなるパッケージによっても所有されていない利用可能なファイルをリストアップすることを目標としています。正規のファイル (Debian パッケージが生成したファイル、<command>dpkg</command> で管理されていない生成された設定ファイル) が報告されるのを避けるためにいくつかのフィルタ (おおむね有効で、おおむね最新の) を持っています。
pl_pl: The <emphasis role="pkg">cruft</emphasis> Pakietowe propozycje listy dostępnych plików ,które nie są własnością żadnego pakietu. To ma jakieś filtry (mniej lub bardziej skuteczne,w zależności od tego jak bardzo jest aktualne), aby uniknąć zgłaszania niektórych uzasadnionych plików (pliki generowane przez pakiety Debiana lub wygenerowane pliki konfiguracyjne nie są zarządzane przez <command>dpkg</command>, itp).

source: Be careful to not blindly delete everything that <command>cruft</command> might list!
it_it: Si faccia attenzione a non eliminare ciecamente tutto quello che <command>cruft</command> potrebbe elencare!
ja_jp: <command>cruft</command> がリストアップしたすべてを盲目的に削除しないよう気を付けてください!
pl_pl: Uważaj aby nie usunąć wszystkiego <command>śmieci</command> może wylistować!

source: Installing Debian
it_it: Installazione di Debian
ja_jp: Debian のインストール
pl_pl: Instaluje Debiana

source: All information on the current server being now known, we can shut it down and begin to install Debian on it.
it_it: Ora che tute le informazioni del server attuale sono conosciute, possiamo spegnerlo e installarci Debian.

source: <primary>architecture</primary>
it_it: <primary>architettura</primary>
ja_jp: <primary>アーキテクチャ</primary>
pl_pl: <primary>archtektura</primary>

source: To choose the appropriate version, we must know the computer's architecture. If it is a PC, it is most likely to be i386. In other cases, we can narrow down the possibilities according to the previously used system.
it_it: Per scegliere la versione appropriata, si deve conoscere l'architettura del computer. Se è un PC, molto probabilmente è i386. In altri casi si possono ridurre le scelte possibili in base al sistema usato precedentemente.

source: Installing the appropriate Debian version
it_it: Installazione della versione appropriata di Debian

source: <xref linkend="tab-corresp" xrefstyle="nopage" /> is not intended to be exhaustive, but may be helpful. In any case, the original documentation for the computer is the most reliable source to find this information.
it_it: <xref linkend="tab-corresp" xrefstyle="nopage" /> non ha la pretesa di essere completa ma può essere utile. In ogni caso, la documentazione originale del computer è la fonte più affidabile per trovare questa informazione.

source: <emphasis>HARDWARE</emphasis> Next-generation PC
it_it: <emphasis>HARDWARE</emphasis> PC di prossima generazione

source: Most recent computers have 64 bit Intel or AMD processors, compatible with older 32 bit processors; the software compiled for “i386” architecture thus works. On the other hand, this compatibility mode does not fully exploit the capabilities of these new processors. This is why Debian provides software for “ia64” architecture for Intel Itanium chips and “amd64” for AMD chips. This last also works with Intel “em64t” processors, which are very similar to AMD64 processors.
it_it: I computer più recenti hanno processori Intel o AMD a 64 bit, compatibili con i più vecchi processori a 32 bit; perciò il software compilato per l'architettura “i386” funziona. D'altra parte, questa modalità compatibile non sfrutta pienamente le capacità di questi nuovi processori. Questo è il motivo per cui Debian fornisce software per l'architettura “ia64” per Intel Itanium e “amd64” per AMD. Quest'ultimo funziona anche con processori Intel “em64t” che sono molto simili ai processori AMD64.

source: Matching operating system and architecture
it_it: Sistema operativo e architettura corrispondente
ja_jp: オペレーティングシステムとアーキテクチャの照合
pl_pl: Dopasowanie systemu operacyjnego i architektury.

source: Operating System
it_it: Sistema operativo
ja_jp: オペレーティングシステム
pl_pl: system operacyjny

source: Architecture(s)
it_it: Architettura
ja_jp: アーキテクチャ
pl_pl: Architektur(a/y)

source: Installing and Configuring the Selected Services
it_it: Installazione e configurazione dei servizi scelti
ja_jp: 選ばれたサービスのインストールと設定
pl_pl: Instalowanie i konfigurowanie wybranych usług.

source: Once Debian is installed, we must install and configure one by one all of the services that this computer must host. The new configuration must take into consideration the prior one in order to ensure a smooth transition. All the information collected in the first two steps are useful to successfully complete this part.
it_it: Una volta che Debian è installata, è necessario installare e configurare uno ad uno i servizi che questo computer deve ospitare. La nuova configurazione deve tenere in considerazione quella precedente per assicurare una transizione indolore. Tutte le informazioni raccolte nei primi due passi sono utili per completare con successo questa parte.
ja_jp: ひとたび Debian がインストールされると、我々はコンピュータがホストする全てのサービスについて 1 つずつインストールと設定を行わなければいけません。移行を円滑に進めるためにも、新しい設定は古い設定を考慮して行われなければいけません。最初の 2 ステップで集めた全ての情報が、この作業を成功のうちに完了させるのに役立ちます。
pl_pl: Po instalacji Debiana , musimy zainstalować i skonfigurować usługi jedną po drugiej, które komputer musi hostować. Nowa konfiguracja musi uwzględniać wcześniejsze w celu zapewnienia płynnego przejścia . Wszystkie informacje zebrane w dwóch pierwszych etapach są przydatne, aby poprawnie zakończyć tą część.

source: Install the selected services
it_it: Installazione dei servizi scelti
ja_jp: 選ばれたサービスのインストール
pl_pl: Zainstaluj wybrane usługi

source: Prior to jumping in to this exercise with both feet, it is strongly recommended that you read the remainder of this book. After that you will have a more precise understanding of how to configure the expected services.
it_it: Prima di gettarsi a capofitto, è fortemente consigliato di leggere il resto di questo libro. Dopo di ciò si avrà una comprensione più precisa di come configurare i servizi attesi.
ja_jp: 意気込んで行動を起こす前に、この本の残りの部分を読むことを強く推奨します。そうすることで、運用予定のサービスを設定する方法について、正確な理解を得ることができるでしょう。
pl_pl: Zanim w pełni rozpoczęczniesz ćwiczenia, zalecamy przeczytanie całej książki. Jak będziesz miał już większe doświadczenie w skonfigurowaniu oczekiwanych usług.

source: Debian integrates very well in all types of existing environments and plays well with any other operating system. This near-perfect harmony comes from market pressure which demands that software publishers develop programs that follow standards. Compliance with standards allows administrators to switch out programs: clients or servers, whether free or not.
ja_jp: Debian はあらゆる種類の既存環境とうまく融合し、他のオペレーティングシステムとうまく協調して動くように設計されています。市場圧力がソフトウェア出版元に対して規格に従ったプログラムの開発を要求することで、このような完璧に近い調和が生まれます。規格に準拠しているため、管理者はプログラムを入れ替えることができます: クライアントでもサーバでも、そしてフリーであるか否かに依存しません。
pl_pl: Debian bardzo dobrze integruje się z wieloma typami istniejących środowisk i dobrze współgra z innymi systemami operacyjnymi. Ta bliska-perfekcji harmonia pochodzi z presji rynku który wymaga od producentów oprogramowania opracowywania programów które spełniają standardy.

source: Samba version 2 behaves like a Windows NT server (authentication, files, print queues, downloading printer drivers, DFS, etc.) Version 3 works with Active Directory, brings interoperability with NT4 domain controllers, and supports RPCs (Remote Procedure Calls). Version 4 is a rewrite that can provide a domain controller compatible with Active Directory.
ja_jp: Samba バージョン 2 は Windows NT サーバのようにふるまいます (認証、ファイル、印刷キュー、プリンタドライバのダウンロード、DFS など)。バージョン 3 は Active Directoryと連動し、NT4 ドメインコントローラとの相互運用性を提供し、RPC (リモートプロシージャコール) をサポートします。バージョン 4 は Active Directory と互換性のあるドメインコントローラをサポートするために書き直されました。
pl_pl: 2 wersja Samby zachowuje się jak Windows NT serwer (uwierzytelnianie, plików, kolejek wydruku, pobierania sterowników do drukarki, DFS, itp.) 3 wersja pracuje z Active Directory, dodaje interoperacyjność z kontroli domen NT4, wspiera RPC ( Remote Procedure Calls)0 (zdalnych wywołan procedur). 4 wersja jest kopią, która może zapewniać kontroler domeny z Active Directory.

source: Mac OS machines provide, and are able to use, network services such as file servers and printer sharing. These services are published on the local network, which allows other machines to discover them and make use of them without any manual configuration, using the Bonjour implementation of the Zeroconf protocol suite. Debian includes another implementation, called Avahi, which provides the same functionality.
ja_jp: Mac OS マシンはファイルサーバやプリンタ共有などのネットワークサービスを提供し、これを利用できます。これらのサービスはローカルネットワークに公開されています。このことにより、他のマシンはサービスを発見し、Zeroconf プロトコルスイートの Bonjour 実装を使い手作業で設定することなくサービスを利用可能になります。Debian は同じ機能を提供する Avahi と呼ばれる別の実装を使います。
pl_pl: Maszyny Mac OS dostarczają i mogą używać serwisów takich jak pliki serwerowe i współdzielnie drukarki. Te usługi są opublikowane w lokalnej sieci, co pozwala innym maszynom na wykrywanie i używanie bez żadnych manualnych konfiguracji, używając implementacji Bonjour z protokołu ZeroConf. Debian zawiera inne implementacje, nazywane Avahi, które dostarcza te same funkcje.

source: In the other direction, the Netatalk daemon can be used to provide file servers to Mac OSX machines on the network. It implements the AFP (AppleShare) protocol as well as the required notifications so that the servers can be autodiscovered by the Mac OSX clients.
ja_jp: 他方で、ネットワーク上の Mac OSX マシンに向けてファイルサーバを提供するために Netatalk デーモンがつかわれます。Netatalk は AFP (AppleShare) プロトコルと Mac OSX クライアントがサーバを自動的に発見できるようにするために必要な通知の実装です。
pl_pl: Z drugiej strony, Netatalk daemon moze być użyty do dostarczania plików serverowych do Mac OSX przez internet. To implementuje protokół AFP(AppleShare) i wymagane notyfikacje, żeby server mógł automatycznie wykrywalny przez użytkowników Mac OSX

source: Older Mac OS networks (before Mac OSX) used a different protocol called AppleTalk. For environments involving machines using this protocol, Netatalk also provides the AppleTalk protocol (in fact, it started as a reimplementation of that protocol). It ensures the operation of the file server and print queues, as well as time server (clock synchronization). Its router function allows interconnection with AppleTalk networks.
ja_jp: 古めの (Mac OSX 以前の) Mac OS ネットワークでは AppleTalk と呼ばれる別のプロトコルが使われていました。このプロトコルを使っているマシンを含む環境に対して、Netatalk が AppleTalk プロトコルを提供しています (実際、Netatalk は AppleTalk プロトコルのクローンとして始められました)。これによりファイルサーバと印刷キューおよび時刻サーバ (時刻同期) 機能が確保されます。ルータ機能により AppleTalk ネットワーク間の相互接続が可能になります。
pl_pl: Starsze wersje mac OS ( przed Mac OSX) wykorzystywały w sieci inny protokół nazywany AppleTalk. W środowiskach obejmujących maszyny z wykorzystaniem tego protokołu, Netatalk również dostarcza protokół AppleTalk (w rzeczywistości, tak zaczęła się reimplementacja tego protokołu.) To zapewnia operacje na plikach serwerowych i kolejkach drukowania jak i serwer czasu (synchronizacja czasu). Funkcja routera umożliwia wzajemne połączenia z sieci AppleTalk.

source: In order to guarantee continuity of the services, each computer migration must be planned and executed according to the plan. This principle applies whatever the operating system used.
ja_jp: サービスの継続性を保証するために、それぞれのコンピュータの移行計画を立て、計画に従って移行作業を行わなければいけません。この原則はオペレーティングシステムの種類に依存しません。
pl_pl: W celu zapewnienia ciągłości usług, każda migracja na komputerze musi być zaplanowana i realizowana zgodnie z planem. Zasada ta ma zastosowanie bez względu na używany system operacyjny.

source: For this purpose, it is wise to inform your users of the project before migrating the server. To involve them in the project, it may be useful to install the most common free software programs on their desktops prior to migration, which they will come across again after the migration to Debian; Libre Office and the Mozilla suite are the best examples here.
ja_jp: この目的で、サーバを移行する前にユーザに Debian プロジェクトを通知することが賢明です。ユーザを Debian プロジェクトに関わらせるために、移行前に最も一般的な (Debian への移行後に使うような) フリーソフトウェアプログラムをユーザのデスクトップにインストールすることは役に立つかもしれません; Libre Office や Mozilla スイートはこのようなソフトウェアの良い例です。
pl_pl: W tym celu dobrze jest poinformować użytkowników o projekcie przed migracją serwera. Zaangażowanie ich w projekcie, może być przydatne w instalacji najbardziej znanych bezpłatnych programów na ich komputerach przed migracją, co natkną się ponownie po migracji do Debiana; Libre Office i Mozilla Suite są najlepszymi przykładami tutaj.

source: Some network commands may work either with IPv4 (the default usually) or with IPv6. These include the <command>nmap</command> and <command>netstat</command> commands, but also others, such as <command>route</command> or <command>ip</command>. The convention is that this behavior is enabled by the <parameter>-6</parameter> command-line option.
ja_jp: いくつかのネットワークコマンドは IPv4 (通常デフォルト) と IPv6 を扱うことができます。<command>nmap</command> と <command>netstat</command> はそのようなコマンドですが、例えば <command>route</command> や <command>ip</command> のようなコマンドはIPv6 を扱えません。慣習的に、<parameter>-6</parameter> コマンドラインオプションを使うことで IPv6 を扱うことができるようになります。
pl_pl: Niektóre komendy sieciowe mogą pracować zarówno z IPv4 (zazwyczaj domyślne) lub z IPv6. Należą do nich <command>nmap</command> i <command>netstat</command> polecenia, ale również inne, takie jak <command>route</command> lub <command>ip</command>.Konwencja opisuje zachowanie jest włączona przez <parameter>-6</parameter> opcja wiersza polecenia.

source: If the server is a Unix machine offering shell accounts to users, it is interesting to determine if processes are executed in the background in the absence of their owner. The command <command>ps auxw</command> displays a list of all processes with their user identity. By checking this information against the output of the <command>who</command> command, which gives a list of logged in users, it is possible to identify rogue or undeclared servers or programs running in the background. Looking at <filename>crontabs</filename> (tables listing automatic actions scheduled by users) will often provide interesting information on functions fulfilled by the server (a complete explanation of <command>cron</command> is available in <xref linkend="sect.task-scheduling-cron-atd" />).
ja_jp: サーバがユーザにシェルアカウントを提供する Unix マシンの場合、所有者不在のプロセスがバックグラウンドで実行されているかどうかを見つけ出すことは興味深いものです。<command>ps auxw</command> コマンドはすべてのプロセスのリストをユーザ名を含めて表示します。この情報と、ログイン中のユーザのリストを表示する <command>who</command> コマンドの出力を比較することで、バックグラウンドで実行されている不正で無申告のサーバまたはプログラムを特定することができます。<filename>crontabs</filename> (ユーザが定期的に予定している自動実行の一覧表) にはしばしばサーバの果たす役割に関する興味深い情報が含まれています (<command>cron</command> の完全な説明は<xref linkend="sect.task-scheduling-cron-atd" />にあります)。
pl_pl: Jeśli serwer jest maszyną Unix oferującą powłokę kont dla użytkowników, interesujące jest to, aby określić, czy procesy są wykonywane w tle, w przypadku braku ich właściciela. Polecenie <command> ps auxw </command> wyświetla listę wszystkich procesów z identyfikatorem użytkownika. Poprzez sprawdzenie tej informacji przed wyjściem <command>who </command>, która daje listę zalogowanych użytkowników, możliwe jest zidentyfikowanie niepożądanych, niezgłoszonych serwerów lub programów działających w tle. Patrząc w <filename> crontab </filename> (listuje tabele działań zaplanowanych przez użytkowników) często zapewnią ciekawe informacje na temat funkcji pełnionych przez serwer

source: It is wise to retain the configuration of every identified service in order to be able to install the equivalent on the updated server. The bare minimum is to make a backup copy of the configuration files.
ja_jp: アップデート後のサーバに同等の環境を作るれるようにするため、それぞれのサービスに対する設定を保存しておくのは賢明です。設定ファイルのバックアップコピーを取ることは最低限必要です。
pl_pl: Dobrze jest, aby utrzymać konfigurację każdej określonej usługi w celu umożliwienia zainstalowania odpowiednik w zaktualizowanym serwera.Absolutnym minimum jest zrobić kopię zapasową plików konfiguracyjnych.

source: For Unix machines, the configuration files are usually found in <filename>/etc/</filename>, but they may be located in a sub-directory of <filename>/usr/local/</filename>. This is the case if a program has been installed from sources, rather than with a package. In some cases, one may also find them under <filename>/opt/</filename>.
ja_jp: Unix マシンでは、設定ファイルは通常 <filename>/etc/</filename> にありますが、場合によっては <filename>/usr/local/</filename> サブディレクトリにあるかもしれません。これはプログラムをパッケージではなくソースコードを使ってインストールした場合です。また、設定ファイルが <filename>/opt/</filename> の下にある場合もあります。
pl_pl: Dla systemów Unix, pliki konfiguracyjne są zwykle w <filename> / etc / </filename>, ale mogą one znajdować się w podkatalogu <filename> / usr / local / </filename>. Jest to przypadek, gdy program jest instalowany z innych źródeł, a nie z pakietu. W niektórych przypadkach, można również znaleźć je w <filename> / opt / </filename>.

source: For data managing services (such as databases), it is strongly recommended to export the data to a standard format that will be easily imported by the new software. Such a format is usually in text mode and documented; it may be, for example, an SQL dump for a database, or an LDIF file for an LDAP server.
ja_jp: データ管理サービス (データベースなど) では、新しいソフトウェアで簡単に読み込むことができる一般的なフォーマットでデータを書き出すことを強く推奨します。そのようなフォーマットは通例テキストデータで文書化されています; これは例えば、データベースでは SQL ダンプ、LDAP サーバでは LDIF ファイルのことを指します。
pl_pl: Dla danych usług zarządzającymi danymi(takimi jak bazy danych), zaleca się, aby wyeksportować dane do standardowego formatu, który będzie łatwo importowany przez nowe oprogramowanie. Taki format zazwyczaj jest w trybie tekstowym i udokumentowanym, może to być dla przykłądu zrzut SQL dla bazy danych lub plik LDIF dla serwera LDAP.

source: Each server software is different, and it is impossible to describe all existing cases in detail. Compare the documentation for the existing and the new software to identify the exportable (thus, re-importable) portions and those which will require manual handling. Reading this book will clarify the configuration of the main Linux server programs.
ja_jp: それぞれのサーバソフトウェアには差がありますから、現存するすべての場合について詳しく述べることは不可能です。移行元と移行先のソフトウェアの文書を比較して、書き出し可能 (そして、再読み込み可能) な部分と手作業を必要とするかどうかを確認してください。この本を読めば主な Linux サーバプログラムの設定は明らかになります。
pl_pl: Każdy oprogramowanie serwera jest inny, i nie jest możliwe opisanie wszystkich odmian w szczegółach. Porównaj dokumentację istniejących oraz nowych oprogramowań do identyfikowania eksportowanych ( ponownie importowanych ) części i tych, które wymagają ręcznej obsługi. Czytając tę książkę dowiesz się o konfiguracji głównych programów serwerowych Linux.

source: The <command>apt-show-versions</command> program (from the Debian package of the same name) checks the list of installed packages and identifies the available versions. <command>aptitude</command> can also be used for these tasks, albeit in a less systematic manner.
ja_jp: <command>apt-show-versions</command> プログラム (同じ名前の Debian パッケージに含まれます) はインストールされたパッケージのリストを確認して、利用可能なバージョンを識別します。<command>apt-show-versions</command> に比べると体系的ではありませんが、<command>aptitude</command> を同様の目的で使うこともできます。
pl_pl: Komenda <command>apt-show-versions</command> programu ( z pakietu Debiana o tej samej nazwie) sprawdza liste zainstalowanych pakietów i identyfikatorów dostepnych wersji. <command>aptitude</command> może również być użyty do tych zadań, aczkolwiek w mniej systematyczny sposób.
