Repository: Neamar/KISS
Catalog: */03_existing-setup.po
Languages: it_it, ja_jp, pl_pl

source: The <filename>sources.list</filename> file is often a good indicator: the majority of administrators keep, at least in comments, the list of APT sources that were previously used. But you should not forget that sources used in the past might have been deleted, and that some random packages grabbed on the Internet might have been manually installed (with the <command>dpkg</command> command). In this case, the machine is misleading in its appearance of “standard” Debian. This is why you should pay attention to any indication that will give away the presence of external packages (appearance of <filename>deb</filename> files in unusual directories, package version numbers with a special suffix indicating that it originated from outside the Debian project, such as <literal>ubuntu</literal> or <literal>lmde</literal>, etc.)
ja_jp: この <filename>sources.list</filename> ファイルは多くの場合良い指標となります: 大多数の管理者は、少なくともコメントの中で、過去に使っていた APT ソースのリストを残しています。しかし、過去に使っていたソースは削除されているかもしれないこと、インターネットから取得されたでたらめなパッケージが手作業で (<command>dpkg</command> コマンドを使って) インストールされているかもしれないこと、を忘れるべきではありません。この場合、マシンは「標準的な」Debian の外観に偽装されている恐れがあります。そのため、外部パッケージの存在を示す兆候を見逃さないようするべきです (通常では考えにくいディレクトリに <filename>deb</filename> ファイルがあったり、パッケージのバージョン番号のサフィックスに <literal>ubuntu</literal> や<literal>lmde</literal> などの特別なものが使われていたら、それは Debian プロジェクト以外で作られたことを意味しています)。
pl_pl: The <filename> sources.list </filename> jest często dobrym wskaźnikiem, większość administratorów zachowuje, przynajmniej w komentarzach, listę APT źródeł, które były wcześniej używane. Ale nie należy zapominać, że źródła wykorzystane w przeszłości mogły zostać usunięty, a niektóre losowe pakiety podpatrzone w internecie mogą być zainstalowane ręcznie (z <command> dpkg </command>). W tym przypadku, urządzenie wprowadza w błąd w swoim wyglądzie "standardowym" Debiana. Dlatego należy zwrócić uwagę na wskazanie, że da się obecność opakowaniach zewnętrznych (wygląd <filename> deb </filename> pliki w nietypowych katalogach, numery wersji pakietu ze specjalną końcówką, wskazującą, że pochodzi spoza projektu Debian, takich jak <literal> ubuntu </literal> lub <literal> lmde </literal>, itp)

source: Likewise, it is interesting to analyze the contents of the <filename>/usr/local/</filename> directory, whose purpose is to contain programs compiled and installed manually. Listing software installed in this manner is instructive, since this raises questions on the reasons for not using the corresponding Debian package, if such a package exists.
ja_jp: 同様に <filename>/usr/local/</filename> ディレクトリの内容を分析するのは興味深いです。このディレクトリは手作業でコンパイルおよびインストールされたプログラムを納めるための場所です。手作業でインストールされたソフトウェアをリストアップすることは有益です。なぜならそうすることで、Debian にもそのソフトウェアに類似するパッケージがあるにもかかわらずそれを使っていない理由に疑問を提起することができるからです。
pl_pl: Podobnie, warto przeanalizować zawartość pliku <filename>/usr/local/</filename> katalogu, w którym są programy zainstalowane i skompilowane manulanie. Listowanie oprogramowania zainstalowanego w ten sposób jest pouczająca, ponieważ rodzi to pytania dotyczące powodów nie używania odpowiedniego pakietu Debiana, jżeli takie pakiety istnieją.

source: Once all the required information on the current server is known, we can shut it down and begin to install Debian on it.
ja_jp: 現在のサーバに関する全ての必要な情報を集め終わったら、サーバを停止させ、Debian のインストールを始めることができます。
pl_pl: Gdy wszystkie wymagane informacje na bieżącym serwerze są znane, możemy go zamknąć i rozpocząć instalację Debiana.

source: To choose the appropriate version, we must know the computer's architecture. If it is a reasonably recent PC, it is most likely to be amd64 (older PCs were usually i386). In other cases, we can narrow down the possibilities according to the previously used system.
ja_jp: 適切なバージョンを選ぶには、コンピュータのアーキテクチャを知らなければいけません。まあまあ最近の PC ならば、アーキテクチャは十中八九 amd64 でしょう (古めの PC なら i386)。それ以外の場合、以前使っていたシステムから可能性を狭めることができます。
pl_pl: Aby wybrać odpowiednią wersję, musimy znać architekturę komputera. Jeśli jest to w miarę nowy PC, jest to bardzo prawdopodobne iż będzie to amd64 (starszymi komputery były zazwyczaj i386). W innych przypadkach, możemy zawęzić możliwości zgodnie z poprzednio używanego systemu.

source: <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> is not intended to be exhaustive, but may be helpful. In any case, the original documentation for the computer is the most reliable source to find this information.
ja_jp: <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> は全てを網羅することを意図したものではありませんが、参考になります。いかなる場合でも、コンピュータの元の文書はこの種の情報を探すには最も信頼できるソースです。
pl_pl: <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> nie jest wyczerpująca, ale może być pomocne. W każdym przypadku, oryginalna dokumentacja dla komputera jest najbardziej wiarygodnym źródłem, aby znaleźć te informacje.

source: <emphasis>HARDWARE</emphasis> 64 bit PC vs 32 bit PC
ja_jp: <emphasis>HARDWARE</emphasis> 64 ビット PC 対 32 ビット PC

source: Most recent computers have 64 bit Intel or AMD processors, compatible with older 32 bit processors; the software compiled for “i386” architecture thus works. On the other hand, this compatibility mode does not fully exploit the capabilities of these new processors. This is why Debian provides the “amd64” architecture, which works for recent AMD chips as well as Intel “em64t” processors (including most of the Core series), which are very similar to AMD64.
ja_jp: 最新のコンピュータは、古めの 32 ビットプロセッサと互換性のある 64 ビット Intel もしくは AMD プロセッサを搭載しています; このため「i386」アーキテクチャ向けコンパイルされたソフトウェアが動きます。一方で、この互換モードでは新しいプロセッサの性能を十分に引き出せません。このため、Debian は「amd64」アーキテクチャを提供しています。これは最近の AMD チップおよび AMD64 によく似た Intel「em64t」プロセッサ (ほとんどの Core シリーズを含みます) に有効です。
pl_pl: Najnowsze komputery mają 64 bitowe procesory Intel lub AMD , zgodne ze starszymi procesorami 32-bitowymi ; programy skompilowane dla architektury" i386 " także działają. Z drugiej strony kompatybilność nie jest w stanie wykorzystywać najnowszych możliwośći nowych procesorów. To dlatego Debian dostarcza architekture "amd64" , która wspołpracuje z najnowszymi czipami AMD jak i procesorami Intel "em64t" (zawierając prawie wszystkie z serri Core), które są bardzo podobne do AMD64

source: powerpc
pl_pl: zaslianie komputera
