Repository: Neamar/KISS
Catalog: */04_installation.po
Languages: id_id, ja_jp

source: In particular, if you install (or reinstall) Windows thereafter, the bootloader will be erased. Debian will still be on the hard drive, but will no longer be accessible from the boot menu. You would then have to boot the Debian installation system in <userinput>rescue</userinput> mode to set up a less exclusive bootloader. This operation is described in detail in the installation manual. <ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch08s07.html" />
id_id: Khususnya, jika Anda menginstall (atau menginstall ulang) Windows setelah itu, bootloader akan dihapus. Debian masih akan di hard drive, namun tidak lagi dapat diakses dari menu boot. Anda kemudian harus memboot sistem instalasi Debian dalam mode <userinput>rescue</userinput> untuk mengatur bootloader kurang ekslusif. Operasi ini dijelaskan lebih detil pada manual instalasi. <ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch08s07.html" />
ja_jp: 特に、後から Windows をインストール (または再インストール) する場合、ブートローダは消去されます。Debian はまだハードドライブに残っていますが、もはやブートメニューに表示されません。排他的でないブートローダをセットアップするには、Debian インストールシステムを <userinput>rescue</userinput> モードで起動してください。この操作はインストールマニュアルに詳しく書かれています。<ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch08s07.html" />

source: By default, the menu proposed by GRUB contains all the installed Linux kernels, as well as any other operating systems that were detected. This is why you should accept the offer to install it in the Master Boot Record. Since keeping older kernel versions preserves the ability to boot the same system if the most recently installed kernel is defective or poorly adapted to the hardware, it often makes sense to keep a few older kernel versions installed.
id_id: Secara bawaan, menu yang ditawarkan GRUB berisi seluruh kernel Linux yang terinstall, sebagaimana sistem operasi lainnya yang terdeteksi. Itulah mengapa Anda harus menerima tawaran untuk menginstallnya pada Master Boot Record. Karena memertahankan versi lama kernel menjaga kemampuan untuk memboot sistem yang sama jika kernel yang baru diinstall tidak sempurna atau adaptasi ke perangkat kerasnya buruk, seringkali masuk akal untuk membiarkan beberapa kernel versi lama terinstall.
ja_jp: デフォルトでは、GRUB の提案したメニューにはすべてのインストールされたカーネルおよび検出された他のオペレーティングシステムが含まれています。このため、GRUB はマスターブートレコード内にインストールされるべきです。最近インストールされたカーネルが欠陥品かハードウェアと相性が悪い場合に、古いカーネルバージョンを保持しておけば、同じシステムを起動できる状態が保存されるため、インストールされた古いカーネルバージョンを保持しておくことは合理的な方法です。

source: GRUB is the default bootloader installed by Debian thanks to its technical superiority: it works with most filesystems and therefore doesn't require an update after each installation of a new kernel, since it reads its configuration during boot and finds the exact position of the new kernel. Version 1 of GRUB (now known as “Grub Legacy”) couldn't handle all combinations of LVM and software RAID; version 2, installed by default, is more complete. There may still be situations where it is more recommendable to install LILO (another bootloader); the installer will suggest it automatically.
id_id: GRUB ialah bootloader bawaan yang terinstall oleh Debian terima kasih untuk superioritas teknisnya: bekerja dengan kebanyakan sistem berkas dan tidak memerlukan perbaruan setiap kali instalasi kernel baru, karena dia membaca konfigurasinya ketika boot dan menemukan posisi yang tepat dari kernel baru. GRUB versi 1 (sekarang dikenal dengan “Grub Legacy”) tidak dapat menangani seluruh kombinasi LVM dan perangkat lunak RAID; versi 2 diinsal sebagai bawaan, lebih lengkap. Mungkin masih ada siatuasi yang lebih direkomendasikan untuk menginstall LILO (bootloader lain); installer akan menyarankannya secara otomatis.
ja_jp: GRUB はその技術的優位性のお陰で Debian がインストールするデフォルトのブートローダに採用されています: GRUB は多くのファイルシステムをサポートしているため、新しいカーネルのインストールの後に毎回更新する必要がありません。なぜなら、起動中に設定を読んで、新しいカーネルの正確な位置を見つけ出すからです。GRUB の バージョン 1 (現在は「Grub Legacy」として知られています) は LVM とソフトウェア RAID の組み合わせを取り扱う事ができませんでした。デフォルトでインストールされるバージョン 2 はより完成度が高くなりました。LILO (別のブートローダ) のインストールが推奨される状況もまだあるかもしれません; そのような場合インストーラは自動的に LILO を提案します。

source: For more information on configuring GRUB, please refer to <xref linkend="sect.config-grub" />.
id_id: Untuk informasi selengkapnya mengonfigurasi GRUB, silahkan merujuk ke <xref linkend="sect.config-grub" />.
ja_jp: GRUB の設定に関する詳しい情報は<xref linkend="sect.config-grub" />を参照してください。

source: <emphasis>BEWARE</emphasis> Bootloaders and architectures
id_id: <emphasis>HATI-HATI</emphasis> Bootloader dan arsitektur
ja_jp: <emphasis>BEWARE</emphasis> ブートローダとアーキテクチャ

source: LILO and GRUB, which are mentioned in this chapter, are bootloaders for <emphasis>i386</emphasis> and <emphasis>amd64</emphasis> architectures. If you install Debian on another architecture, you will need to use another bootloader. Among others, we can cite <command>yaboot</command> or <command>quik</command> for <emphasis>powerpc</emphasis>, <command>silo</command> for <emphasis>sparc</emphasis>, <command>elilo</command> for <emphasis>ia64</emphasis>, <command>aboot</command> for <emphasis>alpha</emphasis>, <command>arcboot</command> for <emphasis>mips</emphasis>, <command>atari-bootstrap</command> or <command>vme-lilo</command> for <emphasis>m68k</emphasis>.
id_id: LILO dan GRUB, yang telah disebutkan di bab ini, ialah bootloader untuk arsitektur <emphasis>i386</emphasis> dan <emphasis>amd64</emphasis>. Jika Anda menginstall Debian pada arsitektur lain, Anda perlu mengnggunakan bootloader lain. Di antaranya, kita dapat menyebut <command>yaboot</command> atau <command>quik</command> untuk <emphasis>powerpc</emphasis>, <command>silo</command> atau <emphasis>sparc</emphasis>, <command>elilo</command> untuk <emphasis>ia64</emphasis>, <command>aboot</command> untuk <emphasis>alpha</emphasis>, <command>arcboot</command> untuk <emphasis>mips</emphasis>, <command>atari-bootstrap</command> atau <command>vme-lilo</command> untuk <emphasis>m68k</emphasis>.
ja_jp: この章で紹介した LILO と GRUB は <emphasis>i386</emphasis> と <emphasis>amd64</emphasis> アーキテクチャ用のブートローダです。もし別のアーキテクチャに Debian をインストールするなら、別のブートローダが必要です。とりわけ、<emphasis>powerpc</emphasis> 用には <command>yaboot</command> または <command>quik</command>、<emphasis>sparc</emphasis> 用には <command>silo</command>、<emphasis>ia64</emphasis> 用には <command>elilo</command>、<emphasis>alpha</emphasis> 用には <command>aboot</command>、<emphasis>mips</emphasis> 用には <command>arcboot</command>、<emphasis>m68k</emphasis> 用には <command>atari-bootstrap</command> または <command>vme-lilo</command> が用意されています。

source: Finishing the Installation and Rebooting
id_id: Menyelesaikan Instalasi dan Memboot Ulang
ja_jp: インストールの完了と再起動

source: The installation is now complete, the program invites you to remove the CD-ROM from the reader and to restart the computer.
id_id: Instalasi sekarang selesai, program meminta Anda untuk melepaskan CD-ROM dari pembaca dan menyalakan ulang komputer.
ja_jp: これでインストールが完了しました。プログラムは、ドライブから CD-ROM を取り出し、コンピュータを再起動するよう促します。

source: After the First Boot
id_id: Setelah Boot Pertama
ja_jp: 初回起動の後

source: If you activated the task “Graphical desktop environment”, the computer will display the <command>gdm3</command> login manager.
id_id: Jika Anda mengaktifkan tugas “Lingkungan dektop grafis”, komputer akan menampilkan login manajer <command>gdm3</command>.
ja_jp: 「Debian デスクトップ環境」のタスク有効化してインストールを進めていた場合、<command>gdm3</command> ログインマネージャが表示されます。

source: First boot
id_id: Boot pertama
ja_jp: 初回起動

source: The user that has already been created can then log in and begin working immediately.
id_id: Pengguna yang telah dibuat kemudian dapat masuk dan mulai berkerja.
ja_jp: 作成したユーザを使ってログインし、すぐに仕事を始められます。

source: Installing Additional Software
id_id: Menginstall Perangkat Lunak Tambahan
ja_jp: 追加ソフトウェアのインストール

source: The installed packages correspond to the profiles selected during installation, but not necessarily to the use that will actually be made of the machine. As such, you might want to use a package management tool to refine the selection of installed packages. The two most frequently used tools (which are installed if the “Graphical desktop environment” profile was chosen) are <command>apt</command> (accessible from the command line) and <command>synaptic</command> (“Synaptic Package Manager” in the menus).
id_id: Paket terinstall menyesuaikan profil yang terpilih ketika instalasi, namun tidak perlu untuk menggunakan yang akan dibuat oleh mesin. Misalnya, Anda mungkin ingin menggunakan alat manajemen paket untuk membersihkan pilihan paket yang telah terinstall. Dua alat yang paling sering digunakan (yang terinstall jika profil “Lingkungan desktop grafis” telah dipilih) ialah <command>apt</command> (dapat diakses dari baris perintah) dan <command>synaptic</command> (“Synaptic Manajer Paket” di menu).
ja_jp: インストール中に選択したタスクを基に選ばれたパッケージがインストールされていますが、実際のマシンの用途には不要なパッケージがインストールされている場合もあります。このような場合、より適切なパッケージをインストールするためにパッケージ管理ツールを使いたくなるかもしれません。最も頻繁に利用されるパッケージ管理ツール (「Debian デスクトップ環境」タスクを選んだ場合にインストールされます) は <command>apt</command> (コマンドラインから利用します) と <command>synaptic</command> (メニューの「Synaptic パッケージマネージャ」から利用します) の 2 種類です。

source: To facilitate the installation of coherent groups of programs, Debian creates “tasks” that are dedicated to specific uses (mail server, file server, etc.). You already had the opportunity to select them during installation, and you can access them again thanks to package management tools such as <command>aptitude</command> (the tasks are listed in a distinct section) and <command>synaptic</command> (through the menu <menuchoice> <guimenu>Edit</guimenu> <guimenuitem>Mark Packages by Task…</guimenuitem> </menuchoice>).
id_id: Untuk memfasilitasi instalasi kelompok program yang koheren, Debian membuat “tasks” yang didedikasikan untuk penggunaan khusus (mail server, server berkas, dll.). Anda telah memiliki kesempata untuk memilihnya ketika instalasi, dan anda dapat mengaksesnya lagi terima kasih pada alat manajemen paket seperti <command>aptitude</command> (tasks terdaftar pada bagian yang berbeda) dan <command>synaptic</command> (melalui menu <menuchoice> <guimenu>Sunting</guimenu> <guimenuitem>Tandai Paket dengan Task…</guimenuitem> </menuchoice>).
ja_jp: 一連のプログラムグループのインストールを楽にするために、Debian は特定の用途 (メールサーバ、ファイルサーバ、など) に対応する「タスク」を作りました。これを選択する機会はインストール中にもありましたし、パッケージ管理ツールである <command>aptitude</command> (タスクは専用のグループ内にリストされています) と <command>synaptic</command> (<menuchoice> <guimenu>編集(E)</guimenu> <guimenuitem>タスクを利用してパッケージにマークする(T)…</guimenuitem> </menuchoice>とメニューを辿ります) からもタスクにアクセスする事が可能です。

source: Aptitude is an interface to APT in full-screen text mode. It allows the user to browse the list of available packages according to various categories (installed or not-installed packages, by task, by section, etc.), and to view all of the information available on each of them (dependencies, conflicts, description, etc.). Each package can be marked “install” (to be installed, <keycap>+</keycap> key) or “remove” (to be removed, <keycap>-</keycap> key). All of these operations will be conducted simultaneously once you've confirmed them by pressing the <keycap>g</keycap> key (“g” for “go!”). If you have forgotten some programs, no worries; you will be able to run <command>aptitude</command> again once the initial installation has been completed.
id_id: Aptitude ialah interaktif untuk APT dalam mode teks layar-penuh. Memungkinkan pengguna untuk menjelajah daftar paket tersedia berdasarkan berbagai kategori (paket terinstall atau tak terinstall, berdasarkan task, pilihan, dll.), dan menampilkan seluruh setiap paket informasi yang tersedia (ketergantungan, konflik, penjelasan, dll.). Setiap paket dapat ditandai “install” (untuk diinstall, tombol <keycap>+</keycap>), atau “remove” (untuk dibuang, tombol <keycap>-</keycap>). Seluruh operasi ini dapat dilakukan secara simultan setelah Anda mengonfirmasi dengan menekan tombol <keycap>g</keycap> (“g” untuk “go!”). Jika Anda lupa beberapa program, tak usah khawatir, Anda akan dapat menjalankann <keycap>aptitude</keycap> lagi setelah instalasi tadi telah selesai.
ja_jp: aptitude は全画面のテキストモードで動く APT へのインターフェースです。aptitude を使えば、さまざまなカテゴリ (インストール済み、未インストールのパッケージ、タスク、セクションなど) に従って利用可能なパッケージのリストを閲覧したり、各パッケージに対して利用可能なすべての情報 (依存パッケージ、衝突、説明など) を確認できます。各パッケージに対して「インストール」(インストールされます、<keycap>+</keycap> キー) または「削除」(削除されます、<keycap>-</keycap> キー) をマークできます。これらの操作は、<keycap>g</keycap> キー (「go!」の「g」) を押して確認したら、一斉に実行されます。インストールし忘れたパッケージがあっても、心配ありません; 最初のインストールが完了したら、再度 <command>aptitude</command> を実行できます。

source: <emphasis>TIP</emphasis> Debian thinks of speakers of non-English languages
id_id: <emphasis>TIP</emphasis> Debian memikirkan pengucap selain bahasa Inggris
ja_jp: <emphasis>TIP</emphasis> Debian は非英語言語話者に配慮しています

source: Several tasks are dedicated to the localization of the system in other languages beyond English. They include translated documentation, dictionaries, and various other packages useful for speakers of different languages. The appropriate task is automatically selected if a non-English language was chosen during installation.
id_id: Beberapa tugas didedikasikan untuk lokalisasi sistem dalam bahasa selain bahasa Inggris. Mereka menyertakan dokumentasi yang diterjemahkan, kamus, dan berbagai paket bahasa yang berguna untuk penutur yang berbeda bahasa. Tugas yang sesuai secara otomatis terpilih jika bahasa selain bahasa Inggris telah dipilih selama instalasi.
ja_jp: 英語でない他の言語向けにシステムを地域化するためのタスクが用意されています。その中には、翻訳された文書、辞書、異なる言語の話者に便利な様々な他のパッケージが含まれています。インストール中に非英語言語を選択した場合には、適切なタスクが自動的に選択されます。

source: <emphasis>CULTURE</emphasis> <command>dselect</command>, the old interface to install packages
id_id: <emphasis>KULTUR</emphasis> <command>dselect</command>, antarmuka lama untuk menginstall paket
ja_jp: <emphasis>CULTURE</emphasis> <command>dselect</command>、パッケージをインストールする古いインターフェース

source: Before <command>aptitude</command>, the standard program to select packages to be installed was <command>dselect</command>, the old graphical interface associated with <command>dpkg</command>. A difficult program for beginners to use, it is not recommended.
id_id: Sebelum <command>aptitude</command>, program standar untuk memilih paket ialah <command>dselect</command>, antarmuka grafis lama terkait dengan <command>dpkg</command>. Program yang sulit digunakan oleh pemula, program ini tidak direkomendasikan.
ja_jp: <command>aptitude</command> 以前、インストールするパッケージを選択するための標準的なプログラムは <command>dselect</command> で、これは <command>dpkg</command> に対する古いグラフィカルインターフェースでした。これは初心者には使い難いプログラムで、推奨しません。

source: Of course, it is possible not to select any task to be installed. In this case, you can manually install the desired software with the <command>apt-get</command> or <command>aptitude</command> command (which are both accessible from the command line).
id_id: Tentu saja, memungkinkan untuk tidak memilih tugas untuk diinstall. Dalam kasus ini, Anda dapat menginstall secara manual perangkat lunak yang diinginkan dengan perintah <command>apt-get</command> atau <command>aptitude</command> (yang dapat diakses dari baris perintah).
ja_jp: もちろん、すべてのタスクを選択しない事も可能です。その場合、<command>apt-get</command> や <command>aptitude</command> コマンド (両方ともコマンドラインから利用できます) を使って必要なソフトウェアを手作業でインストールします。

source: <emphasis>VOCABULARY</emphasis> Package dependencies, conflicts
id_id: <emphasis>KOSA KATA</emphasis> Ketergantungan paket, konlik
ja_jp: <emphasis>VOCABULARY</emphasis> パッケージの依存関係と衝突

source: In the Debian packaging lingo, a “dependency” is another package necessary for the proper functioning of the package in question. Conversely, a “conflict” is a package that can not be installed side-by-side with another.
id_id: Dalam bahasa khas paket Debian, “ketergantungan” ialah paket lain yang diperlukan agar suatu paket dapat berfungsi dengan baik. Sebaliknya, “konflik” ialah paket yang tidak dapat diinstall berdampingan dengan paket lain.
ja_jp: Debian パッケージの用語として、「依存」は対象のパッケージが適切に動作するために必要な他のパッケージを意味しています。逆に、「衝突」は対象のパッケージと共存してインストールできない他のパッケージを意味しています。

source: These concepts are discussed in greater detail in <xref linkend="packaging-system" />.
id_id: Konsept ini dibahas lebih detil di <xref linkend="packaging-system" />
ja_jp: これらの概念は<xref linkend="packaging-system" />で詳しく議論されています。

source: Upgrading the System
id_id: Mengupgrade sistem
ja_jp: システムのアップグレード

source: A first <command>aptitude safe-upgrade</command> (a command used to automatically update installed programs) is generally required, especially for possible security updates issued since the release of the latest Debian stable version. These updates may involve some additional questions through <command>debconf</command>, the standard Debian configuration tool. For further information on these updates conducted by <command>aptitude</command>, please refer to <xref linkend="sect.apt-upgrade" />.
id_id: Sebagai permulaan <command>aptitude safe-upgrade</command> (perintah yang digunakan untuk memerbarui program terinstall) umumnya diperlukan, khususnya pembaruan keamanan yang ditemukan ketika rilis terkini versi stable Debian. Pembaruan ini mungkin melibatkan beberapa pertanyaan melalui <command>debconf</command>, alat konfigutasi standar Debian. Untuk informasi lebih jauh mengenai pembaruan ini dilakukan oleh <command>aptitude</command>, silahkan merujuk ke <xref linkend="sect.apt-upgrade" />.
ja_jp: 一般的に言えば、まず最初に <command>aptitude safe-upgrade</command> (インストールされたプログラムを自動的に更新するコマンド) を実行する事をお勧めします。特に最新の Debian 安定版バージョンのリリース以降に発表されたセキュリティ更新を適用しなければいけません。更新の際に、標準的な Debian 設定ツールである <command>debconf</command> を使ってで追加的な質問をされるかもしれません。<command>aptitude</command> を使った更新に関する詳しい情報は、<xref linkend="sect.apt-upgrade" />を参照してください。
