Repository: Neamar/KISS
Catalog: */04_installation.po
Languages: id_id, ja_jp

source: This technique works in a very simple way: each volume, whether physical or logical, is split into blocks of the same size, which are made to correspond by LVM. The addition of a new disk will cause the creation of a new physical volume, and these new blocks can be associated to any volume group. All of the partitions in the volume group that is thus expanded will have additional space into which they can extend.
id_id: Teknik ini bekerja dengan cara sederhana: setiap volume, entah itu fisikal atau logikal, dibagi pada blok dengan ukuran sama, yang dibuat sesuai oleh LVM. Penambahan cakram baru akan mengakibatkan pembuatan volumen fisikal baru, dan blok baru ini dapat diasosiasikan pada beberapa grup volume. Seluruh partisi pada grup volume yang diperluas akan memiliki ruang tambahan ke dalam grup yang dapat diperluas.
ja_jp: この技法はとても単純な方法で実現されています: それぞれのボリュームは、物理でも論理でも、同じサイズのブロックに分割され、ブロックは LVM に対応付けられます。新しいディスクを追加すると新しい物理ボリュームの作成が必要で、新しいブロックは任意のボリュームグループに関連付ける事が可能です。拡張されたボリュームグループ内のすべてのパーティションは、ディスク領域の許す限り拡張する事が可能です。

source: The partitioning tool configures LVM in several steps. First you must create on the existing disks the partitions that will be “physical volumes for LVM”. To activate LVM, you need to choose “Configure the Logical Volume Manager (LVM)”, then on the same configuration screen “Create a volume group”, to which you will associate the existing physical volumes. Finally, you can create logical volumes within this volume group. Note that the automatic partitioning system can perform all these steps automatically.
id_id: Alat pemartisi mengonfigurasi LVM pada beberapa langkah. Pertama Anda harus membuat cakram yang ada partisi yang akan menjadi “volume fisikal untuk LVM”, Anda perlu memilih “Mengonfigurasi Logical Volume Manager (LVM)”, kemudian pada layar konfigurasi yang sama “Buat group volume”, ke yang akan diasosiasikan volume fisikal yang sudah ada. Akhirnya, Anda dapat membuat volume logikal denga grup volume ini. Catatan bahwa sistem pemartisi otomatis dapat melakukan seluruh langkah ini secara otomatis.
ja_jp: パーティショニングツールは数段階で LVM を設定します。最初に、存在するディスク上に「LVM 用の物理ボリューム」となるパーティションを作成しなければいけません。LVM を稼働するためには、「論理ボリュームマネージャ (LVM) を設定」を選び、同じ設定画面で「ボリュームグループを作成」から、存在する物理ボリュームを関連付けてください。最後に、このボリュームグループ内に論理ボリュームを作成してください。自動パーティショニングシステムは全段階を自動的に実行できます。

source: In the partitioning menu, each physical volume will appear as a disk with a single partition which can not be deleted, but that you can use as desired.
id_id: Pada menu pemartisi, setiap volume fisikal akan nampak sebagai cakram dengan satu partisi yang tidak dapat dihapus, namun dapat Anda gunakan sesuka Anda.
ja_jp: パーティショニングメニューでは、各物理ボリュームは削除できない単一のパーティションを持つディスクとして表示されますが、望み通り使う事が可能です。

source: The usage of LVM is described in further detail in <xref linkend="sect.lvm" />.
id_id: Penggunaan LVM dijelaskan lebih detail pada <xref linkend="sect.lvm" />.
ja_jp: LVM の使い方については<xref linkend="sect.lvm" />で詳しく説明されています。

source: Setting Up Encrypted Partitions
id_id: Mengatur Partisi Terenkripsi
ja_jp: 暗号化されたパーティションを設定

source: <primary>partition</primary><secondary>encrypted</secondary>
id_id: <primary>partisi</primary><secondary>terenkripsi</secondary>
ja_jp: <primary>パーティション</primary><secondary>暗号化</secondary>

source: <primary>partition encryption</primary>
id_id: <primary>enkripsi partisi</primary>
ja_jp: <primary>パーティションの暗号化</primary>

source: <primary>confidentiality</primary><secondary>files</secondary>
id_id: <primary>kerahasiaan</primary><secondary>berkas</secondary>
ja_jp: <primary>機密</primary><secondary>ファイル</secondary>

source: <primary>file</primary><secondary>confidentiality</secondary>
id_id: <primary>berkas</primary><secondary>kerahasiaan</secondary>
ja_jp: <primary>ファイル</primary><secondary>機密</secondary>

source: To guarantee the confidentiality of your data, for instance in the event of the loss or theft of your computer or a hard drive, it is possible to encrypt the data on some partitions. This feature can be added underneath any filesystem, since, as for LVM, Linux (and more particularly the dm-crypt driver) uses the Device Mapper to create a virtual partition (whose content is protected) based on an underlying partition that will store the data in an encrypted form (thanks to LUKS, Linux Unified Key Setup, a standard format that enables the storage of encrypted data as well as meta-information that indicates the encryption algorithms used).
id_id: Untuk menjamin kerahasiaan data Anda, misalnya ketika kehilangan atau pencurian komputer atau hard drive Anda, adalah mungkin untuk mengenkripsi data pada beberapa partisi. Fitur ini dapat ditambahkan di bawah beberapa sistem berkas, misalnya, untuk LVM, Linux (dan khususnya penggerak dm-crypt) menggunakan Device Mapper untuk membuat partisi virtual (yang isinya diproteksi) berdasarkan pada partisi pokok yang akan menyimpan data dalam bentuk terenkripsi (terima kasih untuk LUKS, Linux Unified Key Setup, format standar yang mengaktifkan enkripsi data pada penyimpanan sebagaimana informasi-meta yang menunjukkan penggunaan algoritma enkripsi).
ja_jp: データの機密性を保証するには、例えばコンピュータやバードドライブを紛失したり盗難された時に備えて、一部のパーティションのデータを暗号化しておく必要があります。暗号化の可否はファイルシステムの種類に依存しません。なぜなら、LVM と同様に、Linux (より具体的にいえば dm-crypt ドライバ) は暗号化された形でデータを保存する下層のパーティションに仮想パーティション (この内容が保護されます) を作成するために、デバイスマッパを使っているからです (LUKS、Linux Unified Key Setup、のお陰で標準的なフォーマットが定められ、暗号化されたデータおよび使われている暗号化アルゴリズムを表すメタ情報の保存を可能になりました)。

source: <emphasis>SECURITY</emphasis> Encrypted swap partition
id_id: <emphasis>KEAMANAN</emphasis> Partisi swap terenkripsi
ja_jp: <emphasis>SECURITY</emphasis> 暗号化されたスワップパーティション

source: When an encrypted partition is used, the encryption key is stored in memory (RAM). Since retrieving this key allows the decryption of the data, it is of utmost importance to avoid leaving a copy of this key that would be accessible to the possible thief of the computer or hard drive, or to a maintenance technician. This is however something that can easily occur with a laptop, since when hibernating the contents of RAM is stored on the swap partition. If this partition isn't encrypted, the thief may access the key and use it to decrypt the data from the encrypted partitions. This is why, when you use encrypted partitions, it is imperative to also encrypt the swap partition!
id_id: Ketika enkripsi partisi digunakan, kunci enkripsi tersimpan di memori (RAM). Karena pengambilan kunci memungkinkan dekripsi data, sangat pentin untuk menghindari meninggalkan salinan kunci ini yang mungkin dapat diakses oleh pencuri komputer atau hard drive, atau teknisi pemeliharaan. Inilah mengapa sesuatu yang sangat mudah terjadi ketika laptop, karena ketika hibernasi isi RAM tersimpan pada partisi swap. Jika partisi tidak terenkripsi, pencuri mungkin dapat mengakses kodenya dan menggunakannya untuk mendekripsi data dari partisi yang terenkripsi. Inilah alasannya, ketika Anda menggunakan partisi terenkripsi, sangat penting juga untuk mengenkripsi partisi swap!
ja_jp: 暗号化されたパーティションを使う場合、暗号化鍵はメモリ (RAM) の中に保存されています。暗号化鍵が入手できればデータの復号化が可能になります。コンピュータやハードドライブの泥棒もしくは保守管理技術者に暗号化鍵の複製を入手できないようにするには、これを残さないようにする事が最も重要です。しかしながらこれはラップトップでは簡単に起こりうる事です。なぜなら、ハイバネーションの際に RAM の内容はスワップパーティションに保存されるからです。もしスワップパーティションが暗号化されていなければ、泥棒は鍵を入手して、暗号化されたパーティションのデータを復号化するかもしれません。このため、暗号化されたパーティションを使うなら、スワップパーティションの暗号化も欠かせません!

source: The Debian installer will warn the user if they try to make an encrypted partition while the swap partition isn't encrypted.
id_id: Installer Debian akan memeringatkan pengguna jika mereka mencoba untuk membuat partisi terenkripsi namun partisi swap tidak dienkripsi.
ja_jp: Debian インストーラはスワップパーティションが暗号化されていないにも関わらず暗号化されたパーティションを作ろうとしたらユーザに警告します。

source: To create an encrypted partition, you must first assign an available partition for this purpose. To do so, select a partition and indicate that it is to be used as a “physical volume for encryption”. After partitioning the disk containing the physical volume to be made, choose “Configure encrypted volumes”. The software will then propose to initialize the physical volume with random data (making the localization of the real data more difficult), and will ask you to enter an “encryption passphrase”, which you will have to enter every time you boot your computer in order to access the content of the encrypted partition. Once this step has been completed, and you have returned to the partitioning tool menu, a new partition will be available in an “encrypted volume”, which you can then configure just like any other partition. In most cases, this partition is used as a physical volume for LVM so as to protect several partitions (LVM logical volumes) with the same encryption key, including the swap partition (see sidebar).
id_id: Untuk membuat partisi terenkripsi, Anda harus menentukan partisi yang tersedia untuk tujuan ini. Untuk melakukannya, memilih partisi dan menunjukkan bahwa digunakan sebagai “volume fisikal untuk enkripsi”. Setelah membuat partisi carkran merbsi volume fisikal, pilih “Konfigurasi volume terenkripsi”. Perangkat lunak kemudian akan mengajukan inisialisasi volume fisikal dengan data acak (membuat lokalisasi data yang nyata menjadi lebih sulit), dan akan meminta anda untuk memasukkan sebuah “passphrase enkripsi”, yang harus Anda masukkan setiap Anda memboot komputer agar mengakses isi dari partisi terenkripsi. Sekali langkah ini terlewati, dan Anda telah kembali pada menu alat pemartisian, partisi baru akan tersedia di “volume terenkripsi”, yang kemudian dapat Anda konfigurasi seperti partisi lainnya. Dalam banyak kasus, partisi ini digunakan sebagai volume fisikal untuk LVM jadi seperti memroteksi beberapa partisi (volume logikal LVM) dengan kunci enkripsi yang sama, termasuk partisi swap (lihat bilah sisi).
ja_jp: 暗号化されたパーティションを作成するには、最初にあるパーティションを暗号化用に割り当てなければいけません。割り当てを行うには、パーティションを選択し「暗号化用の物理パーティション」として使うように設定してください。物理ボリュームを含むディスクのパーティショニングの後、「暗号化ボリュームを設定」を選んでください。ソフトウェアは (真のデータの位置をより分かりにくくするために) 物理ボリュームをでたらめなデータで初期化する事を提案し、「暗号化パスフレーズ」の入力を要求します。暗号化されたパーティションの内容にアクセスする場合、パスフレーズはコンピュータの起動時に毎回入力しなければいけません。この段階が完了しパーティショニングツールメニューまで戻ったら、新しいパーティションを「暗号化ボリューム」で利用できるはずです、これは他のパーティションと同様に設定できます。多くの場合、複数のパーティション (LVM 論理ボリューム) をスワップパーティションも含めて (傍注参照) 同じ暗号化鍵で保護するために暗号化されたパーティションは LVM の物理ボリュームとして利用されます。

source: Installing the Base System
id_id: Menginstall Basis Sistem
ja_jp: ベースシステムのインストール

source: <primary>system</primary><secondary>base</secondary>
id_id: <primary>sistem</primary><secondary>basis</secondary>
ja_jp: <primary>システム</primary><secondary>基本</secondary>

source: This step, which doesn't require any user interaction, installs the Debian “base system” packages. This includes the <command>dpkg</command> and <command>apt</command> tools, which manage Debian packages, as well as the utilities necessary to boot the system and start using it.
id_id: Langkah ini, yang tidak memerlukan interaksi penggunak, menginstall paket Debian “sistem dasar”. Termasuk alat <command>dpkg</command> dan <command>apt</command>, yang mengatur paket Debian, sebagaimana yang diperlukan untuk memboot sistem dan mulai menggunakannya.
ja_jp: この段階ではユーザの入力は不要で、Debian の「ベースシステム」パッケージをインストールします。ベースシステムには Debian パッケージを管理する <command>dpkg</command> と <command>apt</command> ツールだけでなく、システムを起動させてシステムを使うのに必要なユーティリティが含まれています。

source: Installation of the base system
id_id: Menginstall sistem dasar
ja_jp: ベースシステムのインストール

source: Configuring the Package Manager (<command>apt</command>)
id_id: Mengonfigurasi Manajer Paket (<command>apt</command>)
ja_jp: パッケージマネージャ (<command>apt</command>) の設定

source: <primary>configuration</primary><secondary>initial configuration of APT</secondary>
id_id: <primary>konfigurasi</primary><secondary>konfigurasi awal APT</secondary>
ja_jp: <primary>設定</primary><secondary>APT の初期設定</secondary>

source: <primary>APT</primary><secondary>initial configuration</secondary>
id_id: <primary>APT</primary><secondary>konfigurasi awal</secondary>
ja_jp: <primary>APT</primary><secondary>初期設定</secondary>

source: In order to be able to install additional software, APT needs to be configured and told where to find Debian packages. This step is as automated as possible. It starts with a question asking if it must use a network source for packages, or if it should only look for packages on the CD-ROM.
id_id: Agar dapat menginstall paket perangkat lunak tambahan, APT perlu dikonfigurasi dan diberi tahu dimana lokasi paket Debian. Langkah ini mungkin terotomasi. Dimulai dengan pertanyaan jika harus menggunakan sumber jaringan untuk paket, atau hanya melihat paket yang ada pada CD-ROM.
ja_jp: 追加ソフトウェアをインストール可能にするためには、APT を設定し、Debian パッケージを探す場所を決めなければいけません。この段階は可能な限り自動化されています。パッケージを探す場所をネットワークソースにするか、CD-ROM だけにするかを尋ねる質問から始まります。

source: <emphasis>NOTE</emphasis> Debian CD-ROM in the drive
id_id: <emphasis>CATATAN</emphasis> CD-ROM Debian di drive
ja_jp: <emphasis>NOTE</emphasis> ドライブ中の Debian CD-ROM

source: If the installer detects a Debian installation disk in the CD/DVD reader, it is not necessary to configure APT to go looking for packages on the network: APT is automatically configured to read packages from a removable media drive. If the disk is part of a set, the software will offer to “explore” other disks in order to reference all of the packages stored on them.
id_id: Jika installer mendeteksi cakram instalasi Debian pada pembaca CD/DVD, tidak perlu mengonfigurasi APT untuk mencari paket pada jaringan: APT secara otomatis dikonfigurasi untuk membaca paket dari drive removable media. Jika cakram termasuk bagiannya, perangkat lunak akan menawarkan untuk “menjelajah” cakram lain agar mereferensikan seluruh paket yang tersimpan di dalamnya.
ja_jp: インストーラが CD/DVD ドライブに Debian のインストールディスクを検出した場合、ネットワーク上のパッケージを探しに行くように APT を設定する必要はありません: APT は自動的にリムーバブルメディアドライブからパッケージを読むように設定します。このディスクがセットの一部だった場合、ソフトウェアは他のディスクに収められているすべてパッケージを参照するために他のディスクを「探索」する事を提案するでしょう。

source: If getting packages from the network is requested, the next two questions allow to choose a server from which to download these packages, by choosing first a country, then a mirror available in that country (a mirror is a public server hosting copies of all the files of the Debian master archive).
id_id: Jika diminta untuk mendapatkan paket dari jaringan, dua pertanyaan selanjutnya memungkinkan untuk memilih server mana untuk mengunduh paket tersebut, pertama dengan memilih negara, kemudian cermin yang tersedia pada negara tersebut (sebuah cermin ialah salinan hosting server publik seluruh berkas arsip master Debian).
ja_jp: ネットワークからパッケージを取得する事を選んだ場合、次の 2 つの質問で国とその国で利用できるミラーを選択し、パッケージをダウンロードするサーバを選びます (ミラーとは Debian マスターアーカイブにあるファイルのコピーをホストしている公開サーバです)。

source: Selecting a Debian mirror
id_id: Memilih mirror Debian
ja_jp: Debian ミラーの選択

source: Finally, the program proposes to use an HTTP proxy. If there is no proxy, Internet access will be direct. If you type <literal>http://proxy.falcot.com:3128</literal>, APT will use the Falcot <foreignphrase>proxy/cache</foreignphrase>, a “Squid” program. You can find these settings by checking the configurations of a web browser on another machine connected to the same network.
id_id: Akhirnya, program menawarkan untuk menggunakan proxy HTTP. Jika tidak ada proxy, akses Internet akan langsung. Jika Anda mengetik <literal>http://proxy.falcot.com:3128</literal>, APT akan menggunakan <foreignphrase>proxy/cache</foreignphrase> Falcot, sebuah program “Squid”. Anda dapat menemukan pengaturan ini dengan memeriksa konfigurasi peramban web pada mesin lain yang terhubung pada jaringan yang sama.
ja_jp: 最後にプログラムは HTTP プロキシを使う事を提案します。プロキシを使わなければ、インターネットに直接アクセスします。<literal>http://proxy.falcot.com:3128</literal> と入力した場合、APT は Falcot の<foreignphrase>プロキシ/キャッシュ</foreignphrase>である「Squid」プログラムを使うでしょう。これらの設定を見つけるには、同じネットワークに接続された別のマシンでウェブブラウザの設定を確認してみてください。

source: The files <filename>Packages.gz</filename> and <filename>Sources.gz</filename> are then automatically downloaded to update the list of packages recognized by APT.
id_id: Berkas <filename>Packages.gz</filename> dan <filename>Sources.gz</filename> kemudian diunduh secara otomatis untuk memerbarui daftar paket yang dikenali oleh APT.
ja_jp: APT は <filename>Packages.gz</filename> と <filename>Sources.gz</filename> ファイルを自動的にダウンロードし、認識するパッケージのリストを更新します。

source: <emphasis>BACK TO BASICS</emphasis> HTTP proxy
id_id: <emphasis>KEMBALI KE DASAR</emphasis> Proxy HTTP
ja_jp: <emphasis>BACK TO BASICS</emphasis> HTTP プロキシ

source: <primary>proxy</primary>
ja_jp: <primary>プロキシ</primary>

source: <primary>proxy cache</primary>
ja_jp: <primary>プロキシキャッシュ</primary>

source: <primary>cache, proxy</primary>
ja_jp: <primary>キャッシュ、プロキシ</primary>

source: An HTTP proxy is a server that forwards an HTTP request for network users. It sometimes helps to speed up downloads by keeping a copy of files that have been transferred through it (we then speak of proxy/cache). In some cases, it is the only means of accessing an external web server; in such cases it is essential to answer the corresponding question during installation for the program to be able to download the Debian packages through it.
id_id: Proxy HTTP ialah server yang meneruskan permintaan HTTP untuk jaringan pengguna. Terkadang hal ini membantu memercepat unduhan dengan menyimpan salinan berkas yang telah ditransfer melaluinya (kemudian kita bicara pada proxy/cache). Pada beberapa kasus, ini hanya bermaksud mengakses sebuah web server eksternal; pada sebuah kasus sangat perlu menjawab pertanyaan yang sesuai sepanjang instalasi program agar dapat mengunduh paket Debian melaluinya.
ja_jp: HTTP プロキシはネットワークユーザの HTTP 要求を転送するサーバです。プロキシは転送したファイルのコピーを保存することでダウンロードの高速化に寄与する場合があります (そのためこれはプロキシ/キャッシュと呼ばれます)。時として、プロキシは外部のウェブサーバにアクセスする唯一の手段である場合があります; このような場合、必ずインストール中のプロキシ関連の質問に答えてください。そうすれば、プログラムはプロキシを通じて Debian パッケージをダウンロードできるようになります。

source: Squid is the name of the server software used by Falcot Corp to offer this service.
id_id: Squid ialah nama perangkat lunak server yang digunakan Falcot Corp untuk menawarkan layanan ini.
ja_jp: Squid は Falcot Corp がプロキシサービスを提供するために使っているサーバソフトウェアの名前です。

source: Debian Package Popularity Contest
id_id: Paket Debian Kontes Popularitas
ja_jp: Debian パッケージ人気コンテスト

source: The Debian system contains a package called <emphasis role="pkg">popularity-contest</emphasis>, whose purpose is to compile package usage statistics. Each week, this program collects information on the packages installed and those used recently, and anonymously sends this information to the Debian project servers. The project can then use this information to determine the relative importance of each package, which influences the priority that will be granted to them. In particular, the most “popular” packages will be included in the installation CD-ROM, which will facilitate their access for users who do not wish to download them or to purchase a complete set.
id_id: Sistem Debian berisi paket yang disebut <emphasis role="pkg">popularity-contest</emphasis>, yang bertujuan untuk menyusun statistik penggunaan paket. Setiap minggu, program ini mengumpulkan informasi paket yang terinstall dan yang baru digunakan, dan mengirim informasi ini ke server Debian secara tanpa nama. Proyek dapat menggunakan informasi ini untuk menentukan kepentingan relatif setiap paket, yang memengaruhi prioritas yang akan diberikan padanya. Khususnya paket yang paling “populer” akan disertakan pada CD-ROM instalasi, yang akan menfasilitasi akses mereka yang tidak ingin mengunduh atau membeli set lengkap.
ja_jp: Debian システムには <emphasis role="pkg">popularity-contest</emphasis> と呼ばれるパッケージが含まれています。<emphasis role="pkg">popularity-contest</emphasis> はパッケージの使用統計を収集するためのパッケージです。毎週、このプログラムはインストール済みパッケージと最近利用されたパッケージの情報を収集し、この情報を匿名で Debian プロジェクトのサーバに送信します。Debian プロジェクトはこの情報を基に各パッケージの相対的重要度を決定します。パッケージの相対的重要度はパッケージの優先度に影響を与えます。特に、インストールメディアの完全なセットをダウンロードまたは購入したくないというユーザの利便性を考慮して、インストール CD-ROM に収録されるパッケージは最も「人気」のパッケージだけに限られています。

source: This package is only activated on demand, out of respect for the confidentiality of users' usage.
id_id: Paket ini hanya diaktifkan ketika diminta, untuk menghargai kerahasiaan penggunaan pengguna.
ja_jp: このパッケージは、ユーザの利用法の機密性を配慮して、要求されない限りインストールされません。

source: Selecting Packages for Installation
id_id: Memilih Paket untuk Diinstall
ja_jp: インストールするパッケージの選択

source: The following step allows you to choose the purpose of the machine in very broad terms; the ten suggested tasks correspond to lists of packages to be installed. The list of the packages that will actually be installed will be fine-tuned and completed later on, but this provides a good starting point in a simple manner.
id_id: Langkah selanjutnya mengizinkan Anda untuk memilih tujuan mesin dalam istilah yang sangat luas; sepuluh saran tugas menyesuaikan daftar paket yang akan diinstall. Daftar paket yang akan diinstall akan disempurnakan dan dilengkapi kemudian, namun ini menyediakan permulaan yang bagus dalam cara yang sederhana.
ja_jp: 以降の段階では、マシンの大まかな用途を選択します; ここで提案されている 10 個のタスクはインストールされるパッケージのリストに対応しています。後からインストールするパッケージを微調整したり仕上げる必要があるという点は変わりませんが、ここでタスクを選択して必要と思われるパッケージインストールしておくことは後の作業の良い足がかりとなります。

source: Some packages are also automatically installed according to the hardware detected (thanks to the program <command>discover-pkginstall</command> from the <emphasis role="pkg">discover</emphasis> package). For instance, if a VirtualBox virtual machine is detected, the program will install the <emphasis role="pkg">virtualbox-ose-guest-dkms</emphasis> package, allowing for better integration of the virtual machine with the host system.
id_id: Beberapa paket juga diinstall secara otomatis berdasarkan perangkat kerang yang terdeteksi (terima kasih program <command>discover-pkginstall</command> dari paket <emphasis role="pkg">discover</emphasis>). Misalnya, jika mesin virtual VirtualBox terdeteksi, program akan menginstall paket <emphasis role="pkg">virtualbox-ose-guest-dkms</emphasis>, mengizinkan integrasi yang lebih baik antara mesin virtual dengan sistem host.
ja_jp: 一部のパッケージは、検出されたハードウェアに基づき、自動的にインストールされます (<emphasis role="pkg">discover</emphasis> パッケージの <command>discover-pkginstall</command> プログラムがこれを担当します)。例えば、VirtualBox 仮想マシンが検出されたら、プログラムは <emphasis role="pkg">virtualbox-ose-guest-dkms</emphasis> パッケージをインストールします。このパッケージは仮想マシンをホストシステムと上手く統合するためのものです。

source: Task choices
id_id: Pilihan tugas
ja_jp: タスクの選択

source: Installing the GRUB Bootloader
id_id: Menginstall Bootloader GRUB
ja_jp: GRUB ブートローダのインストール

source: The bootloader is the first program started by the BIOS. This program loads the Linux kernel into memory and then executes it. It often offers a menu that allows the user to choose the kernel to load and/or the operating system to boot.
id_id: Bootloader ialah program pertama yang dimulai oleh BIOS. Program ini memuat kernel Linux ke dalam memori kemudian mengeksekusinya. Seringkali menawarkan menu yang meungkinkan pengguna untuk memilih kernel untuk dimuat dan/atau sistem operasi yang diboot.
ja_jp: ブートローダは BIOS が起動する最初のプログラムです。ブートローダは Linux カーネルをメモリに読み込み、実行します。通常ブートローダはユーザに対して、読み込むカーネルまたは起動したいオペレーティングシステムを選択できるメニューを表示します。

source: <emphasis>BEWARE</emphasis> Bootloader and dual boot
id_id: <emphasis>HATI-HATI</emphasis> Bootloader dan dual boot
ja_jp: <emphasis>BEWARE</emphasis> ブートローダとデュアルブート

source: This phase in the Debian installation process detects the operating systems that are already installed on the computer, and automatically adds corresponding entries in the boot menu, but not all installation programs do this.
id_id: Pada fase ini instalasi Debian mendeteksi sistem operasi yang telah terinstall di komputer, dan secara otomatis menambahkannya pada menu boot, namun tidak semua program instalasi melakukan ini.
ja_jp: Debian インストール作業では、この段階でコンピュータに既にインストールされたオペレーティングシステムを検出し、関連するエントリをブートメニューに自動的に追加します。しかし、中にはこのような作業を行わないインストールプログラムもあります。
