Repository: Neamar/KISS
Catalog: */04_installation.po
Languages: id_id, ja_jp

source: With the contents of the CD now available, the installer loads all the files necessary to continue with its work. This includes additional drivers for the remaining hardware (especially the network card), as well as all the components of the installation program.
id_id: Sekarang konten CD telah tersedia, installer memuat seluruh berkas yang diperlukan untuk melanjutkan pekerjaannya. Termasuk penggerak tambahannya untuk perangkat keras selanjutnya (khususnya kartu jaringan), sebagaimana komponen program instalasi.
ja_jp: CD の内容が利用可能になったら、インストーラは以降の作業に必要なすべてのファイルを読み込みます。これには、残りのハードウェア (特にネットワークカード) 用の追加ドライバおよびインストールプログラムの構成要素が含まれます。

source: Detecting Network Hardware
id_id: Mendeteksi Perangkat Keras Jaringan
ja_jp: ネットワークハードウェアの検出

source: This automatic step tries to identify the network card and load the corresponding module. If automatic detection fails, you can manually select the module to load. If no module works, it is possible to load a specific module from a removable device. This last solution is usually only needed if the appropriate driver is not included in the standard Linux kernel, but available elsewhere, such as the manufacturer's website.
id_id: Langkah otomatis ini mencoba mengidentifikasi kartu jaringan dan memuat modul yang sesuai. Jika deteksi otomatis gagal, Anda dapat memilih modul untuk dimuat secara manual. Jika tidak ada modul yang bekerja, masih memungkinkan untuk memuat modul spesifik dari perangkat removable. Solusi terakhir ini biasanya hanya diperlukan jika penggerak yang cocok tidak disertakan dalam kernel Linux standar, namun tersedia di tempat lain, misalnya website pabriknya.
ja_jp: この段階でインストーラは、ネットワークカードを自動的に特定し、関連するモジュールを自動的に読み込もうとします。自動検出に失敗した場合でも、手作業で読み込むモジュールを選択できます。どのモジュールでも動かなければ、リムーバブルデバイスから個々のモジュールをロードする事が可能です。最後に挙げた解決策は、適切なドライバが標準的な Linux カーネルには含まれていないけれども、メーカーのウェブサイトなど別のどこかから入手可能、という場合のみ必要です。

source: This step must absolutely be successful for <emphasis>netinst</emphasis> installations, since the Debian packages must be loaded from the network.
id_id: Langkah ini seharusnya sangat berhasil untuk istalasi <emphasis>netinst</emphasis>, karena paket Debian harus dimuat dari jaringan.
ja_jp: <emphasis>netinst</emphasis> を使ってインストールする場合、Debian パッケージはネットワークから読み込まれるため、この段階は間違いなく成功するでしょう。

source: Configuring the Network
id_id: Mengonfigurasi Jaringan
ja_jp: ネットワーク設定

source: <primary>configuration</primary><secondary>network</secondary><tertiary>static</tertiary>
id_id: <primary>konfigurasi</primary><secondary>jaringan</secondary><tertiary>statik</tertiary>
ja_jp: <primary>設定</primary><secondary>ネットワーク</secondary><tertiary>静的</tertiary>

source: <primary>configuration</primary><secondary>network</secondary><tertiary>DHCP</tertiary>
id_id: <primary>konfigurasi</primary><secondary>jaringan</secondary><tertiary>DHCP</tertiary>
ja_jp: <primary>設定</primary><secondary>ネットワーク</secondary><tertiary>DHCP</tertiary>

source: In order to automate the process as much as possible, the installer attempts an automatic network configuration by DHCP (for IPv4) and by IPv6 network discovery. If this fails, it offers more choices: try again with a normal DHCP configuration, attempt DHCP configuration by declaring the name of the machine, or set up a static network configuration.
id_id: Untuk sebanyak mungkin mengotomasi proses, installer berusaha mengotomasi konfigurasi jarigan dengan DHCP (untuk IPv4) dan dengan menemukan jaringan IPv4, Jika ini gagal, akan menawarkan pilihan lainnya: coba lagi dengan konfigurasi DHCP normal, mencoba konfigurasi DHCP dengan mendeklarasikan nama mesin, atau atur konfigurasi jaringan statis.
ja_jp: 可能な限り各段階を自動化するために、インストーラは DHCP (IPv4 の場合) と IPv6 のネットワーク発見機能を使って自動ネットワーク設定を行います。これに失敗した場合、多くの選択肢が提案されます: 通常の DHCP 設定で再挑戦、マシンの名前を宣言して DHCP を設定、静的なネットワークを設定。

source: This last option requires an IP address, a subnet mask, an IP address for a potential gateway, a machine name, and a domain name.
id_id: Pilihan terakhir ii memerlukan sebuah alamat IP, sebuah subnet mask, dan alamat IP untuk gateway potensial, nama mesin, dan nama domain.
ja_jp: ここで挙げた最後の選択肢は、IP アドレス、サブネットマスク、ゲートウェイの IP アドレス、マシン名、ドメイン名、の情報が必要です。

source: <emphasis>TIP</emphasis> Configuration without DHCP
id_id: <emphasis>TIP</emphasis> Konfigurasi tanpa DHCP
ja_jp: <emphasis>TIP</emphasis> DHCP を使わない設定

source: If the local network is equipped with a DHCP server that you do not wish to use because you prefer to define a static IP address for the machine during installation, you can add the <userinput>netcfg/use_dhcp=false</userinput> option when booting from the CD-ROM. You just need to go to the desired menu entry by pressing the <keycap>TAB</keycap> key and add the desired option before pressing the <keycap>Enter</keycap> key.
id_id: Jika jarigan lokal dilengkapi dengan server DHCP yang tidak ingin Anda gunakan karena Anda lebih memilih alamat IP statis untuk mesin sepanjang instalasi, Anda dapat menambahka pilihan <userinput>netcfg/use_dhcp=false</userinput> ketika booting dari CD-ROM. Anda hanya perlu menuju ke menu yang diinginkan dengan menekan tombol <keycap>TAB</keycap> dan tambahkan pilihan yang diinginkan sebelum menekan tombol <keycap>Enter</keycap>.
ja_jp: インストール中にマシンに静的 IP アドレスを定義したいのでローカルネットワーク内で動いている DHCP サーバを使わせたくない場合、CD-ROM から起動する際に <userinput>netcfg/use_dhcp=false</userinput> オプションを追加してください。起動したいメニューエントリにカーソルを合わせた状態で <keycap>TAB</keycap> キーを押して、<keycap>Enter</keycap> キーを押す前に必要なオプションを追加してください。

source: <emphasis>BEWARE</emphasis> Do not improvise
id_id: <emphasis>HATI-HATI</emphasis> Jangan berimprovisasi
ja_jp: <emphasis>BEWARE</emphasis> 場当たり的な設定の禁止

source: Many local area networks are based on an implicit assumption that all machines can be trusted, and inadequate configuration of a single computer will often perturb the whole network. As a result, do not connect your machine to a network without first agreeing with its administrator on the appropriate settings (for example, the IP address, netmask, and broadcast address).
id_id: Kebanyakan jaringan lokal ialah berdasarkan asumsi bahwa seluruh mesin dapat dipercaya, dan konfigurasi yang tak memadai dari sebuah komputer akan sering mengusik seluruh jaringan. Jadi, jangan hubungkan mesin Anda ke jaringan tanpa persetujuan administrator lebih dahulu pada pengaturan yang sesuai (contoh, alamat IP, netmask, dan alamat broadcast).
ja_jp: 多くのローカルエリアネットワークはすべてのマシンが信頼できるという暗黙の了解の基に成り立っており、1 台でも不適切な設定のコンピュータがあるとネットワーク全体が混乱します。つまり、あなたのマシンを勝手に接続する前に、ネットワーク管理者から適切な設定 (例えば、IP アドレス、ネットマスク、ブロードキャストアドレス) を教わってください。

source: Configuring the Clock
id_id: Mengonfigurasi Jam
ja_jp: 時刻の設定

source: If the network is available, the system's internal clock is updated (in a one-shot way) from an NTP server. This way the timestamps on logs will be correct from the first boot. For them to remain consistently precise over time, an NTP daemon needs to be set up after initial installation (see <xref linkend="sect.time-synchronization" />).
id_id: Jika jaringan tersedia, sistem waktu internal diperbaru (singkatnya) dari sebuah server NTP. Cara ini pertanda waktu pada log akan di perbaiki dari booting pertama. Untuk hal tersebut agar waktu tepat secara konsisten, sebuah daemon NTP perlu diatur setelah instalasi awal (lihat <xref linkend="sect.time-synchronization" />).
ja_jp: ネットワークが利用可能なら、システムの内部時計は NTP サーバを使って (1 度だけ) 更新されます。こうすることで、初回起動時以降のログのタイムスタンプが修正されます。常に正確な時刻に合わせるためには、最初のインストール後に NTP デーモンのセットアップが必要です (<xref linkend="sect.time-synchronization" />を参照)。

source: Administrator Password
id_id: Kata Sandi Administrator
ja_jp: 管理者パスワード

source: <primary>account</primary><secondary>administrator account</secondary>
id_id: <primary>akun</primary><secondary>akun administrator</secondary>
ja_jp: <primary>アカウント</primary><secondary>管理者アカウント</secondary>

source: The super-user root account, reserved for the machine's administrator, is automatically created during installation; this is why a password is requested. A confirmation (or two identical entries) will prevent any entry error which would later be difficult to amend.
id_id: Akun super-user root, dimiliki oleh administrator mesin, dibuat secara otomatis selama instalasi; oleh sebab itu kata sandi diperlukan. Konfirmasi (atau entri yang sama) akan menghindari kesalahan entri yang di kemudian hari akansulit untuk diubah.
ja_jp: マシンの管理者用に確保されているスーパーユーザ root アカウントはインストール中に自動的に作成されます; このため、パスワードが要求されます。確認 (または 2 回入力) させるのは、後から修正する事が難しい入力ミスを避けるためです。

source: <emphasis>SECURITY</emphasis> Administrator password
id_id: <emphasis>KEAMANAN</emphasis> Kata sandi administrator
ja_jp: <emphasis>SECURITY</emphasis> 管理者パスワード

source: The root user's password should be long (6 characters or more) and impossible to guess. Indeed, any computer (and a fortiori any server) connected to the Internet is regularly targeted by automated connection attempts with the most obvious passwords. Sometimes it may even be subject to dictionary attacks, in which many combinations of words and numbers are tested as password. Avoid using the names of children or parents, dates of birth, etc.: many of your co-workers might know them, and you rarely want to give them free access to the computer in question.
id_id: Kata sandi pengguna root harus panjang (6 karakter atau lebih) dan tak mungkin ditebak. Memang, beberapa komputer (dan fortiori beberapa server) yang terhubung ke Internet umumnya dijadikan target oleh koneksi otomatis yang berupaya dengan kata sandi paling umum. Kadang kadang bahkan dijadikan subjek pada serangan kamus, yang banyak kombinasi kata dan angka sebagai kata sandi. Hindari penggunaan nama anak atau orang tua, tanggal lahir, dll.: kebanyakan rekan kerja Anda mungkin telah mengenal mereka, dan Anda jarang ingin memberikan akses bebas pada komputer dengan pertanyaan.
ja_jp: root ユーザのパスワードは長く (6 文字以上) て推測できないものであるべきです。実際、インターネットに接続されたコンピュータ (さらにサーバ) はその種類を問わず、定期的に頻繁に使われるパスワードを用いた自動接続攻撃の標的にされます。時には、単語と数字の組み合わせをパスワードとして試す、辞書攻撃にさらされるかもしれません。子供や両親の名前、誕生日などをパスワードとして使わないでください: 多くの同僚がそれを知っているかもしれませんし、そのような人にここでセットアップされている種類のコンピュータを自由に使わせたくはないでしょう。

source: These remarks are equally applicable for other user passwords, but the consequences of a compromised account are less drastic for users without administrative rights.
id_id: Komentar ini sesuai untuk diterapkan pada kata sandi pengguna lain, namun konsekuensi akun yang terkompromi kurang drastis untuk pengguna tanpa hak administratif.
ja_jp: 他のユーザのパスワードに対しても同じ事が言えますが、管理権限を持たないユーザのアカウントが乗っ取られたとしても、その影響はそれほど大きくありません。

source: If inspiration is lacking, do not hesitate to use password generators, such as <command>pwgen</command> (in the package of the same name).
id_id: Jika tak ada inspirasi, jangan ragu untuk menggunakan generator password, seperti <command>pwgen</command> (dalam paket dengan nama yang sama).
ja_jp: もし名案が浮かばなければ、遠慮せずに <command>pwgen</command> (同名のパッケージに含まれます) などのパスワード生成ソフトを使ってください。

source: Creating the First User
id_id: Membuat pengguna Pertama
ja_jp: 1 人目ユーザの作成

source: Debian also imposes the creation of a standard user account so that the administrator doesn't get into the bad habit of working as root. The precautionary principle essentially means that each task is performed with the minimum required rights, in order to limit the damage caused by human error. This is why the installer will ask for the complete name of this first user, their username, and their password (twice, to prevent the risk of erroneous input).
id_id: Debian juga menimpakan pembuatan akun pengguna standar agar administrator tidak mendapat kebiasaan yang buruk bekerja sebagai root. Prinsip kehati-hatian pada dasarnya bermakna bahwa setiap tugas dikerjakan dengan hak minimal, agar meminimalisir bahaya yang disebabkan oleh kesalahan manusia. Inilah mengapa installer akan meminta untuk melengkapi nama pengguna pertama, nama penggunanya, dan kata sandinya (dua kali, untuk mendhindari kesalahan input).
ja_jp: Debian は管理者に root で作業するという悪習を身に付けさせないために、強制的に標準的なユーザアカウントを作成します。この予防原則は本質的に、人的ミスによる損害を抑えるためには必要最低限の権限だけで作業する必要がある、という事を意味しています。このため、インストーラは 1 人目のユーザの完全な名前、ユーザ名、パスワード (入力ミスの危険を防ぐために 2 回) を尋ねるでしょう。

source: Name of the first user
id_id: Nama pengguna pertama
ja_jp: 1 人目のユーザの名前

source: Detecting Disks and Other Devices
id_id: Mendeteksi Disk dan Device Lain
ja_jp: ディスクや他のデバイスの検出

source: This step automatically detects the hard drives on which Debian may be installed. They will be presented in the next step: partitioning.
id_id: Langkah ini secara otomatis mendeteksi perangkat keras yang mungkin diinstali Debian. Akan disajikan pada langkah selanjutnya: pemartisian.
ja_jp: この段階で Debian がインストールされるであろうハードドライブが自動的に検出されます。ハードドライブは次の段階、パーティショニング、で表示されます。

source: Starting the Partitioning Tool
id_id: Memulai Alat Pemartisi
ja_jp: パーティショニングツールを始める

source: <primary>partitioning</primary>
id_id: <primary>pemartisian</primary>
ja_jp: <primary>パーティショニング</primary>

source: <emphasis>CULTURE</emphasis> Uses of partitioning
id_id: <emphasis>KULTUR</emphasis> Penggunaan pemartisi
ja_jp: <emphasis>CULTURE</emphasis> パーティショニング法

source: Partitioning, an indispensable step in installation, consists in dividing the available space on the hard drives (each subdivision thereof being called a “partition”) according to the data to be stored on it and the use for which the computer is intended. This step also includes choosing the filesystems to be used. All of these decisions will have an influence on performance, data security, and the administration of the server.
id_id: Pematisian, langkah yang sangat diperlukan dalam instalasi, berupa pembagian ruang yang tersedia pada hard drive (setiap bagian akan disebut “partisi”) berdasarkan data yang akan disimpan padanya dan penggunaan dimaksud pada komputer.
ja_jp: パーティショニングはインストール時に必ず必要な作業で、ハードドライブ上の利用可能な領域をハードドライブ上に保存されるであろうデータとコンピュータで予定されている用途に従って分割 (それぞれの区画を「パーティション」と呼びます) する作業です。この段階で、使うファイルシステムを選択します。これらすべてが、性能、データのセキュリティ、サーバの管理、に影響します。

source: The partitioning step is traditionally difficult for new users. It is necessary to define the various portions of the disks (or “partitions”) on which the Linux filesystems and virtual memory (swap) will be stored. This task is complicated if another operating system that you want to keep is already on the machine. Indeed, you will then have to make sure that you do not alter its partitions (or that you resize them without causing damage).
id_id: Langkah pemartisian secara tradisional sulit untuk pengguna baru. Perlu menentukan berbagai prosi untuk cakram (atau “partisi”) di mana sistem berkas Linux dan memori virtual (swap) akan disimpan. Tugas ini rumit jika sistem operasi lain yang ingin Anda biarkan telah ada di mesin. Memang, Anda perlu memastikan tidak mengubah partisi tersebut (atau mengubah ukurannya tanpa menyebabkan bahaya).
ja_jp: その昔、新規ユーザにとってパーティショニングは難しい作業でした。パーティショニングには、Linux ファイルシステムと仮想メモリ (スワップ) が保存されるディスクの一区画 (「パーティション」) を定義する必要があります。この作業は、残しておきたい既存の他のオペレーティングシステムがマシン上にある場合に、複雑です。実際には、既存のシステムのパーティションを変更しない (または、損害を与えずにパーティションのサイズを変更する) ように注意しなければいけません。

source: Fortunately, the partitioning software has a “guided” mode which recommends partitions for the user to make — in most cases, you can simply validate the software's suggestions.
id_id: Untungnya, perangkat lunak pemartisi memiliki mode “terpandu” yang merekomendasikan pemartisian pada pengguna untuk membuat - dalam banyak kasus, Anda dapat memvalidasi saran perangkat lunak.
ja_jp: 幸いなことに、パーティショニングソフトウェアは「ガイド付き」モードを備えています。このモードを使う場合、ユーザに作成するパーティショニング方法の候補が提示されます。多くの場合、ソフトウェアの提案を確認するだけで事足ります。

source: Choice of partitioning mode
id_id: Pilihan mode pemartisi
ja_jp: パーティショニング方法の選択

source: The first screen in the partitioning tool offers the choice of using an entire hard drive to create various partitions. For a (new) computer which will solely use Linux, this option is clearly the simplest, and you can choose the option “Guided - use entire disk”. If the computer has two hard drives for two operating systems, setting one drive for each is also a solution that can facilitate partitioning. In both of these cases, the next screen offers to choose the disk where Linux will be installed by selecting the corresponding entry (for example, “SCSI1 (0,0,0) (sda) - 12.9 GB ATA VBOX HARDDISK”). You then start guided partitioning.
id_id: Layar pertama dalam alat pemartisi menawarkan pilihan menggunakan seluruh hard drive untuk membuat berbagai partisi. Untuk komputer (baru) yang akan sepenuhnya menggunakan Linux, pilihan ini jelas paling sederhana, dan Anda dapat mengambil pilihan “Terpandu - gunakan seluruh cakram”. Jika komputer memiliki dua hard drive untuk dua sistem operasi, pengaturan satu drive juga solusi untuk memfasilitasi pemartisian. Dalam kedua kasus ini, layar selanjutnya menawarkan untuk memilih cakram di mana Linux akan diinstall dengan memilih entri yang sesuai (sebagai contoh, “SCSI1 (0,0,0) (sda) - 12.9 GB ATA VBOX HARDDISK”). Anda kemudian memulai pemartisian terpandu.
ja_jp: パーティショニングツールの最初の画面では、ハードドライブ全体を使ってパーティションを作成する選択肢が表示されます。(新しい) コンピュータに Linux だけをインストールする場合、このパーティショニング方法が明らかに最も単純です。この場合「ガイド - ディスク全体を使う」を選んでください。コンピュータに 2 種類のオペレーティングシステム用の 2 台のハードドライブが装備されている場合、ドライブごとにオペレーティングシステムを分けるのも解決策の 1 つです。こうすることでパーティショニングが楽になります。どちらの場合も、次の画面では、関連するエントリから Linux をインストールするディスク (例えば「SCSI1 (0,0,0) (sda) - 12.9 GB ATA VBOX HARDDISK」) を選択します。その後、ガイド付きのパーティショニングが始まります。

source: Disk to use for guided partitioning
id_id: Disk yang digunakan untuk pemartisian terpandu
ja_jp: ガイド付きパーティショニングを適用するディスク

source: Guided partitioning can also set up LVM logical volumes instead of partitions (see below). Since the remainder of the operation is the same, we will not go over the option “Guided - use entire disk and set up LVM” (encrypted or not).
id_id: Pemartisian terpandu juga dapat mengatur volume logikal LVM daripada partisi (lihat di bawah). Karena operasinya sama, kita tidak akan masuk ke pilihan “Terpandu - gunakan seluruh cakram dan atur LVM” (terkenkripsi atau tidak).
ja_jp: ガイド付きパーティショニングでは、パーティションの代わりに LVM 論理ボリュームを作成する事も可能です。残りの操作は同じですから、「ガイド - ディスク全体を使い LVM をセットアップする」の選択肢 (暗号化の有無に関わらず) については説明しません。

source: In other cases, when Linux must work alongside other already existing partitions, you need to choose manual partitioning.
id_id: Dalam kasus lain, ketka Linux harus berdampingan dengan partisi lain yang sudah ada, Anda perlu memilih pemartisian manual.
ja_jp: 他の事例、例えば Linux を既存のパーティションと共存させたい場合、手作業でパーティショニングを実行しなければいけません。

source: Guided partitioning
id_id: Pemartisian terpandu
ja_jp: ガイド付きパーティショニング

source: <primary>partitioning</primary><secondary>guided partitioning</secondary>
id_id: <primary>pemartisian</primary><secondary>pemartisian terpandu</secondary>
ja_jp: <primary>パーティショニング</primary><secondary>ガイド付きパーティショニング</secondary>

source: The guided partitioning tool offers three partitioning methods, which correspond to different usages.
id_id: Alat pemandu pemartisian menawarkan tiga metode pemartisian, yang sesuai dengan penggunaan yang berbeda.
ja_jp: ガイド付きパーティショニングツールでは、それぞれ別の用途に適した 3 種類のパーティショニング機構を選択できます。

source: The first method is called “All files in one partition”. The entire Linux system tree is stored in a single filesystem, corresponding to the root <filename>/</filename> directory. This simple and robust partitioning fits perfectly for personal or single-user systems. In fact, two partitions will be created: the first will house the complete system, the second the virtual memory (swap).
id_id: Metode pertama di sebut “Seluruh berkas dalam satu partisi”. Seluruh sistem Linux tersimpan dalam satu sistem berkas, menyesuaikan dengan direktori root <filename>/</filename>. Sederhana dan pemartisi yang tangguh sangat cocok untuk personal atau pengguna-tunggal sistem. Kenyataannya, dua partisi akan dibuat: pertama sebagai tempat sistem lengkap, yang kedua memori virtual (swap).
ja_jp: 1 番目のパーティショニング機構は「すべてのファイルを 1 つのパーティションに」です。これは、Linux システムツリー全体 (ルート <filename>/</filename> ディレクトリ以下すべて) を単一のファイルシステムに保存します。このパーティショニングは単純かつ頑強であり、個人および単一ユーザシステム用途にぴったりです。実際には、2 つのパーティションが作られます: 1 つ目はシステム全体用、2 つ目は仮想メモリ (swap) 用です。

source: The second method, “Separate <filename>/home/</filename> partition”, is similar, but splits the file hierarchy in two: one partition contains the Linux system (<filename>/</filename>), and the second contains “home directories” (meaning user data, in files and subdirectories available under <filename>/home/</filename>).
id_id: Metode ketua, “Partisi <filename>/home/</filename> terpisah”, mirip, namun memecah hirarki berkas menjadi dua: satu partisi berisi sistem Linux (<filename>/</filename>), dan yang kedua berisi “direktori home” (maksudnya data pengguna, dalam berkas dan subdirektori tersedia di bawah <filename>/home/</filename>).
ja_jp: 2 番目のパーティショニング機構は「<filename>/home/</filename> パーティションの分割」です。これは、1 番目のパーティショニング機構とよく似ていますが、ファイル階層を 2 つに分離します: 片方には Linux システム (<filename>/</filename>) を、もう片方には「ホームディレクトリ」(ユーザデータ、ファイルとサブディレクトリは <filename>/home/</filename> 以下に配置されます) を収めます。

source: The last partitioning method, called “Separate <filename>/home</filename>, <filename>/usr</filename>, <filename>/var</filename>, and <filename>/tmp</filename> partitions”, is appropriate for servers and multi-user systems. It divides the file tree into many partitions: in addition to the root (<filename>/</filename>) and user accounts (<filename>/home/</filename>) partitions, it also has partitions for applications (<filename>/usr/</filename>), server software data (<filename>/var/</filename>), and temporary files (<filename>/tmp/</filename>). These divisions have several advantages. Users can not lock up the server by consuming all available hard drive space (they can only fill up <filename>/tmp/</filename> and <filename>/home/</filename>). The daemon data (especially logs) can no longer clog up the rest of the system.
id_id: Metode pemartisian terakhir, disebut “Partisi <filename>/home</filename>, <filename>/usr</filename>, <filename>/var</filename>, dan <filename>/tmp</filename> terpisah”, cocok untuk server dan sistem multi-pengguna. Membagi pohon berkas ke beberapa partisi: selain partisi (<filename>/</filename>) dan akun pengguna (<filename>/home/</filename>), juga memiliki partisi untuk aplikasi (<filename>/usr/</filename>), data perangkat lunak server (<filename>/var/</filename>), dan berkas sementara (<filename>/</filename>). Pembagian ini memiliki beberapa keuntungan. Pengguna tidak dapat mengunci server dengan menggunakan seluruh ruang cakram keras yang tersedia (mereka dapat mengisi (<filename>/tmp/</filename>) dan (<filename>/home/</filename>). Data daemon (khususnya log) tidak lagi dapat melog seluruh sistem.
ja_jp: 最後のパーティショニング機構は「<filename>/home</filename>, <filename>/usr</filename>, <filename>/var</filename>, <filename>/tmp</filename> パーティションを分割」です。これはサーバや複数のユーザが利用するシステムに適しています。これはファイルツリーを多くのパーティションに分離します: ルート (<filename>/</filename>) とユーザアカウント (<filename>/home/</filename>) パーティション、アプリケーション (<filename>/usr/</filename>)、サーバソフトウェアのデータ (<filename>/var/</filename>)、一時ファイル (<filename>/tmp/</filename>) です。ファイルツリーが格納されるパーティションをこのように分離すると様々な利点を得る事が可能です。ユーザが利用可能なハードドライブ領域を使い切ってしまうこと (<filename>/tmp/</filename> と <filename>/home/</filename> を満杯にすることは可能) でサーバが動かなくなる事がなくなります。デーモンのデータ (とくにログ) がシステムの他の領域を圧迫する事がなくなります。

source: <emphasis>BACK TO BASICS</emphasis> Choosing a filesystem
id_id: <emphasis>KEMBALI KE DASAR</emphasis> Memilih sistem berkas
ja_jp: <emphasis>BACK TO BASICS</emphasis> ファイルシステムの選択

source: <primary>system</primary><secondary>filesystem</secondary>
id_id: <primary>sistem</primary><secondary>sistem berkas</secondary>
ja_jp: <primary>システム</primary><secondary>ファイルシステム</secondary>

source: <primary>file</primary><secondary>system</secondary>
id_id: <primary>berkas</primary><secondary>sistem</secondary>
ja_jp: <primary>ファイル</primary><secondary>システム</secondary>
