Repository: Neamar/KISS
Catalog: */04_installation.po
Languages: id_id, ja_jp

source: All the details of this method are available in the installation guide (“Preparing files for TFTP Net Booting” section). <ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch05s01.html#boot-tftp" /><ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch04s05.html" />
id_id: Seluruh rincian metode ini tersedia pada panduan instalasi (bagian “Persiapan berkas untuk TFTP Net Booting”). <ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch05s01.html#boot-tftp" /><ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch04s05.html" />
ja_jp: この方法に関するすべての詳しい情報はインストールガイド (「TFTP ネットブート用ファイルの準備」の節) に書かれています。<ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch05s01.html#boot-tftp" /><ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch04s05.html" />

source: Other Installation Methods
id_id: Metode Instalasi Lain
ja_jp: その他のインストール方法

source: When we have to deploy customized installations for a large number of computers, we generally choose an automated rather than a manual installation method. Depending on the situation and the complexity of the installations to be made, we can use FAI (Fully Automatic Installer, described in <xref linkend="sect.fai" />), or even a customized installation CD with preseeding (see <xref linkend="sect.d-i-preseeding" />).
id_id: Ketika kita harus mendeploy instalasi khusus untuk banyak komputer, umumnya kita memilih yang terotomatis ketimbang metode instalasi manual. Tergantung pada situasi dan kerumitan instalasi yang dibauat, kita dapat menggunakan FAI (Instalasi Penuh Otomatis, dijelaskan di <xref linkend="sect.fai" />), atau bahkan CD instalasi khusus dengan preseed (lihat <xref linkend="sect.d-i-preseeding" />).
ja_jp: Debian を多数のコンピュータに特別な設定でインストールしなければいけない場合、手作業ではなく自動的にインストールを行う事が多いです。インストールの状況と複雑度合いに依存しますが、FAI (Fully Automatic Installer、<xref linkend="sect.fai" />で説明されています) を使うか、preseeding を使ってカスタマイズされたインストール CD (<xref linkend="sect.d-i-preseeding" />を参照) を使えば、自動インストールを行う事が可能です。

source: Installing, Step by Step
id_id: Menginstall, Selangkah demi Selangkah
ja_jp: インストール作業の各段階

source: Booting and Starting the Installer
id_id: Booting dan Memulai Penginstall
ja_jp: 起動とインストーラの開始

source: Once the BIOS has begun booting from the CD- or DVD-ROM, the Isolinux bootloader menu appears. At this stage, the Linux kernel is not yet loaded; this menu allows you to choose the kernel to boot and enter possible parameters to be transferred to it in the process.
id_id: Sekali BIOS mulai memboot dari CD- atau DVD-ROM, menu bootloader Isolinux muncul. Pada tahap ini, kernel Linux belum dimuat; menu ini mengizinkan Anda untuk memilih kernel untuk diboot dan memasukkan parameter yang memungkinkan untuk dikirim ke proses.
ja_jp: BIOS が CD-ROM や DVD-ROM からの起動を開始したら、Isolinux ブートローダメニューが表示されます。この段階では Linux カーネルはまだ読み込まれていません; このメニューでは、起動させるカーネルを選択し、起動処理中にカーネルに渡す事が可能なパラメータを入力できます。

source: For a standard installation, you only need to choose “Install” or “Graphical install” (with the arrow keys), then press the <keycap>Enter</keycap> key to initiate the remainder of the installation process. If the DVD-ROM is a “Multi-arch” disk (such as the one included with this book), and the machine has an Intel or AMD 64 bit processor, the menu options “64 bit install” and “64 bit graphical install” enable the installation of the 64 bit variant (<emphasis>amd64</emphasis>) instead of the default 32 bit variant (<emphasis>i386</emphasis>). In practice, the 64 bit version can almost always be used: most recent processors are 64 bit processors and the 64 bit version deals better with the large amount of RAM that new computers tend to have.
id_id: Untuk instalasi standar, Anda hanya perlu memilih “Install” atau “Graphical Install” (dengan tombol arah), kemudian tekan tombol <keycap>Enter</keycap> untuk memulai proses instalasi selanjutnya. Jika DVD-ROMnya ialah disk “Multi-arch” (seperti yang disertakan dalam buku ini), dan mesinnya memiliki prosesor Inter atau AMD 64 bit, pilihan menu “64 bit install” dan “64 bit graphical install” memungkinkan instalasi varian 64 bit (<emphasis>amd64</emphasis>) daripada varian bawaan yang 32 bit (<emphasis>i386</emphasis>). Dalam prakteknya, versi 64 bit hampir selalu dapat digunakan: kebanyakan prosesor terbaru ialah prosesor 64 bit dan versi 64 bit menangani lebih baik dengan jumlah RAM besar yang cenderung dimiliki oleh komputer baru.
ja_jp: 標準的なインストールを実行したい場合、矢印キーで「Install」もしくは「Graphical install」を選び、<keycap>Enter</keycap> を押して残りのインストール作業を実行します。DVD-ROM が「Multi-arch」ディスク (この本にはこのディスクが付属しています) であり、マシンが Intel または AMD の 64 ビットプロセッサを搭載している場合、「64 bit install」と「64 bit graphical install」というメニューオプションを使って 64 ビット版 (<emphasis>amd64</emphasis>) をインストールする事も可能です。そうでなければデフォルトの 32 ビット版 (<emphasis>i386</emphasis>) を選んでください。実際のところ、64 ビット版を使う場合が多いでしょうでしょう: 最近のマシンの多くは 64 ビットプロセッサであり、64 ビット版では新しいコンピュータで備わっていることの多い大容量 RAM を上手く取り扱う事が可能です。

source: <emphasis>GOING FURTHER</emphasis> 32 or 64 bits?
id_id: <emphasis>LEBIH JAUH</emphasis> 32 atau 64 bit?
ja_jp: <emphasis>GOING FURTHER</emphasis> 32 ビットか 64 ビットか?

source: <primary>Physical Address Extension</primary>
ja_jp: <primary>物理アドレス拡張</primary>

source: <primary>32/64 bits, choice</primary>
id_id: <primary>pilihan, 32/64 bits</primary>
ja_jp: <primary>32/64 ビットの選択</primary>

source: The fundamental difference between 32 and 64 bit systems is the size of memory addresses. In theory, a 32 bit system can not work with more than 4 GB of RAM (2<superscript>32</superscript> bytes). In practice, it is possible to work around this limitation by using the <literal>686-pae</literal> kernel variant, so long as the processor handles the PAE (Physical Address Extension) functionality. Using it does have a notable influence on system performance, however. This is why it is useful to use the 64 bit mode on a server with a large amount of RAM.
id_id: Perbedaan mendasar antara sistem 32 dan 64 bit ialah ukuran pengalamatan memoti. Pada teorinya, sebuah sistem 32 bit tidak dapat bekerja dengan RAM lebih dari 4 GB (2<superscript>32</superscript> bytes). Pada prakteknya, memungkinkan untuk bekerja pada batasan ini dengan menggunakan varian kernel <literal>686-pae</literal>, sejauh prosesor dapat menangani fungsionalitas PAE (Physical Address Extension). Meskipun, menggunakan sistem 32 bit ini pengaruhnya penting terhadap kinerja sistem. Itulah mengapa sangat berguna untuk menggunakan mode 64 bit pada server dengan jumlah RAM yang besar.
ja_jp: 32 ビットシステムと 64 ビットシステムの本質的な差異はメモリアドレスのサイズにあります。理論的には、32 ビットシステムでは 4 GB (2<superscript>32</superscript> バイト) 以上の RAM を取り扱う事ができません。実際上、PAE (物理アドレス拡張) 機能を扱えるプロセッサでならば、<literal>686-pae</literal> カーネル版を使うことでこの制限を回避する事が可能です。しかし、PAE を使うとシステムの性能に深刻な影響があります。そのため、大容量の RAM を載せたサーバでは 64 ビットモードを使うほうが有益です。

source: For an office computer (where a few percent difference in performance is negligible), you must keep in mind that some proprietary programs are not available in 64 bit versions (such as Skype, for example). It is technically possible to make them work on 64 bit systems, but you have to install the 32 bit versions of all the necessary libraries (see <xref linkend="sect.multi-arch" />), and sometimes to use <command>setarch</command> or <command>linux32</command> (in the <emphasis role="pkg">util-linux</emphasis> package) to trick applications regarding the nature of the system. <indexterm><primary><command>setarch</command></primary></indexterm> <indexterm><primary><command>linux32</command></primary></indexterm>
id_id: Untuk komputer kantor (di mana beberapa persen perbedaan performanya tak berarti), Anda harus tetap memikirkan bahwa beberapa program proprietary tak tersedia untuk versi 64 bit (seperti Skype, sebagai contoh). Secara teknis memungkinkan untuk membuatnya bekerja pada sistem 64 bit, namun Anda harus menginstall versi 32 bit seluruh pustaka yang diperlukan (lihat <xref linkend="sect.multi-arch" />), dan kadang-kadang menggunakan <command>setarch</command> atau <command>linux32</command> (dalam paket <emphasis role="pkg">util-linux</emphasis>) untuk mengelabuhi aplikasi mengenai sifat sistem. <indexterm><primary><command>setarch</command></primary></indexterm> <indexterm><primary><command>linux32</command></primary></indexterm>
ja_jp: オフィスコンピュータ (数パーセントの性能の違いを無視しても構わない場合) について言えば、一部のプロプライエタリプログラムは 64 ビット版を提供していない場合がある事を覚えておいてください。技術的に言えば、これらのプログラムを 64 ビットシステムで動かすことは可能です。しかし、すべての必要なライブラリの 32 ビット版をインストールしなければいけません (<xref linkend="sect.multi-arch" />を参照) し、<command>setarch</command> または <command>linux32</command> コマンド (<emphasis role="pkg">util-linux</emphasis> パッケージを参照) を使ってシステム環境についてアプリケーションをごまかさなければいけない場合があります。<indexterm><primary><command>setarch</command></primary></indexterm> <indexterm><primary><command>linux32</command></primary></indexterm>

source: <emphasis>IN PRACTICE</emphasis> Installation alongside an existing Windows system
id_id: <emphasis>PRAKTEKNYA</emphasis> Instalasi di samping sistem Windows yang sudah ada
ja_jp: <emphasis>IN PRACTICE</emphasis> 既存の Windows システムと共存してインストール

source: <primary>dual boot</primary>
ja_jp: <primary>デュアルブート</primary>

source: If the computer is already running Windows, it is not necessary to delete the system in order to install Debian. You can have both systems at once, each installed on a separate disk or partition, and choose which to start when booting the computer. This configuration is often called “dual boot”, and the Debian installation system can set it up. This is done during the hard drive partitioning stage of installation and while setting up the bootloader (see the sidebars in those sections).
id_id: Jika komputer telah berjalan Windows, tak perlu menghapus sistem untuk menginstall Debian. Anda dapat memiliki kedua sistem bersamaan, masing-masing terinstall pada disk atau partisi yang berbeda, dan pilih mana yang akan dimulai ketika memboot komputer. Konfigurasi ini biasanya disebut “dual boot”, dan instalasi sistem Debian dapat mengaturnya. Hal ini dilakukan selama tahap pemartisian perangkat dan ketika mengatur bootloader (lihat bilah sisi pada bagian itu).
ja_jp: コンピュータで既に Windows が動いている場合、Debian をインストールするのに Windows システムを削除する必要はありません。両者を別のディスクまたはパーティションにインストールすれば、両方のシステムを同時に備える事が可能で、コンピュータの起動時に起動するシステムを選択する事が可能です。この構成は「デュアルブート」と呼ばれており、Debian のインストールシステムは「デュアルブート」構成を設定できます。設定は、インストール中のハードドライブのパーティショニング段階およびブートローダの設定段階 (これを解説している節の傍注参照) で行います。

source: If you already have a working Windows system, you can even avoid using a CD-ROM; Debian offers a Windows program that will download a light Debian installer and set it up on the hard disk. You then only need to reboot the computer and choose between normal Windows boot or booting the installation program. You can also find it on a dedicated website with a rather explicit name… <ulink type="block" url="http://ftp.debian.org/debian/tools/win32-loader/stable/" /> <ulink type="block" url="http://www.goodbye-microsoft.com/" />
id_id: Jika Anda telah memiliki sistem Windows, Anda bahkan dapat menghindari penggunaan CD-ROM; Debia menawarkan sebuah program Windows yang akan mengunduh installer Debian yang ringan dan mengaturnya pada hard disk. Selanjutnya Anda hanya perlu mereboot komputer dan memilih antara boot Windows normal atau memboot program instalasi. Anda juga dapat menemukannya pada website yang didedikasikan dengan nama eksplisit... <ulink type="block" url="http://ftp.debian.org/debian/tools/win32-loader/stable/" /> <ulink type="block" url="http://www.goodbye-microsoft.com/" />
ja_jp: 既に稼働中の Windows システムがある場合、CD-ROM を使わないで済みます; Debian は軽量の Debian インストーラをダウンロードして、ハードディスクに Debian をセットアップするための Windows プログラムを提供しています。コンピュータを再起動し、Windows を通常起動するかインストールプログラムを起動するかを選択るだけです。また、プログラムは露骨な名前の専用ウェブサイトで配布されています… <ulink type="block" url="http://ftp.debian.org/debian/tools/win32-loader/stable/" /> <ulink type="block" url="http://www.goodbye-microsoft.com/" />

source: <emphasis>BACK TO BASICS</emphasis> Boot loader
id_id: <emphasis>KEMBALI KE DASAR</emphasis> Boot loader
ja_jp: <emphasis>BACK TO BASICS</emphasis> ブートローダ

source: <primary>loader</primary><secondary>bootloader</secondary>
ja_jp: <primary>ローダ</primary><secondary>ブートローダ</secondary>

source: <primary>bootloader</primary>
ja_jp: <primary>ブートローダ</primary>

source: <primary>boot</primary><secondary>loader</secondary>
ja_jp: <primary>ブート</primary><secondary>ローダ</secondary>

source: The bootloader is a low-level program that is responsible for booting the Linux kernel just after the BIOS passes off its control. To handle this task, it must be able to locate the Linux kernel to boot on the disk. On the i386 and amd64 architectures, the two most used programs to perform this task are LILO, the older of the two, and GRUB, its modern replacement. Isolinux and Syslinux are alternatives frequently used to boot from removable media.
id_id: Bootloader ialah program level-rendah yang bertanggung jawab untuk booting kernel Linux setelah BIOS melalui kontrolnya. Untuk menangani tugas ini, bootloader harus dapat menemukan kernel Linux untuk diboot pada cakram. Pada arsitektur i386 dan amd64, dua program yang kebanyakan digunakan untuk melakukan tugas ini ialah LILO, yang lebih tua dari keduanya, dan GRUB, penggantinya yang lebih modern. Isolinux dan Syslinux ialah alternatif yang seringkali digunakan untuk memboot dari removable media.
ja_jp: ブートローダとは BIOS から操作を受け取った直後に Linux カーネルを起動させる低レベルプログラムです。この作業を行うために、ブートローダは起動したい Linux カーネルの格納場所を探す事ができなければいけません。i386 と amd64 アーキテクチャで、ブートローダとして最も利用されているプログラムは比較的古参の LILO とその現代的な代替である GRUB です。Isolinux と Syslinux はリムーバブルメディアから起動する際によくつかわれる代替プログラムです。

source: Each menu entry hides a specific boot command line, which can be configured as needed by pressing the <keycap>TAB</keycap> key before validating the entry and booting. The “Help” menu entry displays the old command line interface, where the <keycap>F1</keycap> to <keycap>F10</keycap> keys display different help screens detailing the various options available at the prompt. You will rarely need to use this option except in very specific cases.
id_id: Setiap entri menu tersembunyi baris perintah boot yang spesifik, yang dapat dikonfigurasi sesuai kebutuhan dengan menekan tombol <keycap>TAB</keycap> sebelum memvalidasi entri dan booting. Menu “Bantuan” menampilkan antarmuka baris perintah lawas, di mana tombol <keycap>F1</keycap> ke <keycap>F10</keycap> menampilkan layar bantuan yang berbeda menjelaskan berbagai pilihan yang tersedia. Anda akan jarang menggunakan pilihan ini kecuali pada kasus yang spesifik.
ja_jp: 各メニューエントリを選択して実行するとある起動コマンドが実行されます。このコマンドは、エントリを有効にして起動する前に、必要に応じて <keycap>TAB</keycap> キーを押すことで編集できます。「Help」メニューエントリは古いコマンドラインインターフェースを表示します。ここでは、<keycap>F1</keycap> から <keycap>F10</keycap> までのキーを使って、プロンプトから利用できるさまざまなオプションについての詳細が書かれた別のヘルプ画面を表示します。極めて特殊な場合を除いて、このオプションが必要になることはないでしょう。

source: The “expert” mode (accessible in the “Advanced Options” menu) details all possible options in the process of installation, and allows navigation between the various steps without them happening automatically in sequence. Be careful, this very verbose mode can be confusing due to the multitude of configuration choices that it offers.
id_id: Mode “mahir” (dapat diakses pada menu “Pilihan Tingkat Mahir”) menjelaskan seluruh pilihan yang memungkinkan pada proses instalasi, dan mengizinkan navigasi berbagai langkah tanpa terjadi secara otomatis dalam urutannya. Berhati-hatilah, mode sangat bising ini dapat memusingkan karena banyaknya pilihan konfigurasi yang ditawarkan.
ja_jp: 「expert」モードでは (「Advanced Options」メニューから辿れます) インストール中に利用可能なすべてのオプションを詳細に設定可能で、各インストールステップを自動的に次々と進むのではなく、毎回ナビゲーションを表示するようにできます。これはとても詳細なモードで、表示される設定可能な選択肢が多すぎてわかりにくいかもしれませんので、ご注意ください。

source: Boot screen
id_id: Layar boot
ja_jp: 起動画面

source: Once booted, the installation program guides you step by step throughout the process. This section presents each of these steps in detail. Here we follow the process of an installation from a Multi-Arch DVD-ROM (more specifically, the beta4 version of the installer for Wheezy); <emphasis>netinst</emphasis> installations, as well as the final release of the installer, may look slightly different. We will also address installation in graphical mode, but the only difference from “classic” (text-mode) installation is in the visual appearance.
id_id: Setelah booting, program instalasi memandu Anda selangkah demi selangkah melalui proses. Bagian ini menyajikan setiap langkah ini secara detil. Di sini kita mengikuti proses sebuah instalasi dari DVD-ROM Multi-Arch (lebih spesifiknya, versi beta4 installer untuk Wheezy); instalasi <emphasis>netinst</emphasis>, sebagaimana rilis final installer, mungkin nampak sedikit berbeda. Wikia juga akan berbicara instalasi mode grafis, namun hanya perbedaan dari instalasi “classic” (mode-teks) dalam tampilan visual.
ja_jp: 一旦起動すれば、インストールプログラムがインストールの最初から最後まですべての手順を誘導します。この節ではそれぞれの手順を詳細に解説しています。ここでは Multi-Arch DVD-ROM (より詳しく言えば Wheezy インストーラのベータ 4) を使ったインストールを順に見ていきます。<emphasis>netinst</emphasis> を使ったインストールおよびインストーラの最終版では、少し様子が違うかもしれません。グラフィカルモードのインストールの様子も載せていますが、「クラッシック」(テキストモード) インストールとの違いは見た目だけです。

source: Selecting the language
id_id: Memilih bahasa
ja_jp: 言語の選択

source: <primary>choice</primary><secondary>of language</secondary>
id_id: <primary>pilihan</primary><secondary>bahasa</secondary>
ja_jp: <primary>選択</primary><secondary>言語の</secondary>

source: The installation program begins in English, but the first step allows the user to choose the language that will be used in the rest of the process. Choosing French, for example, will provide an installation entirely translated into French (and a system configured in French as a result). This choice is also used to define more relevant default choices in subsequent stages (notably the keyboard layout).
id_id: Program instalasi dimulai dengan bahasa Inggris, namun langkah pertama memungkinkan pengguna memilih bahasa yang akan digunakan pada seluruh proses. Memilih Prancis, misalnya, akan menyediakan instalasi yang seluruhnya telah diterjemahkan ke dalam bahasa Prancis (dan hasilnya sistem terkonfigurasi dalam bahasa Prancis). Pilihan ini juga dapat digunakan untuk menentukan pilihan bawaan yang sesuai pada langkah berikut (terutama tata letak papan tik).
ja_jp: インストールプログラムは英語で始まりますが、まず最初に以降のインストール作業の表示言語として使われる言語を選択します。例えば、日本語を選択したらインストール中の表示言語はすべて日本語になります (そしてシステムも日本語に設定されます)。さらに、以降のインストール作業のデフォルト選択肢がより適切なものになります (特にキーボードレイアウト)。

source: <emphasis>BACK TO BASICS</emphasis> Navigating with the keyboard
id_id: <emphasis>KEMBALI KE DASAR</emphasis> Navigasi dengan papan tik
ja_jp: <emphasis>BACK TO BASICS</emphasis> キーボードを使うナビゲーション

source: Some steps in the installation process require you to enter information. These screens have several areas that may “have focus” (text entry area, checkboxes, list of choices, OK and Cancel buttons), and the <keycap>TAB</keycap> key allows you to move from one to another.
id_id: Beberapa langkah proses instalasi memerlukan Anda untuk memasukkan informasi. Layar ini memiliki beberapa area yang mungkin “memiliki fokuss” (area entri teks, cekbox, daftar pilihan, tombol OK dan Batal), dan tombol <keycap>TAB</keycap> memungkinkan Anda berpindah dari satu ke yang lainnya.
ja_jp: インストール作業のいくつかの段階では情報の入力が求められます。それらの画面には様々な入力場所 (テキストエリア、チェックボックス、選択リスト、OK ボタンやキャンセルボタン) があり、「フォーカスされている」かもしれません。それぞれの入力場所からフォーカスを移動させるには、<keycap>TAB</keycap> キーを使ってください。

source: In graphical mode, you can use the mouse as you would normally on an installed graphical desktop.
id_id: Pada mode grafis, Anda dapat menggunakan tetikus sebagaimana biasanya pada deskto grafis yang terinstall.
ja_jp: グラフィカルモードでは、インストールされたグラフィカルデスクトップでやるようにマウスを使ってください。

source: Selecting the country
id_id: Memilih negara
ja_jp: 国選択

source: <primary>choice</primary><secondary>of country</secondary>
id_id: <primary>pilihan</primary><secondary>negara</secondary>
ja_jp: <primary>選択</primary><secondary>国の</secondary>

source: The second step consists in choosing your country. Combined with the language, this information enables the program to offer the most appropriate keyboard layout. This will also influence the configuration of the time zone. In the United States, a standard QWERTY keyboard is suggested, and a choice of appropriate time zones is offered.
id_id: Langkah kedua berisi pemilihan negara Anda. Digabungkan dengan bahasa, informasi ini mengaktifkan program yang menawarkan tata letak papan tik yang sesuai. Hal ini juga memengaruihi konfigurasi zona waktu. Di Amerika Serikat, papan tik yang disarankan ialah standar QWERTY, dan pilihan zona waktu yang sesuai ditawarkan.
ja_jp: 2 段階目に国を選択します。インストーラは、先に選択した言語と国の情報を組み合わせて、最も適切と思われるキーボードレイアウトを提案します。さらに、国情報はタイムゾーンの設定にも影響を与えます。日本を選択した場合、標準的な QWERTY キーボードが提案され、適切なタイムゾーンが提供されます。

source: Selecting the keyboard layout
id_id: Memilih tata letak papan tik
ja_jp: キーボードレイアウトの選択

source: <primary>keyboard layout</primary>
id_id: <primary>tata letak papan tik</primary>
ja_jp: <primary>キーボードレイアウト</primary>

source: <primary>layout, keyboard</primary>
id_id: <primary>tata letak, papan tik</primary>
ja_jp: <primary>レイアウト、キーボード</primary>

source: The proposed “American English” keyboard corresponds to the usual QWERTY layout.
id_id: Usulan papan tik “American English” biasanya sesuai dengan tata letak QWERTY.
ja_jp: 提案された「日本語」キーボードは通常の QWERTY レイアウトです。

source: Choice of keyboard
id_id: Pilihan papan tik
ja_jp: キーボードの選択

source: Detecting Hardware
id_id: Mendeteksi Perangkat Keras
ja_jp: ハードウェア検出

source: This step is completely automatic in the vast majority of cases. The installer detects your hardware, and tries to identify the CD-ROM drive used in order to access its content. It loads the modules corresponding to the various hardware components detected, and then “mounts” the CD-ROM in order to read it. The previous steps were completely contained in the boot image included on the CD, a file of limited size and loaded into memory by the BIOS when booting from the CD.
id_id: Langkah ini sepenuhnya otomatis dalam berbagai kasus umumnya. Installer mendeteksi perangkat keras, dan mencoba mengidentifikasi cakram CD-ROM yang digunakan untuk mengakses isinya. Memuat modul yang sesuai dengan berbagai komponen perangkat keras yang terdeteksi, dan kemudian “mounts” CD-ROM untuk membacanya. Langkah sebelumnya sepenuhnya merupakan isi dari citra boot yang disertakan dalam CD, berkas yang berukuran terbatas dan dimuat ke dalam memori oleh BIOS ketika booting dari CD.
ja_jp: 非常に多くの場合、この段階は完全に自動的に行われます。インストーラがハードウェアを検出し、CD の内容を読み出すために CD-ROM ドライブを特定しようと試みます。インストーラは検出された様々なハードウェアに対応するモジュールを読み込み、その後 CD-ROM を「マウント」して内容を読みます。ここまでの段階は CD に含まれる起動イメージ (サイズが制限されており、CD からの起動時に BIOS がメモリ内に読み込んだファイル) が担当しています。

source: The installer can work with the vast majority of drives, especially standard ATAPI peripherals (sometimes called IDE and EIDE). However, if detection of the CD-ROM reader fails, the installer offers the choice to load a kernel module (for instance from a USB key) corresponding to the CD-ROM driver.
id_id: Installer dapat bekerja dengan sebagian besar drive, khsusnya periferal standar ATAPI (kadang-kadang disebut IDE dan EIDE). Akan tetapi, jika deteksi pembaca CD-ROM gagal, installer menawarkan pilihan untuk memuat modul kernel (misalnya dari USB key) sesuai dengan penggerak CD-ROM.
ja_jp: インストーラは大部分のドライブ、特に標準的な ATAPI 周辺機器 (IDE や EIDE と呼ばれる事もあります)、を取り扱う事が可能です。しかし、CD-ROM ドライブの検出に失敗する場合、インストーラは CD-ROM ドライバに対応するカーネルモジュールを (例えば USB メモリから) 読み込むための画面を表示します。

source: Loading Components
id_id: Memuat Komponen
ja_jp: コンポーネントの読み込み
