Repository: Neamar/KISS
Catalog: */04_installation.po
Languages: id_id, ja_jp

source: A filesystem defines the way in which data is organized on the hard drive. Each existing filesystem has its merits and limitations. Some are more robust, others more effective: if you know your needs well, choosing the most appropriate filesystem is possible. Various comparisons have already been made; it seems that ReiserFS is particularly efficient for reading many small files; <emphasis>XFS</emphasis>, in turn, works faster with large files. <emphasis>Ext4</emphasis>, the default filesystem for Debian, is a good compromise, based on the three previous versions of filesystems historically used in Linux (<emphasis>ext</emphasis>, <emphasis>ext2</emphasis> and <emphasis>ext3</emphasis>). <emphasis>Ext4</emphasis> overcomes certain limitations of <emphasis>ext3</emphasis> and is particularly appropriate for very large capacity hard drives. Another option would be to experiment with the very promising <emphasis>btrfs</emphasis>, which includes numerous features that require, to this day, the use of LVM and/or RAID.
id_id: Setelah menentukan sistem berkas dengan bagaimana diorganisasikan pada hard drive. Setiap sistem berkas yang ada memiliki ukuran dan batasannya. Beberapa lebih tangguh, lainya lebih efisien: jika Anda memahami dengan baik keperluan Anda, memungkinkan memilih sistem berkas yang sesuai. Berbagai perbandingan telah dibuat; nampaknya ReiserFS sangat efisien untuk membaca beberapa berkas kecil; <emphasis>XFS</emphasis>, pada gilirannya, bekerja lebih cepat dengan berkas besar. <emphasis>Ext4</emphasis>, sistem berkas bawaan Debian, ialah pilihan yang baik, berdasarkan ketiga versi sistem berkas sebelumnya secara historis digunakan di Linux (<emphasis>ext</emphasis>, <emphasis>ext2</emphasis>, dan <emphasis>ext3</emphasis>). <emphasis>Ext4</emphasis> mengatasi batasan tertentu dari <emphasis>ext3</emphasis> dan terutama sesuai untuk hard drive berkapasitas besar. Pilihan lain akan berkeksperimen dengan sangat menjanjikan <emphasis>btrfs</emphasis> yang menyertakan banyak fitur yang diperlukan, dalam hal ini, penggunaan LVM dan/atau RAID.
ja_jp: ファイルシステムはハードドライブにデータを格納する方法を定義しています。既存のファイルシステムにはそれぞれ長所と制限があります。頑強なものもあれば、効率のよいものもあります: 自分の必要としている事をよく理解している人は最も適切なファイルシステムを選択する事が可能です。様々なファイルシステムを比較してみましょう; ReiserFS ファイルシステムは、多くの小さなファイルを読む場合は特に効率が良いとされています。また、<emphasis>XFS</emphasis> は巨大なファイルを高速に取り扱えます。Debian のデフォルトファイルシステムである <emphasis>ext4</emphasis> は良い妥協点で、昔から Linux で使われてきた 3 つの古いファイルシステムの (<emphasis>ext</emphasis>、<emphasis>ext2</emphasis>、<emphasis>ext3</emphasis>) を基に開発されました。<emphasis>ext4</emphasis> は <emphasis>ext3</emphasis> にあったいくつかの制限を克服しており、とりわけ大容量ハードドライブに適しています。将来が期待されている <emphasis>btrfs</emphasis> を試すという選択肢もあります。このファイルシステムは最近の LVM または RAID を使用する際に要求される非常に多くの機能を備えています。

source: A journalized filesystem (such as <emphasis>ext3</emphasis>, <emphasis>ext4</emphasis>, <emphasis>btrfs</emphasis>, <emphasis>reiserfs</emphasis>, or <emphasis>xfs</emphasis>) takes special measures to make it possible to return to a prior consistent state after an abrupt interruption without completely analyzing the entire disk (as was the case with the <emphasis>ext2</emphasis> system). This functionality is carried out by filling in a journal that describes the operations to conduct prior to actually executing them. If an operation is interrupted, it will be possible to “replay” it from the journal. Conversely, if an interruption occurs during an update of the journal, the last requested change is simply ignored; the data being written could be lost, but since the data on the disk has not changed, they have remained coherent. This is nothing more nor less than a transactional mechanism applied to the filesystem.
id_id: Sistem berkas berjurnal (seperti <emphasis>ext3</emphasis>, <emphasis>ext4</emphasis>, <emphasis>btrfs</emphasis>, <emphasis>reiserfs</emphasis>, atau <emphasis>xfs</emphasis>) mengambil tindakan khusus untuk memungkinkan kembali ke keadaan konsistem sebelumnya setelah tiba-tiba gangguan tanpa menganalisa seluruh cakram (sebagaimana kasus pada sistem berkas <emphasis>ext2</emphasis>). Fungsionalitas ini dilakukan dengan mengisi jurnal yang menjelaskan operasi sebelum untuk benar-benar mengeksekusinya.
ja_jp: ジャーナル化されたファイルシステム (<emphasis>ext3</emphasis>、<emphasis>ext4</emphasis>、<emphasis>btrfs</emphasis>、<emphasis>reiserfs</emphasis>、<emphasis>xfs</emphasis> など) では、突発的な障害が起きた際にディスク全体を完全に解析することなく (<emphasis>ext2</emphasis> システムでは解析が必要でした)、ファイルシステムを以前の整合性の取れた状態に戻せるようにするために、特別な対策が取られています。実際に作業を実行する前に、その作業の内容をジャーナルに書き込むことにより、この機能は実現されています。作業が中断された場合、ジャーナルを使って作業を「再実行」する事が可能です。逆に言うと、ジャーナルの更新中に障害が発生した場合、最後の作業は単純に無視されます; ジャーナルに書き込まれたデータは失われるかもしれませんが、ディスク上のデータは変更されていないので、整合性が保たれます。これはまさにファイルシステムに対するトランザクション処理と言えます。

source: After choosing the type of partition, the software calculates a suggestion, and describes it on the screen; the user can then modify it if needed. You can, in particular, choose another filesystem if the standard choice (<emphasis>ext4</emphasis>) isn't appropriate. In most cases, however, the proposed partitioning is reasonable and it can be accepted by selecting the “Finish partitioning and write changes to disk” entry.
id_id: Setelah memilih tipe partisi, perangkat lungak menghitung saran, dan menjelaskannya di layar; pengguna dapat memodifikasinya jika diperlukan. Terutama, Anda dapat memilih sistem berkas lainnya jika pilihan standar (<emphasis>ext4</emphasis>) tidak cocok. Dalam banyak kasus, akan tetapi, partisi yang disarankan cukup layak dan dapat diterima dengan memilih entri “Selesai pemartisian dan tulis perubahan ke cakram”.
ja_jp: パーティションの種類を選択した後、インストーラはパーティショニング案を算出し、画面に提示します。必要であれば、ユーザはパーティショニング案を変更する事も可能です。特に、標準的なファイルシステム (<emphasis>ext4</emphasis>) が不適切な場合は、別のファイルシステムを選択する事が可能です。しかしながら多くの場合、インストーラの提示したパーティショニング案は妥当です。承諾するには「パーティショニングの終了とディスクへの変更の書き込み」エントリを選択してください。

source: Validating partitioning
id_id: Validasi pemartisian
ja_jp: パーティショニングの確認

source: Manual Partitioning
id_id: Pemartisian Manual
ja_jp: 手作業のパーティショニング

source: <primary>partitioning</primary><secondary>manual partitioning</secondary>
id_id: <primary>pemartisian</primary><secondary>pemartisian manual</secondary>
ja_jp: <primary>パーティショニング</primary><secondary>手作業のパーティショニング</secondary>

source: Manual partitioning allows greater flexibility, allowing the user to choose the purpose and size of each partition. Furthermore, this mode is unavoidable if you wish to use software RAID.
id_id: Pemartisian manual memungkinkan fleksibilitas yang lebih, mengizinkan pengguna memilih tujuan dan ukuran setiap partisi. Lebih jauh, mode ini diharuskan jika Anda ingin menggunakan perangkat lunak RAID.
ja_jp: 手作業でやればより柔軟にパーティショニングを実行できます (各パーティションの目的とサイズを選ぶ事が可能です)。また、ソフトウェア RAID を希望する場合、手作業でパーティショニングを実行しなければいけません。

source: <emphasis>IN PRACTICE</emphasis> Shrinking a Windows partition.
id_id: <emphasis>PRAKTEKNYA</emphasis> Mereduksi partisi Windows
ja_jp: <emphasis>IN PRACTICE</emphasis> Windows パーティションの縮小。

source: <primary>resize a partition</primary>
id_id: <primary>mengubah ukuran partisi</primary>
ja_jp: <primary>パーティションサイズの変更</primary>

source: <primary>shrink a partition</primary>
id_id: <primary>mereduksi partisi</primary>
ja_jp: <primary>パーティションの縮小</primary>

source: To install Debian alongside an existing operating system (Windows or other), you must have some available hard drive space that is not being used by the other system in order to be able to create the partitions dedicated to Debian. In most cases, this means shrinking a Windows partition and reusing the freed space.
id_id: Untuk menginstall Debian berdampingan dengan sistem operasi yang sudah ada (Windows atau lainnya), Anda harus memiliki ruang kosong hard drive yang tersedia yang tidak sedang digunakan oleh sistem operasi lain agar dapat membuat partisi khusus untuk Debian. Dalam banyak kasus, ini artinya mengecilkan partisi Windows dan menggunakan ulang ruang yang dikosongkan.
ja_jp: Debian を他のオペレーティングシステム (Windows など) と共存させてインストールする場合、Debian 専用のパーティションを作成するために、他のシステムが使わないハードドライブ領域が必要です。多くの場合、Windows パーティションを縮小し、できた空領域を再利用することになります。

source: The Debian installer allows this operation when using the manual mode for partitioning. You only need to choose the Windows partition and enter its new size (this works the same with both FAT and NTFS partitions).
id_id: Installer Debian mengizinkan operasi ini ketika menggunakan pemartisian mode manual. Anda hanya perlu memilih partisi Windows dan masukkan ukuran yang baru (berlaku sama untuk partisi FAT dan NTFS).
ja_jp: Debian インストーラでは、手作業でパーティショニングを実行すれば、この作業を行えます。Windows パーティションを選択し、新しいサイズを入力するだけです (FAT と NTFS パーティションの両方に対して縮小できます)。

source: The first screen displays the available disks, their partitions, and any possible free space that has not yet been partitioned. You can select each displayed element; pressing the <keycap>Enter</keycap> key then gives a list of possible actions.
id_id: Layar pertama menampilkan cakram yang tersedia, partisinya, dan kemungkinan ruang kosong yang belum dipartisi. Anda dapat memilih setiap elemen yang ditampilkan; menekan tombol <keycap>Enter</keycap> kemudian muncul daftar aksi yang mungkin.
ja_jp: 最初の画面では、利用可能なディスクおよびパーティションと、パーティションを割り当てられていない空き領域が表示されます。表示されたそれぞれの要素を選択できます; <keycap>Enter</keycap> キーを押して、実行できる操作のリストが表示されます。

source: You can erase all partitions on a disk by selecting it.
id_id: Anda dapat menghapus seluruh partisi dengan memilihnya.
ja_jp: 操作を選択すれば、ディスク上のすべてのパーティションを削除する事も可能です。

source: When selecting free space on a disk, you can manually create a new partition. You can also do this with guided partitioning, which is an interesting solution for a disk that already contains another operating system, but which you may wish to partition for Linux in a standard manner. See the previous section for more details on guided partitioning.
id_id: Ketika memilih ruang kosong di cakram, Anda dapat membuat partisi baru secara manual. Anda juga dapat melakukannya dengan pemartisian terpandu, yang merupakan solusi yang menarik untuk cakram yang telah berisi sistem operasi lain, namun Anda mungkin ingin memartisi untuk Linux dengan cara standar. Lihat bagian sebelumnya untuk penjelasan detail tentang pemartisian terpandu.
ja_jp: ディスク上の空き領域を選択すると、新しいパーティションを作成できます。ガイド付きパーティショニングを空き領域に適用する事も可能です。この方法は、ディスクには別のオペレーティングシステムを含んでいるけれども、標準的なやり方で Linux のパーティショニングを実行したいという場合に興味深い解決策です。ガイド付きパーティショニングに関する詳しい情報は前の節をご覧ください。

source: <emphasis>BACK TO BASICS</emphasis> Mount point
id_id: <emphasis>KEMBALI KE DASAR</emphasis> Titik kaits
ja_jp: <emphasis>BACK TO BASICS</emphasis> マウントポイント

source: <primary>mount point</primary>
id_id: <primary>titik kait</primary>
ja_jp: <primary>マウントポイント</primary>

source: The mount point is the directory tree that will house the contents of the filesystem on the selected partition. Thus, a partition mounted at <filename>/home/</filename> is traditionally intended to contain user data.
id_id: Titik kait ialah pohon direktori yang akan memuat konten sistem berkas pada partisi yang terpilih. Demikian, partisi yang dikaitkan pada <filename>/home/</filename> secara tradisional bertujuan untuk bersisi data pengguna.
ja_jp: マウントポイントとは、パーティション上のファイルシステムの内容を格納するディレクトリツリーです。<filename>/home/</filename> にマウントされたパーティションはユーザデータを格納します。

source: When this directory is named “<filename>/</filename>”, it is known as the <emphasis>root</emphasis> of the file tree, and therefore the root of the partition that will actually host the Debian system.
id_id: Ketika direktori di beri nama “<filename>/</filename>”, disebut juga <filename>root</filename> dari pohon berkas, dan di sanalah akar partisi yang sesungguhnya memuat sistem Debian.
ja_jp: マウントポイントが「<filename>/</filename>」の場合、ファイルツリーの<emphasis>ルート</emphasis>を意味し、このパーティションのルートには Debian システムが格納されます。

source: <emphasis>BACK TO BASICS</emphasis> Virtual memory, swap
id_id: <emphasis>KEMBALI KE DASAR</emphasis> Memori virtual, swap
ja_jp: <emphasis>BACK TO BASICS</emphasis> 仮想メモリ、スワップ

source: <primary>virtual memory</primary>
id_id: <primary>memori virtual</primary>
ja_jp: <primary>仮想メモリ</primary>

source: <primary>swap</primary>
ja_jp: <primary>スワップ</primary>

source: <primary>partition</primary><secondary>swap partition</secondary>
id_id: <primary>partisi</primary><secondary>partisi swap</secondary>
ja_jp: <primary>パーティション</primary><secondary>スワップパーティション</secondary>

source: <primary>swap partition</primary>
id_id: <primary>partisi swap</primary>
ja_jp: <primary>スワップパーティション</primary>

source: Virtual memory allows the Linux kernel, when lacking sufficient memory (RAM), to free a bit of storage by storing the parts of the RAM that have been inactive for some time on the swap partition of the hard disk.
id_id: Memori virtual mengizinkan kernel Linux, ketika kehabisan memori (RAM), untuk membebaskan ruangan dengan menyimpan bagian RAM yang telah tidak aktif selama beberapa waktu ke partisi swap di hard disk.
ja_jp: 仮想メモリのお陰でメモリ (RAM) の空き領域が不足した際に、Linux カーネルは、しばらくの間活動していない RAM の内容をハードディスクのスワップパーティションに保存して、少しの RAM 空き領域を確保する事が可能です。

source: To simulate the additional memory, Windows uses a swap file that is directly contained in a filesystem. Conversely, Linux uses a partition dedicated to this purpose, hence the term “swap partition”.
id_id: Untuk mensimulasikan memori tambahan, Windows menggunakan berkas swap yang secara langsung terisi pada sistem berkas. Sebaliknya, Linux menggunakan partisi khusus untuk tujuan tersebut, maka istilahnya “partisi swap”.
ja_jp: このような付加的メモリを装うために、Windows ではファイルシステムに直接格納されるスワップファイルが利用されています。逆に、Linux ではこの目的専用のパーティション「スワップパーティション」が利用されています。

source: When choosing a partition, you can indicate the manner in which you are going to use it:
id_id: Ketika memilih partisi, Anda dapat menentukan cara yang akan anda gunakan padanya:
ja_jp: パーティションを選ぶ場合、パーティションの取り扱い方を指定する事が可能です:

source: format it and include it in the file tree by choosing a mount point;
id_id: memformat dan menyertakannya pada pohon berkas dengan memilih titik kait;
ja_jp: パーティションをフォーマットし、マウントポイントを指定してパーティションをファイルツリーに含めます;

source: use it as a swap partition;
id_id: gunakan sebagai parsisi swap;
ja_jp: パーティションをスワップパーティションとして使います;

source: make it into a “physical volume for encryption” (to protect the confidentiality of data on certain partitions, see below);
id_id: buatnya ke dalam sebuah “volume fisikal untuk dienkripsi” (untuk melindungi confidentalitas data pada beberapa partisi, lihat di bawah ini);
ja_jp: パーティションを「暗号化物理ボリューム」にします (パーティションに含まれる秘密のデータを守ります、以下を参照);

source: make it a “physical volume for LVM” (this concept is discussed in greater detail later in this chapter);
id_id: buat sebuah “volume fisikal untuk LVM” (konsep ini dibahas lebih detil pada bab ini);
ja_jp: パーティションを「LVM 用物理ボリューム」にします (この概念は、この章の後で詳しく議論します);

source: use it as a RAID device (see later in this chapter);
id_id: gunakan sebagai perangkat RAID (lihat nanti di bab ini);
ja_jp: RAID デバイスとして利用します (この章の後半を参照);

source: or the choice not to use it, and therefore leave it unchanged.
id_id: atau pilihan untuk tidak menggunakannya, dan karenanya biarkan tak diubah.
ja_jp: パーティションを使わないことにして、そのままにしておきます。

source: Configuring Multidisk Devices (Software RAID)
id_id: Mengonfigurasi Perangkat Multidisk (Perangkat Lunak RAID)
ja_jp: 複数ディスクデバイスの設定 (ソフトウェア RAID)

source: <primary>Software RAID</primary>
id_id: <primary>Perangkat Lunak RAID</primary>
ja_jp: <primary>ソフトウェア RAID</primary>

source: <primary>device</primary><secondary>multi-disk device</secondary>
ja_jp: <primary>デバイス</primary><secondary>複数ディスクデバイス</secondary>

source: Some types of RAID allow the duplication of information stored on hard drives to prevent data loss in the event of a hardware problem affecting one of them. Level 1 RAID keeps a simple, identical copy (mirror) of a hard drive on another drive, while level 5 RAID splits redundant data over several disks, thus allowing the complete reconstruction of a failing drive.
id_id: Beberapa tipe RAID mengizinkan duplikasi informasi yang terseimpan pada hard drive untuk menghindari kehilangan data ketika terjadi masalah perangkat keras berakibat pada salah satunya. RAID Level 1 sederhana, salinan identik (mirror) sebuah hard drive pada yang lainnya, sedangkan RAID level 5 membagi data yang berlebihan pada beberapa camram, hal tersebut memungkinkan rekonstruksi lengkap pada drive yang gagal.
ja_jp: 一部の RAID レベルでは、データに影響を及ぼすハードウェア障害が起きた際にデータの消失を防ぐために、ハードドライブに保存された情報を複製します。レベル 1 RAID は単純で、別のハードドライブにドライブの全く同じ複製をとります。これに対して、レベル 5 RAID は冗長データを複数のディスクに分散します。このため、障害の起きたドライブの完全な復元が可能です。

source: We will only describe level 1 RAID, which is the simplest to implement. The first step involves creating two partitions of identical size located on two different hard drives, and to label them “physical volume for RAID”.
id_id: kita hanya akan membahas RAID level 1, yang termudah untuk diimplementasikan. Langkah pertama melibatkan pembuatan dua partisi dengan ukuran sama pada dua hard drive yang berbeda, dan beri label “volume fisikal untuk RAID”.
ja_jp: 実行が最も単純なレベル 1 RAID だけを説明します。最初に、全く同じサイズのパーティションを 2 つ別々のドライブに作成し、「RAID の物理ボリューム」とラベル付けします。

source: You must then choose “Configure software RAID” in the partitioning tool to combine these two partitions into a new virtual disk and select “Create MD device” in the configuration screen. You then need to answer a series of questions about this new device. The first question asks about the RAID level to use, which in our case will be “RAID1”. The second question asks about the number of active devices — two in our case, which is the number of partitions that needs to be included in this MD device. The third question is about the number of spare devices — 0; we have not planned any additional disk to take over for a possible defective disk. The last question requires you to choose the partitions for the RAID device — these would be the two that we have set aside for this purpose (make sure you only select the partitions that explicitly mention “raid”).
id_id: Kemudian Anda perlu memilih “Mengonfigurasi perangkat lunak RAID” pada alat pemartisi untuk mengombinasikan kedua partisi ke dalam cakram virtual baru dan pilih “Buat device MD” pada layar konfigurasi. Kemudian Anda perlu menjawab beberapa pertanyaan tentang perangkat baru ini. Pertanyaan pertama menanyakan tentang level RAID yang digunakan, dalam kasus kita akan berupa “RAID1”. Pertanyaan kedua tentang jumlah device (perangkat) yang aktif - dua dalam hal ini, yang merupakan jumlah partisi yang perlu disertakan dalam perangkat MD ini. Pertanyaan ketiga tentang jumlah perangkat yang dipisah - 0; kita tidak merencanakan untuk penambahan cakram untuk menangani kemungkinan kerusakan cakram. Pertanyaan terakhir Anda perlu memilih partisi untuk perangkat RAID - ini berupa keduanya yang kita atur untuk tujuan ini (pastikan Anda hanya memilih partisi yang secara eksplisit menyebutkan “raid”).
ja_jp: 2 つのパーティションを 1 つの仮想ディスクにまとめるためにはパーティショニングツールで「ソフトウェア RAID を設定」を選び、設定画面で「MD デバイスを作成」を選んでください。新しいデバイスに関する一連の質問に答える必要があります。最初の質問では、使用する RAID レベルを尋ねられます。今回の場合「RAID1」です。2 番目の質問では、アクティブデバイスの数を尋ねられます - 今回の場合 2 台です。これは MD デバイスに含めるパーティションの数です。3 番目の質問では、予備デバイスの数を尋ねられます - 今回の場合 0 台です; ディスク不良が起きた際に機能を代替させるためのディスクを追加する計画はありません。最後の質問では、RAID デバイス用のパーティションを尋ねられます - これは先に用意した 2 つのパーティションです (「raid」と明示されてるパーティション以外は選ばないでください)。

source: Back to the main menu, a new virtual “RAID” disk appears. This disk is presented with a single partition which can not be deleted, but whose use we can choose (just like for any other partition).
id_id: Kembali ke menu utama, cakram virtual “RAID” baru muncul. Cakram ini tersaji dengan sebuah partisi yang tidak dapat dihapus, namun kita dapat memilih siapa yang akan menggunakan (seperti untuk partisi lainnya).
ja_jp: メインメニューに戻ると、新しい仮想「RAID」ディスクが表示されます。このディスクは削除できない単一のパーティションとして表示されますが、選択すればこれを使用できます (他のパーティションと同様に)。

source: For further details on RAID functions, please refer to <xref linkend="sect.raid-soft" />.
id_id: Untuk detail lebih jauh tentang fungsionalitas RAID, silahkan merujuk ke <xref linkend="sect.raid-soft" />
ja_jp: RAID 機能に関するより詳しい情報は<xref linkend="sect.raid-soft" />を参照してください。

source: Configuring the Logical Volume Manager (LVM)
id_id: Mengonfigurasi Logicam Volume Manager (LVM)
ja_jp: 論理ボリュームマネージャ (LVM) の設定

source: <primary>LVM</primary><secondary>during installation</secondary>
id_id: <primary>LVM</primary><secondary>selama instalasi</secondary>
ja_jp: <primary>LVM</primary><secondary>インストール中</secondary>

source: <primary>Logical Volume Manager</primary><secondary>during installation</secondary>
id_id: <primary>Logical Volume Manager</primary><secondary>selama instalasi</secondary>
ja_jp: <primary>論理ボリュームマネージャ</primary><secondary>インストール中</secondary>

source: LVM allows you to create “virtual” partitions that span over several disks. The benefits are twofold: the size of the partitions are no longer limited by individual disks but by their cumulative volume, and you can resize existing partitions at any time, possibly after adding an additional disk when needed.
id_id: LVM memungkinkan Anda untuk membuat partisi “virtual” yang merentang sepanjang beberapa cakram. Kelebihannya ada dua: ukuran partisi tidak lagi dibatasi oleh cakram individual namun oleh volume kumulatif, dan Anda dapat mengupah ukuran partisi yang sudah ada kapanpun, mungkin setelah menambah cakram tambahan ketika diperlukan.
ja_jp: LVM を使うことで、複数のディスクに分散した「仮想」パーティションを作成できます。LVM を使うことの利点は 2 つあります: パーティションのサイズは、もはや個々のディスクによって制限を受けるのではなく、累積ボリュームによって制限を受けます。さらにパーティションのサイズはいつでも (ディスクを追加した後などに) 変更できます。

source: LVM uses a particular terminology: a virtual partition is a “logical volume”, which is part of a “volume group”, or an association of several “physical volumes”. Each of these terms in fact corresponds to a “real” partition (or a software RAID device).
id_id: LVM menggunakan beberapa terminologi: partisi virtual ialah “volume logikal”, bagian dari “grup volume”, atau sebuah asosiasi beberapa “volumen fisikal”. Setiap terminologi ini bersesuai dengan partisi ”real” (atau sebuah device perangkat lunak RAID).
ja_jp: LVM では特有の専門用語を使います: 仮想パーティションは「論理ボリューム」と呼びます。これは「ボリュームグループ」の一部で、複数の「物理ボリューム」群を意味します。実際のところ、それぞれの専門用語は「実」パーティション (またはソフトウェア RAID デバイス) に相当します。

source: <primary>volume</primary><secondary>logical volume</secondary>
id_id: <primary>volume</primary><secondary>volume logikal</secondary>
ja_jp: <primary>ボリューム</primary><secondary>論理ボリューム</secondary>

source: <primary>volume</primary><secondary>physical volume</secondary>
id_id: <primary>volume</primary><secondary>volume fisikal</secondary>
ja_jp: <primary>ボリューム</primary><secondary>物理ボリューム</secondary>

source: <primary>group</primary><secondary>of volumes</secondary>
id_id: <primary>grup</primary><secondary>volume</secondary>
ja_jp: <primary>グループ</primary><secondary>ボリュームの</secondary>

source: <primary>volume</primary><secondary>group</secondary>
id_id: <primary>volume</primary><secondary>grup</secondary>
ja_jp: <primary>ボリューム</primary><secondary>グループ</secondary>
