Repository: Neamar/KISS
Catalog: */04_installation.po
Languages: id_id, ja_jp

source: Installation
id_id: Instalasi
ja_jp: インストール

source: Partitioning
id_id: Pemartisian
ja_jp: パーティション

source: Formatting
id_id: Pemformatan
ja_jp: フォーマット

source: File System
id_id: Sistem berkas
ja_jp: ファイルシステム

source: Boot Sector
ja_jp: ブートセクタ

source: Hardware Detection
id_id: Deteksi Perangkat Keras
ja_jp: ハードウェア検出

source: To use Debian, you need to install it on a computer; this task is taken care of by the <emphasis>debian-installer</emphasis> program. A proper installation involves many operations. This chapter reviews them in their chronological order.
id_id: Untuk menggunakan Debian, Anda perlu menginstallnya ke sebuah komputer; tugas ini dikerjakan oleh program <emphasis>debian-installer</emphasis>. Instalasi yang benar melibatkan beberapa operasi. Bab ini mengulasnya secara kronologis.
ja_jp: Debian を使うには、コンピュータにインストールする必要があります; インストール作業を担当するのが <emphasis>debian-installer</emphasis> プログラムです。適切なインストール作業は多くの手順からなります。この章ではそれぞれの手順を時系列順に概説します。

source: <primary>installation</primary><secondary>of the system</secondary>
id_id: <primary>istalasi</primary><secondary>sistem</secondary>
ja_jp: <primary>インストール作業</primary><secondary>システムの</secondary>

source: <emphasis>BACK TO BASICS</emphasis> A catch-up course in the appendices
id_id: <emphasis>KEMBALI KE DASAR</emphasis> Mengejar ketertinggalan dalam susulan
ja_jp: <emphasis>BACK TO BASICS</emphasis> 付録の補習講座

source: Installing a computer is always simpler when you are familiar with the way it works. If you are not, make a quick detour to <xref linkend="short-remedial-course" /> before reading this chapter.
id_id: Menginstall komputer selalu lebih sederhana ketika Anda familiar dengan caranya bekerja. Jika tidak, memutarlah sejenak ke <xref linkend="short-remedial-course" /> sebelum membaca bab ini.
ja_jp: コンピュータの仕組みをよく知っているなら、インストール作業は難しくありません。よく知らないなら、この章を読む前にちょっと遠回りして<xref linkend="short-remedial-course" />を読んでください。

source: The installer for <emphasis role="distribution">Wheezy</emphasis> is based on <command>debian-installer</command>. Its modular design enables it to work in various scenarios and allows it to evolve and adapt to changes. Despite the limitations implied by the need to support a large number of architectures, this installer is very accessible to beginners, since it assists users at each stage of the process. Automatic hardware detection, guided partitioning, and graphical user interfaces have solved most of the problems that newbies used to face in the early years of Debian.
id_id: Installer untuk <emphasis role="distribution">Wheezy</emphasis> berbasis <command>debian-installer</command>. Desainnya yang modular memungkinkan untuk bekerja dalam berbagai skenario dan mengizinkan melibatkan dan mengadaptasi perubahan. Kendatipun batasannya tersirat pada kebutuhan untuk mendukung arsitektur yang besar, installer ini sangat mudah diakses oleh pemula, karena installer ini memandu pengguna pada setiap tahap proses. Deteksi perangkat keras otomatis, pemanduan partisi, dan antar muka pengguna grafis telah memecahkan kebanyakan masalah yang dihadapi newbie Debian pada tahun-tahun awal.
ja_jp: <emphasis role="distribution">Wheezy</emphasis> 向けのインストーラは <command>debian-installer</command> を使っています。<command>debian-installer</command> の採用するモジュール式設計のお陰で、インストーラは様々な状況下で動作し、進化し、変化に適応する事が可能です。数多くのアーキテクチャをサポートすることで生じる制限にも関わらず、インストールの各段階でユーザを補助することにより、インストーラは初心者にとても優しいものと言えます。自動ハードウェア検知、ガイド付きのパーティショニング、グラフィカルユーザインターフェースのお陰で、初心者が Debian を使い始めた初期に直面するほとんどの問題は解決されています。

source: <primary>installer</primary>
ja_jp: <primary>インストーラ</primary>

source: Installation requires 80 MB of RAM (Random Access Memory) and at least 700 MB of hard drive space. All Falcot computers meet these criteria. Note, however, that these figures apply to the installation of a very limited system without a graphical desktop. A minimum of 512 MB of RAM and 5 GB of hard drive space are really recommended for a basic office desktop workstation.
id_id: Instalasi memerlukan RAM (Random Access Memory) 80 MB dan setidaknya ruang kosong hard drive 700 MB. Seluruh komputer Falcot memenuhi kriteria ini. Catat, meskipun, gambaran ini berlaku untuk instalasi sistem desktop terbatas tanpa antar muka grafis. Minimal RAM 512 MB dan ruang hard drive 5 GB sangat direkomendasikan untuk sebuah workstation desktop kantor dasar.
ja_jp: インストール作業を行うには 80 MB の RAM (ランダムアクセスメモリ) と最低 700 MB のハードドライブの空き領域が必要です。Falcot のすべてのコンピュータはこの基準を満足しています。しかし、これらの数字はグラフィカルデスクトップを含まない、極めて限定されたシステムをインストールする際の最低要件であるということに注意してください。一般的なオフィスデスクトップワークステーション用途では、最低でも 512 MB の RAM と 5 GB のハードドライブの空き領域が推奨されます。

source: <emphasis>BEWARE</emphasis> Upgrading from Squeeze
id_id: <emphasis>HATI-HATI</emphasis> Upgrade dari Squeeze
ja_jp: <emphasis>BEWARE</emphasis> Squeeze からのアップグレード

source: If you already have Debian Squeeze installed on your computer, this chapter is not for you! Unlike other distributions, Debian allows updating a system from one version to the next without having to reinstall the system. Reinstalling, in addition to being unnecessary, could even be dangerous, since it could remove already installed programs.
id_id: Jika Anda telah menginstall Debian Squeeze di komputer Anda, bab ini bukan untuk Anda! Tidak seperti distribusi lainnya, Debian mengizinkan perbaruan sistem dari suatu versi ke versi selanjutnya tanpa perlu menginstall ulang sistemnya. Menginstall ulang, menjadi tidak perlu, bahkan bisa menjadi berbahaya, karena dapat membuang program yang telah terinstall.
ja_jp: Debian Squeeze が既にコンピュータ上にインストール済みの場合、この章は役に立ちません! 他のディストリビューションとは異なり、Debian はシステムを再インストールすることなく、あるバージョンから次のバージョンに更新する事が可能です。再インストールは不必要というだけでなく、危険をはらんでいます。なぜなら、再インストールは既にインストール済みのプログラムを削除してしまうからです。

source: The upgrade process will be described in <xref linkend="sect.dist-upgrade" />.
id_id: Proses upgrade akan dijelaskan di <xref linkend="sect.dist-upgrade" />
ja_jp: アップグレード手順は<xref linkend="sect.dist-upgrade" />で説明しています。

source: Installation Methods
id_id: Metode Instalasi
ja_jp: インストール方法

source: A Debian system can be installed from several types of media, as long as the BIOS of the machine allows it. You can for instance boot with a CD-ROM, a USB key, or even through a network.
id_id: Sistem Debian dapat diinstall dari beberapa tipe media, sejauh BIOS mesinnya memerbolehkannya. Anda dapat membootnya dari CD-ROM, USB Key, atau bahkan melalui jaringan.
ja_jp: Debian システムは、マシンの BIOS が対応していれば、様々な種類のメディアからインストール可能です。例えば、CD-ROM、USB メモリ、さらにネットワーク経由からも起動可能です。

source: <emphasis>BACK TO BASICS</emphasis> BIOS, the hardware/software interface
id_id: <emphasis>KEMBALI KE DASAR</emphasis> BIOS, antarmuka hardware/software
ja_jp: <emphasis>BACK TO BASICS</emphasis> BIOS、ハードウェア/ソフトウェアインターフェース

source: BIOS (which stands for Basic Input/Output System) is a software that is included in the motherboard (the electronic board connecting all peripherals) and executed when the computer is booted, in order to load an operating system (via an adapted bootloader). It stays in the background to provide an interface between the hardware and the software (in our case, the Linux kernel).
id_id: BIOS (singkatan dari Basic Input/Output System) ialah perangkat lunak yang disertakan di motherboard (papan elektronik yang menghubungkan seluruh peripheral) dan dieksekusi ketika memboot komputer, untuk memuat sebuah sistem operasi (melalui bootloader yang diadaptasi). Berada di background untuk menyediakan antarmuka antara perangkat keras dan perangkat lunak (dalam hal ini, kernel Linux).
ja_jp: BIOS (Basic Input/Output System の略) はマザーボード (すべての周辺装置を接続する電子回路ボード) に含まれるソフトウェアで、オペレーティングシステムを読み込むために (適合するブートローダ経由で) コンピュータの起動時に実行されます。バックグラウンドでハードウェアとソフトウェア (今回の場合 Linux カーネル) 間のインターフェースを提供します。

source: Installing from a CD-ROM/DVD-ROM
id_id: Menginstall dari CD-ROM/DVD-ROM
ja_jp: CD-ROM/DVD-ROM からのインストール

source: The most widely used installation method is from a CD-ROM (or DVD-ROM, which behaves exactly the same way): the computer is booted from this media, and the installation program takes over.
id_id: Pada umumnya metode instalasi ialah dari CD-ROM (atau DVD-ROM, yang mungkin caranya sama saja): komputer diboot dari media ini, dan program instalasi mengambil alih.
ja_jp: 最も広く使われているのは CD-ROM (DVD-ROM を使っても全く同じです) からインストールする方法です: コンピュータはメディアから起動され、インストールプログラムが以降の作業を引き継ぎます。

source: Various CD-ROM families have different purposes: <emphasis>netinst</emphasis> (network installation) contains the installer and the base Debian system; all other programs are then downloaded. Its “image”, that is the ISO-9660 filesystem that contains the exact contents of the disk, only takes up about 150 to 250 MB (depending on architecture). On the other hand, the complete set offers all packages and allows for installation on a computer that has no Internet access; it requires around 70 CD-ROMs (or 10 DVD-ROMs, or two Blu-ray disks). But the programs are divided among the disks according to their popularity and importance; the first three disks will be sufficient for most installations, since they contain the most used software.
id_id: Berbagai keluarga CD-ROM memiliki tujuan berbeda: <emphasis>netinst</emphasis> (instalasi berbasis jaringan) berisi installer dan sistem Debian dasar; seluruh program kemudian diunduh. “Citra” ini, itulah sistem berkas ISO-9660 yang berisi konten disk yang sebenarnya, hanya mengambil sekitar 150 hingga 250 (tergantung arsitekturnya). Di sisi lain, set lengkapnya menawarkan seluruh paket dan dapat untuk diinstall pada komputer yang tak ada koneksi Internet; memerlukan sekitar 70 CD-ROM (atau 10 DVD-ROM, atau dua disk Blu-ray). Namun programnya dibagi pada disk berdasarkan popularitas dan kepentingannya; tiga disk yang pertama akan penting untuk kebanyakan instalasi, karena berisi perangkat lunak yang paling sering digunakan.
ja_jp: CD-ROM の各種類には異なる目的があります: <emphasis>netinst</emphasis> (ネットワークインストール) にはインストーラとベース Debian システムが含まれています; それ以外のプログラムはダウンロードされます。これの「イメージ」はディスクと完全に同じ内容の ISO-9660 ファイルシステムで、そのサイズは 150 から 250 MB 程度 (アーキテクチャに依存します) です。一方で、完全版にはすべてのパッケージが含まれ、インターネットにアクセスできないコンピュータにシステムをインストールする事が可能です; これには 70 枚程度の CD-ROM が必要です (DVD-ROM、ブルーレイディスクの場合は 10 枚程度)。プログラムは人気と重要度に従ってディスク毎に分けられています; ほとんどの場合、最もよく使われているソフトウェアが含まれている最初の 3 枚のディスクがあれば十分でしょう。

source: Debian also used to provide a <emphasis>businesscard</emphasis> or <emphasis>bizcard</emphasis> CD-ROM, which only contained the installer, and which required all the Debian packages (including the base system) to be downloaded. Since its image only took up 35 MB, it was meant to be burnt on a “business card” type CD-ROM. This CD-ROM is no longer provided for Wheezy: the debian-installer developers estimated that the work required to maintain that image was no longer worth it. Furthermore, the <filename>mini.iso</filename> image that they already provide as by-product of the installer is very similar.
id_id: Debian juga menyediakan CD-ROM <emphasis>businesscard</emphasis> atau <emphasis>bizcard</emphasis>, yang hanya berisi installer, dan yang perlu mengunduh seluruh paket Debian (termasuk sistem dasar). Karena citra ini hanya berukuran 35 MB, dimaksudkan untuk dibakar pada CD-ROM bertipe “business card”. CD-ROM ini tak lagi disediakan untuk Wheezy: pengembang debian-installer memerkirakan pengerjaan untuk mengelola citra tersebut tak lagi bernilai. Lebih jauh, citra <filename>mini.iso</filename> yang telah disediakan sebagai produk installer sangatlah mirip.
ja_jp: 以前 Debian は <emphasis>businesscard</emphasis> または <emphasis>bizcard</emphasis> CD-ROM を提供していました。これにはインストーラだけが含まれており、(ベースシステムを含めて) すべての Debian パッケージのダウンロードが必要です。これのサイズは高々 35 MB だったので、「名刺」型 CD-ROM に書き込む事ができました。この CD-ROM の Wheezy 版はもはや提供されていません: debian-installer の開発者は、もはやこのイメージのメンテナンスに必要な作業には価値がないと判断しました。加えて、インストーラの副産物として既に提供されていた <filename>mini.iso</filename> イメージはこれとよく似ていました。

source: <emphasis>TIP</emphasis> Multi-architecture disks
id_id: <emphasis>TIP</emphasis> Disk multi-arsitektur
ja_jp: <emphasis>TIP</emphasis> マルチアーキテクチャディスク

source: Most installation CD- and DVD-ROMs work only with a specific hardware architecture. If you wish to download the complete images, you must take care to choose those which work on the hardware of the computer on which you wish to install them.
id_id: Kebanyakan CD- adan DVD-ROM instalasi hanya bekerja dengan arsitektur perangkat keras yang spesifik. Jika Anda ingin mengunduh citra yang lengkap, Anda harus memilih yang akan bekerja pada perangkat keras komputer yang yang akan Anda install.
ja_jp: ほとんどのインストール CD-ROM や DVD-ROM は単一のハードウェアアーキテクチャ専用です。完全版をダウンロードする場合、インストーラがシステムをインストールしたいコンピュータのハードウェアで動くものを選ばなければいけません。

source: Some CD/DVD-ROM images can work on several architectures. We thus have a CD-ROM image combining the <emphasis>netinst</emphasis> images of the <emphasis>i386</emphasis> and <emphasis>amd64</emphasis> architectures. There is also a DVD-ROM image that contains the installer and a selection of binary packages for <emphasis>i386</emphasis> and <emphasis>amd64</emphasis>, as well as the corresponding source packages.
id_id: Beberapa citra CD/DVD-ROM dapat bekerja pada beberapa arsitektur. Kami memiliki citra CD-ROM yang menggabungkan citra <emphasis>netinst</emphasis> arsitektur <emphasis>i386</emphasis> dan <emphasis>amd64</emphasis>. Ada juga citra DVD-ROM yang berisi installer dan pilihan paket biner untuk <emphasis>i386</emphasis> dan <emphasis>amd64</emphasis>, sebagaimana paket sumber yang sesuai.
ja_jp: いくつかの CD/DVD-ROM イメージは複数のアーキテクチャで動きます。<emphasis>i386</emphasis> と <emphasis>amd64</emphasis> アーキテクチャの <emphasis>netinst</emphasis> イメージを含む CD-ROM イメージが用意されています。また、インストーラを含み、<emphasis>i386</emphasis> と <emphasis>amd64</emphasis> 用のバイナリパッケージおよび対応するソースパッケージの選択が可能な DVD-ROM イメージも用意されています。

source: <primary>CD-ROM</primary><secondary>installation CD-ROM</secondary>
id_id: <primary>CD-ROM</primary><secondary>CD-ROM instalasi</secondary>
ja_jp: <primary>CD-ROM</primary><secondary>インストール用 CD-ROM</secondary>

source: <primary>CD-ROM</primary><secondary><emphasis>businesscard CD-ROM</emphasis></secondary>
ja_jp: <primary>CD-ROM</primary><secondary><emphasis>名刺型 CD-ROM</emphasis></secondary>

source: <primary>DVD-ROM</primary><secondary>installation DVD-ROM</secondary>
ja_jp: <primary>DVD-ROM</primary><secondary>インストール用 DVD-ROM</secondary>

source: <primary>DVD-ROM</primary><secondary><emphasis>businesscard DVD-ROM</emphasis></secondary>
ja_jp: <primary>DVD-ROM</primary><secondary><emphasis>名刺型 DVD-ROM</emphasis></secondary>

source: To acquire Debian CD-ROM images, you may of course download them and burn them to disk. You may also purchase them, and, thus, provide the project with a little financial support. Check the website to see the list of CD-ROM image vendors and download sites. <ulink type="block" url="http://www.debian.org/CD/index.html" />
id_id: Untuk mendapatkan citra CD-ROM Debian, tentu saja Anda mungkin mendunduh dan membakarnya ke disk. Anda juga dapat memesannya, dan, itu, mendukung proyek dengan finansial kecil. Periksa website untuk melihat daftar penyedia citra CD-ROM dan situs unduh. <ulink type="block" url="http://www.debian.org/CD/index.html" />
ja_jp: Debian CD-ROM を作るためには、イメージをダウンロードして、ディスクに書き込む必要があります。Debian CD-ROM は購入する事も可能で、これはプロジェクトに対する幾ばくかの資金援助になります。CD-ROM イメージ業者とダウンロード場所のリストがウェブサイトで公開されています。<ulink type="block" url="http://www.debian.org/CD/index.html" />

source: Booting from a USB Key
id_id: Booting dari USB Key
ja_jp: USB メモリから起動

source: <primary>USB key</primary>
ja_jp: <primary>USB メモリ</primary>

source: Since recent computers are able to boot from USB devices, you can also install Debian from a USB key (this is nothing more than a small flash-memory disk). Be aware, however, that not all BIOSes are the same; some are able to boot from USB 2.0 devices, while others only work with USB 1.1. Besides, the USB key must have 512-bytes sectors, and this feature, while common, is never documented on the packaging of the keys you find for sale.
id_id: Karena komputer terbaru dapat memboot dari perangkat USB, Anda dapat juga menginstall Debian dari sebuah USB Key (tak lebih dari sebuah memori-flash kecil). Berhati-hatilah, meskipun, tidak seluruh BIOS itu sama; beberapa dapat memboot dari perangkat USB 2.0, yang lainnya hanya dapat dapat dengan USB 1.1. Di samping itu, USB key harus memiliki 512-byte sektor, dan fitur ini, yang umum, tidak pernah terdokumentasi pada paket yang Anda beli.
ja_jp: 最近のコンピュータは USB デバイスから起動する事ができるため、USB メモリ (これは単なるフラッシュメモリディスクに過ぎません) から Debian をインストールする事も可能です。しかし、すべての BIOS が同じではないという点に注意してください; BIOS によっては USB 2.0 デバイスからでも起動可能なものもあれば、USB 1.1 デバイスからしか起動できないものもあります。加えて、インストールに使う USB メモリのセクタサイズは 512 バイトでなければいけません。この点についてパッケージで言及している USB メモリはめったに販売されていません。

source: The installation manual explains how to create a USB key that contains the <command>debian-installer</command>. The procedure has been significantly simplified for the <emphasis role="distribution">Squeeze</emphasis> release compared to the previous versions; the ISO images for i386 and amd64 architectures are now hybrid images that can boot from a CD-ROM as well as from a USB key.
id_id: Panduan instalasi menjelaskan bagaimana membuat sebuah USB key yang memuat <command>debian-installer</command>. Prosedurnya telah dipermudah secara signifikan untuk rilis <emphasis role="distribution">Squeeze</emphasis> dibandingkan dengan versi sebelumnya; citra ISO untuk arsitektur i386 dan amd64 sekarang citra hybrid yang dapat memboot dari CD-ROM sebagaimana dari USB key.
ja_jp: インストールマニュアルでは <command>debian-installer</command> を含む USB メモリを作成する方法が説明されています。<emphasis role="distribution">Squeeze</emphasis> リリース以降は以前に比べてこの手順が著しく単純化されました; i386 と amd64 アーキテクチャの ISO イメージは今や CD-ROM だけでなく USB メモリからも起動できるハイブリッドイメージになっています。

source: You must first identify the device name of the USB key (ex: <literal>/dev/sdb</literal>); the simplest means to do this is to check the messages issued by the kernel using the <command>dmesg</command> command. Then you must copy the previously downloaded ISO image (for example debian-7.0.0-amd64-i386-netinst.iso) with the command <command>cat debian-7.0.0-amd64-i386-netinst.iso &gt;/dev/sdb; sync</command>. This command requires administrator rights, since it accesses the USB key directly and blindly erases its content.
id_id: Anda harus mengidentifikasi nama perangkat USB key (mis: <literal>/dev/sdb</literal>); hal termudah untuk melakukan ini ialah dengan memeriksa pesan yang dikeluarkan oleh kernel dengan menggunakan perintah <command>dmesg</command>. Kemudian Anda harus menyalis citra ISO yang diunduh sebelumnya (contoh debian-7.0.0-amd64-i386-netinst.iso) dengan perintah <command>cat debian-7.0.0-amd64-i386-netinst.iso &gt;/dev/sdb; sync</command>. Perintah ini memerlukan hak akses administrator, karena mengakses USB key secara langsung dan menghapus seluruh isinya.
ja_jp: まず最初に USB メモリのデバイス名を確認しなければいけません (例: <literal>/dev/sdb</literal>); <command>dmesg</command> コマンドを使ってカーネルの出したメッセージを確認するのが最も簡単な方法です。次に前もってダウンロードした ISO イメージ (例えば debian-7.0.0-amd64-i386-netinst.iso) を <command>cat debian-7.0.0-amd64-i386-netinst.iso &gt;/dev/sdb; sync</command> のコマンドを実行してコピーしなければいけません。このコマンドは USB メモリに直接アクセスし、無差別に内容を削除するため、実行には管理者権限が必要です。

source: A more detailed explanation is available in the installation manual. Among other things, it describes an alternative method of preparing a USB key that is more complex, but that allows to customize the installer's default options (those set in the kernel command line). <ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch04s03.html" />
id_id: Penjelasan lebih detail tersedia di panduan instalasi. Antara lain, menjelaskan metode alternatif untuk menyiapkan USB key yang lebih kompleks, namun mengizinkan untuk mengostumisasi pilihan bawaan installer (yang diset pada baris perintah kernel). <ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch04s03.html" />
ja_jp: より詳しい説明はインストールマニュアルに書いてあります。このマニュアルで注目すべきは、書かれたより複雑な手順で USB メモリを準備する方法です。この方法を使うことで、インストーラのデフォルトオプションを (カーネルコマンドラインを使い) カスタマイズする事が可能です。<ulink type="block" url="http://www.debian.org/releases/stable/amd64/ch04s03.html" />

source: Installing through Network Booting
id_id: Instalasi melalui Booting Jaringan
ja_jp: ネットワークブート経由のインストール

source: <primary>installation</primary><secondary><emphasis>netboot installation</emphasis></secondary>
ja_jp: <primary>インストール</primary><secondary><emphasis>netboot インストール</emphasis></secondary>

source: <primary>installation</primary><secondary><emphasis>PXE installation</emphasis></secondary>
ja_jp: <primary>インストール</primary><secondary><emphasis>PXE インストール</emphasis></secondary>

source: <primary>installation</primary><secondary><emphasis>TFTP installation</emphasis></secondary>
ja_jp: <primary>インストール</primary><secondary><emphasis>TFTP インストール</emphasis></secondary>

source: Many BIOSes allow booting directly from the network by downloading a kernel and a minimal filesystem image. This method (which has several names, such as <acronym>PXE</acronym> or <acronym>TFTP</acronym> boot) can be a life-saver if the computer does not have a CD-ROM reader, or if the BIOS can't boot from such media.
id_id: Kebanyakan BIOS mengizinkan booting langsung dari jaringan dengan mengunduh kernel dan citra sistem berkas. Metode ini (yang memiliki beberapa nama, seperti <acronym>PXE</acronym> atau <acronym>FTFP</acronym> boot) dapat menjadi penyelamat-hidup jika komputer tidak memiliki pembaca CD-ROM, atau jika BIOS tidak dapat boot dari media apapun.
ja_jp: 多くの BIOS では、カーネルと最低限のファイルシステムイメージをダウンロードすることでネットワークから直接起動できるようになっています。<acronym>PXE</acronym> や <acronym>TFTP</acronym> ブートなどと呼ばれるこの方法は CD-ROM ドライブを持たないコンピュータやメディアからの起動をサポートしていない BIOS を備えたコンピュータにインストールを行う場合の救世主になります。

source: This installation method works in two steps. First, while booting the computer, the BIOS (or the network card) issues a BOOTP/DHCP request to automatically acquire an IP address. When a BOOTP or DHCP server returns a response, it includes a filename, as well as network settings. After having configured the network, the client computer then issues a TFTP (Trivial File Transfer Protocol) request for a file whose name was previously indicated. Once this file is acquired, it is executed as though it were a bootloader. This then launches the Debian installation program, which is executed as though it were running from the hard drive, a CD-ROM, or a USB key.
id_id: Metode instalasi ini bekerja dalam dua langkah. Pertama, ketika booting komputer, BIOS (atau kartu jaringan) mengeluarkan permintaan BOOTP/DHCP untuk mendapatkan alamat IP secara otomatis. Ketika BOOTP atau server DHCP memberikan respon, beserta nama berkas, sebagaimana pengaturan jaringan. Setelah jaringan diatur, komputer klien mengeluarkan permintaan TFTP (Trivial File Transfer Protocol) untuk sebuah berkas yang namanya diindikasikan sebelumnya. Setelah berkas ini didapatkan, berkas tersebut dieksekusi sebagai bootloader. Berkas ini kemudian memulai program instalasi Debian, yang dieksekusi sebagaimana ketika dieksekusi dari perangkat keras, CD-ROM, atau USB key.
ja_jp: ネットワークブート経由のインストール方法は 2 段階で行われます。最初に、コンピュータ起動中の BIOS (またはネットワークカード) が自動的に IP アドレスを取得するために BOOTP/DHCP 要求を出します。BOOTP または DHCP サーバがこれに応答し、ファイル名とネットワーク設定を返します。ネットワークの設定が終了した後、クライアントコンピュータは先に返されたファイル名のファイルを取得するために TFTP (Trivial File Transfer Protocol) 要求を出します。ファイルの取得が終わったら、ファイルをあたかもブートローダであるかのごとく実行します。ブートローダは Debian インストールプログラムを起動し、インストーラはハードドライブ、CD-ROM、USB メモリから起動したのと同じように実行されます。
