Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: <command>dpkg</command> removes all of the package's files, with the exception of the configuration files and configuration scripts.
de_de: <command>dpkg</command> entfernt alle Dateien des Pakets bis auf die Konfigurationsdateien und die Konfigurationsskripte.
es_es: <command>dpkg</command> elimina todos los archivos del paquete, con la excepción de los archivos de configuración y scripts de configuración.
it_it: <command>dpkg</command> rimuove tutti i file del pacchetto, con l'eccezione dei file di configurazione e gli script di configurazione.
ja_jp: <command>dpkg</command> は設定ファイルと設定スクリプトを除くすべてのパッケージのファイルを削除します。
zh_cn: <command>dpkg</command> 移除了所有的软件包文件，只剩下了配置文件和配置的脚本。

source: <command>dpkg</command> executes <command>postrm remove</command>. All of the configuration scripts, except <filename>postrm</filename>, are removed. If the user has not used the “purge” option, the process stops here.
ja_jp: <command>dpkg</command> は <command>postrm remove</command> を実行します。すべての設定スクリプトは <filename>postrm</filename> を除いて削除されます。ユーザが「purge」オプションを指定しない限り、作業はここで終了します。

source: For a complete purge of the package (command issued with <command>dpkg --purge</command> or <command>dpkg -P</command>), the configuration files are also deleted, as well as a certain number of copies (<filename>*.dpkg-tmp</filename>, <filename>*.dpkg-old</filename>, <filename>*.dpkg-new</filename>) and temporary files; <command>dpkg</command> then executes <command>postrm purge</command>.
de_de: Bei einer vollständigen Entfernung des Paketes (durch den Befehl <command>dpkg --purge</command> oder <command>dpkg -P</command>) werden sowohl die Konfigurationsdateien entfernt, als auch eine Anzahl von Kopien (<filename>*.dpkg-tmp</filename>, <filename>*.dpkg-old</filename>, <filename>*.dpkg-new</filename>) und temporären Dateien; <command>dpkg</command> führt dann abschließend <command>postrm purge</command> aus.
es_es: Para eliminar completamente un paquete (con la orden <command>dpkg --purge</command> o <command>dpkg -P</command>), los archivos de configuración también son eliminados junto con una cantidad de copias (<filename>*.dpkg-tmp</filename>, <filename>*.dpkg-old</filename>, <filename>*.dpkg-new</filename>) y archivos temporales; luego <command>dpkg</command> ejecuta <command>postrm purge</command>.
it_it: Per una eliminazione completa del pacchetto (comando impartito con <command>dpkg --purge</command> o <command>dpkg -P</command>), anche i file di configurazione vengono eliminati, così come certe copie (<filename>*.dpkg-tmp</filename>, <filename>*.dpkg-old</filename>, <filename>*.dpkg-new</filename>) e certi file temporanei; poi <command>dpkg</command> esegue <command>postrm purge</command>.
ja_jp: パッケージを完全消去する (<command>dpkg --purge</command> または <command>dpkg -P</command> を実行した) 場合、設定ファイルおよびそのコピー (<filename>*.dpkg-tmp</filename>、<filename>*.dpkg-old</filename>、<filename>*.dpkg-new</filename>) と一時ファイルも削除されます; <command>dpkg</command> は <command>postrm purge</command> を実行します。
zh_cn: 对于一个完整的清除包（由<command>dpkg --purge</command>或<command>dpkg -P</command>发出的），配置文件也将会被删除，同时一些副本（<filename>*.dpkg-tmp</filename>,<filename>*.dpkg-old</filename>,<filename>*.dpkg-new</filename>）和缓存文件也会被删除掉；<command>dpkg</command>这时会执行<command>postrm purge</command>。

source: <emphasis>VOCABULARY</emphasis> Purge, a complete removal
ja_jp: <emphasis>VOCABULARY</emphasis> Purge、完全消去

source: <primary>purge of a package</primary>
de_de: <primary>vollständiges Entfernen („purge“) eines Pakets</primary>
es_es: <primary>purga de un paquete</primary>
it_it: <primary>eliminazione completa di un pacchetto</primary>
ja_jp: <primary>パッケージの完全消去</primary>
zh_cn: <primary>清除软件包</primary>

source: When a Debian package is removed, the configuration files are retained in order to facilitate possible re-installation. Likewise, the data generated by a daemon (such as the content of an LDAP server directory, or the content of a database for an SQL server) are usually retained.
de_de: Wenn ein Debian-Paket entfernt wird, bleiben die Konfigurationsdateien erhalten, um eine mögliche Re-Installation zu erleichtern. In gleicher Weise bleiben die von einem Hintergrundprogramm erzeugten Daten (wie der Inhalt eines LDAP-Server-Verzeichnisses oder der Inhalt einer SQL-Server-Datenbank) normalerweise erhalten.
es_es: Cuando un paquete de Debian es eliminado, se mantienen los archivos de configuración para facilitar una posible reinstalación. De la misma forma, se mantienen normalmente los datos generados por un demonio (como el contenido de un servidor de directorio LDAP o el contenido de una base de datos de un servidor SQL).
it_it: Quando un pacchetto Debian viene rimosso, i file di configurazione sono conservati per facilitare una possibile reinstallazione. Per lo stesso motivo, i dati generati da un demone (come i contenuti della directory di un server LDAP o il contenuto di un database per un server SQL) normalmente sono conservati.
ja_jp: Debian パッケージが削除されても、パッケージの設定ファイルは後々の再インストールを楽にするために削除されません。同様に、デーモンが作成したデータ (LDAP サーバディレクトリの内容、SQL サーバのデータベースの内容など) も削除されません。
zh_cn: 当Debian的软件包被移除掉的时候，该软件包的配置文件会被保留下来以便重新安装。同样，守护程序产生的数据（比如LDAP的服务器目录内容，或者是SQL服务器的数据库内容）也常常会被保留。

source: To remove all data associated with a package, it is necessary to “purge” the package with the command, <command>dpkg -P <replaceable>package</replaceable></command>, <command>apt-get remove --purge <replaceable>package</replaceable></command> or <command>aptitude purge <replaceable>package</replaceable></command>.
de_de: Um alle mit einem Paket in Verbindung stehenden Daten zu entfernen, muss das Paket mit dem Befehl <command>dpkg -P <replaceable>paket</replaceable></command>, <command>apt-get remove --purge <replaceable>paket</replaceable></command> oder <command>aptitude purge <replaceable>paket</replaceable></command> gelöscht werden.
es_es: Para eliminar todos los datos asociados con un paquete es necesario «purgar» el paquete con la orden <command>dpkg -P <replaceable>paquete</replaceable></command>, <command>apt-get remove --purge <replaceable>paquete</replaceable></command> o <command>aptitude purge <replaceable>paquete</replaceable></command>.
it_it: Per rimuovere tutti i dati associati a un pacchetto, è necessario eseguirne il «purge» con il comando <command>dpkg -P <replaceable>pacchetto</replaceable></command>, <command>apt-get remove --purge <replaceable>pacchetto</replaceable></command> oppure <command>aptitude purge <replaceable>pacchetto</replaceable></command>.
ja_jp: パッケージに関連するすべてのデータを削除するには、以下のコマンドを使ってパッケージを「完全消去」する必要があります。<command>dpkg -P <replaceable>package</replaceable></command>、<command>apt-get remove --purge <replaceable>package</replaceable></command>、<command>aptitude purge <replaceable>package</replaceable></command>。
zh_cn: 移除掉软件包所关联的所有数据，必须使用“purge”命令，<command>dpkg -P<replaceable>软件包</replaceable></command>，<command>apt-get remove --purge <replaceable>软件包</replaceable></command> 或者是<command>aptitude purge <replaceable>软件包</replaceable></command>。

source: Given the definitive nature of such data removal, purge should not be taken lightly.
de_de: Angesichts der Unwiderruflichkeit einer derartigen Datenlöschung sollte „purge“ nicht unbedacht verwendet werden.
es_es: Dada la naturaleza definitiva de tal eliminación de datos, no se debe tomar a la ligera el purgado.
it_it: Vista la natura definitiva di tale rimozione di dati, questa operazione non dovrebbe essere intrapresa con leggerezza.
ja_jp: このようなデータに含まれる内容を考慮すると、安易に完全消去を実行するべきではありません。
zh_cn: 位了更好的明确操作的性质，在删除数据，清除数据的时候，我们应当更加小心。

source: <primary><filename>config</filename>, <command>debconf</command> script</primary>
ja_jp: <primary><filename>config</filename>、<command>debconf</command> スクリプト</primary>

source: The four scripts detailed above are complemented by a <filename>config</filename> script, provided by packages using <command>debconf</command> to acquire information from the user for configuration. During installation, this script defines in detail the questions asked by <command>debconf</command>. The responses are recorded in the <command>debconf</command> database for future reference. The script is generally executed by <command>apt</command> prior to installing packages one by one in order to group all the questions and ask them all to the user at the beginning of the process. The pre- and post-installation scripts can then use this information to operate according to the user's wishes.
ja_jp: 上で詳細を述べた 4 つのスクリプトの実行を補助するのが <filename>config</filename> スクリプトです。パッケージが提供するこのスクリプトは <command>debconf</command> を用いて設定に必要な情報をユーザに入力させるためのものです。ユーザからの情報は <command>debconf</command> データベースに保存され、後々利用されます。このスクリプトは通常 <command>apt</command> によって各パッケージインストールの前に実行され、処理が始まるとすべての質問をまとめてユーザに尋ねます。インストール前後に実行されるスクリプトは、ユーザの希望を反映させるために、これらの情報を利用します。

source: <command>debconf</command> was created to resolve a recurring problem in Debian. All Debian packages unable to function without a minimum of configuration used to ask questions with calls to the <command>echo</command> and <command>read</command> commands in <filename>postinst</filename> shell scripts (and other similar scripts). But this also means that during a large installation or update the user must stay with their computer to respond to various questions that may arise at any time. These manual interactions have now been almost entirely dispensed with, thanks to the <command>debconf</command> tool.
ja_jp: <command>debconf</command> は Debian で繰り返し発生する問題を解決するために作られました。すべての Debian パッケージは最低限の設定無しには機能しません。昔は最低限の設定をするために <filename>postinst</filename> シェルスクリプト (と同様の別のスクリプト) の中で <command>echo</command> や <command>read</command> コマンドを呼び出して質問していました。しかしこの方法では、ユーザは長いインストールや更新の最中、いつあるかわからない様々な質問に答えるために、コンピュータの前に居続けなければいけませんでした。<command>debconf</command> ツールのお陰で、今やほとんどの場合、このような手動設定法を採る必要はなくなりました。

source: <command>debconf</command> has many interesting features: it requires the developer to specify user interaction; it allows localization of all the strings displayed to users (all translations are stored in the <filename>templates</filename> file describing the interactions); it has different frontends to display the questions to the user (text mode, graphical mode, non-interactive); and it allows creation of a central database of responses to share the same configuration with several computers... but the most important is that it is now possible to present all of the questions in a row to the user, prior to starting a long installation or update process. The user can go about their business while the system handles the installation on its own, without having to stay there staring at the screen waiting for questions.
ja_jp: <command>debconf</command> には多くの興味深い機能があります: 開発者はユーザに入力させる内容を規定する事が可能です; ユーザに向けて表示されるすべての文字列の地域化が可能です (すべての翻訳は入力内容を説明している <filename>templates</filename> ファイルに保存されます); ユーザに質問を表示するための様々なフロントエンド (テキストモード、グラフィカルモード、非対話モード) があります; 複数のコンピュータで同じ設定を共有するために、ユーザが入力した内容の中央データベースを作成する事が可能です... しかし最も重要な機能は、ユーザに対するすべての質問が長時間かかるインストールや更新作業の前に行われる点です。ユーザはシステムがインストールを行っている間に自分の仕事をできます、質問に答えるために画面の前に居続ける必要はありません。

source: Checksums, List of Configuration Files
de_de: Checksummen, Liste der Konfigurationsdateien
es_es: Sumas de verificación («checksum»), lista de archivos de configuración
it_it: Somme di controllo, elenco di file di configurazione
ja_jp: チェックサム、設定ファイルのリスト
zh_cn: 校验，配置文件列表

source: <primary>checksums</primary>
ja_jp: <primary>チェックサム</primary>

source: <primary>files</primary><secondary>configuration files</secondary>
de_de: <primary>Dateien</primary><secondary>Konfigurationsdateien</secondary>
es_es: <primary>configuración</primary><secondary>archivos de configuración</secondary>
it_it: <primary>file</primary><secondary>file di configurazione</secondary>
ja_jp: <primary>ファイル</primary><secondary>設定ファイル</secondary>
zh_cn: <primary>文件</primary><secondary>配置文件</secondary>

source: <primary>configuration</primary><secondary>files</secondary>
de_de: <primary>Konfiguration</primary><secondary>Dateien</secondary>
es_es: <primary>archivo</primary><secondary>de configuración</secondary>
it_it: <primary>configurazione</primary><secondary>file</secondary>
ja_jp: <primary>設定</primary><secondary>ファイル</secondary>
zh_cn: <primary>配置</primary><secondary>文件</secondary>

source: In addition to the maintainer scripts and control data already mentioned in the previous sections, the <filename>control.tar.gz</filename> archive of a Debian package may contain other interesting files. The first, <filename>md5sums</filename>, contains the MD5 checksums for all of the package's files. Its main advantage is that it allows a tool such as <command>debsums</command> (which we will study in <xref linkend="sect.debsums" />) to check if these files have been modified since their installation. Note that when this file doesn't exist, <command>dpkg</command> will generate it dynamically at installation time (and store it in the dpkg database just like other control files).
ja_jp: 前の節で既に説明したメンテナスクリプトと管理情報に加えて、Debian パッケージの <filename>control.tar.gz</filename> アーカイブに興味深いファイルが含まれている場合があります。1 つ目は <filename>md5sums</filename> で、このファイルにはパッケージに含まれる全ファイルの MD5 チェックサムが列挙されています。これのお陰で、<command>debsums</command> などのツール (詳しくは<xref linkend="sect.debsums" />を参照) はインストール以降ファイルが変更されたか否かを判断できるようになります。このファイルが存在しなければ、<command>dpkg</command> がインストール時に動的にこのファイルを生成します (そして他の管理情報ファイルと同様に dpkg データベースに内容を保存します)。

source: <filename>conffiles</filename> lists package files that must be handled as configuration files. Configuration files can be modified by the administrator, and <command>dpkg</command> will try to preserve those changes during a package update.
ja_jp: <filename>conffiles</filename> では、設定ファイルとして取り扱われるべきパッケージファイルが指定されています。管理者は設定ファイルを変更でき、<command>dpkg</command> はパッケージの更新中に設定ファイルの変更を保存しようとします。

source: In effect, in this situation, <command>dpkg</command> behaves as intelligently as possible: if the standard configuration file has not changed between the two versions, it does nothing. If, however, the file has changed, it will try to update this file. Two cases are possible: either the administrator has not touched this configuration file, in which case <command>dpkg</command> automatically installs the new version; or the file has been modified, in which case <command>dpkg</command> asks the administrator which version they wish to use (the old one with modifications, or the new one provided with the package). To assist in making this decision, <command>dpkg</command> offers to display a “<command>diff</command>” that shows the difference between the two versions. If the user chooses to retain the old version, the new one will be stored in the same location in a file with the <filename>.dpkg-dist</filename> suffix. If the user chooses the new version, the old one is retained in a file with the <filename>.dpkg-old</filename> suffix. Another available action consists of momentarily interrupting <command>dpkg</command> to edit the file and attempt to re-instate the relevant modifications (previously identified with <command>diff</command>).
de_de: Im Ergebnis verhält sich <command>dpkg</command> in dieser Situation möglichst intelligent: falls die Standard-Konfigurationsdatei zwischen zwei Versionen nicht verändert worden ist, tut es gar nichts. Falls die Datei jedoch verändert wurde, wird es versuchen, sie zu aktualisieren. Zwei Fälle sind möglich: entweder hat der Administrator diese Konfigurationsdatei nicht angerührt, dann installiert <command>dpkg</command> automatisch die neue Version; oder die Datei ist verändert worden, dann fragt <command>dpkg</command> den Administrator, welche Version er verwenden möchte (die alte mit den Veränderungen oder die neue, die mit dem Paket bereitgestellt wird). Um diese Entscheidung zu erleichtern, bietet <command>dpkg</command> an, ein „<command>diff</command>“ anzuzeigen, das die Unterschiede zwischen den beiden Versionen aufführt. Falls der Nutzer sich entscheidet, die alte Version zu behalten, wird die neue am selben Ort in einer Datei mit dem Zusatz <filename>.dpkg-old</filename> abgespeichert. Eine weitere mögliche Maßnahme besteht darin, <command>dpkg</command> vorübergehend anzuhalten und dann die Datei zu editieren, und dabei zu versuchen, die relevanten Veränderungen (die zuvor durch <command>diff</command> identifiziert worden sind) wieder einzusetzen.
es_es: De hecho, en esta situación, <command>dpkg</command> se comporta tan inteligentemente como le es posible: si el archivo de configuración estándar no fue modificado entre dos versiones, no hace nada. Si, sin embargo, el archivo cambió intentará actualizar este archivo. Son posibles dos casos: o bien el administrador no modificó el archivo, en cuyo caso <command>dpkg</command> automáticamente instalará la nueva versión; o el archivo fue modificado, en cuyo caso <command>dpkg</command> le preguntará al administrador qué versión desea utilizar (la antigua con modificaciones o la nueva provista con el paquete). Para asistirlo en esta decisión <command>dpkg</command> ofrece mostrar las diferencias entre las dos versiones («<command>diff</command>»). Si el usuario decide mantener la versión anterior, la nueva será almacenada en la misma ubicación con el sufijo <filename>.dpkg-dist</filename>. Si el usuario selecciona la nueva versión, se mantiene la versión anterior en la misma ubicación con el sufijo <filename>.dpkg-old</filename>. Otra acción posible consiste en interrumpir momentáneamente <command>dpkg</command> para editar el archivo e intentar rehacer las modificaciones relevantes (identificadas previamente con <command>diff</command>).
it_it: In effetti, in questa situazione, <command>dpkg</command> si comporta il più intelligentemente possibile: non fa niente se il file di configurazione standard non è cambiato tra le due versioni. Se, invece, il file è cambiato, cercherà di aggiornarlo. Sono possibili due casi: o l'amministratore non ha toccato questo file di configurazione, nel qual caso <command>dpkg</command> installa automaticamente la nuova versione; oppure il file è stato modificato, nel qual caso <command>dpkg</command> chiede all'amministratore quale versione desidera usare (quella vecchia con modifiche o quella nuova fornita con il pacchetto). Per aiutare nella decisione, <command>dpkg</command> offre la possibilità di visualizzare un «<command>diff</command>» che mostra le differenze tra le due versioni. Se l'utente sceglie di tenere la vecchia versione, quella nuova sarà memorizzata nella stessa posizione, in un file con il suffisso <filename>.dpkg-dist</filename>. Se l'utente sceglie la nuova versione, quella vecchia è mantenuta in un file con il suffisso <filename>.dpkg-old</filename>. Un'altra azione disponibile consiste nell'interrompere momentaneamente <command>dpkg</command> per modificare il file e tentare di applicare di nuovo le relative modifiche (precedentemente identificate con <command>diff</command>).
ja_jp: 実際のところこの状況では、<command>dpkg</command> はできるだけ賢明に振舞います: パッケージに含まれる標準的な設定ファイルが 2 つのバージョン間で変更されていなければ、何もしません。しかしながら、標準的な設定ファイルが 2 つのバージョン間で変更されていたら、ファイルを更新しようとします。2 つの場合が考えられます: 管理者が設定ファイルに変更を加えていなければ、<command>dpkg</command> は自動的にパッケージに含まれる新しいバージョンをインストールします; 管理者が設定ファイルに変更を加えていれば、<command>dpkg</command> は管理者にどちらのバージョン(変更された古いバージョン、またはパッケージに含まれる新しいバージョン) を使うかを尋ねます。どちらのバージョンを使うかの判断を手助けするために、<command>dpkg</command> は「<command>diff</command>」を使って 2 つのバージョンの違いを表示します。ユーザが古いバージョンを選んだ場合、新しいバージョンは同じ場所にファイル名の末尾に <filename>.dpkg-dist</filename>を追加して保存されます。ユーザが新しいバージョンを選んだ場合、古いバージョンはファイル名の末尾に <filename>.dpkg-old</filename> を追加して保存されます。他の利用可能な操作は、一旦 <command>dpkg</command> の処理を中断してファイルを編集する、または改めてバージョン間の違いを表示する (先と同じ様に <command>diff</command> コマンドを実行する) です。
zh_cn: 实际上，在这种情况下，<command>dpkg</command>的行为会尽可能地智能：如果两个版本之间并没有改变标准的配置文件，那么<command>dpkg</command>就什么也不会作。但是，如果文件已经被修改，它会尝试更新此文件。这会产生两种可能的情况：一是管理员没有碰配置文件，在这种情况下<command>dpkg</command>会自动安装新版本；二是文件已经被修改了，在这种情况下<command>dpkg</command>会询问管理员希望使用哪个版本（旧版本或者新的）。为了帮助用户作出选择，<command>dpkg</command>会提供“<command>差异</command>”，这会显示两个版本之间的差异。如果用户选择保留旧的版本，新的将被存储在文件夹的同一个位置并以<filename>.dpkg-dist</filename>为后缀名的文件中。另外一个可能的操作是由暂时中断的<command>dpkg</command>来编辑该文件，并试图重新恢复相关的修改（之前被验证的<command>差异</command>）。

source: <emphasis>GOING FURTHER</emphasis> Avoiding the configuration file questions
de_de: <emphasis>WEITERE SCHRITTE</emphasis> Die Fragen zur Konfigurationsdatei vermeiden
es_es: <emphasis>YENDO MÁS ALLÁ</emphasis> Evitando preguntas sobre los archivos de configuración
it_it: <emphasis>APPROFONDIMENTI</emphasis> Evitare le domande del file di configurazione
ja_jp: <emphasis>GOING FURTHER</emphasis> 設定ファイルに関連する質問を回避する
zh_cn: <emphasis>更进一步</emphasis> 避免配置文件问题

source: <command>dpkg</command> handles configuration file updates, but, while doing so, regularly interrupts its work to ask for input from the administrator. This makes it less than enjoyable for those who wish to run updates in a non-interactive manner. This is why this program offers options that allow the system to respond automatically according to the same logic: <command>--force-confold</command> retains the old version of the file; <command>--force-confnew</command> will use the new version of the file (these choices are respected, even if the file has not been changed by the administrator, which only rarely has the desired effect). Adding the <command>--force-confdef</command> option tells <command>dpkg</command> to decide by itself when possible (in other words, when the original configuration file has not been touched), and only uses <command>--force-confnew</command> or <command>--force-confold</command> for other cases.
ja_jp: <command>dpkg</command> は設定ファイルの更新を担当しますが、更新中に管理者からの入力を要求するため、更新作業は定期的に中断されます。この状況は非対話的に更新作業を行いたいと思う人にとって都合がよいとは言えない。そのため、<command>dpkg</command> にはシステムが同じ基準で自動的に質問に回答するオプションが用意されています: <command>--force-confold</command> を使うとファイルの古いバージョンが保持されます; <command>--force-confnew</command> を使うとファイルの新しいバージョンが使われます (管理者がファイルを変更していた場合さえも、これらの基準が優先されますから、期待通りの結果を得られない事が多いです)。<command>--force-confdef</command> オプションを使うと、<command>dpkg</command> は可能な場合は (言い換えれば、オリジナルの設定ファイルが変更されていなければ) 自動的にデフォルトの動作を選ぶようになり、その他の場合は <command>--force-confnew</command> または <command>--force-confold</command> を使うようになります。
