Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: <indexterm><primary><command>ar</command></primary></indexterm> As for the <command>ar</command> program, it allows handling files of the same name: <command>ar t <replaceable>archive</replaceable></command> displays the list of files contained in such an archive, <command>ar x <replaceable>archive</replaceable></command> extracts the files from the archive into the current working directory, <command>ar d <replaceable>archive</replaceable> <replaceable>file</replaceable></command> deletes a file from the archive, etc. Its man page (<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>) documents its many other operations. <command>ar</command> is a very rudimentary tool that a Unix administrator would only use on rare occasions, but admins routinely use <command>tar</command>, a more evolved archive and file management program. This is why it is easy to restore <command>dpkg</command> in the event of an erroneous deletion. You would only have to download the Debian package and extract the content from the archive <filename>data.tar.gz</filename> in the system's root (<filename>/</filename>):
de_de: <indexterm><primary><command>ar</command></primary></indexterm> Das Paket <command>ar</command> ermöglicht es, mit Dateien, die diesen Namen tragen, umzugehen: <command>ar t <replaceable>archiv</replaceable></command> zeigt eine Liste der in einem solchen Archiv enthaltenen Dateien an, <command>ar x <replaceable>archiv</replaceable></command> entpackt die Dateien aus dem Archiv in das aktuelle Arbeitsverzeichnis, <command>ar d <replaceable>archiv</replaceable> <replaceable>datei</replaceable></command> löscht eine Datei aus dem Archiv usw. Seine Handbuchseite (<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>) dokumentiert noch viele weitere Arbeitsgänge. <command>ar</command> ist ein sehr elementares Werkzeug, das ein Unix-Administrator nur selten benutzen wird. Stattdessen verwenden Administratoren üblicherweise <command>tar</command>, ein höher entwickeltes Programm für das Archiv- und Dateimanagement. Daher ist es einfach, <command>dpkg</command> wieder herzustellen, falls es versehentlich gelöscht wurde. Sie brauchen nur das Debian-Paket herunterzuladen und seinen Inhalt aus dem Archiv <filename>data.tar.gz</filename> in das Wurzelverzeichnis des Systems (<filename>/</filename>) zu entpacken:
es_es: <indexterm><primary><command>ar</command></primary></indexterm> En cuanto al programa <command>ar</command>, permite manejar los archivos del mismo nombre: <command>ar t <replaceable>compendio</replaceable></command> muestra la lista de archivos contenidos en el compendio, <command>ar x <replaceable>compendio</replaceable></command> extrae dichos archivos al directorio actual, <command>ar d <replaceable>compendio</replaceable> <replaceable>archivo</replaceable></command> elimina un archivo del compendio, etc. Su página de manual (<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>) documenta sus muchas otras operaciones. <command>ar</command> es una herramienta muy rudimentaria que un administrador Unix sólo utilizaría en raras ocasiones, pero utilizarían rutinariamente <command>tar</command>, un programa de manejo de archivos y compendios más evolucionado. Es por eso que es sencillo restaurar <command>dpkg</command> en el caso de que sea eliminado por error. Sólo necesita descargar el paquete Debian y extraer el contenido del archivo <filename>data.tar.gz</filename> en la raíz del sistema (<filename>/</filename>):
it_it: <indexterm><primary><command>ar</command></primary></indexterm>Per quanto riguarda il programma <command>ar</command>, esso permette la gestione dei file con lo stesso nome: <command>ar t <replaceable>archivio</replaceable></command> visualizza l'elenco dei file contenuti in tale archivio, <command>ar x <replaceable>archivio</replaceable></command> estrae i file dall'archivio nella directory di lavoro corrente, <command>ar d <replaceable>archivio</replaceable> <replaceable>file</replaceable></command> elimina un file dall'archivio, ecc. La sua pagina di manuale (<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>) documenta le sue numerose operazioni. <command>ar</command> è uno strumento molto rudimentale che un amministratore Unix userebbe solo in rare occasioni, ma gli amministratori abitualmente usano <command>tar</command>, un programma di archiviazione e gestione file più evoluto. Questo è il motivo per cui è facile ripristinare <command>dpkg</command> in caso di una sua eliminazione accidentale. Si dovrebbe solo scaricare il pacchetto Debian ed estrarre il contenuto dall'archivio <filename>data.tar.gz</filename> alla radice del sistema (<filename>/</filename>):

source: <xref linkend="solving-problems" /> discusses manual pages in further detail (see <xref linkend="section.manuel" />).
de_de: <xref linkend="solving-problems" /> erläutert Handbuchseiten ausführlicher (siehe <xref linkend="section.manuel" />).
es_es: El <xref linkend="solving-problems" /> discute las páginas de manual con más detalles (revise la <xref linkend="section.manuel" />).
it_it: Il <xref linkend="solving-problems" /> tratta le pagine di manuale in maggior dettaglio (vedere la <xref linkend="section.manuel" />).
zh_cn: <xref linkend="solving-problems" /> 更详细地讨论 man 手册系统 （参见 <xref linkend="section.manuel" />）。

source: <filename>debian-binary</filename>. This is a text file which simply indicates the version of the <filename>.deb</filename> file used (in 2011: version 2.0).
de_de: <filename>debian-binary</filename>. Dies ist eine Textdatei, die lediglich die Version der verwendeten <filename>.deb</filename>-Datei angibt (2011: Version 2.0).
es_es: <filename>debian-binary</filename>. Es un archivo de texto que indica simplemente la versión del archivo <filename>.deb</filename> utilizado (en 2011: versión 2.0).
it_it: <filename>debian-binary</filename>. Questo è un file di testo che indica semplicemente la versione del file <filename>.deb</filename> usato (nel 2011: versione 2.0).
zh_cn: <filename>debian-binary</filename>，这是一个文本文件，简单写明了该 <filename>.deb</filename> 文件使用的文件版本（2011年时是2.0版本）。

source: <filename>control.tar.gz</filename>. This archive file contains all of the available meta-information. In it, package management tools find, among other things, the name and version of the package. Some of this meta-information allows them to determine if it is possible to install or uninstall it, for example according to the list of packages already on the machine.
de_de: <filename>control.tar.gz</filename>. Diese Archivdatei enthält alle verfügbaren Meta-Informationen. In ihr finden Paketverwaltungsprogramme unter anderem den Namen und die Version des Paketes. Manche dieser Meta-Information ermöglicht ihnen die Entscheidung, ob die enthaltenen Programme zum Beispiel unter Beachtung der Liste der bereits auf dem Gerät installierten Pakete installiert oder deinstalliert werden können.
es_es: <filename>control.tar.gz</filename>. Este compendio contiene toda la metainformación disponible. Las herramientas de gestión de paquetes encuentran en él, entre otras cosas, el nombre y la versión del paquete. Alguna de esta metainformación les permite determinar si es posible instalar o desinstalarlo, por ejemplo según la lista de paquetes que ya se encuentran en el equipo.
it_it: <filename>control.tar.gz</filename>. Questo file archivio contiene tutte le meta-informazioni disponibili. In esso, gli strumenti di gestione dei pacchetti trovano, tra le altre cose, il nome e la versione del pacchetto. Alcune di queste meta-informazioni permettono loro di determinare se è possibile installarlo o disinstallarlo, per esempio secondo l'elenco dei pacchetti già sulla macchina.

source: <command>=</command>: equal to (note, “<literal>2.6.1</literal>” is not equal to “<literal>2.6.1-1</literal>”);
de_de: <command>=</command>: gleich (beachte, „<literal>2.6.1</literal>“ ist nicht gleich „<literal>2.6.1-1</literal>“);
es_es: <command>=</command>: igual a (note que «<literal>2.6.1</literal>» no es igual a «<literal>2.6.1-1</literal>»);
it_it: <command>=</command>: uguale (notare che «<literal>2.6.1</literal>» non è uguale a «<literal>2.6.1-1</literal>»);
zh_cn: <command>=</command>：等于（注意， “<literal>2.6.1</literal>” 不等于 “<literal>2.6.1-1</literal>”）；

source: In a list of conditions to be met, the comma serves as a separator. In logic, its meaning would be interpreted as “and”. In conditions, the vertical bar (“|”) expresses “or” in logic (it is an inclusive “or”, as opposed to meaning “either/or”). Carrying greater priority than “and”, it can be used as many times as necessary. Thus, the dependency “(A or B) and C” is written <command>A | B, C</command>. In contrast, the expression “A or (B and C)” should be written as “(A or B) and (A or C)”, since the <literal>Depends</literal> field does not tolerate parentheses that change the order of priorities between the logical operators “or” and “and”. It would thus be written <command>A | B, A | C</command>. <ulink type="block" url="http://www.debian.org/doc/debian-policy/ch-relationships.html" />
de_de: In einer Liste der zu erfüllenden Bedingungen dient das Komma als Trennzeichen. Logisch wird es als „und“ interpretiert. In den Bedingungen drückt der vertikale Strich („|“) ein logisches „oder“ aus (es ist ein nichtausschließendes „oder“ im Gegensatz zu „entweder/oder“). Es hat einen höheren Rang als „und“ und kann so oft eingesetzt werden, wie es erforderlich ist. So wird die Abhängigkeit „(A oder B) und C“ geschrieben als <command>A | B, C</command>. Dagegen sollte der Ausdruck „A oder (B und C)“ geschrieben werden als „(A oder B) und (A oder C)“, da die <literal>Depends</literal>-Zeilen keine Klammern zulassen, die die Rangordnung zwischen den logischen Operatoren „oder“ und „und“ verändern. Es würde daher als <command>A | B, A | C</command> geschrieben. <ulink type="block" url="http://www.debian.org/doc/debian-policy/ch-relationships.html" />
es_es: En una lista de condiciones a cumplir, la coma sirve como separador. En lógica su significado sería el de «y». En las condiciones una barra vertical («|») expresa un «o» lógico (es un «o» inclusivo en lugar de significar «uno o el otro»). Tiene más prioridad que «y» y puede ser utilizado tantas veces como sea necesario. Por lo tanto, la dependencia «(A o B) y C» se escribe <command>A | B, C</command>. Por otro lado, la expresión «A o (B y C)» debe escribirse «(A o B) y (A o C)» ya que el campo <literal>Depends</literal> no permite paréntesis que cambien el orden de las prioridades entre los operadores lógicos «o» e «y». Por lo tanto, se lo escribiría <command>A | B, A | C</command>. <ulink type="block" url="http://www.debian.org/doc/debian-policy/ch-relationships.html" />
it_it: In un elenco di condizioni che devono essere verificate, la virgola serve come separatore. In logica il suo significato sarebbe interpretato come «and». Nelle condizioni, la barra verticale («|») esprime «or» in logica (è un «or» inclusivo, diverso dal significato «o... o...»). Ha una priorità superiore di «and» e può essere usata tante volte quanto necessario. Perciò, la dipendenza «(A o B) e C» viene scritta <command>A | B, C</command>. Invece l'espressione «A o (B e C)» deve essere scritta come «(A o B) e (A o C)», perché il campo <literal>Depends</literal> non accetta parentesi che cambino la priorità tra gli operatori logici «or» e «and». Verrebbe perciò scritta come <command>A | B, A | C</command>. <ulink type="block" url="http://www.debian.org/doc/debian-policy/ch-relationships.html" />
zh_cn: 在列表中必须满足一个条件,那就是逗号作为分隔符。逻辑上，就是“和”的意思。在这种条件下， 垂直分隔条 “|” 表示 “或" 的逻辑意思（它是一个包容性的”或”，意思就是 “要么”/“或”）。它比“和”具有更高的优先级，它可以根据需要多次的使用。因此，依赖“(A或B) 和 C” 写成 <command>A | B，C</command>。相比之下，表达“A或(B和C)”应写成“（A或B），（A或C）”，因为<literal>取决于</literal>的字段不能容忍括号改变逻辑运算符“或”和“与”之间的逻辑优先级顺序。因此，这将被写入<command>A|B，A|C</command>。<ulink type="block" url="http://www.debian.org/doc/debian-policy/ch-relationships.html" />

source: <primary>meta-package</primary>
de_de: <primary>Meta-Paket</primary>
es_es: <primary>metapaquete</primary>
it_it: <primary>meta-pacchetto</primary>
zh_cn: <primary>元-软件包</primary>

source: The dependencies system is a good mechanism for guaranteeing the operation of a program, but it has another use with “meta-packages”. These are empty packages that only describe dependencies. They facilitate the installation of a consistent group of programs preselected by the meta-package maintainer; as such, <command>apt-get install <replaceable>meta-package</replaceable></command> will automatically install all of these programs using the meta-package's dependencies. The <emphasis role="pkg">gnome</emphasis>, <emphasis role="pkg">kde</emphasis> and <emphasis role="pkg">linux-image-2.6-686</emphasis> packages are examples of meta-packages.
de_de: Das Abhängigkeitensystem ist eine gute Vorrichtung um das Funktionieren eines Programms sicherzustellen, aber es hat mit den „Meta-Paketen“ noch eine weitere Funktion. Dies sind leere Pakete, die lediglich Abhängigkeiten beschreiben. Sie erleichtern die Installation einer zusammenhängenden Gruppe von Programmen, die vom Betreuer des Meta-Pakets ausgewählt wurden. So installiert <command>apt-get install <replaceable>Meta-Paket</replaceable></command> automatisch alle Programme unter Verwendung der Abhängigkeiten des Meta-Pakets. Die Pakete <emphasis role="pkg">gnome</emphasis>, <emphasis role="pkg">kde</emphasis> und <emphasis role="pkg">linux-image-2.6-686</emphasis> sind Beispiele solcher Meta-Pakete.
es_es: El sistema de dependencias es un buen mecanismo para garantizar el funcionamiento de un programa, pero tiene otro uso con los «metapaquetes». Éstos son paquetes vacíos que sólo describen dependencias. Facilitan la instalación de un grupo consistente de programas preseleccionados por el desarrollador del metapaquete; como tal <command>apt-get install <replaceable>metapaquete</replaceable></command> instalará automáticamente todos estos programas utilizando las dependencias del metapaquete. Los paquetes <emphasis role="pkg">gnome</emphasis>, <emphasis role="pkg">kde</emphasis> y <emphasis role="pkg">linux-image-2.6-686</emphasis>, por ejemplo, son metapaquetes.
it_it: Il sistema delle dipendenze è un buon meccanismo per garantire il funzionamento di un programma, ma ha un altro uso con i «meta-pacchetti». Questi sono pacchetti vuoti che descrivono solamente delle dipendenze. Essi facilitano l'installazione di gruppi coerenti di programmi prescelti dal manutentore del meta-pacchetto; in tal modo, <command>apt-get install <replaceable>meta-pacchetto</replaceable></command> installerà automaticamente tutti questi programmi usando le dipendenze del meta-pacchetto. Esempi di meta-pacchetti sono <emphasis role="pkg">gnome</emphasis>, <emphasis role="pkg">kde</emphasis> e <emphasis role="pkg">linux-image-2.6-686</emphasis>.
zh_cn: 依赖系统可以保证程序的操作，这是一个非常好的机制，但它还可以另外和“元软件包”一起使用。元软件包是一种空的只描述依赖性的空包。通过采用一致的元软件包组程序预选方案，它们可以非常自动的安装使用了元软件包依赖的所有程序的依赖关系；比如<command>apt-get install <replaceable>元软件包</replaceable></command> 。<emphasis role="pkg">gnome</emphasis>, <emphasis role="pkg">kde</emphasis> 和 <emphasis role="pkg">linux-image-2.6-686</emphasis> 是一些元软件包的包例子。

source: “Pre-dependencies”, which are listed in the “<literal>Pre-Depends</literal>” field in the package headers, complete the normal dependencies; their syntax is identical. A normal dependency indicates that the package in question must be unpacked and configured before the package declaring the dependency. A pre-dependency stipulates that the package in question must be unpacked and configured before execution of the pre-installation script of the package declaring the pre-dependency, that is before its installation.
de_de: „Vorabhängigkeiten“, die in der „<literal>Pre-Depends</literal>“-Zeilen des Paketkopfes aufgeführt sind, vervollständigen die normalen Abhängigkeiten; ihre Syntax ist identisch. Eine normale Abhängigkeit bedeutet, dass das betreffende Paket vor dem Paket, das die Abhängigkeit feststellt, entpackt und konfiguriert werden muss. Eine Vorabhängigkeit schreibt vor, dass das betreffende Paket entpackt und konfiguriert werden muss, bevor das Skript zur Vorbereitung der Installation des Paketes, das die Vorabhängigkeit feststellt, ausgeführt wird; das heißt, vor dessen Installation.
es_es: Las «predependencias», listadas en el campo «<literal>Pre-Depends</literal>» de las cabeceras de un paquete, completan las dependencias normales; la sintaxis es idéntica. Una dependencia normal indica que el paquete en cuestión debe ser desempaquetado y configurado antes del paquete que declara la dependencia. Una predependencia estipula que el paquete en cuestión debe ser desempaquetado y configurado antes de la ejecución del script de preinstalación del paquete que declara la predependencia, es decir antes de su instalación.
it_it: Le «pre-dipendenze», che sono elencate nel campo «<literal>Pre-Depends</literal>» nelle intestazioni del pacchetto, completano le normali dipendenze; la loro sintassi è identica. Una normale dipendenza indica che il pacchetto in questione deve essere scompattato e configurato prima del pacchetto che dichiara la pre-dipendenza. Una pre-dipendenza indica espressamente che il pacchetto in questione deve essere scompattato e configurato prima dell'esecuzione dello script di pre-installazione del pacchetto che dichiara la pre-dipendenza, cioè prima della sua installazione.
zh_cn: “预依赖关系”，是在”<literal>预依赖</literal>字段的软件包包头中，完成正常的依赖；它们的语法是相同的。一个正常的依赖性表明包的问题必须得到在解压包和配置包前所申明的依赖关系。预依赖关系规定，必须包进行解包和配置包并在宣告依赖前必须执行预安装脚本，也就是之前的安装。

source: The <literal>Enhances</literal> field also describes a suggestion, but in a different context. It is indeed located in the suggested package, and not in the package that benefits from the suggestion. Its interest lies in that it is possible to add a suggestion without having to modify the package that is concerned. Thus, all add-ons, plug-ins, and other extensions of a program can then take place in the list of suggestions related to the software. Although it has existed for several years, this last field is still largely ignored by programs such as <command>apt-get</command> or <command>synaptic</command>. Its purpose is for a suggestion made by the <literal>Enhances</literal> field to appear to the user in addition to the traditional suggestions — found in the <literal>Suggests</literal> field.
de_de: Die <literal>Enhances</literal>-Zeilen beschreibt auch eine Empfehlung, aber in einem anderen Zusammenhang. Und zwar befindet sie sich in dem vorgeschlagenen Paket, nicht in dem Paket, dem der Vorschlag zugute kommt. Sie ist deshalb interessant, weil man auf diese Weise eine Empfehlung hinzufügen kann, ohne das betroffene Paket zu verändern. So können alle Add-ons, Plug-ins und sonstigen Erweiterungen in der Liste der Empfehlungen für ein Programm aufgeführt werden. Obwohl es sie bereits seit mehreren Jahren gibt, werden diese Zeilen noch weitgehend von Programmen wie <command>apt-get</command> oder <command>synaptic</command> ignoriert. Ihr Zweck besteht darin, dem Nutzer einen von der <literal>Enhances</literal>-Zeile gemachten Vorschlag zusätzlich zu den herkömmlichen Vorschlägen - in der <literal>Suggests</literal>-Zeile - anzuzeigen.
es_es: El campo <literal>Enhances</literal> también describe una sugerencia pero en un contexto diferente. Está ubicado en el paquete sugerido, no en el paquete que se beneficia de la sugerencia. Por lo tanto, todos los agregados, plugins y otras extensiones de un programa pueden tener un lugar en la lista de sugerencias relacionadas al software. Si bien existe desde hace varios años, este último campo es generalmente ignorado por programas como <command>apt-get</command> o <command>synaptic</command>. Su propósito es que una sugerencia en el campo <literal>Enhances</literal> aparezca ante el usuario además de las sugerencias tradicionales — que se encuentran en el campo <literal>Suggests</literal>.
it_it: Anche il campo <literal>Enhances</literal> descrive un consiglio, ma in un contesto differente. Infatti si trova nel pacchetto consigliato, non nel pacchetto che beneficia del consiglio. È interessante perché è possibile aggiungere un consiglio senza dover modificare il pacchetto interessato. Perciò tutte le aggiunte, plug-in e altre estensioni a un programma possono prendere posto nell'elenco di consigli relativi a quel software. Sebbene esista da diversi anni, quest'ultimo campo è ancora largamente ignorato da programmi come <command>apt-get</command> o <command>synaptic</command>. Il suo scopo è far apparire all'utente un consiglio fatto dal campo <literal>Enhances</literal> in aggiunta ai tradizionali consigli trovati nel campo <literal>Suggests</literal>.
zh_cn: <literal>增强</literal>字段在不同的内容中也介绍了一个建议。这个建议是位于所建议的软件包内，而不是在建议的有好处的软件包内。它的好处是你可以添加一个建议，而不需要修改软件包。因此，所有的附加组件，插件，和其他扩展程序都可以取代该软件有关联的建议列表。虽然它已经存在了好几年，这个最后的字段仍然在很大程序上被比如<command>apt-get</command> 或者<command>synaptic</command> 所忽视。它的目的是为了<literal>增强</literal>字段来显示给用户那些普通的建议外所作出的建议 - 这个也在<literal>建议</literal>的字段可以找到。

source: The <literal>Conflicts</literal> field indicates when a package cannot be installed simultaneously with another. The most common reasons for this are that both packages include a file containing the same name, or provide the same service on the same TCP port, or would hinder each other's operation.
de_de: Die <literal>Conflicts</literal>-Zeilen zeigen an, dass ein Paket nicht gleichzeitig mit einem anderen installiert sein kann. Die häufigsten Gründe hierfür sind, dass beide Pakete eine Datei mit demselben Namen enthalten, dass sie den gleichen Dienst am selben TCP-Port anbieten oder dass sie sich gegenseitig im Betrieb behindern würden.
es_es: El campo <literal>Conflicts</literal> indica que un paquete no puede instalarse simultáneamente con otro. La razón más común es que ambos paquetes contienen un archivo con el mismo nombre, provee el mismo servicio en el mismo puerto TCP o estorban el funcionamiento del otro.
it_it: Il campo <literal>Conflicts</literal> indica quando un pacchetto non può essere installato insieme a un altro. La ragione più comune è che entrambi i pacchetti contengono un file con lo stesso nome o forniscono il solito servizio sulla stessa porta TCP o si ostacolerebbero a vicenda nel funzionamento.
zh_cn: <literal>冲突</literal>字段申明了不能和另外一个软件包同时安装。最常见的原因是这些软件包都包含了相同的名字，或者是在TCP端口上提供了相同的服务，或者可能会阻碍对方的操作。
