Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: Binary package
de_de: Binärpaket
es_es: Paquete binario
it_it: Pacchetto binario
ja_jp: バイナリパッケージ
zh_cn: 二进制包

source: Source package
de_de: Quellpaket
es_es: Paquete fuente
it_it: Pacchetto sorgente
ja_jp: ソースパッケージ
zh_cn: 源码包

source: dependencies
de_de: Abhängigkeiten
es_es: dependencias
it_it: dipendenze
ja_jp: 依存関係
zh_cn: 依赖

source: conflict
de_de: Konflikt
es_es: conflicto
it_it: conflitto
ja_jp: 衝突
zh_cn: 冲突

source: Packaging System: Tools and Fundamental Principles
de_de: Paketierungssystem: Hilfsprogramme und grundlegende Prinzipien
es_es: Sistema de paquetes: herramientas y principios fundamentales
it_it: Sistema dei pacchetti: strumenti e principi fondamentali
ja_jp: パッケージシステム: ツールと基本原則
zh_cn: 包管理系统：工具和基本原则

source: As a Debian system administrator, you will routinely handle <filename>.deb</filename> packages, since they contain consistent functional units (applications, documentation, etc.), whose installation and maintenance they facilitate. It is therefore a good idea to know what they are and how to use them.
de_de: Als Debian-Systemadministrator werden Sie regelmäßig mit <filename>.deb</filename>-Paketen umgehen, da sie festgelegte funktionale Einheiten (Anwendungen, Dokumentation usw.) enthalten, deren Installation und Wartung sie vereinfachen. Deshalb ist es gut zu wissen, was sie sind und wie man sie benutzt.
es_es: Como un administrador de un sistema Debian generalmente manejará paquetes <filename>.deb</filename> ya que contienen unidades funcionales consistentes (aplicaciones, documentación, etc.) facilitando su instalación y mantenimiento. Por lo tanto, es buena idea saber qué son y cómo utilizarlos.
it_it: Come amministratore di sistema Debian, si gestiranno abitualmente pacchetti <filename>.deb</filename>, dal momento che contengono unità funzionali coordinate (applicazioni, documentazione, ecc.), di cui facilitano l'installazione e la manutenzione. È perciò una buona idea conoscere cosa sono e come usarli.
ja_jp: Debian システム管理者は日常的に <filename>.deb</filename> パッケージを取り扱います。なぜなら、パッケージにはそのパッケージを使うために必要なすべての要素 (アプリケーション、文書など) が含まれており、パッケージによってこれらのインストールとメンテナンスが楽になるからです。ゆえに、パッケージとはどのようなもので、パッケージを取り扱う方法を知っておくことは良い考えです。
zh_cn: 作为 Debian 系统管理员，你经常地要处理 <filename>.deb</filename> 包，因为它们包含一致的功能单元（应用程序、文档等），使得安装和维护更容易。所以了解它们是什么及如何使用它们是个好主意。

source: This chapter describes the structure and contents of “binary” and “source” packages. The former are <filename>.deb</filename> files, directly usable by <command>dpkg</command>, while the latter contain the source code, as well as instructions for building binary packages.
de_de: Dieses Kapitel beschreibt die Struktur und den Inhalt von „Binär“- und „Quell“-Paketen. Erstere sind <filename>.deb</filename>-Dateien, die direkt mit dem Befehl <command>dpkg</command> benutzt werden können, während letztere den Programm-Quellcode sowie Anweisungen zum Bau von Binärpaketen enthalten.
es_es: Este capítulo describe la estructura y los contenidos de paquetes «binarios» y «fuente». Los primeros son archivos <filename>.deb</filename> para utilizar directamente con <command>dpkg</command> mientras que los últimos contienen el código fuente así como las instrucciones para crear los paquetes binarios.
it_it: Questo capitolo descrive la struttura e il contenuto dei pacchetti «binari» e «sorgenti». I primi sono file <filename>.deb</filename>, direttamente utilizzabili da <command>dpkg</command>, mentre i secondi contengono il codice sorgente e le istruzioni per costruire pacchetti binari.
ja_jp: この章では、「バイナリパッケージ」と「ソースパッケージ」の構造と内容について説明します。バイナリパッケージとは <command>dpkg</command> が直接取り扱う <filename>.deb</filename> ファイルで、ソースパッケージにはソースコードおよびバイナリパッケージをビルドするための説明が含まれています。
zh_cn: 本章介绍了“二进制”和“源码”包的结构和内容。前者是 <filename>.deb</filename> 文件，可以用 <command>dpkg</command> 命令直接处理；而后者则包含程序的源代码，以及创建二进制包的说明。

source: Structure of a Binary Package
de_de: Struktur eines Binärpakets
es_es: Estructura de un paquete binario
it_it: Struttura di un pacchetto binario
ja_jp: バイナリパッケージの構造
zh_cn: 二进制包的结构

source: <primary>package</primary><secondary>binary package</secondary>
de_de: <primary>Paket</primary><secondary>Binärpaket</secondary>
es_es: <primary>paquete</primary><secondary>binario</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto binario</secondary>
ja_jp: <primary>パッケージ</primary><secondary>バイナリパッケージ</secondary>
zh_cn: <primary>包</primary><secondary>二进制包</secondary>

source: The Debian package format is designed so that its content may be extracted on any Unix system that has the classic commands <command>ar</command>, <command>tar</command>, and <command>gzip</command> (sometimes <command>xz</command> or <command>bzip2</command>). This seemingly trivial property is important for portability and disaster recovery.
ja_jp: Debian パッケージのフォーマットは古くからのコマンド <command>ar</command>、<command>tar</command>、<command>gzip</command> (<command>xz</command> や <command>bzip2</command> の場合も) を備える Unix システムで内容を展開できるようにデザインされました。この一見些細な特徴は可搬性と障害復旧を考えると重要です。

source: Imagine, for example, that you mistakenly deleted the <command>dpkg</command> program, and that you could thus no longer install Debian packages. <command>dpkg</command> being a Debian package itself, it would seem your system would be done for... Fortunately, you know the format of a package and can therefore download the <filename>.deb</filename> file of the <emphasis role="pkg">dpkg</emphasis> package and install it manually (see the “TOOLS” sidebar). If by some misfortune one or more of the programs <command>ar</command>, <command>tar</command> or <command>gzip</command>/<command>xz</command>/<command>bzip2</command> have disappeared, you will only need to copy the missing program from another system (since each of these operates in a completely autonomous manner, without dependencies, a simple copy will suffice).
ja_jp: 例えば、誤って <command>dpkg</command> プログラムを削除したとしましょう、こうなると Debian パッケージをインストールできなくなります。<command>dpkg</command> は Debian パッケージなので、もはやシステムを回復することは不可能のように見えます... 幸いなことに、パッケージの構成を知っていれば、<emphasis role="pkg">dpkg</emphasis> パッケージの <filename>.deb</filename> ファイルをダウンロードし、手作業でパッケージをインストールできます (「TOOLS」傍注参照)。もし不幸にも、<command>ar</command>、<command>tar</command>、<command>gzip</command>/<command>xz</command>/<command>bzip2</command> のうち 1 つでも無かったら、足りないプログラムを別のシステムからコピーするだけで十分です(其々のプログラムは、依存関係が無く、完全に独立して動くため、単純にコピーすれば十分です)。

source: <emphasis>TOOLS</emphasis> <command>dpkg</command>, <command>APT</command> and <command>ar</command>
de_de: <emphasis>HILFSPROGRAMME</emphasis> <command>dpkg</command>, <command>APT</command> und <command>ar</command>
es_es: <emphasis>HERRAMIENTAS</emphasis> <command>dpkg</command>, <command>APT</command> y <command>ar</command>
it_it: <emphasis>STRUMENTI</emphasis> <command>dpkg</command>, <command>APT</command> e <command>ar</command>
ja_jp: <emphasis>TOOLS</emphasis> <command>dpkg</command>、<command>APT</command>、<command>ar</command>
zh_cn: <emphasis>工具</emphasis> <command>dpkg</command>、<command>APT</command> 和 <command>ar</command>

source: <command>dpkg</command> is the program that handles <filename>.deb</filename> files, notably extracting, analyzing, and unpacking them.
de_de: <command>dpkg</command> ist das Programm, das mit <filename>.deb</filename>-Dateien umgeht, sie insbesondere extrahiert, analysiert und entpackt.
es_es: <command>dpkg</command> es el programa que maneja los archivos <filename>.deb</filename>, en particular los extrae, analiza y descomprime.
it_it: <command>dpkg</command> è il programma che gestisce i file <filename>.deb</filename>, in particolare l'estrazione, l'analisi e lo spacchettamento.
ja_jp: <command>dpkg</command> は <filename>.deb</filename> ファイルを取り扱うプログラムで、抽出、分析、展開を担当しています。
zh_cn: <command>dpkg</command> 是处理 <filename>.deb</filename> 文件的命令，尤其是解压、分析和解包它们。

source: <command>APT</command> is a group of programs that allows the execution of higher-level modifications to the system: installing or removing a package (while keeping dependencies satisfied), updating the system, listing the available packages, etc.
de_de: <command>APT</command> ist eine Gruppe von Programmen, die es ermöglichen, Veränderungen auf höherer Ebene des Systems durchzuführen: ein Paket zu installieren oder zu entfernen (und dabei Abhängigkeiten erfüllt zu halten), das System zu aktualisieren, die verfügbaren Pakete aufzulisten usw.
es_es: <command>APT</command> es un grupo de programas que permite la ejecución de modificaciones de más alto nivel al sistema: instalar o eliminar un paquete (mientras mantiene dependencias satisfechas), actualizar el sistema, listar los paquetes disponibles, etc.
it_it: <command>APT</command> è un gruppo di programmi che permette l'esecuzione di modifiche di più alto livello al sistema: installazione o rimozione di un pacchetto (mantenendo soddisfatte le dipendenze), aggiornamento del sistema, elenco dei pacchetti disponibili, ecc.
ja_jp: <command>APT</command> はシステムの高レベル変更を担当するプログラムのグループです: パッケージのインストールや削除 (依存関係を破壊することなく)、システムの更新、利用可能なパッケージの表示などを行います。
zh_cn: <command>APT</command> 是一组允许对系统进行高级的修改的程序：安装或者删除一个软件包（并且保持依赖关系满足），更新系统，列出可用的软件包等。

source: <indexterm><primary><command>ar</command></primary></indexterm> As for the <command>ar</command> program, it allows handling files of the same name: <command>ar t <replaceable>archive</replaceable></command> displays the list of files contained in such an archive, <command>ar x <replaceable>archive</replaceable></command> extracts the files from the archive into the current working directory, <command>ar d <replaceable>archive</replaceable> <replaceable>file</replaceable></command> deletes a file from the archive, etc. Its man page (<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>) documents all its other features. <command>ar</command> is a very rudimentary tool that a Unix administrator would only use on rare occasions, but admins routinely use <command>tar</command>, a more evolved archive and file management program. This is why it is easy to restore <command>dpkg</command> in the event of an erroneous deletion. You would only have to download the Debian package and extract the content from the <filename>data.tar.gz</filename> archive in the system's root (<filename>/</filename>):
ja_jp: <indexterm><primary><command>ar</command></primary></indexterm> <command>ar</command> プログラムは ar アーカイブファイルを取り扱います: <command>ar t <replaceable>archive</replaceable></command> はアーカイブに含まれるファイルのリストを表示、<command>ar x <replaceable>archive</replaceable></command> は現在の作業ディレクトリにアーカイブからファイルを抽出、<command>ar d <replaceable>archive</replaceable> <replaceable>file</replaceable></command> はアーカイブからファイルを削除、などです。これ以外の機能は man ページ (<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>) を参照してください。<command>ar</command> はとても基本的なツールであり、Unix 管理者はめったにこれを使いません。対して、<command>tar</command> は日常的に使われる、進化したアーカイブとファイル管理プログラムです。そんなわけで、<command>dpkg</command> を誤って削除した場合でも、簡単に元の状態に戻す事が可能です。Debian パッケージをダウンロードして、<filename>data.tar.gz</filename> アーカイブからシステムのルート (<filename>/</filename>) で内容を抽出するだけです:

source: <emphasis>BACK TO BASICS</emphasis> Man page notation
de_de: <emphasis>ZURÜCK ZU DEN GRUNDLAGEN</emphasis> Ausdrucksweise in den Handbuchseiten
es_es: <emphasis>VOLVER A LOS CIMIENTOS</emphasis> Notación de páginas de manual
it_it: <emphasis>FONDAMENTALI</emphasis> Notazione delle pagine di manuale
ja_jp: <emphasis>BACK TO BASICS</emphasis> man ページの表記
zh_cn: <emphasis>基础知识</emphasis> Man 手册注记

source: It can be confusing for beginners to find references to “<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>” in the literature. This is generally a convenient means of referring to the man page entitled <literal>ar</literal> in section 1.
de_de: Für Anfänger kann es verwirrend sein, in der Literatur Verweise auf „<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>“ zu finden. Dies ist gemeinhin eine bequeme Art, auf die Handbuchseite namens <literal>ar</literal> in Abschnitt 1 zu verweisen.
es_es: Los principiantes pueden encontrar confusas las referencias como «<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>» en la literatura. Generalmente esta es una forma conveniente de referirse a la página de manual titulada <literal>ar</literal> en la sección 1.
it_it: I principianti possono essere disorientati dal trovare riferimenti a «<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>» nella documentazione. Questo è generalmente un modo comodo per riferirsi alla pagina di manuale intitolata <literal>ar</literal> nella sezione 1.
ja_jp: 初心者にとって、文献から <citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry> の資料を探すことは、わかりにくいことかもしれません。この記法は第 1 セクションから <literal>ar</literal> と標題をつけられた man ページを参照する便利な表記です。
zh_cn: 初学者可能会在看到“<citerefentry><refentrytitle>ar</refentrytitle><manvolnum>1</manvolnum></citerefentry>”这样的文字注记时感到疑惑。这通常是个简写，它表示指向 man 手册第一类中标题是 <literal>ar</literal> 的页面。

source: Sometimes this notation is also used to remove ambiguities, for example to distinguish between the <command>printf</command> command that can also be indicated by <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>1</manvolnum></citerefentry> and the <function>printf</function> function in the C programming language, which can also be referred to as <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
de_de: Manchmal wird diese Ausdrucksweise auch verwendet um Mehrdeutigkeiten zu beseitigen, um zum Beispiel zwischen dem Befehl <command>printf</command>, der in <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>1</manvolnum></citerefentry> beschrieben ist, und der Funktion <function>printf</function> in der Programmiersprache C, auf die sich <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>3</manvolnum></citerefentry> bezieht, zu unterscheiden.
es_es: Algunas veces se utiliza esta notación para eliminar ambigüedades, por ejemplo para distinguir entre el programa <command>printf</command>, que también puede indicarse como <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>1</manvolnum></citerefentry>, y la función <function>printf</function> del lenguaje de programación C, que también puede indicarse como <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
it_it: Talvolta questa notazione è usata anche per evitare ambiguità, per esempio per distinguere tra il comando <command>printf</command> che può essere anche indicato da <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>1</manvolnum></citerefentry> e la funzione <function>printf</function> nel linguaggio di programmazione C, a cui ci si può riferire anche come <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
ja_jp: この表記は曖昧さを無くすために使われる場合があります。例えば、<command>printf</command> コマンドの man ページは <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>1</manvolnum></citerefentry>と表記し、C 言語の<function>printf</function> 関数の man ページは <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>3</manvolnum></citerefentry> と表記することで、両者を区別します。
zh_cn: 有时这种注记也用来避免歧义，比如要区分清楚是 <command>printf</command> 命令，可以用 <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>1</manvolnum></citerefentry> 来指明，如果是 C 语言里的 <function>printf</function> 函数，就可以用 <citerefentry><refentrytitle>printf</refentrytitle><manvolnum>3</manvolnum></citerefentry> 来引用。

source: <xref linkend="solving-problems" /> discusses manual pages in further detail (see <xref linkend="sect.manual-pages" />).
ja_jp: 詳細は<xref linkend="solving-problems" />で議論されています (<xref linkend="sect.manual-pages" />をご覧ください)。

source: Have a look at the content of a <filename>.deb</filename> file:
de_de: Werfen Sie einen Blick auf den Inhalt einer <filename>.deb</filename>-Datei:
es_es: Estos son los contenidos de un archivo <filename>.deb</filename>:
it_it: Questo è il contenuto di un file <filename>.deb</filename>:
ja_jp: <filename>.deb</filename> ファイルの内容を見てみましょう:
zh_cn: 来看看 <filename>.deb</filename> 文件的内容：

source: As you can see, the <command>ar</command> archive of a Debian package is comprised of three files:
de_de: Wie Sie sehen, besteht das <command>ar</command>-Archiv eines Debian-Pakets aus drei Dateien:
es_es: Como puede ver, el compendio <command>ar</command> de un paquete Debian contiene tres archivos:
it_it: Come si può vedere, l'archivio <command>ar</command> di un pacchetto Debian è composto da tre file:
ja_jp: ご覧の通り、Debian パッケージの <command>ar</command> アーカイブは 3 つのファイルから成り立っています:
zh_cn: 如你所见， Debian 包的 <command>ar</command> 存档格式由三个文件组成：

source: <filename>debian-binary</filename>. This is a text file which simply indicates the version of the <filename>.deb</filename> file used (in 2013: version 2.0).
ja_jp: <filename>debian-binary</filename>。これは使われている <filename>.deb</filename>ファイルのバージョンを示す (2013 年の時点ではバージョン 2.0) テキストファイルです。

source: <filename>control.tar.gz</filename>. This archive file contains all of the available meta-information, like the name and version of the package. Some of this meta-information allows package management tools to determine if it is possible to install or uninstall it, for example according to the list of packages already on the machine.
ja_jp: <filename>control.tar.gz</filename>。このアーカイブファイルには、パッケージの名前やバージョンなど、利用可能なすべてのメタ情報が含まれています。このメタ情報の一部と、例えば、マシンにインストールされているパッケージのリストを照らし合わせて、パッケージ管理ツールはパッケージをインストールまたはアンインストールが可能かを決定します。

source: <filename>data.tar.gz</filename>. This archive contains all of the files to be extracted from the package; this is where the executable files, documentation, etc., are all stored. Some packages may use other compression formats, in which case the file will be named differently (<filename>data.tar.bz2</filename> for bzip2, <filename>data.tar.xz</filename> for XZ, <filename>data.tar.lzma</filename> for LZMA).
de_de: <filename>data.tar.gz</filename>. Dieses Archiv enthält alle Dateien, die aus dem Paket entpackt werden sollen; hier sind die ausführbaren Dateien, die Dokumentation usw. gespeichert. Möglicherweise verwenden einige Pakete andere Komprimierungsformate, wobei die Datei dann anders heißt (<filename>data.tar.bz2</filename> für bzip2, <filename>data.tar.xz</filename> für XZ, <filename>data.tar.lzma</filename> für LZMA).
es_es: <filename>data.tar.gz</filename>. Este compendio contiene todos los archivos a extraerse del paquete; aquí es donde están almacenados los archivos ejecutables, la documentación etc. Algunos paquetes pueden utilizar otros formatos de compresión, en los que el archivo tendrá otro nombre (<filename>data.tar.bz2</filename> para bzip2m <filename>data.tar.xz</filename> para XZ, <filename>data.tar.lzma</filename> para LZMA).
it_it: <filename>data.tar.gz</filename>. Questo archivio contiene tutti i file che devono essere estratti dal pacchetto; qui è dove sono memorizzati i file eseguibili, la documentazione, ecc. Alcuni pacchetti possono usare altri formati di compressione, nel qual caso il file avrà un altro nome (<filename>data.tar.bz2</filename> per bzip2, <filename>data.tar.xz</filename> per XZ, <filename>data.tar.lzma</filename> per LZMA).
ja_jp: <filename>data.tar.gz</filename>。このアーカイブには、パッケージから展開されるすべてのファイルが含まれています; 実行ファイル、文書などすべてが保存されています。一部のパッケージでは異なる圧縮フォーマットが使われているかもしれません、このような場合、ファイルは別の名前がつけられています (bzip2 の場合 <filename>data.tar.bz2</filename>、XZ の場合 <filename>data.tar.xz</filename>、LZMA の場合 <filename>data.tar.lzma</filename>)。
zh_cn: <filename>data.tar.gz</filename>，这个存档文件包含所有要被从软件包里解压缩出来的文件；这是可执行文件、文档等存储的地方。有些软件包可能会使用其它压缩格式，那样的话文件名会有所不同（bzip2 是 <filename>data.tar.bz2</filename>，XZ 是 <filename>data.tar.xz</filename> for XZ，LZMA 是 <filename>data.tar.lzma</filename>）。

source: Package Meta-Information
de_de: Paket-Meta-Information
es_es: Metainformación de un paquete
it_it: Meta-informazioni sul pacchetto
ja_jp: パッケージのメタ情報
zh_cn: 软件包元信息

source: <primary>package meta-information</primary>
de_de: <primary>Paket-Meta-Information</primary>
es_es: <primary>metainformación de un paquete</primary>
it_it: <primary>meta-informazioni pacchetto</primary>
ja_jp: <primary>パッケージのメタ情報</primary>
zh_cn: <primary>软件包元信息</primary>

source: <primary>package</primary><secondary>meta-information</secondary>
de_de: <primary>Paket</primary><secondary>Meta-Information</secondary>
es_es: <primary>paquete</primary><secondary>metainformación</secondary>
it_it: <primary>pacchetto</primary><secondary>meta-informazioni</secondary>
ja_jp: <primary>パッケージ</primary><secondary>メタ情報</secondary>
zh_cn: <primary>package</primary><secondary>元信息</secondary>

source: The Debian package is not only an archive of files intended for installation. It is part of a larger whole, and it describes its relationship with other Debian packages (dependencies, conflicts, suggestions). It also provides scripts that enable the execution of commands at different stages in the package's lifecycle (installation, removal, upgrades). These data used by the package management tools are not part of the packaged software, but are, within the package, what is called its “meta-information” (information about other information).
de_de: Das Debian-Paket ist nicht nur ein für die Installation vorgesehenes Archiv von Dateien. Es ist Teil eines größeren Ganzen und beschreibt seine Beziehungen zu anderen Debian-Paketen (Abhängigkeiten, Konflikte, Vorschläge). Es stellt auch Skripte zur Verfügung, die die Ausführung von Befehlen in verschiedenen Lebensphasen des Paketes (Installation, Entfernung, Aktualisierung) ermöglichen. Diese vom Paket-Verwaltungsprogramm benutzten Daten sind nicht Teil des Softwarebündels, sondern sind innerhalb des Pakets sogenannte „Meta-Informationen“ (Information über andere Information).
es_es: Un paquete Debian no es sólo un compendio de archivos a instalar. Es parte de un todo más grande y describe su relación con otros paquetes Debian (dependencias, conflictos, sugerencias). También provee scripts que permiten la ejecución de órdenes en diferentes etapas del ciclo de vida del paquete (instalación, eliminación, actualización). Estos datos utilizados por las herramientas de gestión de paquetes no son parte del software empaquetado pero son, dentro del paquete, lo que se denomina «metainformación» (información sobre otra información).
it_it: Il pacchetto Debian non è solo un archivio di file da installare. È parte di un insieme più ampio e descrive le proprie relazioni con altri pacchetti Debian (dipendenze, conflitti, consigli). Fornisce anche degli script che permettono l'esecuzione di comandi nei diversi stadi del ciclo di vita del pacchetto (installazione, rimozione, aggiornamenti). Questi dati usati dagli strumenti di gestione dei pacchetti non fanno parte del software contenuto nel pacchetto, ma sono, all'interno del pacchetto, ciò che viene chiamato «meta-informazioni» (informazioni riguardanti altre informazioni).
ja_jp: Debian パッケージはインストールされるファイルのアーカイブというだけではありません。メタ情報はパッケージの一部で、他の Debian パッケージとの関係性 (依存関係、衝突、提案) を記述しています。また、メタ情報にはスクリプトも含まれています。スクリプトはパッケージライフサイクルのある時点 (インストール、削除、アップグレード) にコマンドを実行するためのものです。パッケージ管理ツールが使うこれらのデータは、パッケージ化されたソフトウェアの一部ではありませんが、パッケージの「メタ情報」(他の情報のデータ) と呼ばれて、パッケージに含まれています。
zh_cn: Debian 软件包不仅仅只是一些待安装的文件的存档，它是一个更大的结构的一部分，它描述与其它 Debian 软件包的关系（依赖、冲突、建议）。它还提供脚本供软件包的生命周期的不同阶段（安装、删除、升级）使用。这些供包管理工具使用的数据不是被打包的软件的一部分，但它们存在于软件包里，被称作“元信息”（关于其它信息的信息）。

source: Description: the <filename>control</filename> File
de_de: Beschreibung: Die <filename>control</filename>-Datei
es_es: Descripción: el archivo <filename>control</filename>
it_it: Descrizione: il file <filename>control</filename>
ja_jp: 説明: <filename>control</filename> ファイル
zh_cn: 描述：<filename>control</filename> 文件
