Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: When a new version of a package (source package and one or more binary packages) arrives on the Debian server, the source package is the most important. Indeed, it will then be used by a network of machines of different architectures for compilation on the various architectures supported by Debian. The fact that the developer also sends one or more binary packages for a given architecture (usually i386 or amd64) is relatively unimportant, since these could just as well have been automatically generated.
ja_jp: パッケージの新バージョン (ソースパッケージと 1 つ以上のバイナリパッケージ) が Debian サーバにアップロードされると、このソースパッケージが最も重要です。実際には、異なるアーキテクチャのマシンのネットワークがソースパッケージを使い、Debian がサポートする様々なアーキテクチャ上でコンパイルを行います。開発者がソースパッケージだけでなく、適当なアーキテクチャ (通常 i386 または amd64) 向けの 1 つ以上のバイナリパッケージを送信するという事実はそれほど重要ではありません。なぜなら、送信されたバイナリパッケージと同じアーキテクチャのマシンでもバイナリパッケージが生成されるからです。

source: Manipulating Packages with <command>dpkg</command>
de_de: Pakete mit <command>dpkg</command> handhaben
es_es: Manipulación de paquetes con <command>dpkg</command>
it_it: Manipolazione dei pacchetti con <command>dpkg</command>
ja_jp: <command>dpkg</command> を用いたパッケージの操作
zh_cn: 通过<command>dpkg</command>来操作软件包

source: <command>dpkg</command> is the base command for handling Debian packages on the system. If you have <filename>.deb</filename> packages, it is <command>dpkg</command> that allows installation or analysis of their contents. But this program only has a partial view of the Debian universe: it knows what is installed on the system, and whatever it is given on the command line, but knows nothing of the other available packages. As such, it will fail if a dependency is not met. Tools such as <command>apt-get</command>, on the contrary, will create a list of dependencies to install everything as automatically as possible.
ja_jp: <command>dpkg</command> はシステムの Debian パッケージを操作する基礎的なコマンドです。<filename>.deb</filename> パッケージがあれば、<command>dpkg</command> でパッケージ内容をインストールしたり解析したりする事が可能です。しかしこのプログラムは Debian 世界のある一方向だけを見ているに過ぎません: このプログラムは、システムインストール済みのパッケージとコマンドラインで与えられたパッケージについては理解していますが、他の利用可能なパッケージについては理解していません。このため、依存関係が満足されていなければパッケージを操作できません。これに対して、<command>apt-get</command> などのツールは、可能な限り自動的にすべてをインストールするために、依存関係のリストを作成します。

source: <emphasis>NOTE</emphasis> <command>dpkg</command> or <command>apt-get</command>?
de_de: <emphasis>ANMERKUNG</emphasis> <command>dpkg</command> oder <command>apt-get</command>?
es_es: <emphasis>NOTA</emphasis> ¿<command>dpkg</command> o <command>apt-get</command>?
it_it: <emphasis>NOTA</emphasis> <command>dpkg</command> o <command>apt-get</command>?
ja_jp: <emphasis>NOTE</emphasis> <command>dpkg</command> か <command>apt-get</command> か?
zh_cn: <emphasis>简述</emphasis> <command>dpkg</command> 或 <command>apt-get</command>?

source: <command>dpkg</command> should be seen as a system tool (backend), and <command>apt-get</command> as a tool closer to the user, which overcomes the limitations of the former. These tools work together, each one with its particularities, suited to specific tasks.
ja_jp: <command>dpkg</command> はシステムツール (バックエンド) と、<command>apt-get</command> はユーザに近いツールととらえるべきです。後者は前者の制限を克服しています。これらのツールは互いに協力して作業を行います。両者は互いに異なる得意分野を持っており、それぞれが特定の作業を担当しています。

source: Installing Packages
de_de: Pakete installieren
es_es: Instalación de paquetes
it_it: Installazione dei pacchetti
ja_jp: パッケージのインストール
zh_cn: 安装软件包

source: <primary>installation</primary><secondary>package installation</secondary>
ja_jp: <primary>インストール</primary><secondary>パッケージのインストール</secondary>

source: <primary>package</primary><secondary>installation</secondary>
de_de: <primary>Paket</primary><secondary>Installation</secondary>
es_es: <primary>paquete</primary><secondary>instalación</secondary>
it_it: <primary>pacchetto</primary><secondary>installazione</secondary>
ja_jp: <primary>パッケージ</primary><secondary>インストール</secondary>
zh_cn: <primary>软件包</primary><secondary>安装</secondary>

source: <command>dpkg</command> is, above all, the tool for installing an already available Debian package (because it does not download anything). To do this, we use its <literal>-i</literal> or <literal>--install</literal> option.
ja_jp: 中でも、<command>dpkg</command> は既に利用可能な Debian パッケージのインストールを担当する (ダウンロード機能はありません) ツールです。インストールを行うには、<literal>-i</literal> または <literal>--install</literal> オプションを使ってください。

source: Installation of a package with <command>dpkg</command>
de_de: Installation eines Pakets mit <command>dpkg</command>
es_es: Instalación de un paquete con <command>dpkg</command>
it_it: Installazione di un pacchetto con <command>dpkg</command>
ja_jp: <command>dpkg</command> を使ったパッケージのインストール
zh_cn: 通过<command>dpkg</command>来安装一个软件包

source: <computeroutput># </computeroutput><userinput>dpkg -i man-db_2.6.2-1_amd64.deb</userinput> <computeroutput>(Reading database ... 96357 files and directories currently installed.) Preparing to replace man-db 2.6.1-3 (using man-db_2.6.2-1_amd64.deb) ... Unpacking replacement man-db ... Setting up man-db (2.6.2-1) ... Building database of manual pages ... </computeroutput>
ja_jp: <computeroutput># </computeroutput><userinput>dpkg -i man-db_2.6.2-1_amd64.deb</userinput> <computeroutput>(データベースを読み込んでいます ... 現在 96357 個のファイルとディレクトリがインストールされています。) man-db 2.6.1-3 を (man-db_2.6.2-1_amd64.deb で) 置換するための準備をしています ... man-db を展開し、置換しています... man-db (2.6.2-1) を設定しています ... Updating database of manual pages ...</computeroutput>

source: We can see the different steps performed by <command>dpkg</command>; we know, thus, at what point any error may have occurred. The installation can also be effected in two stages: first unpacking, then configuration. <command>apt-get</command> takes advantage of this, limiting the number of calls to <command>dpkg</command> (since each call is costly, due to loading of the database in memory, especially the list of already installed files).
de_de: Wir können die verschiedenen von <command>dpkg</command> durchgeführten Schritte sehen; so wissen wir, an welchem Punkt möglicherweise ein Fehler aufgetreten ist. Die Installation kann in zwei Phasen betroffen sein: erstens beim Entpacken und zweitens bei der Konfigurierung. <command>apt-get</command> nutzt dies, um die Anzahl der Aufrufe von <command>dpkg</command> zu begrenzen (weil jeder Aufruf aufwendig ist, da jedes Mal die Datenbank in den Speicher geladen werden muss, vor allem die Liste der bereits installierten Dateien).
es_es: Podemos ver los diferentes pasos que realiza <command>dpkg</command>; sabemos, por lo tanto, en qué punto podría haber ocurrido un error. La instalación también puede realizarse en dos etapas: primero desempaquetado, luego configuración. <command>apt-get</command> lo aprovecha limitando la cantidad de invocaciones de <command>dpkg</command> (ya que cada llamada es costosa debido a la carga de la base de datos en memoria, especialmente la lista de archivos ya instalados).
it_it: Si possono vedere i differenti passi eseguiti da <command>dpkg</command>; si può sapere, perciò, a quale punto si è verificato un errore. L'installazione può anche essere effettuata in due stadi: prima lo spacchettamento, poi la configurazione. <command>apt-get</command> si avvantaggia di ciò, limitando il numero di chiamate a <command>dpkg</command> (dal momento che ogni chiamata è onerosa a causa del caricamento del database in memoria, specialmente l'elenco dei file già installati).
ja_jp: <command>dpkg</command> の実行する各作業段階が見て取れます; このため、どの時点でエラーが起きたかを識別できます。インストールを 2 段階に分けて実行する事も可能です: 最初が解凍、その後設定です。<command>apt-get</command> はこれを上手に利用して、<command>dpkg</command> を呼び出す回数を減らしています (なぜなら呼び出される度にデータベース、特にインストール済みファイルのリスト、をメモリに読み込むため効率が悪いからです)。
zh_cn: 通过<command>dpkg</command>我们可以看到安装时的不同步骤；因此我们会知道在什么时候可能会发生错误。安装也被分为两个阶段：首先解压包，然后配置它。<command>apt-get</command>会利用这一点，然后有限的调用<command>dpkg</command>（因为每次调用都要把数据加载到内存中，特别是那些在名单中已经被安装的文件）。

source: Separate unpacking and configuration
de_de: Getrenntes Entpacken und Konfigurieren
es_es: Desempaquetado y configuración separados
it_it: Spacchettamento e configurazione separati
ja_jp: 解凍と設定を分けて実行
zh_cn: 分开解压和配置

source: <computeroutput># </computeroutput><userinput>dpkg --unpack man-db_2.6.2-1_amd64.deb</userinput> <computeroutput>(Reading database ... 96357 files and directories currently installed.) Preparing to replace man-db 2.6.2-1 (using man-db_2.6.2-1_amd64.deb) ... Unpacking replacement man-db ... # </computeroutput><userinput> dpkg --configure man-db</userinput> <computeroutput>Setting up man-db (2.6.2-1) ... Building database of manual pages ...</computeroutput>
ja_jp: <computeroutput># </computeroutput><userinput>dpkg --unpack man-db_2.6.2-1_amd64.deb</userinput> <computeroutput>(データベースを読み込んでいます ... 現在 96357 個のファイルとディレクトリがインストールされています。) man-db 2.6.2-1 を (man-db_2.6.2-1_amd64.deb で) 置換するための準備をしています ... man-db を展開し、置換しています... # </computeroutput><userinput> dpkg --configure man-db</userinput> <computeroutput>man-db (2.6.2-1) を設定しています ... Updating database of manual pages ...</computeroutput>

source: <primary>package</primary><secondary>unpacking</secondary>
de_de: <primary>Paket</primary><secondary>entpacken</secondary>
es_es: <primary>paquete</primary><secondary>desempaquetado</secondary>
it_it: <primary>pacchetto</primary><secondary>spacchettamento</secondary>
ja_jp: <primary>パッケージ</primary><secondary>解凍</secondary>
zh_cn: <primary>软件包</primary><secondary>解压</secondary>

source: <primary>unpacking</primary><secondary>binary package</secondary>
ja_jp: <primary>解凍</primary><secondary>バイナリパッケージ</secondary>

source: Sometimes <command>dpkg</command> will fail to install a package and return an error; if the user orders it to ignore this, it will only issue a warning; it is for this reason that we have the different <literal>--force-*</literal> options. The <command>dpkg --force-help</command> command, or documentation of this command, will give a complete list of these options. The most frequent error, which you are bound to encounter sooner or later, is a file collision. When a package contains a file that is already installed by another package, <command>dpkg</command> will refuse to install it. The following messages will then appear:
de_de: Manchmal wird <command>dpkg</command> bei der Installation eines Pakets scheitern und eine Fehlermeldung ausgeben; falls der Nutzer die Anweisung gibt, ihn zu ignorieren, wird es nur eine Warnung anzeigen; aus diesem Grund haben wir die verschiedenen <literal>--force-*</literal>-Optionen. Der Befehl <command>dpkg --force-help</command> oder die Dokumentation dieses Befehls zeigt Ihnen eine vollständige Liste dieser Optionen. Der häufigste Fehler, dem Sie früher oder später mit Sicherheit begegnen werden, ist eine Dateikollision. Wenn ein Paket eine Datei enthält, die bereits mit einem anderen Paket installiert worden ist, wird <command>dpkg</command> sich weigern, es zu installieren. In diesem Fall wird dann folgende Meldung erscheinen:
es_es: A veces <command>dpkg</command> fallará intentando instalar un paquete y devolverá un error; si el usuario le ordena ignorarlo sólo generará una advertencia; es por esta razón que tenemos las diferentes opciones <literal>--force-*</literal>. La orden <command>dpkg --force-help</command>, o su documentación, proveerá una lista completa de estas opciones. El error más frecuente, con el que seguramente se encontrará tarde o temprano, es una colisión de archivos. Cuando un paquete contiene un archivo que ya está instalado por otro paquete, <command>dpkg</command> se negará a instalarlo. Aparecerá el siguiente mensaje:
it_it: Talvolta <command>dpkg</command> non riuscirà a installare un pacchetto e restituirà un errore; se l'utente ordina di ignorarlo, verrà emesso soltanto un avvertimento; è per questo motivo che esistono le diverse opzioni <literal>--force-*</literal>. Il comando <command>dpkg --force-help</command>, o la documentazione di questo comando, dà un elenco completo di queste opzioni. L'errore più frequente, che prima o poi si incontrerà, è una collisione tra file. Quando un pacchetto contiene un file che è già installato da un altro pacchetto, <command>dpkg</command> si rifiuterà di installarlo. Il seguente messaggio apparirà:
ja_jp: <command>dpkg</command> がパッケージのインストールに失敗し、エラーを返す事があります; ユーザが失敗を無視するように命令すれば、警告を表示するでしょう; これが異なる <literal>--force-*</literal> 系オプションがある理由です。このコマンドの文書によれば <command>dpkg --force-help</command> コマンドでこれらのオプションの完全なリストを見る事が可能です。最もよくあるエラーはファイルの衝突で、遅かれ早かれこのエラーに遭遇するのは避けられません。パッケージが他のパッケージによってインストール済みのファイルを含んでいる場合、<command>dpkg</command> はパッケージのインストールを拒否します。以下のメッセージが表示されます:
zh_cn: 有时<command>dpkg</command>在安装软件包的时候会失败并且返回一个错误；如果用户命令dpkg忽略掉这个错误，那么它仅仅会提示一个警告；这也就是我们有一个不同的<literal>--force--*</literal>选项。<command>dpkg --force-help</command>，或者是dpkg的帮助文档，有一个这些选项的详细清单。最常见的错误是，你迟到会遇到这样一个文件冲突，当一个软件包包含的文件中已经安装了另外一个软件包。

source: In this case, if you think that replacing this file is not a significant risk to the stability of your system (which is usually the case), you can use the option <literal>--force-overwrite</literal>, which tells <command>dpkg</command> to ignore this error and overwrite the file.
de_de: Falls Sie in diesem Fall denken, dass das Ersetzen dieser Datei kein wesentliches Risiko für die Stabilität Ihres Systems bedeutet (was normalerweise der Fall ist), können Sie die Option <literal>--force-overwrite</literal> benutzen, die <command>dpkg</command> anweist, diesen Fehler zu ignorieren und die Datei zu überschreiben.
es_es: En este caso, si piensa que reemplazar este archivo no es un riesgo significativo para la estabilidad de su sistema (que es el caso frecuentemente), puede utilizar la opción <literal>--force-overwrite</literal> que le indica a <command>dpkg</command> que ignore dicho error y sobreescriba el archivo.
it_it: In questo caso, se si pensa che sostituire questo file non sia un rischio significativo per la stabilità del sistema (e solitamente è così), si può usare l'opzione <literal>--force-overwrite</literal>, che dice a <command>dpkg</command> di ignorare questo errore e di sovrascrivere il file.
ja_jp: この場合、ファイルを置き換えることでシステムの安定度が大きく阻害されない (通常は阻害されません) と考えるなら、<literal>--force-overwrite</literal> オプションを使うことで <command>dpkg</command> にこのエラーを無視してファイルを上書きするように伝えられます。
zh_cn: 在这种情况下，如果你认为文件替换该文件可能不会对系统的稳定性造成重大的风险（通常情况下），你可以使用<literal>--force-overwrite</literal>选项来告诉<command>dpkg</command>去忽略这个错误并且覆盖该文件。

source: While there are many available <literal>--force-*</literal> options, only <literal>--force-overwrite</literal> is likely to be used regularly. These options only exist for exceptional situations, and it is better to leave them alone as much as possible in order to respect the rules imposed by the packaging mechanism. Do not forget, these rules ensure the consistency and stability of your system.
de_de: Obwohl viele <literal>--force-*</literal>-Optionen verfügbar sind, wird wahrscheinlich nur <literal>--force-overwrite</literal> häufiger gebraucht werden. Es gibt diese Optionen nur für außergewöhnliche Situationen, und es ist besser, soweit wie möglich die Finger von ihnen zu lassen, um die vom Paketverwaltungsmechanismus vorgegebenen Regeln einzuhalten. Sie sollten nicht vergessen, dass diese Regeln die Konsistenz und Stabilität Ihres Systems sicherstellen.
es_es: Si bien hay muchas opciones <literal>--force-*</literal> disponibles, probablemente sólo utilice regularmente <literal>--force-overwrite</literal>. Estas opciones sólo existen para situaciones excepcionales y es mejor evitarlas siempre que sea posible para respetar las reglas impuestas por el mecanismo de empaquetado. No olvide que estas reglas aseguran la consistencia y estabilidad de su sistema.
it_it: Anche se ci sono molte opzioni <literal>--force-*</literal>, è probabile che solo <literal>--force-overwrite</literal> sia usata regolarmente. Queste opzioni esistono solamente per situazioni eccezionali ed è meglio lasciarle stare il più possibile per rispettare le regole imposte dal meccanismo dei pacchetti. Non si dimentichi che queste regole assicurano la coerenza e la stabilità del sistema.
ja_jp: <literal>--force-*</literal> 系のオプションはたくさんありますが、日常的に使うのは <literal>--force-overwrite</literal> だけです。これらのオプションは例外的状況のためだけに用意されており、パッケージ化メカニズムの定める標準規則を尊重するためには、これらのオプションを使うことは可能な限り避けるべきです。これらの標準規則はシステムの一貫性と安定性を守るものである事を忘れないでください。
zh_cn: 当然这里有非常多的<literal>--force-*</literal>选项，只是<literal>--force-overwrite</literal>使用的非常频繁。这些选项仅存在特殊的情况下，所以最好是不去使用它们以便遵守软件包的管理机制。不要忘了，这些管理规则可以确保你的系统的稳定性和一致性。

source: <emphasis>CAUTION</emphasis> Effective use of <literal>--force-*</literal>
de_de: <emphasis>VORSICHT</emphasis> Effektive Verwendung von <literal>--force-*</literal>
es_es: <emphasis>PRECAUCIÓN</emphasis> Uso efectivo de <literal>--force-*</literal>
it_it: <emphasis>ATTENZIONE</emphasis> Uso efficace di <literal>--force-*</literal>
ja_jp: <emphasis>CAUTION</emphasis> <literal>--force-*</literal> の効果的な使い方
zh_cn: <emphasis>注意</emphasis> 使用<literal>--force-*</literal>的影响

source: <primary>broken dependency</primary>
de_de: <primary>Gebrochene Abhängigkeit</primary>
es_es: <primary>dependencia rota</primary>
it_it: <primary>dipendenza non soddisfatta</primary>
ja_jp: <primary>破壊された依存性</primary>
zh_cn: <primary>破坏依赖性</primary>

source: If you are not careful, the use of an option <literal>--force-*</literal> can lead to a system where the APT family of commands will refuse to function. In effect, some of these options allow installation of a package when a dependency is not met, or when there is a conflict. The result is an inconsistent system from the point of view of dependencies, and the APT commands will refuse to execute any action except those that will bring the system back to a consistent state (this often consists of installing the missing dependency or removing a problematic package). This often results in a message like this one, obtained after installing a new version of <emphasis role="pkg">rdesktop</emphasis> while ignoring its dependency on a newer version of the <emphasis role="pkg">libc6</emphasis>:
ja_jp: 下手をすると <literal>--force-*</literal> オプションを使うことにより、そのシステム上で APT ファミリーのコマンドが動かなくなる場合があります。事実上、これらのオプションを使えば、依存関係が満足されていないくても、衝突していても、パッケージをインストールをできてしまいます。この結果、システムは依存関係の観点からすると一貫性の無い状況になります。APT コマンドはシステムを一貫性の有る状態に戻せるような操作 (多くの場合、依存関係を満足させるために必要なパッケージのインストール、問題のあるパッケージの削除が含まれています) を除き、その実行を拒否しますから、APT コマンドが実行できなくなります。その場合、例えば以下のようなメッセージが表示される事があります。これは、<emphasis role="pkg">rdesktop</emphasis> の新しいバージョンが <emphasis role="pkg">libc6</emphasis> のシステムにインストールされているバージョンよりも新しいバージョンに依存しているにも関わらず、その依存関係を無視して <emphasis role="pkg">rdesktop</emphasis> をインストールした結果です。

source: A courageous administrator who is certain of the correctness of their analysis may choose to ignore a dependency or conflict and use the corresponding <literal>--force-*</literal> option. In this case, if they want to be able to continue to use <command>apt-get</command> or <command>aptitude</command>, they must edit <filename>/var/lib/dpkg/status</filename> to delete/modify the dependency, or conflict, that they chose to override.
de_de: Ein mutiger Administrator, der von der Richtigkeit seiner Analyse überzeugt ist, wird sich möglicherweise entscheiden, eine Abhängigkeit oder einen Konflikt zu ignorieren und die entsprechende <literal>--force-*</literal>-Option verwenden. Falls er in diesem Fall weiterhin in der Lage sein will, <command>apt-get</command> oder <command>aptitude</command> zu verwenden, muss er <filename>/var/lib/dpkg/status</filename> editieren, um die Abhängigkeit oder den Konflikt, über den er sich hinweggesetzt hat, zu löschen oder abzuändern.
es_es: Un administrador valiente que está seguro de la correctitud de su análisis podría elegir ignorar una dependencia o conflicto y utilizar la opción <literal>--force-*</literal> correspondiente. En este caso, si desea poder continuar utilizando <command>apt-get</command> o <command>aptitude</command>, deberá editar <filename>/var/lib/dpkg/status</filename> para borrar o modificar la dependencia o conflicto que desea invalidar.
it_it: Un amministratore coraggioso che sia certo della correttezza della propria analisi può scegliere di ignorare una dipendenza o un conflitto e usare la corrispondente opzione <literal>--force-*</literal>. In questo caso, se si vuole continuare a usare <command>apt-get</command> o <command>aptitude</command>, bisogna modificare <filename>/var/lib/dpkg/status</filename> per eliminare o modificare la dipendenza, o il conflitto, che si è scelto di scavalcare.
ja_jp: 勇気ある管理者が自分の解析の正確さに自信を持っているなら、依存関係や衝突を無視して、対応する <literal>--force-*</literal> 系オプションを使う事を選ぶかもしれません。この場合に、管理者が <command>apt-get</command> や <command>aptitude</command> を使い続けたいと思うなら、管理者は無効にしたい依存関係や衝突を削除/変更するために <filename>/var/lib/dpkg/status</filename> を編集しなければいけません。
zh_cn: 一个勇敢的系统管理员会确定他们分析的正确性，然后选择忽略依赖或者冲突，并且使用对应的<literal>--force-*</literal>选项。在这种情况下，如果他们希望能够继续使用<command>apt-get</command>或者是<command>aptitude</command>，他们必须编辑<filename>/var/lib/dpkg/status</filename>去删除/修改对应的依赖关系，或者是冲突。他们也可以选择覆盖。

source: This manipulation is an ugly hack, and should never be used, except in the most extreme case of necessity. Quite frequently, a more fitting solution is to recompile the package that's causing the problem (see <xref linkend="sect.rebuilding-package" />) or use a new version (potentially corrected) from a repository such as the <literal>stable-backports</literal> one (see <xref linkend="sect.backports" />).
ja_jp: この操作は最悪の対応策であり、本当にどうしても必要な場合を除いて、絶対に使うべきではありません。多くの場合、より適切な解決策は、問題を生じさせているパッケージを再コンパイルするか (<xref linkend="sect.rebuilding-package" /> をご覧ください)、<literal>stable-backports</literal> などのリポジトリから新しい (修正済みの可能性がある) バージョンを使うか (<xref linkend="sect.backports" /> をご覧ください) です。

source: <primary>removing a package</primary>
de_de: <primary>Ein Paket entfernen</primary>
es_es: <primary>eliminación de un paquete</primary>
it_it: <primary>rimozione di un pacchetto</primary>
ja_jp: <primary>パッケージの削除</primary>
zh_cn: <primary>删除掉一个软件包</primary>

source: <primary>purging a package</primary>
ja_jp: <primary>パッケージの完全消去</primary>

source: <primary>package</primary><secondary>removal</secondary>
de_de: <primary>Paket</primary><secondary>Entfernen</secondary>
es_es: <primary>paquete</primary><secondary>eliminación</secondary>
it_it: <primary>pacchetto</primary><secondary>rimozione</secondary>
ja_jp: <primary>パッケージ</primary><secondary>削除</secondary>
zh_cn: <primary>软件包</primary><secondary>移除</secondary>

source: <primary>package</primary><secondary>purge</secondary>
de_de: <primary>Paket</primary><secondary>vollständig löschen</secondary>
es_es: <primary>paquete</primary><secondary>purgado</secondary>
it_it: <primary>pacchetto</primary><secondary>eliminazione completa</secondary>
ja_jp: <primary>パッケージ</primary><secondary>完全消去</secondary>
zh_cn: <primary>软件包</primary><secondary>清除</secondary>

source: Invoking <command>dpkg</command> with the <literal>-r</literal> or <literal>--remove</literal> option, followed by the name of a package, removes that package. This removal is, however, not complete: all of the configuration files, maintainer scripts, log files (system logs) and other user data handled by the package remain. That way disabling the program is easily done by uninstalling it, and it's still possible to quickly reinstall it with the same configuration. To completely remove everything associated with a package, use the <literal>-P</literal> or <literal>--purge</literal> option, followed by the package name.
ja_jp: <command>dpkg</command> を実行する際に、<literal>-r</literal> または <literal>--remove</literal> オプションを付けてさらにパッケージの名前を続けると、パッケージを削除します。しかしながらこの削除は完璧ではありません: パッケージの取り扱うすべての設定ファイル、メンテナスクリプト、ログファイル (システムログ)、その他のユーザデータは残されたままです。プログラムを無効化するには、この方法でパッケージをアンインストールしてください。そうすれば、そのパッケージを同じ設定で再インストールして素早く利用可能な状態にする事もまだ可能です。パッケージに関連するすべてを完全に削除するには、<literal>-P</literal> または <literal>--purge</literal> オプションつけてさらにパッケージの名前を続けてください。
