Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: Since <command>dpkg</command> is the program for handling Debian packages, it also provides the reference implementation of the logic of comparing version numbers. This is why it has a <literal>--compare-versions</literal> option, usable by external programs (especially configuration scripts executed by <command>dpkg</command> itself). This option requires three parameters: a version number, a comparison operator, and a second version number. The different possible operators are <literal>lt</literal> (strictly less than), <literal>le</literal> (less than or equal to), <literal>eq</literal> (equal), <literal>ne</literal> (not equal), <literal>ge</literal> (greater than or equal to), and <literal>gt</literal> (strictly greater than). If the comparison is correct, <command>dpkg</command> gives the return code, 0 (success); if not, it gives a non-zero return value (indicating failure).
de_de: Da <command>dpkg</command> das Programm zur Handhabung von Debian-Paketen ist, stellt es auch die Referenzanwendung für die Logik zum Vergleich von Versionsnummern bereit. Daher hat es die Option <literal>--compare-versions</literal>, die von externen Programmen benutzt werden kann (insbesondere von Konfigurationsskripten, die von <command>dpkg</command> selbst ausgeführt werden). Diese Option benötigt drei Parameter: eine Versionsnummer, einen Vergleichsoperator und eine zweite Versionsnummer. Die möglichen Operatoren sind <literal>lt</literal> (kleiner als), <literal>le</literal> (kleiner als oder gleich), <literal>eq</literal> (gleich), <literal>ne</literal> (ungleich), <literal>ge</literal> (größer als oder gleich) und <literal>gt</literal> (größer als). Falls der Vergleich zutrifft, gibt <command>dpkg</command> den Code 0 (Erfolg) aus; anderenfalls zeigt es einen von Null verschiedenen Wert an (Fehlschlag).
es_es: Dado que <command>dpkg</command> es el programa para gestionar paquetes Debian, también provee la implementación de referencia para la lógica de comparación de números de versión. Es por esto que tiene una opción <literal>--compare-versions</literal>, que puede ser utilizada por programas externos (especialmente scripts de configuración ejecutados por <command>dpkg</command> mismo). Esta opción necesita tres parámetros: un número de versión, un operador de comparación y un segundo número de versión. Los diferentes operadores posibles son: <literal>lt</literal> (estrictamente menor), <literal>le</literal> (menor o igual), <literal>eq</literal> (igual), <literal>ne</literal> (distinto), <literal>ge</literal> (mayor o igual) y <literal>gt</literal> (estrictamente mayor). Si la comparación es correcta, <command>dpkg</command> devuelve el código 0 (éxito); de lo contrario devolverá un valor distinto de cero (indicado un fallo).
it_it: Dal momento che <command>dpkg</command> è il programma per gestire pacchetti Debian, fornisce anche l'implementazione tipo della logica di confronto dei numeri di versione. Questo è il motivo per cui ha un'opzione <literal>--compare-versions</literal> utilizzabile da programmi esterni (specialmente gli script di configurazione eseguiti dallo stesso <command>dpkg</command>). Questa opzione richiede tre parametri: un numero di versione, un operatore di confronto e un secondo numero di versione. I diversi operatori possibili sono <literal>lt</literal> (strettamente minore), <literal>le</literal> (minore o uguale), <literal>eq</literal> (uguale), <literal>ne</literal> (diverso), <literal>ge</literal> (maggiore o uguale) e <literal>gt</literal> (strettamente maggiore). Se il confronto è corretto, <command>dpkg</command> restituisce il codice di ritorno 0 (successo), altrimenti restituisce un valore di ritorno diverso da zero (che indica fallimento).
zh_cn: 自从<command>dpkg</command>作为处理Debian软件包的程序以来，它也提供了逻辑化的比较版本号的功能。这就是<literal>--compare-versions</literal>选项，使用外部程序（尤其是配置脚本的时候被<command>dpkg</command>执行的）。此选项需要三个参数：一个版本号，一个比较操作符，和第二个版本号。这和下面的<literal>lt</literal>（严格小于），<literal>le</literal>（小于或等于），<literal>eq</literal>（等于），<literal>ne</literal>（不等于）,<literal>ge</literal>（大于或登录），和<literal>gt</literal>（严格大于）有一些不同。如果对比后是正确的，<command>dpkg</command>得到返回代码，0 （成功）；如果不正确，会得到一个非零的返回值（表示失败）。

source: Note the unexpected failure of the last comparison: for <command>dpkg</command>, <literal>pre</literal>, usually denoting a pre-release, has no particular meaning, and this program compares the alphabetic characters in the same way as the numbers (a &lt;b &lt;c ...), in alphabetical order. This is why it considers “<literal>0pre3</literal>” to be greater than “<literal>0</literal>”. When we want a package's version number to indicate that it is a pre-release, we use the tilde character, “<literal>~</literal>”:
de_de: Beachten Sie den unerwarteten Fehlschlag des letzten Vergleichs: für <command>dpkg</command> hat <literal>pre</literal>, das normalerweise eine Vorabveröffentlichung bezeichnet, keine besondere Bedeutung, und es behandelt die Buchstaben in derselben Weise wie die Zahlen (a &lt;b &lt;c ...), in alphabetischer Reihenfolge. Daher hält es „<literal>0pre3</literal>“ für größer als „<literal>0</literal>“. Wenn wir möchten, dass die Versionsnummer eines Pakets eine Vorabveröffentlichung kennzeichnet, verwenden wir die Tilde „<literal>~</literal>“:
es_es: Note el fallo inesperado de la última comparación: <literal>pre</literal>, que generalmente denota una prepublicación, no tiene un significado especial para <command>dpkg</command> y éste compara los caracteres alfabéticos de la misma forma que los números (a &lt;b &lt;c ...): en orden alfabético. Es por esto que considera «<literal>0pre3</literal>» mayor que «<literal>0</literal>». Si deseamos que el número de versión de un paquete indique que es una prepublicación, utilizamos el carácter virgulilla: «<literal>~</literal>»:
it_it: Si noti il fallimento inatteso dell'ultimo confronto: per <command>dpkg</command>, <literal>pre</literal>, che normalmente indica un pre-rilascio, non ha alcun particolare significato e questo programma confronta i caratteri alfabetici nello stesso modo dei numeri (a &lt;b &lt;c ...) in ordine alfabetico. Questo è il motivo per cui «<literal>0pre3</literal>» è considerato maggiore di «<literal>0</literal>». Quando si vuole che un numero di versione di un pacchetto indichi che si tratta di un pre-rilascio, si deve usare il carattere tilde «<literal>~</literal>»:
zh_cn: 在最后的对比中需要注意意外的失败：<command>dpkg</command>，<literal>pre</literal>，通常表示一个预发布的，它本来没有特别的意义，这个程序会用字母顺序排列的方式比较相同的字母字符号码 （A &lt; B &lt; C...）。这也就是为什么它认为“<literal>0pre3</literal>”大于“<literal>0</literal>”的版本。当我们想要软件包的版本号来指明这是一个预发布版，我们使用波浪符“<literal>~</literal>”：

source: A recently introduced feature in <command>dpkg</command> is that it keeps a log of all of its actions in <filename>/var/log/dpkg.log</filename>. This log is extremely verbose, since it details every one of the stages through which packages handled by <command>dpkg</command> go. In addition to offering a way to track dpkg's behavior, it helps, above all, to keep a history of the development of the system: one can find the exact moment when each package has been installed or updated, and this information can be extremely useful in understanding a recent change in behavior. Additionally, all versions being recorded, it is easy to cross-check the information with the <filename>changelog.Debian.gz</filename> for packages in question, or even with online bug reports.
de_de: Ein bei <command>dpkg</command> unlängst eingeführtes Merkmal ist das Führen eines Protokolls über alle seine Aktivitäten in <filename>/var/log/dpkg.log</filename>. Dieses Protokoll ist äußerst wortreich, da es jeden einzelnen Schritt aufzeichnet, durch den die von <command>dpkg</command> verarbeiteten Pakete gehen. Zusätzlich zu der Möglichkeit, das Verhalten von <command>dpkg</command> zu verfolgen, hilft es vor allem auch dabei, den Verlauf der Entwicklung des Systems festzuhalten: man kann den genauen Zeitpunkt feststellen, zu dem jedes Paket installiert oder aktualisiert worden ist, und diese Information kann für das Verständnis einer kürzlich aufgetretenen Verhaltensänderung äußerst hilfreich sein. Da alle Versionen aufgezeichnet werden, erleichtert es außerdem eine Gegenprobe mit <filename>changelog.Debian.gz</filename> für betroffene Pakete oder sogar mit Online-Fehlerberichten.
es_es: Una de las funcionalidades agregadas recientemente a <command>dpkg</command> es que mantiene un registro de todas sus acciones en <filename>/var/log/dpkg.log</filename>. Este registro es extremadamente detallado ya que incluye cada una de las etapas por las que pasa un paquete gestionado por <command>dpkg</command>. Además de ofrecer una forma de rastrear el funcionamiento de dpkg, sobre todo ayuda a mantener un historial del desarrollo del sistema: uno puede encontrar el momento exacto en el que se instaló o actualizó un paquete, y esta información puede ser extremadamente útil cuando se intenta entender un cambio de comportamiento reciente. Además, como se registran todas las versiones, es sencillo verificar y referenciar información con el archivo <filename>changelog.Debian.gz</filename> del paquete en cuestión o inclusive con reportes de error online.
it_it: Una funzionalità introdotta recentemente in <command>dpkg</command> è che mantiene un registro di tutte le proprie azioni in <filename>/var/log/dpkg.log</filename>. Questo registro è estremamente prolisso, dal momento che contiene dettagli di ciascun stato attraverso cui passano i pacchetti gestiti da <command>dpkg</command>. Oltre a offrire un modo per tenere traccia del comportamento di dpkg, ciò aiuta, soprattutto, a mantenere una cronologia dello sviluppo del sistema: si può trovare il momento esatto in cui ciascun pacchetto è stato installato o aggiornato e queste informazioni possono essere estremamente utili nel comprendere un recente cambiamento di comportamento. Inoltre, siccome tutte le versioni sono registrate, è facile incrociare queste informazioni con il <filename>changelog.Debian.gz</filename> dei pacchetti in questione o anche con le segnalazioni di bug online.
zh_cn: 最近推出的<command>dpkg</command>中的功能是，它使所有它的操作保存在<filename>/var/log/dpkg.log</filename>中。这个日志非常长，因为它记录了每一步的<command>dpkg</command>操作。它提供了追踪dpkg行为的一个方式，对于保持系统的升级来说这非常有用：一是可以查找到每个软件包安装或升级的确切的时间，这些信息对于理解系统最近的改变极其有用。此外，所有的版本都被记录了，这就很容易交叉核对<filename>changelog.Debian.gz</filename>的软件包的问题，或者通过网上的bug报告。

source: Debian packages are not the only software packages used in the free software world. The main competitor is the RPM format for Red Hat Linux and its many derivatives. Red Hat is a very popular, commercial distribution. It is common for software provided by third parties to be offered as RPM packages rather than Debian.
de_de: Debian-Pakete sind nicht die einzigen in der freien Software-Welt verwendeten Software-Pakete. Hauptkonkurrent ist das RPM-Format für Red Hat Linux und seine zahlreichen Abkömmlinge. Red Hat ist eine sehr populäre kommerzielle Distribution. Häufig wird von Dritten bereitgestellte Software als RPM-Paket angeboten und nicht als Debian.
es_es: Los paquetes Debian no son los únicos paquetes de software utilizados en el mundo del software libre. El principal competidor es el formato RPM de Red Hat Linux y sus muchos derivados. Red Hat es una distribución comercial muy popular. Es muy común que el software provisto por terceros sea ofrecido como paquetes RPM en lugar de paquetes Debian.
it_it: I pacchetti Debian non son gli unici pacchetti software usati nel monto del software libero. Il concorrente principale è il formato RPM per Red Hat Linux e le sue molte derivate. Red Hat è una distribuzione commerciale molto popolare. È comune che il software fornito da terze parti sia offerto come pacchetti RPM invece che Debian.
zh_cn: Debian软件包不仅仅是一个自由软件世界的软件包。主要竞争对手是红帽Linux的RPM和它的许多的衍生系统。红帽是一个非常流行，商业的贡献者。非常常见的是由第三方提供的RPM软件包比Debian的更多。

source: If you regularly use the <command>alien</command> program to install RPM packages coming from one of your providers, do not hesitate to write to them and amicably express your strong preference for the <filename>.deb</filename> format. Note that the format of the package is not everything: a <filename>.deb</filename> package built with <command>alien</command> or prepared for a version of Debian different than that which you use, even for a derivative distribution like Ubuntu, would probably not offer the same level of quality and integration as a package specifically developed for Debian <emphasis role="distribution">Squeeze</emphasis>.
de_de: Falls Sie regelmäßig das Programm <command>alien</command> verwenden, um RPM-Pakete zu installieren, die von einem Ihrer Lieferanten kommen, sollten Sie nicht zögern, ihm zu schreiben und in freundlicher Weise Ihre starke Vorliebe für das <filename>.deb</filename>-Format zum Ausdruck zu bringen. Beachten Sie, dass das Format eines Pakets nicht alles ist: ein mit <command>alien</command> erzeugtes <filename>.deb</filename>-Paket oder eines, das für eine andere Debian-Version erstellt wurde als die von Ihnen verwendete oder gar für eine abgeleitete Distribution wie Ubuntu, würde wahrscheinlich nicht das gleiche Niveau an Qualität und Integration bieten, wie ein Paket, das speziell für Debian <emphasis role="distribution">Squeeze</emphasis> entwickelt worden ist.
es_es: Si utiliza el programa <command>alien</command> frecuentemente para instalar paquetes RPM de alguno de sus proveedores, no dude en escribirle y expresar su fuerte preferencia por el formato <filename>.deb</filename>. Note que el formato del paquete no es todo: un paquete <filename>.deb</filename> construido con <command>alien</command> o preparado para una versión de Debian diferente a la que utiliza, aún para una distribución derivada como Ubuntu, probablemente no ofrezca el mismo nivel de calidad e integración que un paquete desarrollado específicamente para Debian <emphasis role="distribution">Squeeze</emphasis>.
it_it: Se si usa abitualmente il programma <command>alien</command> per installare pacchetti RPM provenienti da uno dei vostri fornitori, non si esiti a scrivergli ed esprimere amichevolmente la forte preferenza per il formato <filename>.deb</filename>. Si noti che il formato del pacchetto non è tutto: un pacchetto <filename>.deb</filename> costruito con <command>alien</command> o preparato per una versione differente di Debian rispetto a quella in uso, anche per una versione derivata come Ubuntu, probabilmente non offrirebbe lo stesso livello di qualità e di integrazione di un pacchetto sviluppato specificamente per Debian <emphasis role="distribution">Squeeze</emphasis>.
zh_cn: 如果你经常使用<command>alien</command>程序来安装从发行商那里得到的RPM软件包，不要犹豫，马上写信给他们，并友好地表达你自己强烈的喜欢<filename>.deb</filename>的格式，需要注意的是软件包的格式并不是一定的：一个<filename>.deb</filename>软件包可以被<command>alien</command>编译产生或是被不同版本的Debian使用，甚至是衍生的像Ubuntu这样的版本。这可能会导致无法提供专为Debian<emphasis role="distribution">Squeeze</emphasis>而开发的同等级同质量的完整性。

source: You will find that this process is extremely simple. You must know, however, that the package generated does not have any information on dependencies, since the dependencies in the two packaging formats don't have systematic correspondence. The administrator, thus, must manually ensure that the converted package will function correctly, and this is why Debian packages thus generated should be avoided as much as possible. Fortunately, Debian has the largest collection of software packages of all distributions, and it is likely that whatever you seek is already in there.
de_de: Sie werden feststellen, dass dieses Verfahren sehr einfach ist. Sie müssen jedoch wissen, dass das so erstellte Paket keinerlei Informationen über Abhängigkeiten enthält, da die Abhängigkeiten in den beiden Paketformaten keine systematische Entsprechung miteinander haben. Der Administrator muss daher manuell sicherstellen, dass das konvertierte Paket richtig funktioniert, und aus diesem Grund sollten so erzeugte Debian-Pakete möglichst vermieden werden. Glücklicherweise hat Debian von allen Distributionen die größte Sammlung an Softwarepaketen, und es ist wahrscheinlich, dass das, was Sie suchen, bereits darin vorhanden ist.
es_es: Encontrará que el proceso es extremadamente simple. Debe saber, sin embargo, que el paquete generado no tiene información sobre dependencias ya que las dependencias de los dos formatos de paquetes no tienen una correspondencia sistemática. El administrador, por lo tanto, debe asegurarse manualmente que el paquete convertido funcionará correctamente y esta es la razón por la que se deben evitar los paquetes Debian así generados tanto como sea posible. Afortunadamente, Debian tiene la colección más grande de paquetes de software entre todas las distribuciones y es probable que lo que sea que busque ya esté allí.
it_it: Questo procedimento è estremamente semplice. Si deve sapere, però, che il pacchetto generato non ha alcuna informazione sulle dipendenze, dal momento che le dipendenze nei due formati di pacchetti non hanno una corrispondenza sistematica. L'amministratore, perciò, deve assicurare manualmente che il pacchetto convertito funzioni correttamente e questo è il motivo per cui i pacchetti Debian generati in questo modo dovrebbe essere evitati il più possibile. Fortunatamente, Debian ha la più grande raccolta di pacchetti software rispetto a tutte le distribuzioni ed è probabile che qualunque cosa si cerchi ci sia già.
zh_cn: 你会发现，这个过程相当的简单。但是你必须知道，两种不同的包管理格式通过alien生成的软件包没有任何信息的依赖，因为它没有和系统对应。因此，管理员必须手动确保转换后的软件包正常。这也就是为什么要避免产生这种Debian软件包。幸运的是，Debian有非常强大的软件包仓库收集了所有的分发的软件包，基本上你所有需要寻找的软件包它都有，这简直太棒了！

source: Looking at the man page for the <command>alien</command> command, you will also note that this program also handles other packaging formats, especially the one used by the Slackware distribution (it is made of a simple <filename>tar.gz</filename> archive).
de_de: Wenn Sie sich die Handbuchseite für das Programm <command>alien</command> ansehen, werden sie feststellen, dass es auch andere Paketformate verarbeiten kann, vor allem solche der Slackware-Distribution (sie sind einfache <filename>tar.gz</filename> Archive).
es_es: Revisando la página de manual del programa <command>alien</command> también notará que este programa también es compatible con otros formatos de paquetes, en especial el utilizado por la distribución Slackware (que está compuesto de un simple compendio <filename>tar.gz</filename>).
it_it: Guardando la pagina di manuale per il comando <command>alien</command>, si noterà che questo programma gestisce anche altri formati di pacchetti, specificamente quello della distribuzione Slackware (è composto da un semplice archivio <filename>tar.gz</filename>).
zh_cn: 看看<command>alien</command>命令的帮助手册，你会注意到这个程序也可以处理其它的软件包格式，尤其是使用Slackware发行版(它使用简单的<filename>tar.gz</filename>来归档)。

source: <computeroutput>$ </computeroutput><userinput>apt-cache show apt</userinput> <computeroutput>Package: apt Priority: important Section: admin Installed-Size: 5612 Maintainer: APT Development Team &lt;deity@lists.debian.org&gt; Architecture: i386 Version: 0.8.0 Replaces: manpages-pl (&lt;&lt; 20060617-3~) Provides: libapt-pkg4.10 Depends: libc6 (&gt;= 2.3.4), libgcc1 (&gt;= 1:4.1.1), libstdc++6 (&gt;= 4.4.0), zlib1g (&gt;= 1:1.1.4), debian-archive-keyring, gnupg Suggests: aptitude | synaptic | wajig, dpkg-dev, apt-doc, bzip2, lzma, python-apt Conflicts: python-apt (&lt;&lt; 0.7.93.2~) Filename: pool/main/a/apt/apt_0.8.0_i386.deb Size: 1965454 MD5sum: 43364819b898e49b8175e88ec5787241 SHA1: 350a8a7a43fe182d54f3b7d73b8032f85b5d7ddf SHA256: a593e7d7f9b3cffa37770201a3c13bd2c8bc588bafbf39b4aaa5e13b5fb00b8b Description: Advanced front-end for dpkg This is Debian's next generation front-end for the dpkg package manager. It provides the apt-get utility and APT dselect method that provides a simpler, safer way to install and upgrade packages. . APT features complete installation ordering, multiple source capability and several other unique features, see the Users Guide in apt-doc. Tag: admin::package-management, hardware::storage, hardware::storage:cd, interface::commandline, network::client, protocol::{ftp,http,ipv6}, role::program, suite::debian, use::downloading, use::searching, works-with::software:package</computeroutput>
it_it: <computeroutput>$ </computeroutput><userinput>apt-cache show apt</userinput> <computeroutput>Package: apt Version: 0.9.3 Installed-Size: 3008 Maintainer: APT Development Team &lt;deity@lists.debian.org&gt; Architecture: i386 Replaces: manpages-pl (&lt;&lt; 20060617-3~) Depends: libapt-pkg4.12 (&gt;= 0.9.3), libc6 (&gt;= 2.4), libgcc1 (&gt;= 1:4.1.1), libstdc++6 (&gt;= 4.6), debian-archive-keyring, gnupg Suggests: aptitude | synaptic | wajig, dpkg-dev, apt-doc, xz-utils, python-apt Conflicts: python-apt (&lt;&lt; 0.7.93.2~) Description-it: gestore di pacchetti a riga di comando Questo pacchetto fornisce strumenti a riga di comando per cercare e gestire pacchetti, così come per interrogare le informazioni sui pacchetti, usando l'accesso a basso livello a tutte le funzionalità della libreria libapt-pkg. . Includono: * apt-get per recuperare pacchetti e informazioni su di essi da fonti autenticate e per l'installazione, aggiornamento e rimozione dei pacchetti insieme alle loro dipendenze; * apt-cache per interrogare le informazioni disponibili sui pacchetti installati, così come su quelli installabili; * apt-cdrom per usare supporti rimovibili come fonte per i pacchetti; * apt-config come interfaccia alle impostazioni di configurazione; * apt-key come interfaccia per la gestione delle chiavi di autenticazione. Description-md5: 9fb97a88cb7383934ef963352b53b4a7 Tag: admin::package-management, hardware::storage, hardware::storage:cd, implemented-in::c++, interface::commandline, network::client, protocol::ftp, protocol::http, protocol::ipv6, role::program, suite::debian, use::downloading, use::searching, works-with::software:package Section: admin Priority: important Filename: pool/main/a/apt/apt_0.9.3_i386.deb Size: 1149410 MD5sum: 8033e6df639ca534c9127156e2c5a691 SHA1: 5af45a9dac1aab4d16cd01166a0671d844615eae SHA256: 6d1f1307926d4493ba195a7bfbfe3964ea7fa4c1d48b827feb616832c65728f0</computeroutput>

source: This file uses a structure similar to email headers (as defined by RFC 2822). For example, for <emphasis role="pkg">apt</emphasis>, the <filename>control</filename> file looks like the following:
de_de: Diese Datei verwendet eine den E-Mail-Kopfzeilen ähnliche Struktur (wie sie in RFC 2822 definiert ist). So sieht die <filename>control</filename>-Datei für <emphasis role="pkg">apt</emphasis> zum Beispiel folgendermaßen aus:

source: <primary><filename>conffiles</filename></primary>
zh_cn: <primary><filename>冲突文件</filename></primary>
