Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: This file uses a structure similar to email headers (as defined by RFC 2822). For example, for <emphasis role="pkg">apt</emphasis>, the <filename>control</filename> file looks like the following:
es_es: Este archivo utiliza una estructura similar a las cabeceras de email (definidas en RFC 2822). Por ejemplo el archivo <filename>control</filename> de <emphasis role="pkg">apt</emphasis> se ve de la siguiente forma:
it_it: Questo file usa una struttura simile alle intestazioni delle email (come definite dalla RFC 2822). Per esempio, per <emphasis role="pkg">apt</emphasis>, il file <filename>control</filename> è fatto così:
ja_jp: このファイルは (RFC 2822 の定義する) 電子メールヘッダとよく似た構造を使っています。例えば、<emphasis role="pkg">apt</emphasis> の <filename>control</filename> ファイルは以下の内容です:
zh_cn: 该文件使用一个类似电子邮件头（由 RFC 2822 定义）的结构。例如，<emphasis role="pkg">apt</emphasis> 包的 <filename>control</filename> 文件看起来是这样的：

source: <computeroutput>$ </computeroutput><userinput>apt-cache show apt</userinput> <computeroutput>Package: apt Version: 0.9.7.9 Installed-Size: 3271 Maintainer: APT Development Team &lt;deity@lists.debian.org&gt; Architecture: amd64 Replaces: manpages-pl (&lt;&lt; 20060617-3~) Depends: libapt-pkg4.12 (&gt;= 0.9.7.9), libc6 (&gt;= 2.4), libgcc1 (&gt;= 1:4.1.1), libstdc++6 (&gt;= 4.6), debian-archive-keyring, gnupg Suggests: aptitude | synaptic | wajig, dpkg-dev, apt-doc, xz-utils, python-apt Conflicts: python-apt (&lt;&lt; 0.7.93.2~) Description-en: commandline package manager This package provides commandline tools for searching and managing as well as querying information about packages as a low-level access to all features of the libapt-pkg library. . These include: * apt-get for retrieval of packages and information about them from authenticated sources and for installation, upgrade and removal of packages together with their dependencies * apt-cache for querying available information about installed as well as installable packages * apt-cdrom to use removable media as a source for packages * apt-config as an interface to the configuration settings * apt-key as an interface to manage authentication keys Description-md5: 9fb97a88cb7383934ef963352b53b4a7 Tag: admin::package-management, hardware::storage, hardware::storage:cd, implemented-in::c++, interface::commandline, network::client, protocol::ftp, protocol::http, protocol::ipv6, role::program, suite::debian, use::downloading, use::searching, works-with::software:package Section: admin Priority: important Filename: pool/main/a/apt/apt_0.9.7.9_amd64.deb Size: 1253524 MD5sum: 00a128b2eb2b08f4ecee7fe0d7e3c1c4 SHA1: 6a271487ceee6f6d7bc4c47a8a16f49c26e4ca04 SHA256: 3bba3b15fb5ace96df052935d7069e0d21ff1f5b496510ec9d2dc939eefad104</computeroutput>
ja_jp: <computeroutput>$ </computeroutput><userinput>apt-cache show apt</userinput> <computeroutput>Package: apt Version: 0.9.7.9 Installed-Size: 3271 Maintainer: APT Development Team &lt;deity@lists.debian.org&gt; Architecture: amd64 Replaces: manpages-pl (&lt;&lt; 20060617-3~) Depends: libapt-pkg4.12 (&gt;= 0.9.7.9), libc6 (&gt;= 2.4), libgcc1 (&gt;= 1:4.1.1), libstdc++6 (&gt;= 4.6), debian-archive-keyring, gnupg Suggests: aptitude | synaptic | wajig, dpkg-dev, apt-doc, xz-utils, python-apt Conflicts: python-apt (&lt;&lt; 0.7.93.2~) Description-ja: コマンドラインパッケージマネージャ 本パッケージは、パッケージを検索、管理したりパッケージの情報を照会できるコ マンドラインツールを提供します。libapt-pkg ライブラリの全機能に低レベルアク セスできます。 . 次のツールが含まれます。 * apt-get: 信頼されたソースからパッケージやパッケージの情報を取得したり、 パッケージとその依存関係をまとめてインストール、アップグレード、および削 除できます * apt-cache: インストールしたパッケージやインストール可能なパッケージに関 して利用できる情報を検索できます * apt-cdrom: リムーバブルメディアをパッケージの取得ソースとして利用できます * apt-config: 構成設定へのインターフェース * apt-key: 信頼できる鍵を管理するインターフェース Description-md5: 9fb97a88cb7383934ef963352b53b4a7 Tag: admin::package-management, hardware::storage, hardware::storage:cd, implemented-in::c++, interface::commandline, network::client, protocol::ftp, protocol::http, protocol::ipv6, role::program, suite::debian, use::downloading, use::searching, works-with::software:package Section: admin Priority: important Filename: pool/main/a/apt/apt_0.9.7.9_amd64.deb Size: 1253524 MD5sum: 00a128b2eb2b08f4ecee7fe0d7e3c1c4 SHA1: 6a271487ceee6f6d7bc4c47a8a16f49c26e4ca04 SHA256: 3bba3b15fb5ace96df052935d7069e0d21ff1f5b496510ec9d2dc939eefad104</computeroutput>

source: <emphasis>BACK TO BASICS</emphasis> RFC — Internet standards
de_de: <emphasis>ZURÜCK ZU DEN GRUNDLAGEN</emphasis> RFC — Internet-Standards
es_es: <emphasis>VOLVER A LOS CIMIENTOS</emphasis> RFC — estándares de internet
it_it: <emphasis>FONDAMENTALI</emphasis> RFC — Standard per Internet
ja_jp: <emphasis>BACK TO BASICS</emphasis> RFC - インターネット標準
zh_cn: <emphasis>基础知识</emphasis> RFC －－ 互联网标准

source: RFC is the abbreviation of “Request For Comments”. An RFC is generally a technical document that describes what will become an Internet standard. Before becoming standardized and frozen, these standards are submitted for public review (hence their name). The IETF (Internet Engineering Task Force) decides on the evolution of the status of these documents (proposed standard, draft standard, or standard).
de_de: RFC ist die Abkürzung für „Request For Comments“ (Bitte um Kommentare). Ein RFC ist üblicherweise ein technisches Dokument, das einen zukünftigen Internet-Standard beschreibt. Bevor sie standardisiert und für Veränderungen gesperrt werden, werden diese Standards einer öffentlichen Überprüfung unterworfen (daher der Name). Die IETF (Internet Engineering Task Force) entscheidet über die Statusentwicklung dieser Dokumente (vorgeschlagener Standard, Standardentwurf oder Standard).
es_es: RFC son las siglas de «pedido de comentarios» («Request For Comments»). Un RFC es generalmente un documento técnico que describe lo que se convertirá en un estándar de internet. Antes de convertirse en estándar y congelarse, éstos estándares son enviados para revisión pública (de ahí su nombre). La IETF («Internet Engineering Task Force»: grupo de trabajo de ingeniería de internet) decide sobre la evolución del estado de estos documentos (estándares propuestos, borradores de estándar o estándar).
it_it: RFC è l'acronimo di «Request For Comments» («Richiesta di commenti»). Una RFC è generalmente un documento tecnico che descrive ciò che diventerà uno standard per Internet. Prima di diventare standardizzati e congelati, questi standard sono sottoposti a una revisione pubblica (da cui il loro nome). La IETF (Internet Engineering Task Force) decide sull'evoluzione e sullo stato di questi documenti (proposta di standard, bozza di standard, standard).
ja_jp: RFC は「Request For Comments」の略称です。RFC は一般的にインターネット標準になり得る技術の仕様を説明した技術文書です。標準化と決定の前に、これらの文書は公開レビューされます (そんなわけでこの名前が付いています)。IETF (インターネット技術タスクフォース) はこれらの文書の状態の進化 (標準化への提唱、標準化への草稿、標準) を決定します。
zh_cn: RFC 是 “征求建议”的缩写。RFC通常是一份描述将要成为互联网的标准的技术文档。在成为标准并被冻结之前，这些标准被提交给大众评估（这就是名字的由来）。 IETF（互联网工程专家组）决定这些文档的演进更新（建议标准、草案或标准）。

source: RFC 2026 defines the process for standardization of Internet protocols. <ulink type="block" url="http://www.faqs.org/rfcs/rfc2026.html" />
de_de: RFC 2026 definiert den Prozess der Standardisierung von Internet-Protokollen. <ulink type="block" url="http://www.faqs.org/rfcs/rfc2026.html" />
es_es: RFC 2026 define el proceso de estadarización de protocolos de internet. <ulink type="block" url="http://www.faqs.org/rfcs/rfc2026.html" />
it_it: RFC 2026 definisce la procedura per la standardizzazione dei protocolli Internet. <ulink type="block" url="http://www.faqs.org/rfcs/rfc2026.html" />
ja_jp: RFC 2026 ではインターネットプロトコル標準化の手続きが定義されています。<ulink type="block" url="http://www.faqs.org/rfcs/rfc2026.html" />
zh_cn: RFC 2026 定义了互联网协议标准化的程序。<ulink type="block" url="http://www.faqs.org/rfcs/rfc2026.html" />

source: Dependencies: the <literal>Depends</literal> Field
de_de: Abhängigkeiten: die<literal>Depends</literal>-Zeile
es_es: Dependencias: el campo <literal>Depends</literal>
it_it: Dipendenze: il campo <literal>Depends</literal>
ja_jp: 依存関係: <literal>Depends</literal> フィールド
zh_cn: 依赖：<literal>Depends</literal> 域

source: <primary>dependency</primary>
de_de: <primary>Abhängigkeit</primary>
es_es: <primary>dependencia</primary>
it_it: <primary>dipendenza</primary>
ja_jp: <primary>依存</primary>
zh_cn: <primary>依赖</primary>

source: <primary><literal>Depends</literal>, header field</primary>
de_de: <primary><literal>Depends</literal>, Kopfzeile</primary>
es_es: <primary><literal>Depends</literal>, campo de cabecera</primary>
it_it: <primary><literal>Depends</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Depends</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>Depends</literal>, 头部的域</primary>

source: <primary>package</primary><secondary>dependency</secondary>
de_de: <primary>Paket</primary><secondary>Abhängigkeit</secondary>
es_es: <primary>paquete</primary><secondary>dependencia</secondary>
it_it: <primary>pacchetto</primary><secondary>dipendenza</secondary>
ja_jp: <primary>パッケージ</primary><secondary>依存関係</secondary>
zh_cn: <primary>软件包</primary><secondary>依赖</secondary>

source: The dependencies are defined in the <literal>Depends</literal> field in the package header. This is a list of conditions to be met for the package to work correctly — this information is used by tools such as <command>apt</command> in order to install the required libraries, in their appropriate versions, that the package to be installed depends on. For each dependency, it is possible to restrict the range of versions that meet that condition. In other words, it is possible to express the fact that we need the package <emphasis role="pkg">libc6</emphasis> in a version equal to or greater than “2.3.4” (written “<command>libc6 (&gt;= 2.3.4)</command>”). Version comparison operators are as follows:
de_de: Die Abhängigkeiten sind in der <literal>Depends</literal>-Zeile des Paketkopfs definiert. Dies ist eine Liste von Bedingungen, die erfüllt sein müssen, damit das Paket korrekt funktioniert - diese Information wird von Programmen wie <command>apt</command> dazu verwendet, die erforderlichen Bibliotheken in der passenden Version zu installieren, auf die das zu installierende Programm angewiesen ist. Für jede Abhängigkeit kann der Bereich der Versionen, die diese Bedingung erfüllen, eingeschränkt werden. Anders ausgedrückt ist es möglich, die Tatsache zu bekunden, dass wir das Paket <emphasis role="pkg">libc6</emphasis> in einer Version größer oder gleich „2.3.4“ benötigen (geschrieben „<command>libc6 (&gt;= 2.3.4)</command>“). Für den Versionsvergleich gibt es folgende Operatoren:
es_es: Las dependencias están definidas en el campo <literal>Depends</literal> en la cabecera del paquete. Esta es una lista de condiciones a cumplir para que el paquete funcione correctamente — las herramientas como <command>apt</command> utilizan esta información para instalar las bibliotecas necesarias, las versiones apropiadas, de las que depende el paquete a instalar. Para cada dependencia es posible restringir el rango de versiones que cumplen dicha condición. En otras palabras, es posible expresar el hecho de que necesitamos el paquete <emphasis role="pkg">libc6</emphasis> en una versión igual o mayor a «2.3.4» (escrito como «<command>libc6 (>= 2.3.4)</command>». Los operadores de comparación de versiones son los siguientes:
it_it: Le dipendenze sono definite nel campo <literal>Depends</literal> dell'intestazione del pacchetto. Questo è un elenco di condizioni che devono essere verificate perché il pacchetto lavori correttamente; queste informazioni sono usate da strumenti come <command>apt</command> per installare le librerie richieste, nelle loro versioni appropriate, dalle quali dipende il pacchetto che deve essere installato. Per ogni dipendenza, è possibile restringere l'intervallo di versioni che verificano una condizione. In altre parole, è possibile esprimere il fatto che è necessario il pacchetto <emphasis role="pkg">libc6</emphasis> in una versione uguale o superiore a «2.3.4» (scritto «<command>libc6 (&gt;= 2.3.4)</command>»). Gli operatori di confronto per la versione sono i seguenti:
ja_jp: 依存関係はパッケージヘッダの <literal>Depends</literal> フィールドで定義されています。依存関係はパッケージを正しく動かすために必要な条件を定義しています - <command>apt</command> などのツールは、この情報を使って、インストールしたいパッケージが要求するバージョンで必要なライブラリをインストールします。それぞれの依存パッケージについて、要求を満たすパッケージのバージョン範囲を指定する事が可能です。言い換えれば、バージョン「2.3.4」以上の <emphasis role="pkg">libc6</emphasis> パッケージが必要という条件を表現する(「<command>libc6 (&gt;= 2.3.4)</command>」と表記する) 事が可能です。バージョン比較演算子は次の通りです:

source: <command>&lt;&lt;</command>: less than;
de_de: <command>&lt;&lt;</command>: kleiner als;
es_es: <command>&lt;&lt;</command>: menor que;
it_it: <command>&lt;&lt;</command>: minore;
ja_jp: <command>&lt;&lt;</command>: より低い;
zh_cn: <command>&lt;&lt;</command>：小于；

source: <command>&lt;=</command>: less than or equal to;
de_de: <command>&lt;=</command>: kleiner als oder gleich;
es_es: <command>&lt;=</command>: menor o igual que;
it_it: <command>&lt;=</command>: minore o uguale;
ja_jp: <command>&lt;=</command>: 以下;
zh_cn: <command>&lt;=</command>：小于或等于；

source: <command>=</command>: equal to (note that “<literal>2.6.1</literal>” is not equal to “<literal>2.6.1-1</literal>”);
ja_jp: <command>=</command>: 等しい (「<literal>2.6.1</literal>」は「<literal>2.6.1-1</literal>」と等しくありません);

source: <command>&gt;=</command>: greater than or equal to;
de_de: <command>&gt;=</command>: größer als oder gleich;
es_es: <command>&gt;=</command>: mayor o igual que;
it_it: <command>&gt;=</command>: maggiore o uguale;
ja_jp: <command>&gt;=</command>: 以上;
zh_cn: <command>&gt;=</command>：大于或等于；

source: <command>&gt;&gt;</command>: greater than.
de_de: <command>&gt;&gt;</command>: größer als.
es_es: <command>&gt;&gt;</command>: mayor que.
it_it: <command>&gt;&gt;</command>: maggiore.
ja_jp: <command>&gt;&gt;</command>: より高い;
zh_cn: <command>&gt;&gt;</command>：大于。

source: In a list of conditions to be met, the comma serves as a separator. It must be interpreted as a logical “and”. In conditions, the vertical bar (“|”) expresses a logical “or” (it is an inclusive “or”, not an exclusive “either/or”). Carrying greater priority than “and”, it can be used as many times as necessary. Thus, the dependency “(A or B) and C” is written <command>A | B, C</command>. In contrast, the expression “A or (B and C)” should be written as “(A or B) and (A or C)”, since the <literal>Depends</literal> field does not tolerate parentheses that change the order of priorities between the logical operators “or” and “and”. It would thus be written <command>A | B, A | C</command>. <ulink type="block" url="http://www.debian.org/doc/debian-policy/ch-relationships.html" />
ja_jp: 満足すべき条件リストの中で使われるカンマは条件同士の区切りです。このカンマは論理「and」に解釈されます。条件リストの中で、垂直棒 (「|」) は論理「or」に解釈されます (これは「包含的論理和」で、「排他的論理和」ではありません)。or は「and」より大きな優先順位を持っており、必要に応じて何度でも使えます。このため、「(A or B) and C」は n <command>A | B, C</command> のように表記できます。これに対して、「A or (B and C)」は「(A or B) and (A or C)」のように表記してください。なぜなら、<literal>Depends</literal> フィールドでは括弧を使って論理演算子「or」と「and」の優先度の順位を変える事ができないからです。このため、これは <command>A | B, A | C</command> のように表記できます。<ulink type="block" url="http://www.debian.org/doc/debian-policy/ch-relationships.html" />

source: The dependencies system is a good mechanism for guaranteeing the operation of a program, but it has another use with “meta-packages”. These are empty packages that only describe dependencies. They facilitate the installation of a consistent group of programs preselected by the meta-package maintainer; as such, <command>apt-get install <replaceable>meta-package</replaceable></command> will automatically install all of these programs using the meta-package's dependencies. The <emphasis role="pkg">gnome</emphasis>, <emphasis role="pkg">kde-full</emphasis> and <emphasis role="pkg">linux-image-amd64</emphasis> packages are examples of meta-packages.
ja_jp: 依存関係システムはプログラムの動作を保証する良いメカニズムですが、「メタパッケージ」を使う手もあります。メタパッケージは依存関係を表記するだけの空のパッケージです。メタパッケージはメンテナが事前に選んだ一連のプログラムグループのインストールを楽にします; <command>apt-get install <replaceable>meta-package</replaceable></command> はメタパッケージが依存するすべてのプログラムを自動的にインストールします。<emphasis role="pkg">gnome</emphasis>、<emphasis role="pkg">kde-full</emphasis>、<emphasis role="pkg">linux-image-amd64</emphasis> パッケージはメタパッケージの例です。

source: <emphasis>DEBIAN POLICY</emphasis> <literal>Pre-Depends</literal>, a more demanding <literal>Depends</literal>
de_de: <emphasis>DEBIAN-RICHTLINIEN</emphasis> <literal>Pre-Depends</literal>, ein anspruchsvolleres <literal>Depends</literal>
es_es: <emphasis>NORMA DEBIAN</emphasis> <literal>Pre-Depends</literal>, un <literal>Depends</literal> más exigentes
it_it: <emphasis>POLICY DEBIAN</emphasis> <literal>Pre-Depends</literal>, più esigente di <literal>Depends</literal>
ja_jp: <emphasis>DEBIAN POLICY</emphasis> <literal>Pre-Depends</literal>、<literal>Depends</literal> よりも厳しい要求
zh_cn: <emphasis>DEBIAN 政策</emphasis> <literal>预依赖</literal>, 一个更苛刻的 <literal>取决于</literal>

source: <primary><literal>Pre-Depends</literal>, header field</primary>
de_de: <primary><literal>Pre-Depends</literal>, Kopfzeilen</primary>
es_es: <primary><literal>Pre-Depends</literal> campo de cabecera</primary>
it_it: <primary><literal>Pre-Depends</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Pre-Depends</literal> ヘッダフィールド</primary>
zh_cn: <primary><literal>预依赖</literal>, 头失败</primary>

source: <primary>pre-dependency</primary>
de_de: <primary>Vorabhängigkeit</primary>
es_es: <primary>predependencia</primary>
it_it: <primary>pre-dipendenza</primary>
ja_jp: <primary>先行依存</primary>
zh_cn: <primary>预依赖</primary>

source: “Pre-dependencies”, which are listed in the “<literal>Pre-Depends</literal>” field in the package headers, complete the normal dependencies; their syntax is identical. A normal dependency indicates that the package in question must be unpacked and configured before configuration of the package declaring the dependency. A pre-dependency stipulates that the package in question must be unpacked and configured before execution of the pre-installation script of the package declaring the pre-dependency, that is before its installation.
ja_jp: 「先行依存」はパッケージヘッダの「<literal>Pre-Depends</literal>」フィールドに書かれており、通常の依存関係を完全なものにします; 書式は同じです。通常の依存関係とは、インストールしたいパッケージの設定前に、依存関係にあるパッケージの解凍および設定されなければいけない事を示しています。先行依存とは、インストールしたいパッケージのインストール前スクリプトの実行前 (インストールの前) に、先行依存関係にあるパッケージの解凍および設定を行わなければいけない事を規定しています。

source: A pre-dependency is very demanding for <command>apt</command>, because it adds a strict constraint on the ordering of the packages to install. As such, pre-dependencies are discouraged unless absolutely necessary. It is even recommended to consult other developers on <email>debian-devel@lists.debian.org</email> before adding a pre-dependency. It is generally possible to find another solution as a work-around.
de_de: Eine Vorabhängigkeit ist für <command>apt</command> sehr schwierig, da es der Reihenfolge der zu installierenden Pakete eine strenge Restriktion auferlegt. Deshalb wird von Vorabhängigkeiten abgeraten, es sei denn, sie sind unbedingt erforderlich. Es wird sogar empfohlen, andere Entwickler auf <email>debian-devel@lists.debian.org</email> zu Rate zu ziehen, bevor eine Vorabhängigkeit eingefügt wird. Es ist normalerweise möglich eine andere Lösung zur Umgehung des Problems zu finden.
es_es: Una predependencia es muy exigente para <command>apt</command> porque agrega una restricción estricta en el orden de instalación de los paquetes. Por lo tanto se intenta evitar predependencias a menos que sea absolutamente necesario. Es recomendable aún consultar a otros desarrolladores en <email>debian-devel@lists.debian.org</email> antes de agregar una predependencia. Generalmente es posible encontrar otra solución para evitarlo.
it_it: Una pre-dipendenza è molto forte per <command>apt</command> perché aggiunge un vincolo stretto sull'ordine dei pacchetti da installare. Pertanto, le pre-dipendenze sono scoraggiate se non assolutamente necessarie. È anche consigliato consultare altri sviluppatori in <email>debian-devel@lists.debian.org</email> prima di aggiungere una pre-dipendenza. In genere è possibile trovare un'altra soluzione per aggirare il problema.
ja_jp: 先行依存は <command>apt</command> にとってとても重要です。なぜなら、先行依存関係はパッケージをインストールする順番を厳しく制約するからです。先行依存関係それ自体は、絶対必要でない限り勧められません。先行依存関係を追加する前に、<email>debian-devel@lists.debian.org</email> の他の開発者に相談する事をお勧めします。通常、次善策として別の解決策を見つける事が可能です。
zh_cn: <command>apt</command>对预依赖的要求非常严格，因为它在安装软件包的时候增加了严格约束。因此，预依赖关系的安装软件的时候不鼓励,除非绝对需要。它甚至建议在加入预依赖前直接咨询开发人员<email>debian-devel@lists.dibian.org</email>。这也是一个通用的解决办法。

source: <emphasis>DEBIAN POLICY</emphasis> <literal>Recommends</literal>, <literal>Suggests</literal>, and <literal>Enhances</literal> fields
de_de: <emphasis>DEBIAN-RICHTLINIEN</emphasis> <literal>Recommends</literal>-, <literal>Suggests</literal>- und <literal>Enhances</literal>-Zeilen
es_es: <emphasis>NORMA DEBIAN</emphasis> Campos <literal>Recommends</literal>, <literal>Suggests</literal> y <literal>Enhances</literal>
it_it: <emphasis>POLICY DEBIAN</emphasis> I campi <literal>Recommends</literal>, <literal>Suggests</literal> e <literal>Enhances</literal>
ja_jp: <emphasis>DEBIAN POLICY</emphasis> <literal>Recommends</literal>、<literal>Suggests</literal>、<literal>Enhances</literal> フィールド
zh_cn: <emphasis>DEBIAN 政策</emphasis> <literal>推荐</literal>，<literal>建议</literal>，<literal>提高</literal>水平

source: <primary><literal>Recommends</literal>, header field</primary>
de_de: <primary><literal>Recommends</literal>, Kopfzeilen</primary>
es_es: <primary><literal>Recommend</literal>, campo de cabecera</primary>
it_it: <primary><literal>Recommends</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Recommends</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>推荐</literal>，头字段</primary>

source: <primary><literal>Suggests</literal>, header field</primary>
de_de: <primary><literal>Suggests</literal>, Kopfzeilen</primary>
es_es: <primary><literal>Suggests</literal>, campo de cabecera</primary>
it_it: <primary><literal>Suggests</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Suggests</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>建议</literal>，头字段</primary>
