Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: The <literal>Recommends</literal> and <literal>Suggests</literal> fields describe dependencies that are not compulsory. The “recommended” dependencies, the most important, considerably improve the functionality offered by the package but are not indispensable to its operation. The “suggested” dependencies, of secondary importance, indicate that certain packages may complement and increase their respective utility, but it is perfectly reasonable to install one without the others.
de_de: Die <literal>Recommends</literal>- und <literal>Suggests</literal>-Zeilen bezeichnen Abhängigkeiten, die nicht vorgeschrieben sind. Die „empfohlenen“ (recommended) Abhängigkeiten sind wichtig und verbessern die Funktionen des Pakets wesentlich, sind für seinen Einsatz aber nicht unabdingbar. Die „vorgeschlagenen“ (suggested) Abhängigkeiten sind weniger wichtig und deuten darauf hin, dass bestimmte Pakete die Funktionalität ergänzen oder verbessern können; es ist jedoch völlig zulässig, es ohne diese zu installieren.
es_es: Los campos <literal>Recommends</literal> y <literal>Suggests</literal> describen dependencias que no son obligatorias. Las dependencias «recomendadas», las más importantes, mejoran considerablemente la funcionalidad ofrecida por el paquete pero no son indispensables para su funcionamiento. Las dependencias «sugeridas», de importancia secundaria, indica que ciertos paquetes complementarían y aumentarían su utilidad pero es perfectamente razonable instalar uno sin los otros.
it_it: I campi <literal>Recommends</literal> e <literal>Suggests</literal> descrivono dipendenze non obbligatorie. Le dipendenze «raccomandate», le più importanti, migliorano considerevolmente le funzionalità offerte dal pacchetto, ma non sono indispensabili al suo funzionamento. Le dipendenze «consigliate», di importanza secondaria, indicano che certi pacchetti possono integrare o aumentare la loro rispettiva utilità, ma è perfettamente ragionevole installarne uno senza gli altri.
ja_jp: <literal>Recommends</literal> と <literal>Suggests</literal> フィールドは必須ではない依存関係を表すためのものです。最も重要な「recommended」依存関係のパッケージは、パッケージの提供する機能を大幅に改善するけれども、動作に必要不可欠ではないパッケージです。2 番目に重要な「suggested」依存関係のパッケージは、そのユーティリティの機能を補完したり強化する可能性があり、他のパッケージではなくこのパッケージをインストールするのが極めて合理的であるようなパッケージです。
zh_cn: <literal>推荐</literal>和<literal>建议</literal>字段描述的依赖关系不是强制性的。“推荐”的依赖,是最重要的，能显著改善由软件包提供的功能，但这并非是必不可少的操作。“建议”的依赖，是次要的，表明某些软件包可以补充或者增加其各自的效果，有充分的理由去单独安装它而不是其它的软件包。

source: You should always install the “recommended” packages, unless you know exactly why you do not need them. Conversely, it is not necessary to install “suggested” packages unless you know why you need them.
de_de: Sie sollten immer die „empfohlenen“ (recommended) Pakete installieren, es sei denn, Sie wissen genau warum Sie sie nicht benötigen. Dagegen ist es nicht erforderlich, die „vorgeschlagenen“ (suggested) Pakete zu installieren, es sei denn, Sie wissen warum Sie sie benötigen.
es_es: Siempre debería instalar los paquetes «recomendados» a menos que sepa exactamente que no los necesita. Por el contrario, no es necesario instalar paquetes «sugeridos» a menos que sepa porqué los necesita.
it_it: Si dovrebbe sempre installare i pacchetti «raccomandati», a meno che non si sappia esattamente perché non se ne ha bisogno. Al contrario, non è necessario installare i pacchetti «consigliati» a meno che non si sappia perché se ne ha bisogno.
ja_jp: 「recommended」パッケージは、それを必要としない理由を理解している場合を除いて、常にインストールされるべきです。逆に「suggested」パッケージは、それを必要とする理由を理解している場合を除いて、インストールしなくてもかまいません。
zh_cn: 你应该总是安装“推荐”的软件包，除非你知道究竟为什么你不需要它们。相反，“建议”的软件包是不必要安装的，除非你知道为什么你需要它们。

source: <primary><literal>Enhances</literal>, header field</primary>
de_de: <primary><literal>Enhances</literal>Kopfzeilen</primary>
es_es: <primary><literal>Enhances</literal>, campo de cabecera</primary>
it_it: <primary><literal>Enhances</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Enhances</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>增强</literal>，头字段</primary>

source: The <literal>Enhances</literal> field also describes a suggestion, but in a different context. It is indeed located in the suggested package, and not in the package that benefits from the suggestion. Its interest lies in that it is possible to add a suggestion without having to modify the package that is concerned. Thus, all add-ons, plug-ins, and other extensions of a program can then appear in the list of suggestions related to the software. Although it has existed for several years, this last field is still largely ignored by programs such as <command>apt-get</command> or <command>synaptic</command>. Its purpose is for a suggestion made by the <literal>Enhances</literal> field to appear to the user in addition to the traditional suggestions — found in the <literal>Suggests</literal> field.
ja_jp: <literal>Enhances</literal> フィールドは同様にパッケージを提案するためのものですが、使用法が少し違います。自分があるパッケージから利益を得る場合は Suggests フィールド、自分があるパッケージに利益を与える場合は Enhances フィールドを使います。Enhances フィールドの良いところは、自分を変更することなく提案を追加できる、という点です。つまり、あるプログラムのアドオン、プラグイン、機能拡張は、このソフトウェアの Enhances フィールドに載せる事が可能です。数年前から存在したにもかかわらず、Enhances フィールドはいまだに <command>apt-get</command> や <command>synaptic</command> など多くのプログラムから無視されています。<literal>Enhances</literal> フィールドの目的とは、<literal>Suggests</literal> フィールドによる伝統的な提案ではカバーできない提案をユーザに示す事です。

source: Conflicts: the <literal>Conflicts</literal> field
de_de: Konflikte: die <literal>Conflicts</literal>-Zeilen
es_es: Conflitos: el campo <literal>Conflicts</literal>
it_it: Conflitti: il campo <literal>Conflicts</literal>
ja_jp: 衝突: <literal>Conflicts</literal> フィールド
zh_cn: 冲突：<literal>冲突</literal>字段

source: <primary>conflicts</primary>
de_de: <primary>Konflikte</primary>
es_es: <primary>conflictos</primary>
it_it: <primary>conflitti</primary>
ja_jp: <primary>衝突</primary>
zh_cn: <primary>冲突</primary>

source: <primary><literal>Conflicts</literal>, header field</primary>
de_de: <primary><literal>Konflikte</literal>, Kopfzeilen</primary>
es_es: <primary><literal>Conflicts</literal>, campo de cabecera</primary>
it_it: <primary><literal>Conflicts</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Conflicts</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>冲突</literal>，头字段</primary>

source: <primary>package</primary><secondary>conflict</secondary>
de_de: <primary>Paket</primary><secondary>Konflikt</secondary>
es_es: <primary>paquete</primary><secondary>conflicto</secondary>
it_it: <primary>pacchetto</primary><secondary>conflitto</secondary>
ja_jp: <primary>パッケージ</primary><secondary>衝突</secondary>
zh_cn: <primary>包</primary><secondary>冲突</secondary>

source: The <literal>Conflicts</literal> field indicates when a package cannot be installed simultaneously with another. The most common reasons for this are that both packages include a file of the same name, or provide the same service on the same TCP port, or would hinder each other's operation.
ja_jp: <literal>Conflicts</literal> フィールドでは、同時にインストールできないパッケージを指定します。このフィールドが使われるケースで最も多いのは、両方のパッケージが同名のファイルを含む場合、同種のサービスを同じ TCP ポートで提供する場合、互いの動作を妨げる場合です。

source: <command>dpkg</command> will refuse to install a package if it triggers a conflict with an already installed package, except if the new package specifies that it will “replace” the installed package, in which case <command>dpkg</command> will choose to replace the old package with the new one. <command>apt-get</command> always follows your instructions: if you choose to install a new package, it will automatically offer to uninstall the package that poses a problem.
de_de: <command>dpkg</command> wird sich weigern, ein Paket zu installieren, falls es einen Konflikt mit einem bereits installierten Paket auslöst, es sei denn das neue Paket gibt an, dass es die installierten Pakete „ersetzen“ wird. In diesem Fall wird sich <command>dpkg</command> dafür entscheiden, das alte Paket durch das neue zu ersetzen. <command>apt-get</command> folgt immer Ihren Anweisungen: wenn Sie es vorziehen ein neues Paket zu installieren, wird es automatisch anbieten das Paket, das ein Problem darstellt, zu deinstallieren.
es_es: <command>dpkg</command> se negará a instalar un paquete si genera un conflicto con un paquete ya instalado, excepto si el nuevo paquete especifica que «reemplazará» al paquete instalado en cuyo caso <command>dpkg</command> elegirá reemplazar el paquete existente con el nuevo. <command>apt-get</command> siempre seguirá sus instrucciones: si desea instalar un nuevo paquete ofrecerá automáticamente desinstalar el paquete que genera problemas.
it_it: <command>dpkg</command> si rifiuterà di installare un pacchetto che provoca un conflitto con un pacchetto già installato, a meno che il nuovo pacchetto non specifichi che «sostituisce» il pacchetto installato, nel qual caso <command>dpkg</command> sceglierà di sostituire il vecchio pacchetto con quello nuovo. <command>apt-get</command> segue sempre le istruzioni: se si sceglie di installare un nuovo pacchetto, offrirà automaticamente di disinstallare il pacchetto che crea un problema.
ja_jp: <command>dpkg</command> は、あるパッケージがインストール済みのパッケージと衝突を引き起こす場合、新しいパッケージがインストール済みのパッケージを「置換」する場合 (このような場合、<command>dpkg</command> が古いパッケージを新パッケージで置換します) を除き、そのパッケージのインストールを拒否するでしょう。<command>apt-get</command> は常に、あなたの指示に従います: もしあなたが新しいパッケージをインストールしたいのなら、問題を引き起こすインストール済みパッケージを自動的にアンインストールします。
zh_cn: <command>dpkg</command>会拒绝安装一个软件包，当这个软件包和已经安装的软件包触发了一个冲突的时候，除非新的软件包特别指定了“替换”已安装的软件包，在这种情况下<command>dpkg</command>将会用新的软件包来替换掉旧的软件包。<command>apt-get</command>则会一直遵循你的指示：如果你选择安装一个新的软件包，它将自动提供卸载老的软件包，这将会引入一个新的问题。

source: Incompatibilities: the <literal>Breaks</literal> Field
de_de: Inkompatibilitäten: die <literal>Breaks</literal>-Zeilen
es_es: Incompatibilidades: el campo <literal>Breaks</literal>
it_it: Incompatibilità: il campo <literal>Breaks</literal>
ja_jp: 不適合性: <literal>Breaks</literal> フィールド
zh_cn: 不相容性:<literal>中断</literal>字段

source: <primary>incompatibilities</primary>
de_de: <primary>Inkompatibilitäten</primary>
es_es: <primary>incompatibilidades</primary>
it_it: <primary>incompatibilità</primary>
ja_jp: <primary>不適合性</primary>
zh_cn: <primary>不相容性</primary>

source: <primary><literal>Breaks</literal>, header field</primary>
de_de: <primary><literal>Breaks</literal>, Kopfzeilen</primary>
es_es: <primary><literal>Breaks</literal>, campo de cabecera</primary>
it_it: <primary><literal>Breaks</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Breaks</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>中断</literal>，头字段</primary>

source: <primary>package</primary><secondary>incompatibility</secondary>
de_de: <primary>Paket</primary><secondary>Inkompatibilität</secondary>
es_es: <primary>paquete</primary><secondary>incompatibilidad</secondary>
it_it: <primary>pacchetto</primary><secondary>incompatibilità</secondary>
ja_jp: <primary>パッケージ</primary><secondary>両立不可能</secondary>
zh_cn: <primary>包</primary><secondary>不相容性</secondary>

source: The <literal>Breaks</literal> field has an effect similar to that of the <literal>Conflicts</literal> field, but with a special meaning. It signals that the installation of a package will “break” another package (or particular versions of it). In general, this incompatibility between two packages is transitory, and the <literal>Breaks</literal> relationship specifically refers to the incompatible versions.
de_de: Die <literal>Breaks</literal>-Zeilen haben einen ähnlichen Effekt wie die <literal>Conflicts</literal>-Zeilen, jedoch mit einer besonderen Bedeutung. Sie deutet darauf hin, dass die Installation eines Paketes ein anderes Paket (oder bestimmte Versionen davon) „brechen“ wird. Normalerweise ist die Inkompatibilität zwischen zwei Paketen vorübergehend, und die <literal>Breaks</literal>-Beziehung bezieht sich auf die inkompatiblen Versionen.
es_es: El campo <literal>Breaks</literal> tiene un efecto similar al del campo <literal>Conflicts</literal> pero con un significado especial. Indica que la instalación de un paquete «romperá» otro paquete (o versiones particulares del mismo). En general, esta incompatibilidad entre dos paquetes es temporal y la relación <literal>Breaks</literal> se refiere específicamente a las versiones incompatibles.
it_it: Il campo <literal>Breaks</literal> ha un effetto simile a <literal>Conflicts</literal>, ma con un significato speciale. Segnala che l'installazione di un pacchetto «renderà difettoso» un altro pacchetto (o delle sue versioni particolari). In generale, questa incompatibilità tra due pacchetti è transitoria e la relazione <literal>Breaks</literal> fa specifico riferimento alle versioni incompatibili.
ja_jp: <literal>Breaks</literal> フィールドは <literal>Conflicts</literal> フィールドとよく似た効果を持っていますが、特別な意味があります。このフィールドはあるパッケージをインストールすることで他のパッケージ (または他のパッケージの特定バージョン) を「破壊する」という意味があります。一般的に、このような 2 つのパッケージの不適合性は一時的なもので、<literal>Breaks</literal> フィールドでは不適合性がある特定のバージョンだけを指定します。
zh_cn: <literal>中断</literal>字段有一个影响和<literal>冲突</literal>字段类似，但它具有特殊的意义。它标志着一个包的安装会将另外一个包（或者是特定版本）中断掉。通常而言，两个包之间的不兼容是短暂的，<literal>中断</literal>关系会特别指出那些不兼容的版本。

source: <command>dpkg</command> will refuse to install a package that breaks an already installed package, and <command>apt-get</command> will try to resolve the problem by updating the package that would be broken to a newer version (which is assumed to be fixed and, thus, compatible again).
de_de: <command>dpkg</command> wird sich weigern, ein Paket zu installieren das ein bereits installiertes Paket beschädigen würde, und <command>apt-get</command> wird versuchen das Problem dadurch zu lösen, dass es das Paket das beschädigt würde auf eine neuere Version zu aktualisieren (von der angenommen wird, dass sie korrigiert und damit wieder kompatibel ist).
es_es: <command>dpkg</command> se negará a instalar un paquete que rompe un paquete ya instalado y <command>apt-get</command> intentará resolver el problema actualizando a una nueva versión el paquete que se rompería (que se asume estaría arreglado y, por lo tanto, sería compatible nuevamente).
it_it: <command>dpkg</command> si rifiuterà di installare un pacchetto che rende difettoso un pacchetto già installato e <command>apt-get</command> cercherà di risolvere il problema aggiornando il pacchetto che sarebbe reso difettoso a una nuova versione (che si suppone corretta e, perciò, di nuovo compatibile).
ja_jp: <command>dpkg</command> はインストール済みのパッケージを破壊するようなパッケージのインストールを拒否します、<command>apt-get</command> は破壊されるパッケージを新しいバージョンに更新することで (新しいバージョンではこの問題が修正され、両パッケージが適合すると期待されます)、この問題の解決を試みます。
zh_cn: <command>dpkg</command>在中断已安装的软件包时会拒绝安装新的软件包，<command>apt-get</command>则会通过更新到新的版本来尝试解决这个问题（这被认为是修复兼容性的方式，因此，包会再次兼容。）。

source: This type of situation may occur in the case of updates without backwards compatibility: this is the case if the new version no longer functions with the older version, and causes a malfunction in another program without making special provisions. The <literal>Breaks</literal> field prevents the user from running into these problems.
de_de: Diese Situation kann bei Aktualisierungen ohne rückwärtige Kompatibilität auftreten: dies ist der Fall, wenn eine neue Version nicht mehr zusammen mit der älteren Version funktioniert und eine Fehlfunktion in einem anderen Programm verursacht ohne dass dafür besondere Vorkehrungen getroffen worden sind. Die <literal>Breaks</literal>-Zeilen verhindern, dass der Nutzer in diese Schwierigkeiten gerät.
es_es: Este tipo de situaciones pueden ocurrir en casos de actualizaciones que no sean compatibles con versiones anteriores: este es el caso si una nueva versión ya no funciona con la versión anterior y causa un mal funcionamiento en otros programas si no se toman medidas especiales. El campo <literal>Breaks</literal> previene que el usuario se tope con estos problemas.
it_it: Questo tipo di situazione può accadere in caso di aggiornamenti senza compatibilità all'indietro: questo è il caso di una nuova versione che non funziona più insieme alla vecchia versione e causa un malfunzionamento in un altro programma senza avere accorgimenti speciali. Il campo <literal>Breaks</literal> evita che l'utente incontri tali problemi.
ja_jp: この手の状況は更新によって後方互換性が無くなる場合に起こりうるかもしれません: 新しいバージョンが古いバージョンと同時に動かない場合、特別な設定をしないと別のプログラムの機能不良が起きる場合です。<literal>Breaks</literal> フィールドはユーザがこのような問題に遭遇する事がないようにしています。
zh_cn: 不向后兼容的更新可能会发生这种情况：如果新版本与旧版本的功能不在另一个程序中做特别规定，这将导致故障。<literal>中断</literal>字段会防止用户继续运行从而遇到这些问题。

source: Provided Items: the <literal>Provides</literal> Field
de_de: Bereitgestellte Elemente: die <literal>Provides</literal>-Zeilen
es_es: Elementos provistos: el campo <literal>Provides</literal>
it_it: Oggetti forniti: il campo <literal>Provides</literal>
ja_jp: 提供されるアイテム: <literal>Provides</literal> フィールド
zh_cn: 预备好的条目：<literal>预备</literal>字段

source: <primary><literal>Provides</literal>, header field</primary>
de_de: <primary><literal>Provides</literal>, Kopfzeilen</primary>
es_es: <primary><literal>Provides</literal>, campo de cabecera</primary>
it_it: <primary><literal>Provides</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Provides</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>预备</literal>，头字段</primary>

source: This field introduces the very interesting concept of a “virtual package”. It has many roles, but two are of particular importance. The first role consists in using a virtual package to associate a generic service with it (the package “provides” the service). The second indicates that a package completely replaces another, and that for this purpose it can also satisfy the dependencies that the other would satisfy. It is thus possible to create a substitution package without having to use the same package name.
de_de: Diese Zeile führt das sehr interessante Konzept eines „virtuellen Pakets“ ein. Sie hat viele Aufgaben, aber zwei sind von besonderer Bedeutung. Die erste Aufgabe besteht darin, ein virtuelles Paket dazu zu benutzen, ihm einen allgemeinen Dienst zuzuordnen (das Paket „stellt“ den Dienst „bereit“). Die zweite zeigt an, dass ein Paket ein anderes vollständig ersetzt, und dass es daher auch die Abhängigkeiten erfüllen kann, die das andere erfüllen würde. Auf diese Weise kann ein Ersatzpaket erstellt werden, ohne denselben Paketnamen verwenden zu müssen.
es_es: Este campo introduce el concepto interesante de un «paquete virtual». Tiene muchos roles pero hay dos particularmente importantes. El primero consiste en utilizar un paquete virtual para asociar un servicio genérico con él (el paquete «provee» el servicio). El segundo indica que un paquete reemplaza completamente a otro y, para esos propósitos, también puede satisfacer las dependencias que otros satisfacen. Es posible, entonces, crear un paquete substituto sin tener que utilizar el mismo nombre de paquete.
it_it: Questo campo introduce il concetto molto interessante di «pacchetto virtuale». Ha molti ruoli, ma due sono particolarmente importanti. Il primo ruolo consiste nell'usare un pacchetto virtuale per associare ad esso un servizio generico (il pacchetto «fornisce» il servizio). Il secondo indica che un pacchetto sostituisce completamente un altro e che per questo scopo può anche soddisfare le dipendenze che l'altro soddisferebbe. Perciò è possibile creare un pacchetto sostitutivo senza dover usare il solito nome di pacchetto.
ja_jp: このフィールドによって、とても興味深い「仮想パッケージ」の構想が生まれました。このフィールドは多くの役割を持っていますが、特に重要な 2 つを説明します。最初の役割は、仮想パッケージを使って一般的なサービスとパッケージを関連付ける (サービスを「提供する」のはパッケージです) 事を可能にする役割です。2 番目の役割は、このパッケージを他のパッケージを完全に置き換えること、このパッケージの依存関係を他のパッケージが満足するであろう依存関係を使って満足させる事を可能にする役割です。このため、同じパッケージ名を使わずに、代替パッケージを作成する事が可能です。
zh_cn: 这个字段引入了一个很有意思的“虚拟包”的概念。它有很多的角色，但有两个特别重要。第一个是由使用虚拟包关联到的一个通用的服务（包“预备”了这些服务）。第二个表示一个包完全取代了另外一个，所以它也能满足依赖性要求。因此，可以创建一个替换而不必使用相同的包名称的包。

source: <emphasis>VOCABULARY</emphasis> Meta-package and virtual package
de_de: <emphasis>WÖRTERVERZEICHNIS</emphasis> Meta-Pakete und virtuelle Pakete
es_es: <emphasis>VOCABULARIO</emphasis> Metapaquete y paquete virtual
it_it: <emphasis>VOCABOLARIO</emphasis> Meta-pacchetto e pacchetto virtuale
ja_jp: <emphasis>VOCABULARY</emphasis> メタパッケージと仮想パッケージ
zh_cn: <emphasis>VOCABULARY</emphasis>元软件包和虚拟包

source: <primary>package</primary><secondary>virtual package</secondary>
es_es: <primary>virtual</primary><secondary>paquete virtual</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto virtuale</secondary>
ja_jp: <primary>パッケージ</primary><secondary>仮想パッケージ</secondary>
zh_cn: <primary>软件包</primary><secondary>虚拟软件包</secondary>

source: <primary>virtual package</primary>
de_de: <primary>virtuelles Paket</primary>
es_es: <primary>paquete virtual</primary>
it_it: <primary>pacchetto virtuale</primary>
ja_jp: <primary>仮想パッケージ</primary>
zh_cn: <primary>虚拟软件包</primary>

source: It is essential to clearly distinguish meta-packages from virtual packages. The former are real packages (including real <filename>.deb</filename> files), whose only purpose is to express dependencies.
de_de: Es ist unerlässlich, zwischen Meta-Paketen und virtuellen Paketen zu unterscheiden. Erstere sind wirkliche Pakete (einschließlich wirklicher <filename>.deb</filename>-Dateien), deren einziger Zweck darin besteht, Abhängigkeiten aufzuzeigen.
es_es: Es esencial distinguir los metapaquetes de los paquetes virtuales. Los primeros son paquetes reales (incluyendo archivos <filename>.deb</filename>) cuyo único propósito es expresar dependencias.
it_it: È essenziale distinguere chiaramente i meta-pacchetti dai pacchetti virtuali. I primi sono pacchetti reali (che comprendono dei file <filename>.deb</filename> reali), il cui unico scopo è di esprimere dipendenze.
ja_jp: メタパッケージと仮想パッケージを明確に区別することは絶対不可欠です。メタパッケージは真のパッケージで (真の <filename>.deb</filename> ファイルを含んでいます)、その目的は依存関係を表現するだけです。
zh_cn: 这里必须明确的从虚拟软件包里面区分出元软件包。元软件包是真实的元件包（包含真实的<filename>.deb</filename>文件），其唯一目的是用来表示依赖性关系。

source: Virtual packages, however, do not exist physically; they are only a means of identifying real packages based on common, logical criteria (service provided, compatibility with a standard program or a pre-existing package, etc.).
de_de: Dagegen existieren virtuelle Pakete nicht wirklich; sie dienen lediglich dazu, wirkliche Pakete auf der Basis gemeinsamer, logischer Kriterien (des bereitgestellten Dienstes, der Kompatibilität mit einem Standardprogramm oder einem schon vorher bestehenden Paket usw.) zu identifizieren.
es_es: Los paquetes virtuales, por el otro lado, no existen físicamente; sólo son un modo de identificar paquetes reales basados en criterios lógicos y comunes (servicios provistos, compatibilidades con un programa estándar o un paquete preexistentes, etc.).
it_it: I pacchetti virtuali, invece, non esistono fisicamente; sono solo un mezzo per identificare pacchetti reali in base a criteri comuni e logici (servizio fornito, compatibilità con un programma standard o con un pacchetto preesistente, ecc.).
ja_jp: これに対して、仮想パッケージは実体がありません; 仮想パッケージの目的は、一般的で論理的な基準 (提供するサービス、一般的なプログラムまたは既存のパッケージなどとの互換性) に従って真のパッケージを選別する事です。
zh_cn: 提供一个“服务”

source: Providing a “Service”
de_de: Einen „Dienst“ bereitstellen
es_es: Proveyendo un «servicio»
it_it: Fornire un «servizio»
ja_jp: 「サービス」の提供
