Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: In addition to the <filename>control</filename> file, the <filename>control.tar.gz</filename> archive for each Debian package may contain a number of scripts, called by <command>dpkg</command> at different stages in the processing of a package. The Debian Policy describes the possible cases in detail, specifying the scripts called and the arguments that they receive. These sequences may be complicated, since if one of the scripts fails, <command>dpkg</command> will try to return to a satisfactory state by canceling the installation or removal in progress (insofar as it is possible).
de_de: Zusätzlich zur <filename>control</filename>-Datei kann das <filename>control.tar.gz</filename>-Archiv jeden Debian-Pakets eine Anzahl von Skripten enthalten, die von <command>dpkg</command> in verschiedenen Phasen der Paketverarbeitung aufgerufen werden. Die Debian-Richtlinien beschreiben ausführlich die möglichen Fälle mit Benennung der aufgerufenen Skripte und der Parameter, die sie entgegennehmen. Diese Abläufe können kompliziert sein, da <command>dpkg</command> im Falle des Scheiterns eines Skripts versucht, zu einem zufriedenstellenden Zustand zurückzukehren, indem es die Installation oder die gerade stattfindende Entfernung (insofern möglich) abbricht.
es_es: Además del archivo <filename>control</filename>, el compendio <filename>control.tar.gz</filename> de cada paquete Debian puede contener una cantidad de scripts que serán ejecutados por <command>dpkg</command> en diferentes etapas del procesamiento de un paquete. La Normativa Debian describe lo casos posibles en detalle, especificando los scripts que serán llamados y los argumentos que recibirán. Estas secuencias pueden ser complicadas ya que si falla uno de los scripts <command>dpkg</command> intentará volver a un estado satisfactorio cancelando la instalación o eliminación en curso (siempre que sea posible).
it_it: In aggiunta al file <filename>control</filename>, l'archivio <filename>control.tar.gz</filename> per ogni pacchetto Debian può contenere alcuni script, chiamati da <command>dpkg</command> a differenti stadi dell'elaborazione di un pacchetto. La Policy Debian descrive nei dettagli i casi possibili, specificando gli script chiamati e gli argomenti che ricevono. Queste sequenze possono essere complicate, dal momento che, se uno degli script fallisce, <command>dpkg</command> cercherà di ritornare a uno stato soddisfacente annullando l'installazione o la rimozione in corso (per quanto possibile).
ja_jp: それぞれの Debian パッケージには、<filename>control</filename> ファイルだけでなく <filename>control.tar.gz</filename> アーカイブが含まれており、このアーカイブには、<command>dpkg</command> がパッケージ処理の各段階で呼び出す多数のスクリプトが含まれているかもしれません。Debian ポリシーでは、呼び出されるスクリプトとスクリプトが受け取る引数を明記することで、スクリプトの使われ方が詳しく説明されています。スクリプトが呼び出される順番はわかりにくいかもしれません。なぜなら、スクリプトの内 1 つでも失敗したら、<command>dpkg</command> は進行中のインストールを止めるか(可能ならば)削除することでシステムを一貫性のある状態に戻そうとするからです。
zh_cn: 除了<filename>控制</filename>文件之外，每个Debian软件包可能在<filename>control.tar.gz</filename>的存档中包含了一些脚本，这些脚本在软件包处理的不同的阶段被<command>dpkg</command>调用。Debian政策描述了一些可能的细节，在可能的情况下，指定脚本调用它们所收到的参数。这些顺序可能比较复杂，因为如果脚本中任何一步出现问题的时候，<command>dpkg</command>进程会通过取消安装或者卸载来尝试恢复到一个令人满意的状态（只要是可能的）。

source: <emphasis>GOING FURTHER</emphasis> <command>dpkg</command>'s database
ja_jp: <emphasis>GOING FURTHER</emphasis> <command>dpkg</command> データベース

source: <primary>dpkg</primary><secondary>database</secondary>
ja_jp: <primary>dpkg</primary><secondary>データベース</secondary>

source: All of the configuration scripts for installed packages are stored in the <filename>/var/lib/dpkg/info/</filename> directory, in the form of a file prefixed with the package's name. This directory also includes a file with the <filename>.list</filename> extension for each package, containing the list of files that belong to that package.
de_de: Alle Konfigurationsskripte für installierte Pakete sind im Verzeichnis <filename>/var/lib/dpkg/info/</filename> in Form einer Datei gespeichert, der der Dateiname des Pakets vorangestellt ist. In diesem Verzeichnis befindet sich für jedes Paket auch eine Datei mit der Erweiterung <filename>.list</filename>, die eine Liste der zu dem jeweiligen Paket gehörenden Dateien enthält.
es_es: Todos los scripts de configuración para los paquetes instalados se almacenan en el directorio <filename>/var/lib/dpkg/info/</filename> en forma de un archivo con el nombre del paquete como prefijo. Este directorio también incluye un archivo con la extensión <filename>.list</filename> para cada paquete que contiene una lista de los archivos que pertenecen a dicho paquete.
it_it: Tutti gli script di configurazione per i pacchetti installati sono memorizzati nella directory <filename>/var/lib/dpkg/info/</filename>, sotto forma di file il cui nome inizia con il nome del pacchetto. Questa directory comprende anche un file con l'estensione <filename>.list</filename> per ogni pacchetto, che contiene l'elenco dei file che appartengono a tale pacchetto.
ja_jp: インストール済みパッケージの設定スクリプトはすべて <filename>/var/lib/dpkg/info/</filename> ディレクトリに、ファイル名がパッケージ名から始まるファイルの形で保存されています。このディレクトリには、ファイル名がパッケージ名に <filename>.list</filename> 拡張子を付けたファイルが含まれています。このファイルの内容はパッケージに含まれるファイルのリストです。
zh_cn: 所有已安装的软件包的配置脚本都存在<filename>/var/lib/dpkg/info/</filename>目录，在软件包的名字前会有一个文件名的前缀。此目录的每个软件包还包括一个叫<filename>.list</filename>的文件扩展，包括列表的文件字段属于哪些包。

source: The <filename>/var/lib/dpkg/status</filename> file contains a series of data blocks (in the format of the famous mail headers, RFC 2822) describing the status of each package. The information from the <filename>control</filename> file of the installed packages is also replicated there.
de_de: Die Datei <filename>/var/lib/dpkg/status</filename> enthält eine Reihe von Datenblöcken (im Format der bekannten Mail-Kopfzeilen, RFC 2822), die den Status jedes Pakets beschreiben. Die Information aus der <filename>control</filename>-Datei der installierten Pakete ist hier ebenfalls wiedergegeben.
es_es: El archivo <filename>/var/lib/dpkg/status</filename> contiene una serie de bloques de datos (en el famoso formato de cabeceras de correo, RFC 2822) que describen el estado de cada paquete. La información del archivo <filename>control</filename> también es duplicada allí.
it_it: Il file <filename>/var/lib/dpkg/status</filename> contiene una serie di blocchi di dati (nel formato delle note intestazioni di posta, RFC 2822) che descrive lo stato di ogni pacchetto. Anche le informazioni del file <filename>control</filename> del pacchetto installato sono duplicate qui.
ja_jp: <filename>/var/lib/dpkg/status</filename> ファイルは (有名なメールヘッダ、RFC 2822、の形で) 一連のデータブロックを含んでおり、各データブロックは各パッケージの状態に対応します。この情報は、インストール済みのパッケージの <filename>control</filename> ファイルから、複製されています。
zh_cn: <filename>/var/lib/dpkg/status</filename>文件包含了一些数据块（著名的邮件标题的格式，RFC2822）描述了每个软件包的状态。从<filename>control</filename>文件中已经安装的软件包的信息也会被复制。

source: In general, the <filename>preinst</filename> script is executed prior to installation of the package, while the <filename>postinst</filename> follows it. Likewise, <filename>prerm</filename> is invoked before removal of a package and <filename>postrm</filename> afterwards. An update of a package is equivalent to removal of the previous version and installation of the new one. It is not possible to describe in detail all the possible scenarios here, but we will discuss the most common two: an installation/update and a removal.
de_de: Im Allgemeinen wird das Skript <filename>preinst</filename> vor der Installation eines Pakets ausgeführt, <filename>postinst</filename> danach. In gleicher Weise wird <filename>prerm</filename> vor dem Entfernen eines Pakets aufgerufen und <filename>postrm</filename> danach. Die Aktualisierung eines Pakets ist gleichbedeutend mit dem Entfernen der vorhergehenden Version und einer Installation der neuen. Alle möglichen Szenarien können hier nicht ausführlich beschrieben werden, aber wir werden die zwei häufigsten erörtern: eine Installation/Aktualisierung und ein Entfernen.
es_es: En general, se ejecuta el script <filename>preinst</filename> antes de la instalación del paquete, y <filename>postinst</filename> luego. De la misma forma, se invoca <filename>prerm</filename> antes de la eliminación de un paquete y <filename>postrm</filename> luego. Actualizar un paquete es equivalente a eliminar la versión anterior e instalar la nueva. No es posible describir en detalle todos los escenarios posibles aquí, pero discutiremos los dos más comunes: instalación/actualización y eliminación.
it_it: In genere, lo script <filename>preinst</filename> viene eseguito prima dell'installazione del pacchetto, mentre <filename>postinst</filename> la segue. Nella stessa maniera, <filename>prerm</filename> viene invocato prima della rimozione di un pacchetto e <filename>postrm</filename> dopo. Un aggiornamento di un pacchetto equivale alla rimozione della versione precedente e all'installazione di quella nuova. Non è possibile qui descrivere nei dettagli tutti i possibili scenari, ma saranno discussi i due più comuni: un'installazione/aggiornamento e una rimozione.
ja_jp: 一般的に言って、<filename>preinst</filename> スクリプトはパッケージのインストール前に実行され、<filename>postinst</filename> はインストール後に実行されます。同様に、 <filename>prerm</filename> はパッケージの削除前に実行され、<filename>postrm</filename> は削除後に実行されます。パッケージの更新とは、パッケージの古いバージョンを削除して新しいバージョンをインストールすることと等価です。ここですべての可能なシナリオを詳細に説明することは不可能なので、最も一般的なケースを 2 つだけ挙げます: インストール/更新と削除です。
zh_cn: 在一般情况下，<filename>preinst</filename>脚本会在安装软件包前执行，而<filename>postinst</filename>会稍候执行。同样，<filename>prerm</filename>会在移除一个软件包的前和<filename>postrm</filename>之后。更新软件包相当于是清除掉以前的旧版本并且安装新的软件包。所以在这里我们不可能来详细描述所有的可能的方案，但我们将讨论最常见的两种：安装/更新和移除。

source: <emphasis>CAUTION</emphasis> Symbolic names of the scripts
de_de: <emphasis>VORSICHT</emphasis> Symbolische Skriptnamen
es_es: <emphasis>PRECAUCIÓN</emphasis> Nombres simbólicos de los scripts
it_it: <emphasis>ATTENZIONE</emphasis> Nomi simbolici degli script
ja_jp: <emphasis>CAUTION</emphasis> スクリプトのシンボリック名
zh_cn: <emphasis>小心</emphasis> 脚本的符号名称

source: The sequences described in this section call configuration scripts by specific names, such as <command>old-prerm</command> or <command>new-postinst</command>. They are, respectively, the <command>prerm</command> script contained in the old version of the package (installed before the update) and the <command>postinst</command> script contained in the new version (installed by the update).
de_de: Die in diesem Abschnitt beschriebenen Schritte bezeichnen Konfigurationsskripte mit spezifischen Namen wie <command>old-prerm</command> oder <command>new-postinst</command>. Dies sind zum einen das in der alten Version des Pakets enthaltene Skript <command>prerm</command> (das vor der Aktualisierung installiert worden war) und zum anderen das in der neuen Version enthaltene Skript <command>postinst</command> (das durch die Aktualisierung installiert wird).
es_es: Las secuencias descriptas en esta sección llaman scripts de configuración por sus nombres específicos, como <command>old-prerm</command> o <command>new-postinst</command>. Ellos son, respectivamente, el script <command>prerm</command> en la versión antigua del paquete (instalada antes de la actualización) y el script <command>postinst</command> en la nueva versión (instalada en la actualización).
it_it: Le sequenze descritte in questa sezione chiamano gli script di configurazione con nomi specifici come <command>old-prerm</command> o <command>new-postinst</command>. Sono rispettivamente lo script <command>prerm</command> contenuto nella vecchia versione del pacchetto (installata prima dell'aggiornamento) e lo script <command>postinst</command> contenuto nella nuova versione (installata dall'aggiornamento).
ja_jp: この節の説明文では、<command>old-prerm</command> や <command>new-postinst</command> などの特定の名前を持つ設定スクリプトが登場します。前者はパッケージの (更新の前にインストールされていた) 古いバージョンに含まれる <command>prerm</command> スクリプト、後者は (更新によってインストールされる) 新しいバージョンに含まれる <command>postinst</command> スクリプトを指します。
zh_cn: 本节中由特定的名称和描述的顺序来调用配置脚本，比如<command>old-prerm</command> 或 <command>new-postinst</command>。它们分别是，<command>prerm</command>脚本中包含的旧的版本软件包（更新之前安装的）和<command>postinst</command>脚本中包含的新版本（更新安装）

source: <emphasis>TIP</emphasis> State diagrams
de_de: <emphasis>TIP</emphasis> Zustandsdiagramme
es_es: <emphasis>SUGERENCIA</emphasis> Diagramas de estado
it_it: <emphasis>SUGGERIMENTO</emphasis> Diagrammi di stato
ja_jp: <emphasis>TIP</emphasis> 状態遷移図
zh_cn: <emphasis>提示</emphasis>状态图

source: Manoj Srivastava made these diagrams explaining how the configuration scripts are called by <command>dpkg</command>. Similar diagrams have also been developed by the Debian Women project; they are a bit simpler to understand, but less complete. <ulink type="block" url="http://people.debian.org/~srivasta/MaintainerScripts.html" /> <ulink type="block" url="http://wiki.debian.org/MaintainerScripts" />
de_de: Manoj Srivastava hat diese Diagramme erstellt, die erklären, wie die Konfigurationsskripte von <command>dpkg</command> aufgerufen werden. Ähnliche Diagramme wurden auch vom Projekt „Debian Women“ entwickelt; sie sind etwas einfacher zu verstehen, aber weniger vollständig. <ulink type="block" url="http://people.debian.org/~srivasta/MaintainerScripts.html" /> <ulink type="block" url="http://wiki.debian.org/MaintainerScripts" />
es_es: Manoj Srivastava realizó estos diagramas explicando cómo <command>dpkg</command> llama a estos scripts de configuración. El proyecto Debian Women («Mujeres Debian») también desarrolló diagramas similares; más simples de entender pero menos completos. <ulink type="block" url="http://people.debian.org/~srivasta/MaintainerScripts.html" /> <ulink type="block" url="http://wiki.debian.org/MaintainerScripts" />
it_it: Manoj Srivastava ha creato questi diagrammi che spiegano come gli script di configurazione vengono chiamati da <command>dpkg</command>. Diagrammi simili sono stati sviluppati anche dal progetto Debian Women; sono un po' più semplici da comprendere, ma meno completi <ulink type="block" url="http://people.debian.org/~srivasta/MaintainerScripts.html" /> <ulink type="block" url="http://wiki.debian.org/MaintainerScripts" />
ja_jp: Manoj Srivastava さんは <command>dpkg</command> がどのように設定スクリプトを呼び出すかを説明する図を作成しました。Debian Women プロジェクトが同様の図を作成しました; この図は理解しやすいように少し単純化されており、先の図に比べると正確ではありません。<ulink type="block" url="http://people.debian.org/~srivasta/MaintainerScripts.html" /> <ulink type="block" url="http://wiki.debian.org/MaintainerScripts" />
zh_cn: Manoj Srivastava做了一个简单的图表来说明配置脚本是如何被<command>dpkg</command>调用的。类似的图表也被Debian 妇女项目所开发；她们简单的了解一些，但是不完整。<ulink type="block" url="http://people.debian.org/~srivasta/MaintainerScripts.html" /> <ulink type="block" url="http://wiki.debian.org/MaintainerScripts" />

source: Installation and Upgrade
de_de: Installation und Aktualisierung
es_es: Instalación y actualización
it_it: Installazione e aggiornamento
ja_jp: パッケージのインストールとアップグレード
zh_cn: 安装和升级

source: <primary><command>dpkg</command></primary><secondary>internal operation</secondary>
ja_jp: <primary><command>dpkg</command></primary><secondary>インストール操作</secondary>

source: Here is what happens during an installation (or an update):
de_de: Folgendes geschieht während einer Installation (oder einer Aktualisierung):
es_es: Esto es lo que ocurre durante una instalación (o actualización):
it_it: Ecco cosa succede durante un'installazione (o un aggiornamento):
ja_jp: ここではパッケージのインストール中 (または更新中) に何が起きるかを説明します:
zh_cn: 这里告诉你，安装的时候发生了什么（或者是更新）

source: For an update, <command>dpkg</command> calls the <command>old-prerm upgrade <replaceable>new-version</replaceable></command>.
de_de: Für eine Aktualisierung ruft <command>dpkg</command> das Skript <command>old-prerm upgrade <replaceable>neue-version</replaceable></command> auf.
es_es: En una actualización, <command>dpkg</command> ejecuta <command>old-prerm upgrade <replaceable>nueva-versión</replaceable></command>.
it_it: Per un aggiornamento, <command>dpkg</command> chiama <command>old-prerm upgrade <replaceable>new-version</replaceable></command>.
ja_jp: 更新の際に、<command>dpkg</command> は <command>old-prerm upgrade <replaceable>new-version</replaceable></command> を呼び出します。
zh_cn: 对于升级，<command>dpkg</command>会调用<command>old-prerm 升级新版本 <replaceable></replaceable></command>。

source: Still for an update, <command>dpkg</command> then executes <command>new-preinst upgrade <replaceable>old-version</replaceable></command>; for a first installation, it executes <command>new-preinst install</command>. It may add the old version in the last parameter, if the package has already been installed and removed since (but not purged, the configuration files having been retained).
de_de: Ebenfalls für eine Aktualisierung führt <command>dpkg</command> dann <command>new-preinst upgrade<replaceable>alte-version</replaceable></command> aus; bei einer erstmaligen Installation führt es stattdessen <command>new-preinst install</command> aus. Möglicherweise fügt es im letzten Parameter die alte Version hinzu, falls das Paket früher schon einmal installiert war und seither entfernt wurde (aber nicht vollständig gelöscht, da die Konfigurationsdateien noch zurückbehalten wurden).
es_es: En una actualización <command>dpkg</command> ejecuta luego <command>new-preinst upgrade <replaceable>antigua-versión</replaceable></command>; para una primera instalación ejecuta <command>new-preinst install</command>. También puede agregar la versión anterior en el último parámetro si el paquete ya ha sido instalada y eliminada desde entonces (pero no purgada, se mantuvieron los archivos de configuración).
it_it: Per un aggiornamento, <command>dpkg</command> poi esegue <command>new-preinst upgrade <replaceable>vecchia-versione</replaceable></command>; per una prima installazione, esegue <command>new-preinst install</command>. Può anche aggiungere la vecchia versione nell'ultimo parametro, se il pacchetto è già stato installato e rimosso (ma non completamente e i vecchi file di configurazione sono stati conservati).
ja_jp: 更新する場合、<command>dpkg</command> は <command>new-preinst upgrade <replaceable>old-version</replaceable></command> を実行します; 初めてインストールする場合、<command>new-preinst install</command> を実行します。過去にもしパッケージがインストールされてさらに削除されていた場合 (完全消去されていない場合、古い設定ファイルがまだ残っている場合)、最後の引数に古いバージョンを追加します。
zh_cn: 还是对于升级，<command>dpkg</command>执行<command>new-preinst 升级<replaceable>旧版本</replaceable></command>；对于第一个安装，它会执行<command>new-preinst 安装</command>。它可能会增加旧版本的最后一个参数，如果软件包已经被安装或者是删除了（但没有清除合并掉旧版本，那么这个配置文件会被保留）。

source: The new package files are then unpacked. If a file already exists, it is replaced, but a backup copy is temporarily made.
de_de: Die neuen Paketdateien werden dann entpackt. Falls eine Datei bereits vorhanden ist, wird sie ersetzt, wobei aber vorübergehend eine Sicherheitskopie erstellt wird.
es_es: Se descomprimen los archivos del nuevo paquete. Si un archivo ya existe, es reemplazado pero se guarda una copia de respaldo de forma temporal.
it_it: Poi i file del nuovo pacchetto vengono scompattati. Se un file esiste già, viene sostituito, ma viene fatta temporaneamente una copia di backup.
ja_jp: そして新しいパッケージのファイルが解凍されます。あるファイルが既に存在した場合、そのファイルは置換されますが、一時的にバックアップコピーが作られます。
zh_cn: 新的软件包文件被解压。如果文件已经存在，就被会替换，同时会产生一个临时的备份副本。

source: For an update, <command>dpkg</command> executes <command>old-postrm upgrade <replaceable>new-version</replaceable></command>.
de_de: Für eine Aktualisierung führt <command>dpkg</command> das Skript <command>old-postrm upgrade <replaceable>neue-version</replaceable></command> aus.
es_es: En una actualización, <command>dpkg</command> ejecuta <command>old-postrm upgrade <replaceable>nueva-versión</replaceable></command>.
it_it: Per un aggiornamento, <command>dpkg</command> esegue <command>old-postrm upgrade <replaceable>nuova-versione</replaceable></command>.
ja_jp: 更新の場合、<command>dpkg</command> は <command>old-postrm upgrade <replaceable>new-version</replaceable></command> を実行します。
zh_cn: 对于更新，<command>dpkg</command>执行<command>old-postrm 升级<replaceable>新版本</replaceable></command>。

source: <command>dpkg</command> updates all of the internal data (file list, configuration scripts, etc.) and removes the backups of the replaced files. This is the point of no return: <command>dpkg</command> no longer has access to all of the elements necessary to return to the previous state.
de_de: <command>dpkg</command> aktualisiert alle internen Daten (Dateiliste, Konfigurationsskripte usw.) und entfernt die Sicherheitskopien der ersetzten Dateien. Dies ist der Punkt, an dem es kein Zurück mehr gibt: <command>dpkg</command> hat keinen Zugang zu all den Elementen mehr, die für eine Rückkehr zum vorherigen Zustand erforderlich wären.
es_es: <command>dpkg</command> actualiza toda su información interna (lista de archivos, scripts de configuración, etc.) y elimina los respalos de los archivos reemplazados. Este es el punto sin retorno: <command>dpkg</command> ya no tiene acceso a todos los elementos necesarios para volver al estado anterior.
it_it: <command>dpkg</command> aggiorna tutti i dati interni (elenco file, script di configurazione, ecc.) e rimuove i backup dei file sostituiti. Questo è il punto di non ritorno: <command>dpkg</command> non ha più accesso a tutti gli elementi necessari a ritornare allo stato precedente.
ja_jp: <command>dpkg</command> はすべての内部データを (ファイルリスト、設定スクリプトなど) 更新し、置換されたファイルのバックアップを削除します。これ以降はもう後戻りできません: 前の状態に戻るために必要な情報がすべて失われたため、<command>dpkg</command> は状態を復元できません。
zh_cn: <command>dpkg</command>更新所有的内部数据（文件爱女列表，配置脚本等），并删除被替换文件的备份。这是一条不归路： ） <command>dpkg</command>将不再具有访问所有元素的需要以此来返回以前的状态。

source: <command>dpkg</command> will update the configuration files, asking the user to decide if it is unable to automatically manage this task. The details of this procedure are discussed in <xref linkend="sect.conffiles" />.
ja_jp: <command>dpkg</command> が設定ファイルを更新します。自動的にこの作業を完了できない場合にはユーザにどうするか尋ねます。この作業の詳細は<xref linkend="sect.conffiles" />をご覧ください。

source: Finally, <command>dpkg</command> configures the package by executing <command>new-postinst configure <replaceable>last-version-configured</replaceable></command>.
de_de: Schließlich konfiguriert <command>dpkg</command> das Paket, indem es <command>new-postinst configure <replaceable>vorherige-konfigurierte-version</replaceable></command> ausführt.
es_es: Finalmente, <command>dpkg</command> configura el paquete ejecutando <command>new-postinst configure <replaceable>última-versión-configurada</replaceable></command>.
it_it: Infine, <command>dpkg</command> configura il pacchetto eseguendo <command>new-postinst configure <replaceable>ultima-versione-configurata</replaceable></command>.
ja_jp: 最後に、<command>dpkg</command> は <command>new-postinst configure <replaceable>last-version-configured</replaceable></command> を実行して、パッケージを設定します。
zh_cn: 最后，<command>dpkg</command> 配置软件包通过执行<command>new-postinst配置<replaceable>最终版本配置</replaceable></command>

source: Package Removal
de_de: Paketentfernung
es_es: Eliminación de un paquete
it_it: Rimozione di pacchetti
ja_jp: パッケージの削除
zh_cn: 软件包移除

source: Here is what happens during a package removal:
de_de: Folgendes geschieht, wenn ein Paket entfernt wird:
es_es: Esto es lo que sucede durante la eliminación de un paquete:
it_it: Ecco cosa succede durante la rimozione di un pacchetto:
ja_jp: ここではパッケージの削除中に何が起こるかを説明します:
zh_cn: 这里是当移除一个软件包的时候发生了什么：

source: <command>dpkg</command> calls <command>prerm remove</command>.
de_de: <command>dpkg</command> ruft <command>prerm remove</command> auf.
es_es: <command>dpkg</command> ejecuta <command>prerm remove</command>.
it_it: <command>dpkg</command> chiama <command>prerm remove</command>.
ja_jp: <command>dpkg</command> は <command>prerm remove</command> を呼び出します。
zh_cn: <command>dpkg</command> 回调<command>prerm 移除</command>。
