Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: Let us discuss the first case in greater detail with an example: all mail servers, such as <emphasis role="pkg">postfix</emphasis> or <emphasis role="pkg">sendmail</emphasis> are said to “provide” the <emphasis role="pkg">mail-transport-agent</emphasis> virtual package. Thus, any package that needs this service to be functional (e.g. a mailing list manager, such as <emphasis role="pkg">smartlist</emphasis> or <emphasis role="pkg">sympa</emphasis>) simply states in its dependencies that it requires a <emphasis role="pkg">mail-transport-agent</emphasis> instead of specifying a large yet incomplete list of possible solutions (e.g. <command>postfix | sendmail | exim4 | …</command>). Furthermore, it is useless to install two mail servers on the same machine, which is why each of these packages declares a conflict with the <emphasis role="pkg">mail-transport-agent</emphasis> virtual package. The conflict with itself is ignored by the system, but this technique will prohibit the installation of two mail servers side by side.
ja_jp: 最初の場合について、例を挙げて詳細に議論しましょう: すべてのメールサーバ、例えば <emphasis role="pkg">postfix</emphasis> や <emphasis role="pkg">sendmail</emphasis> などは <emphasis role="pkg">mail-transport-agent</emphasis> 仮想パッケージ「提供」するとされています。このため、動作にメールサービスを必要なパッケージ (例えば <emphasis role="pkg">smartlist</emphasis> や <emphasis role="pkg">sympa</emphasis> などのメーリングリストマネージャ) は、おそらくメールサービスを提供するであろうパッケージ (例えば、<command>postfix | sendmail | exim4 | …</command>の ように) をたくさん依存関係に宣言するのではなく、たった 1 つ <emphasis role="pkg">mail-transport-agent</emphasis> を宣言するだけで十分です。さらに、1 台のマシンに 2 つのメールサーバをインストールすることは無駄なため、メールサーバの機能を提供するパッケージは <emphasis role="pkg">mail-transport-agent</emphasis> 仮想パッケージとの衝突を宣言します。自分自身との衝突はシステムによって無視されます。この手法により、2 つのメールサーバを同時にインストールできなくなります。

source: <emphasis>DEBIAN POLICY</emphasis> List of virtual packages
de_de: <emphasis>DEBIAN-RICHTLINIEN</emphasis> Liste virtueller Pakete
es_es: <emphasis>NORMA DEBIAN</emphasis> Lista de paquetes virtuales
it_it: <emphasis>POLICY DEBIAN</emphasis> Elenco di pacchetti virtuali
ja_jp: <emphasis>DEBIAN POLICY</emphasis> 仮想パッケージのリスト
zh_cn: <emphasis>DEBIAN 政策</emphasis> 虚拟软件包列表

source: For virtual packages to be useful, everyone must agree on their name. This is why they are standardized in the Debian Policy. The list includes among others <emphasis role="pkg">mail-transport-agent</emphasis> for mail servers, <emphasis role="pkg">c-compiler</emphasis> for C programming language compilers, <emphasis role="pkg">www-browser</emphasis> for web browsers, <emphasis role="pkg">httpd</emphasis> for web servers, <emphasis role="pkg">ftp-server</emphasis> for FTP servers, <emphasis role="pkg">x-terminal-emulator</emphasis> for terminal emulators in graphical mode (<command>xterm</command>), and <emphasis role="pkg">x-window-manager</emphasis> for window managers.
ja_jp: 仮想パッケージを便利なものにするために、全員がその名前に同意しなければいけません。このため、仮想パッケージの名前は Debian ポリシーで標準化されています。メールサーバは <emphasis role="pkg">mail-transport-agent</emphasis>、C 言語コンパイラは <emphasis role="pkg">c-compiler</emphasis>、ウェブブラウザは <emphasis role="pkg">www-browser</emphasis>、ウェブサーバは <emphasis role="pkg">httpd</emphasis>、FTP サーバは <emphasis role="pkg">ftp-server</emphasis>、グラフィカルモードのターミナルエミュレータ (<command>xterm</command>) は <emphasis role="pkg">x-terminal-emulator</emphasis>、ウィンドウマネージャは <emphasis role="pkg">x-window-manager</emphasis> などが定められています。

source: The full list can be found on the Web. <ulink type="block" url="http://www.debian.org/doc/packaging-manuals/virtual-package-names-list.txt" />
ja_jp: 完全なリストはウェブの情報を参照してください。<ulink type="block" url="http://www.debian.org/doc/packaging-manuals/virtual-package-names-list.txt" />

source: Interchangeability with Another Package
de_de: Austauschbarkeit mit einem anderen Paket
es_es: Intercambio con otro paquete
it_it: Interscambiabilità con un altro pacchetto
ja_jp: 他のパッケージとの互換性
zh_cn: 和另一个软件包的可交互性

source: The <literal>Provides</literal> field is again interesting when the content of a package is included in a larger package. For example, the <emphasis role="pkg">libdigest-md5-perl</emphasis> Perl module was an optional module in Perl 5.6, and has been integrated as standard in Perl 5.8 (and later versions, such as 5.14 present in <emphasis role="distribution">Wheezy</emphasis>). As such, the package <emphasis role="pkg">perl</emphasis> has since version 5.8 declared <literal>Provides: libdigest-md5-perl</literal> so that the dependencies on this package are met if the user has Perl 5.8 (or newer). The <emphasis role="pkg">libdigest-md5-perl</emphasis> package itself has eventually been deleted, since it no longer had any purpose when old Perl versions were removed.
ja_jp: パッケージの内容が巨大なパッケージに統合された場合に、<literal>Provides</literal> フィールドはさらに興味深い役割を果たします。例えば、<emphasis role="pkg">libdigest-md5-perl</emphasis> Perl モジュールは Perl 5.6 では任意選択モジュールでしたが、Perl 5.8 (と <emphasis role="distribution">Wheezy</emphasis> に含まれる 5.14 などのその後のバージョン) では標準モジュールに組み込まれました。このため、<emphasis role="pkg">perl</emphasis> パッケージはバージョン 5.8 から <literal>Provides: libdigest-md5-perl</literal> を宣言しています。そうすれば、ユーザが Perl 5.8 (とそれより新しいバージョン) を持っている場合、このパッケージの依存関係が満足されるからです。<emphasis role="pkg">libdigest-md5-perl</emphasis> パッケージ自体は、いずれ削除されます。なぜなら、古い Perl バージョンが削除されたらこのパッケージはもはや存在意義が無いからです。

source: Use of a <literal>Provides</literal> field in order to not break dependencies
de_de: Verwendung einer <literal>Provides</literal>-Zeile zur Vermeidung des Brechens von Abhängigkeiten
es_es: Utilización del campo <literal>Provides</literal> para no romper dependencias
it_it: Uso del campo <literal>Provides</literal> per non lasciare dipendenze non soddisfatte
ja_jp: 依存関係を壊さない <literal>Provides</literal> フィールドの使い方
zh_cn: 使用了<literal>预备</literal>字段来避免中断依赖性关系

source: This feature is very useful, since it is never possible to anticipate the vagaries of development, and it is necessary to be able to adjust to renaming, and other automatic replacement, of obsolete software.
de_de: Dieses Merkmal ist sehr nützlich, da es nie möglich ist, die Wechselfälle der Entwicklung vorherzusehen, und es erforderlich ist, sich auf die Umbenennung oder einen anderen automatischen Ersatz einer veralteten Software einzustellen.
es_es: Esta funcionalidad es muy útil ya que nunca es posible anticipar los caprichos del desarrollo y es necesario que sea posible adaptarse a cambios de nombre y otros reemplazos automáticos de software obsoleto.
it_it: Questa caratteristica è molto utile dal momento che non è mai possibile anticipare le variabilità dello sviluppo ed è necessario essere in grado di adattarsi ai cambiamenti di nome del software obsoleto e ad altre sostituzioni automatiche.
ja_jp: この機能はとても便利です、なぜなら、開発方向性の変化を予測することは絶対に不可能ですし、名称を変更できたり、他の時代遅れのソフトウェアを自動に置き換えできるようにする事が必要だからです。
zh_cn: 这个功能非常有用，因为它是永远不可能预料到变化莫测的发展，它不能够调整重命名，或者其他自动替换过的软件，所以它是必要的。

source: <emphasis>BACK TO BASICS</emphasis> Perl, a programming language
de_de: <emphasis>ZURÜCK ZU DEN GRUNDLAGEN</emphasis> Perl, eine Programmiersprache
es_es: <emphasis>VOLVER A LOS CIMIENTOS</emphasis> Perl, un lenguaje de programación
it_it: <emphasis>FONDAMENTALI</emphasis> Perl, un linguaggio di programmazione
ja_jp: <emphasis>BACK TO BASICS</emphasis> Perl、プログラミング言語
zh_cn: <emphasis>回到基本</emphasis>Perl，一种编程语言

source: Perl (Practical Extraction and Report Language) is a very popular programming language. It has many ready-to-use modules that cover a vast spectrum of applications, and that are distributed by the CPAN (Comprehensive Perl Archive Network) servers, an exhaustive network of Perl packages. <ulink type="block" url="http://www.perl.org/" /> <ulink type="block" url="http://www.cpan.org/" />
de_de: Perl (Practical Extraction and Report Language) ist eine sehr populäre Programmiersprache. Sie hat zahlreiche gebrauchsfertige Module, die ein weites Spektrum von Anwendungen abdecken und die durch die Server des CPAN (Comprehensive Perl Archive Network) verteilt werden, ein vollständiges Netzwerk von Perl-Paketen. <ulink type="block" url="http://www.perl.org/" /> <ulink type="block" url="http://www.cpan.org/" />
es_es: Perl (lenguaje práctico de extración y reportes — «Practical Extraction and Report Language») es un lenguaje de programación muy popular. Tiene muchos módulos listos para utilizar que cubren un vasto espectro de aplicaciones y que son distribuidos por los servidores CPAN (red exhaustiva de compendios Perl — «Comprehensive Perl Archive Network»), una amplia red de paquetes Perl. <ulink type="block" url="http://www.perl.org/" /> <ulink type="block" url="http://www.cpan.org/" />
it_it: Perl (Practical Extraction and Report Language) è un linguaggio di programmazione molto popolare. Ha molti moduli pronti all'uso che coprono un vasto spettro di applicazioni e che sono distribuiti tramite i server CPAN (Comprehensive Perl Archive Network), una completa rete di pacchetti Perl. <ulink type="block" url="http://www.perl.org/" /> <ulink type="block" url="http://www.cpan.org/" />
ja_jp: Perl (Practical Extraction and Report Language) はとても人気があるプログラミング言語です。Perl にはすぐに使えるモジュールが数多くあります。これらのモジュールは非常に広い分野における応用をカバーし、Perl パッケージの包括的ネットワークである CPAN (Comprehensive Perl Archive Network) サーバで配布されています。<ulink type="block" url="http://www.perl.org/" /> <ulink type="block" url="http://www.cpan.org/" />
zh_cn: Perl（实用报表提取语言）是非常受欢迎的编程语言。它有许多现成的模块，涵盖了广阔的应用，这些都是由CPAN（Perl综合架构网络）提供服务的，cpan是一个详尽的网络Perl软件包。<ulink type="block" url="http://www.perl.org/" /> <ulink type="block" url="http://www.cpan.org/" />

source: Since it is an interpreted language, a program written in Perl does not require compilation prior to execution. This is why they are called “Perl scripts”.
de_de: Da es eine interpretierte Sprache ist, brauchen in Perl geschriebene Programme vor ihrer Ausführung nicht kompiliert zu werden. Daher werden sie „Perl-Skripte“ genannt.
es_es: Dado que es un lenguaje interpretado, un programa escrito en Perl no requiere compilación antes de su ejecución. Por esto se los llama «scripts Perl».
it_it: Dal momento che è un linguaggio interpretato, un programma scritto in Perl non richiede una compilazione prima dell'esecuzione. Questo è il motivo per cui sono chiamati «script Perl».
ja_jp: Perl はインタプリタ型言語であるため、Perl で書かれたプログラムは実行前にコンパイルする必要がありません。このためプログラムは「Perl スクリプト」と呼ばれています。
zh_cn: 由于它是一种解释语言，Perl语言编写的程序并不需要编译之前来执行。这就是为什么大家叫它“Perl脚本”

source: Current Limitations
de_de: Gegenwärtige Einschränkungen
es_es: Limitaciones actuales
it_it: Limitazioni attuali
ja_jp: 現在の制限
zh_cn: 现在的缺点

source: Virtual packages suffer from some limitations, the most significant of which being the absence of a version number. To return to the previous example, a dependency such as <literal>Depends: libdigest-md5-perl (&gt;= 1.6)</literal>, despite the presence of Perl 5.10, will never be considered as satisfied by the packaging system — while in fact it most likely is satisfied. Unaware of this, the package system chooses the least risky option, assuming that the versions do not match.
ja_jp: 仮想パッケージにはいくつかの制限があります。最も重要な制限はバージョン番号が無い事です。先に挙げた例に戻ると、Perl 5.10 があるなら、<literal>Depends: libdigest-md5-perl (&gt;= 1.6)</literal> という依存関係は満足されています (正しく言えば、十中八九満足されています) が、パッケージシステムはこの依存関係が満足されていることに気がつきません。パッケージシステムは依存関係が満足されていることに気がつきませんが、指定されたバージョンが一致しないと仮定して、最もリスクの低いオプションを選びます。

source: <emphasis>GOING FURTHER</emphasis> Virtual package versions
de_de: <emphasis>WEITERE SCHRITTE</emphasis> Virtuelle Paketversionen
es_es: <emphasis>YENDO MÁS ALLÁ</emphasis> Versiones de paquetes virtuales
it_it: <emphasis>APPROFONDIMENTI</emphasis> Versioni dei pacchetti virtuali
ja_jp: <emphasis>GOING FURTHER</emphasis> 仮想パッケージのバージョン
zh_cn: <emphasis>进一步讨论</emphasis>虚拟软件包版本

source: Although today virtual packages can't have versions, this will not necessarily always be the case. Indeed, <command>apt</command> is already able to manage the versions of virtual packages and it is likely that <command>dpkg</command> eventually will too. We will then be able to write fields such as <literal>Provides: libstorable-perl (= 1.7)</literal> to indicate that a package provides the same functionality as <emphasis role="pkg">libstorable-perl</emphasis> in its 1.7 version.
de_de: Obwohl virtuelle Pakete bisher keine Versionen haben können, muss dies nicht immer so bleiben. <command>apt</command> ist in der Tat bereits in der Lage, mit Versionen virtueller Pakete umzugehen und das wird bei <command>dpkg</command> eines Tages auch so sein. Wir werden dann Zeilen wie <literal>Provides: libstorable-perl (= 1.7)</literal> schreiben können um anzuzeigen, dass ein Paket dieselbe Funktionalität wie <emphasis role="pkg">libstorable-perl</emphasis> in seiner Version 1.7 bereitstellt.
es_es: Si bien hoy en día los paquetes virtuales no pueden tener versiones, esto no será el caso para siempre. De hecho, <command>apt</command> ya puede gestionar versiones de paquetes virtuales y es probable que <command>dpkg</command> también lo hará eventualmente. Luego podremos escribir los campos como <literal>Provides: libstorable-perl (= 1.7)</literal> para indicar que el paquete provee la misma funcionalidad que <emphasis role="pkg">libstorable-perl</emphasis> en su versión 1.7.
it_it: Sebbene oggi i pacchetti virtuali non possano avere versioni, non sarà necessariamente sempre così. Infatti, <command>apt</command> è già in grado di gestire le versioni dei pacchetti virtuali ed è probabile che alla fine lo faccia anche <command>dpkg</command>. Sarà quindi possibile scrivere campi come <literal>Provides: libstorable-perl (= 1.7)</literal> per indicare che un pacchetto fornisce le stesse funzionalità della versione 1.7 di <emphasis role="pkg">libstorable-perl</emphasis>.
ja_jp: 今のところ仮想パッケージにはバージョンの概念がありませんが、この状況が常に正しいとは限りません。実際、<command>apt</command> は既に仮想パッケージのバージョンを取り扱う事が可能で、<command>dpkg</command> も将来的には可能になるでしょう。あるパッケージに <literal>Provides: libstorable-perl (= 1.7)</literal> のようなフィールドを宣言することで、そのパッケージが <emphasis role="pkg">libstorable-perl</emphasis> の バージョン 1.7 と同じ機能を提供している事を表す事ができるようになるのです。
zh_cn: 尽管直到今天，虚拟软件包都没有版本号，但这不一定总是如此。事实上,<command>apt</command>命令中已经能够管理虚拟软件包的版本了,<command>dpkg</command>以后也可以管理。我们将能写一些字段到<literal>预备的：libstorable-perl (= 1.7)</literal> 来申明一个软件包提供了相同的功能,比如<emphasis role="pkg">libstorable-perl</emphasis>的 1.7 版本。

source: Replacing Files: The <literal>Replaces</literal> Field
de_de: Dateien ersetzen: Die <literal>Replaces</literal>-Zeile
es_es: Reemplazando archivos: el campo <literal>Replaces</literal>
it_it: Sostituzione di file: il campo <literal>Replaces</literal>
ja_jp: ファイルの置き換え: <literal>Replaces</literal> フィールド
zh_cn: 替换文件：<literal>替换</literal>字段

source: <primary>replacement</primary>
de_de: <primary>Ersetzung</primary>
es_es: <primary>reemplazo</primary>
it_it: <primary>sostituzione</primary>
ja_jp: <primary>置換</primary>
zh_cn: <primary>替换</primary>

source: <primary><literal>Replaces</literal>, header field</primary>
de_de: <primary><literal>Replaces</literal>, Kopfzeile</primary>
es_es: <primary><literal>Replaes</literal>, campo de cabecera</primary>
it_it: <primary><literal>Replaces</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Replaces</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>替换</literal>,头字段</primary>

source: <primary>package</primary><secondary>replacement</secondary>
de_de: <primary>Paket</primary><secondary>Ersetzung</secondary>
es_es: <primary>paquete</primary><secondary>reemplazo</secondary>
it_it: <primary>pacchetto</primary><secondary>sostituzione</secondary>
ja_jp: <primary>パッケージ</primary><secondary>置換</secondary>
zh_cn: <primary>软件包</primary><secondary>替换</secondary>

source: The <literal>Replaces</literal> field indicates that the package contains files that are also present in another package, but that the package is legitimately entitled to replace them. Without this specification, <command>dpkg</command> fails, stating that it can not overwrite the files of another package (in fact, it is possible to force it to do so with the <literal>--force-overwrite</literal> option). This allows identification of potential problems and requires the maintainer to study the matter prior to choosing whether to add such a field.
de_de: Die <literal>Replaces</literal>-Zeile zeigt an, dass das Paket Dateien enthält, die auch in einem anderen Paket vorhanden sind, dass aber das Paket offiziell berechtigt ist, sie zu ersetzen. Ohne diese Angabe würde <command>dpkg</command> scheitern und erklären, dass es die Dateien eines anderen Pakets nicht überschreiben kann (allerdings kann es durch die Option <literal>--force-overwrite</literal> dazu gezwungen werden). Hierdurch ist es möglich, eventuelle Probleme zu identifizieren, und der Betreuer muss die Angelegenheit untersuchen, bevor er entscheidet, ob er solch eine Zeile einfügt.
es_es: El campo <literal>Replaces</literal> indica que el paquete contiene archivos que también están presentes en otro paquete, pero que el paquete tiene el derecho legítimo de reemplazarlo. Sin esta especificación, <command>dpkg</command> fallará indicando que no puede sobreescribir los archivos de otro paquete (es posible forzar que lo haga con la opción <literal>--force-overwrite</literal>). Esto permite identificar problemas potenciales y requiere que el desarrollador estudie el hecho antes de decidir agregar dicho campo.
it_it: Il campo <literal>Replaces</literal> indica che il pacchetto contiene file che sono presenti anche in un altro pacchetto, ma che il pacchetto è legittimamente titolato a sostituirli. Senza questa specificazione, <command>dpkg</command> fallisce dichiarando che non può sovrascrivere i file di un altro pacchetto (in realtà è possibile obbligarlo a farlo con l'opzione <literal>--force-overwrite</literal>). Ciò permette di identificare problemi potenziali e obbliga il manutentore a studiare la situazione prima di scegliere se aggiungere tale campo.
ja_jp: <literal>Replaces</literal> フィールドは、そのパッケージが他のパッケージにも含まれるファイルを含んでおり、合法的にそのファイルを置き換える権利を持っている事を示すためのものです。この仕様が無かったとしても、<command>dpkg</command> はそのようなファイルを置き換える事はできません。これは他のパッケージのファイルは上書きできない事を意味しています (実際には、<literal>--force-overwrite</literal> オプションを付ければ強制的に上書き可能です)。このことにより潜在的な問題を識別できるようになりますし、メンテナはこのフィールドを追加する前に問題の原因を追及する事ができるようになります。
zh_cn: <literal>替换</literal>字段表示该软件包中包含的文件，在另一个软件包中也存在，但该包能够合法和有权的替换掉这些文件。如果没有这个规范，<command>dpkg</command>命令会失败，说明它不能替换掉这些文件的另外一个软件包（事实上，它有可能迫使它这样做，使用<literal>强制覆盖</literal>选项）。这使得识别潜在的问题和需要维护者在研究此事前，选择是否增加这样的字段。

source: The use of this field is justified when package names change or when a package is included in another. This also happens when the maintainer decides to distribute files differently among various binary packages produced from the same source package: a replaced file no longer belongs to the old package, but only to the new one.
de_de: Die Verwendung dieser Zeile ist gerechtfertigt, wenn sich Paketnamen ändern oder wenn ein Paket in einem anderen enthalten ist. Dies kommt auch vor, wenn der Betreuer sich entschließt, Dateien in unterschiedlicher Weise auf mehrere Binärpakete zu verteilen, die vom selben Quellpaket erstellt werden: eine ersetzte Datei ist nicht mehr Teil des alten Pakets, sondern nur noch des neuen.
es_es: El uso de este campo está justificado cuando cambian los nombres de los paquetes o cuando un paquete está incluido en otro. Esto sucede cuando el desarrollador decide distribuir los archivos de otra forma entre los varios paquetes binarios producidos del mismo paquete fuente: un archivo reemplazado no le corresponde al paquete antiguo, sólo al nuevo.
it_it: L'uso di questo campo è giustificato quando il nome del pacchetto cambia o quando un pacchetto è incluso in un altro. Questo succede anche quando il manutentore decide di distribuire i file in maniera differente tra i vari pacchetti binari prodotti dallo stesso pacchetto sorgente: un file sostituito non appartiene più al vecchio pacchetto, ma solo a quello nuovo.
ja_jp: このフィールドは、パッケージ名が変更された時や、パッケージが別のパッケージに統合された時に使われます。これはまた、メンテナが同じソースパッケージから作成されたバイナリパッケージ間で異なるファイルを配布したい場合に使われます: 置き換えられたファイルはもはや古いパッケージではなく新しいパッケージに所属します。
zh_cn: 当软件包名称变更时，或者当一个软件包包含在另外一个的时候，此字段的使用是合理的。这也发生在维护者决定从来自相同的源码包的大量二进制包里分发出文件：一个替换的文件不再属于旧的软件包，只有新的才属于。

source: If all of the files in an installed package have been replaced, the package is considered to be removed. Finally, this field also encourages <command>dpkg</command> to remove the replaced package where there is a conflict.
de_de: Sobald alle Dateien eines installierten Pakets ersetzt wurden, gilt das Paket als entfernt. Ausserdem veranlasst dieses Feld <command>dpkg</command>, das ersetzte Paket zu entfernen, wenn ein Konflikt auftritt.
es_es: Si todos los archivos de un paquete instalado fueron reemplazados, se considera que se eliminó el paquete. Finalmente, este campo incita que <command>dpkg</command> elimie los paquetes reemplazados en casos de conflictos.
it_it: Se tutti i file di un pacchetto installato sono stati sostituiti, il pacchetto è considerato come rimosso. Infine, questo campo incoraggia <command>dpkg</command> a rimuovere il pacchetto sostituito quando c'è un conflitto.
ja_jp: インストール済みパッケージのすべてのファイルが置き換えられたら、このパッケージは削除されたとみなされます。最後に、このフィールドは衝突がある場合に <command>dpkg</command> が置き換えられたパッケージを削除する際に使われます。
zh_cn: 如果已安装软件包的所有文件都被替换了，那么该软件包将认为将被删除掉。最后，这个字段会鼓励<command>dpkg</command>命令去删除替换掉有冲突的包。

source: <emphasis>GOING FURTHER</emphasis> The <literal>Tag</literal> field
de_de: <emphasis>WEITERE SCHRITTE</emphasis> Die <literal>Tag</literal>-Zeile
es_es: <emphasis>YENDO MÁS ALLÁ</emphasis> El campo <literal>Tag</literal>
it_it: <emphasis>APPROFONDIMENTI</emphasis> Il campo <literal>Tag</literal>
ja_jp: <emphasis>GOING FURTHER</emphasis> <literal>Tag</literal> フィールド
zh_cn: <emphasis>更进一步</emphasis><literal>标签</literal>字段

source: In the <emphasis role="pkg">apt</emphasis> example above, we can see the presence of a field that we have not yet described, the <literal>Tag</literal> field. This field does not describe a relationship between packages, but is simply a way of categorizing a package in a thematic taxonomy. This classification of packages according to several criteria (type of interface, programming language, domain of application, etc.) has been available for a long time. Despite this, not all packages have accurate tags and it is not yet integrated in all Debian tools; <command>aptitude</command> displays these tags, and allows them to be used as search criteria. For those who are repelled by <command>aptitude</command>'s search criteria, the following website allows navigation of the tag database: <ulink type="block" url="http://debtags.alioth.debian.org/" />
ja_jp: 上に挙げた <emphasis role="pkg">apt</emphasis> の例にはまだ説明していない <literal>Tag</literal> フィールドがあります。このフィールドはパッケージ間の関連性を説明するものではなく、単純にテーマ分類に基づいてパッケージを分類するものです。昔からパッケージはいくつかの基準 (インターフェースの種類、プログラミング言語、アプリケーションの分野など) に基づいて分類されていました。これにも関わらず、適切なタグがすべてのパッケージに付けられているわけではありませんし、まだすべての Debian ツールがタグを使えるわけではありません; <command>aptitude</command> はこれらのタグを表示しますし、検索条件としてタグを使う事も可能です。<command>aptitude</command> の検索条件に嫌悪感を抱く人は、以下のウェブサイトを使ってタグのデータベースを見る事が可能です。<ulink type="block" url="http://debtags.alioth.debian.org/" />

source: Configuration Scripts
de_de: Konfigurationsskripte
es_es: Scripts de configuración
it_it: Script di configurazione
ja_jp: 設定スクリプト
zh_cn: 配置脚本
