Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: Removal and purge of the <emphasis>debian-cd</emphasis> package
de_de: Entfernen und vollständiges Löschen des Pakets <emphasis>debian-cd</emphasis>
es_es: Eliminación y purgado del paquete <emphasis>debian-cd</emphasis>
it_it: Rimozione ed eliminazione completa del pacchetto <emphasis>debian-cd</emphasis>
ja_jp: <emphasis>debian-cd</emphasis> パッケージの削除と完全消去
zh_cn: 删除和清除掉<emphasis>debian-cd</emphasis>软件包

source: <computeroutput># </computeroutput><userinput>dpkg -r debian-cd</userinput> <computeroutput>(Reading database ... 97747 files and directories currently installed.) Removing debian-cd ... # </computeroutput><userinput>dpkg -P debian-cd</userinput> <computeroutput>(Reading database ... 97401 files and directories currently installed.) Removing debian-cd ... Purging configuration files for debian-cd ...</computeroutput>
ja_jp: <computeroutput># </computeroutput><userinput>dpkg -r debian-cd</userinput> <computeroutput>(データベースを読み込んでいます ... 現在 97747 個のファイルとディレクトリがインストールされています。) debian-cd を削除しています ... # </computeroutput><userinput>dpkg -P debian-cd</userinput> <computeroutput>(データベースを読み込んでいます ... 現在 97401 個のファイルとディレクトリがインストールされています。) debian-cd を削除しています ... debian-cd の設定ファイルを削除しています ...</computeroutput>

source: Querying <command>dpkg</command>'s Database and Inspecting <filename>.deb</filename> Files
ja_jp: <command>dpkg</command> のデータベースへの問い合わせと <filename>.deb</filename> ファイルの調査

source: <primary>package</primary><secondary>status</secondary>
de_de: <primary>Paket</primary><secondary>Status</secondary>
es_es: <primary>paquete</primary><secondary>estado</secondary>
it_it: <primary>pacchetto</primary><secondary>stato</secondary>
ja_jp: <primary>パッケージ</primary><secondary>状態</secondary>
zh_cn: <primary>软件包</primary><secondary>状态</secondary>

source: <primary>package</primary><secondary>file list</secondary>
de_de: <primary>Paket</primary><secondary>Dateiliste</secondary>
es_es: <primary>paquete</primary><secondary>lista de archivos</secondary>
it_it: <primary>pacchetto</primary><secondary>elenco file</secondary>
ja_jp: <primary>パッケージ</primary><secondary>ファイルリスト</secondary>
zh_cn: <primary>软件包</primary><secondary>文件列表</secondary>

source: <primary>package</primary><secondary>content inspection</secondary>
de_de: <primary>Paket</primary><secondary>Inhaltsüberprüfung</secondary>
es_es: <primary>paquete</primary><secondary>inspección de contenido</secondary>
it_it: <primary>pacchetto</primary><secondary>ispezione del contenuto</secondary>
ja_jp: <primary>パッケージ</primary><secondary>内容の調査</secondary>
zh_cn: <primary>软件包</primary><secondary>内容检查</secondary>

source: <emphasis>BACK TO BASICS</emphasis> Option syntax
de_de: <emphasis>ZURÜCK ZU DEN GRUNDLAGEN</emphasis> Optionen-Syntax
es_es: <emphasis>VOLVER A LOS CIMIENTOS</emphasis> Sintaxis de opciones
it_it: <emphasis>FONDAMENTALI</emphasis> Sintassi delle opzioni
ja_jp: <emphasis>BACK TO BASICS</emphasis> オプションの構文
zh_cn: <emphasis>回到基础</emphasis> 选项的语法

source: Most options are available in a “long” version (one or more relevant words, preceded by a double dash) and a “short” version (a single letter, often the initial of one word from the long version, and preceded by a single dash). This convention is so common that it is a POSIX standard.
ja_jp: ほとんどのオプションには「長い」もの (1 個以上の関連する単語、二重ダッシュで始まる) と「短い」もの (1 文字、長いオプションの頭文字の場合が多い、単独のダッシュで始まる) があります。これは POSIX 標準のプログラムでよく見られる慣例です。

source: Before concluding this section, we will study <command>dpkg</command> options that query the internal database in order to obtain information. Giving first the long options and then corresponding short options (that will evidently take the same possible arguments) we cite <literal>--listfiles <replaceable>package</replaceable></literal> (or <literal>-L</literal>), which lists the files installed by this package; <literal>--search <replaceable>file</replaceable></literal> (or <literal>-S</literal>), which finds the package(s) containing the file; <literal>--status <replaceable>package</replaceable></literal> (or <literal>-s</literal>), which displays the headers of an installed package; <literal>--list</literal> (or <literal>-l</literal>), which displays the list of packages known to the system and their installation status; <literal>--contents <replaceable>file.deb</replaceable></literal> (or <literal>-c</literal>), which lists the files in the Debian package specified; <literal>--info<replaceable> file.deb </replaceable></literal> (or <literal>-I</literal>), which displays the headers of this Debian package.
ja_jp: この節を締めくくる前に、内部データベースに問い合わせて情報を得る際に使う <command>dpkg</command> のオプションについて学びましょう。表記は最初に長いオプション、そのあとに対応する短いオプション (両者は同じ引数を取るのは明らかです) です。<literal>--listfiles <replaceable>package</replaceable></literal> (または <literal>-L</literal>)、与えられたパッケージがインストールするファイルを表示します; <literal>--search <replaceable>file</replaceable></literal> (または <literal>-S</literal>)、ファイルを含むパッケージを探します; <literal>--status <replaceable>package</replaceable></literal> (または <literal>-s</literal>)、インストールされたパッケージのヘッダを表示します; <literal>--list</literal> (または <literal>-l</literal>)、システムが把握しているパッケージのリストとその状態を表示します; <literal>--contents <replaceable>file.deb</replaceable></literal> (または <literal>-c</literal>)、与えられた Debian パッケージに含まれるファイルを表示します; <literal>--info<replaceable> file.deb </replaceable></literal> (または <literal>-I</literal>) Debian パッケージのヘッダを表示します。

source: Various queries with <command>dpkg</command>
de_de: Verschiedene Anfragen mit <command>dpkg</command>
es_es: Varias consultas con <command>dpkg</command>
it_it: Varie richieste con <command>dpkg</command>
ja_jp: <command>dpkg</command> に様々な情報を問い合わせる
zh_cn: <command>dpkg</command>的各种查询

source: <computeroutput>$ </computeroutput><userinput>dpkg -L base-passwd</userinput> <computeroutput>/. /usr /usr/sbin /usr/sbin/update-passwd /usr/share /usr/share/man /usr/share/man/ru /usr/share/man/ru/man8 /usr/share/man/ru/man8/update-passwd.8.gz /usr/share/man/pl /usr/share/man/pl/man8 /usr/share/man/pl/man8/update-passwd.8.gz /usr/share/man/man8 /usr/share/man/man8/update-passwd.8.gz /usr/share/man/fr /usr/share/man/fr/man8 /usr/share/man/fr/man8/update-passwd.8.gz /usr/share/doc-base /usr/share/doc-base/users-and-groups /usr/share/base-passwd /usr/share/base-passwd/passwd.master /usr/share/base-passwd/group.master /usr/share/lintian /usr/share/lintian/overrides /usr/share/lintian/overrides/base-passwd /usr/share/doc /usr/share/doc/base-passwd /usr/share/doc/base-passwd/copyright /usr/share/doc/base-passwd/users-and-groups.html /usr/share/doc/base-passwd/changelog.gz /usr/share/doc/base-passwd/users-and-groups.txt.gz /usr/share/doc/base-passwd/README $ </computeroutput><userinput>dpkg -S /bin/date</userinput> <computeroutput>coreutils: /bin/date $ </computeroutput><userinput>dpkg -s coreutils</userinput> <computeroutput>Package: coreutils Essential: yes Status: install ok installed Priority: required Section: utils Installed-Size: 13822 Maintainer: Michael Stone &lt;mstone@debian.org&gt; Architecture: amd64 Multi-Arch: foreign Version: 8.13-3.5 Replaces: mktemp, timeout Depends: dpkg (&gt;= 1.15.4) | install-info Pre-Depends: libacl1 (&gt;= 2.2.51-8), libattr1 (&gt;= 1:2.4.46-8), libc6 (&gt;= 2.7), libselinux1 (&gt;= 1.32) Conflicts: timeout Description: GNU core utilities This package contains the basic file, shell and text manipulation utilities which are expected to exist on every operating system. . Specifically, this package includes: arch base64 basename cat chcon chgrp chmod chown chroot cksum comm cp csplit cut date dd df dir dircolors dirname du echo env expand expr factor false flock fmt fold groups head hostid id install join link ln logname ls md5sum mkdir mkfifo mknod mktemp mv nice nl nohup nproc od paste pathchk pinky pr printenv printf ptx pwd readlink rm rmdir runcon sha*sum seq shred sleep sort split stat stty sum sync tac tail tee test timeout touch tr true truncate tsort tty uname unexpand uniq unlink users vdir wc who whoami yes Homepage: http://gnu.org/software/coreutils $ </computeroutput><userinput>dpkg -l 'b*'</userinput> <computeroutput>Desired=Unknown/Install/Remove/Purge/Hold | Status=Not/Inst/Conf-files/Unpacked/halF-conf/Half-inst/trig-aWait/Trig-pend |/ Err?=(none)/Reinst-required (Status,Err: uppercase=bad) ||/ Name Version Architecture Description +++-============-==============-==============-================================ un backupninja &lt;none&gt; (no description available) un base &lt;none&gt; (no description available) un base-config &lt;none&gt; (no description available) ii base-files 7.1 amd64 Debian base system miscellaneous ii base-passwd 3.5.26 amd64 Debian base system master passwo [...] $ </computeroutput><userinput>dpkg -c /var/cache/apt/archives/gnupg_1.4.12-7_amd64.deb</userinput> <computeroutput>drwxr-xr-x root/root 0 2013-01-02 19:28 ./ drwxr-xr-x root/root 0 2013-01-02 19:28 ./usr/ drwxr-xr-x root/root 0 2013-01-02 19:28 ./usr/share/ drwxr-xr-x root/root 0 2013-01-02 19:28 ./usr/share/doc/ drwxr-xr-x root/root 0 2013-01-02 19:28 ./usr/share/doc/gnupg/ -rw-r--r-- root/root 3258 2012-01-20 10:51 ./usr/share/doc/gnupg/TODO -rw-r--r-- root/root 308 2011-12-02 18:34 ./usr/share/doc/gnupg/FAQ -rw-r--r-- root/root 3543 2012-02-20 18:41 ./usr/share/doc/gnupg/Upgrading_From_PGP.txt -rw-r--r-- root/root 690 2012-02-20 18:41 ./usr/share/doc/gnupg/README.Debian -rw-r--r-- root/root 1418 2012-02-20 18:41 ./usr/share/doc/gnupg/TODO.Debian [...] $ </computeroutput><userinput>dpkg -I /var/cache/apt/archives/gnupg_1.4.12-7_amd64.deb</userinput> <computeroutput> new debian package, version 2.0. size 1952176 bytes: control archive=3312 bytes. 1449 bytes, 30 lines control 4521 bytes, 65 lines md5sums 479 bytes, 13 lines * postinst #!/bin/sh 473 bytes, 13 lines * preinst #!/bin/sh Package: gnupg Version: 1.4.12-7 Architecture: amd64 Maintainer: Debian GnuPG-Maintainers &lt;pkg-gnupg-maint@lists.alioth.debian.org&gt; Installed-Size: 4627 Depends: libbz2-1.0, libc6 (&gt;= 2.4), libreadline6 (&gt;= 6.0), libusb-0.1-4 (&gt;= 2:0.1.12), zlib1g (&gt;= 1:1.1.4), dpkg (&gt;= 1.15.4) | install-info, gpgv Recommends: libldap-2.4-2 (&gt;= 2.4.7), gnupg-curl Suggests: gnupg-doc, xloadimage | imagemagick | eog, libpcsclite1 Section: utils Priority: important Multi-Arch: foreign Homepage: http://www.gnupg.org Description: GNU privacy guard - a free PGP replacement GnuPG is GNU's tool for secure communication and data storage. It can be used to encrypt data and to create digital signatures. It includes an advanced key management facility and is compliant with the proposed OpenPGP Internet standard as described in RFC 4880. [...]</computeroutput>
ja_jp: <computeroutput>$ </computeroutput><userinput>dpkg -L base-passwd</userinput> <computeroutput>/. /usr /usr/sbin /usr/sbin/update-passwd /usr/share /usr/share/man /usr/share/man/ru /usr/share/man/ru/man8 /usr/share/man/ru/man8/update-passwd.8.gz /usr/share/man/pl /usr/share/man/pl/man8 /usr/share/man/pl/man8/update-passwd.8.gz /usr/share/man/man8 /usr/share/man/man8/update-passwd.8.gz /usr/share/man/fr /usr/share/man/fr/man8 /usr/share/man/fr/man8/update-passwd.8.gz /usr/share/doc-base /usr/share/doc-base/users-and-groups /usr/share/base-passwd /usr/share/base-passwd/passwd.master /usr/share/base-passwd/group.master /usr/share/lintian /usr/share/lintian/overrides /usr/share/lintian/overrides/base-passwd /usr/share/doc /usr/share/doc/base-passwd /usr/share/doc/base-passwd/copyright /usr/share/doc/base-passwd/users-and-groups.html /usr/share/doc/base-passwd/changelog.gz /usr/share/doc/base-passwd/users-and-groups.txt.gz /usr/share/doc/base-passwd/README $ </computeroutput><userinput>dpkg -S /bin/date</userinput> <computeroutput>coreutils: /bin/date $ </computeroutput><userinput>dpkg -s coreutils</userinput> <computeroutput>Package: coreutils Essential: yes Status: install ok installed Priority: required Section: utils Installed-Size: 13822 Maintainer: Michael Stone &lt;mstone@debian.org&gt; Architecture: amd64 Multi-Arch: foreign Version: 8.13-3.5 Replaces: mktemp, timeout Depends: dpkg (&gt;= 1.15.4) | install-info Pre-Depends: libacl1 (&gt;= 2.2.51-8), libattr1 (&gt;= 1:2.4.46-8), libc6 (&gt;= 2.7), libselinux1 (&gt;= 1.32) Conflicts: timeout Description: GNU core utilities This package contains the basic file, shell and text manipulation utilities which are expected to exist on every operating system. . Specifically, this package includes: arch base64 basename cat chcon chgrp chmod chown chroot cksum comm cp csplit cut date dd df dir dircolors dirname du echo env expand expr factor false flock fmt fold groups head hostid id install join link ln logname ls md5sum mkdir mkfifo mknod mktemp mv nice nl nohup nproc od paste pathchk pinky pr printenv printf ptx pwd readlink rm rmdir runcon sha*sum seq shred sleep sort split stat stty sum sync tac tail tee test timeout touch tr true truncate tsort tty uname unexpand uniq unlink users vdir wc who whoami yes Homepage: http://gnu.org/software/coreutils $ </computeroutput><userinput>dpkg -l 'b*'</userinput> <computeroutput>要望=(U)不明/(I)インストール/(R)削除/(P)完全削除/(H)保持 | 状態=(N)無/(I)インストール済/(C)設定/(U)展開/(F)設定失敗/(H)半インストール/(W)トリガ待ち/(T)トリガ保留 |/ エラー?=(空欄)無/(R)要再インストール (状態,エラーの大文字=異常) ||/ 名前 バージョン アーキテク 説明 +++-============-==============-==============-================================ un backupninja &lt;なし&gt; (説明 (description) がありません) un base &lt;なし&gt; (説明 (description) がありません) un base-config &lt;なし&gt; (説明 (description) がありません) ii base-files 7.1 amd64 Debian base system miscellaneous ii base-passwd 3.5.26 amd64 Debian base system master passwo [...] $ </computeroutput><userinput>dpkg -c /var/cache/apt/archives/gnupg_1.4.12-7_amd64.deb</userinput> <computeroutput>drwxr-xr-x root/root 0 2013-01-02 19:28 ./ drwxr-xr-x root/root 0 2013-01-02 19:28 ./usr/ drwxr-xr-x root/root 0 2013-01-02 19:28 ./usr/share/ drwxr-xr-x root/root 0 2013-01-02 19:28 ./usr/share/doc/ drwxr-xr-x root/root 0 2013-01-02 19:28 ./usr/share/doc/gnupg/ -rw-r--r-- root/root 3258 2012-01-20 10:51 ./usr/share/doc/gnupg/TODO -rw-r--r-- root/root 308 2011-12-02 18:34 ./usr/share/doc/gnupg/FAQ -rw-r--r-- root/root 3543 2012-02-20 18:41 ./usr/share/doc/gnupg/Upgrading_From_PGP.txt -rw-r--r-- root/root 690 2012-02-20 18:41 ./usr/share/doc/gnupg/README.Debian -rw-r--r-- root/root 1418 2012-02-20 18:41 ./usr/share/doc/gnupg/TODO.Debian [...] $ </computeroutput><userinput>dpkg -I /var/cache/apt/archives/gnupg_1.4.12-7_amd64.deb</userinput> <computeroutput> 新形式 debian パッケージ、バージョン 2.0。 サイズ 1952176 バイト: コントロールアーカイブ = 3312 バイト。 1449 バイト、 30 行 control 4521 バイト、 65 行 md5sums 479 バイト、 13 行 * postinst #!/bin/sh 473 バイト、 13 行 * preinst #!/bin/sh Package: gnupg Version: 1.4.12-7 Architecture: amd64 Maintainer: Debian GnuPG-Maintainers &lt;pkg-gnupg-maint@lists.alioth.debian.org&gt; Installed-Size: 4627 Depends: libbz2-1.0, libc6 (&gt;= 2.4), libreadline6 (&gt;= 6.0), libusb-0.1-4 (&gt;= 2:0.1.12), zlib1g (&gt;= 1:1.1.4), dpkg (&gt;= 1.15.4) | install-info, gpgv Recommends: libldap-2.4-2 (&gt;= 2.4.7), gnupg-curl Suggests: gnupg-doc, xloadimage | imagemagick | eog, libpcsclite1 Section: utils Priority: important Multi-Arch: foreign Homepage: http://www.gnupg.org Description: GNU privacy guard - a free PGP replacement GnuPG is GNU's tool for secure communication and data storage. It can be used to encrypt data and to create digital signatures. It includes an advanced key management facility and is compliant with the proposed OpenPGP Internet standard as described in RFC 4880. [...]</computeroutput>

source: <emphasis>GOING FURTHER</emphasis> Comparison of versions
de_de: <emphasis>WEITERE SCHRITTE</emphasis> Vergleich von Versionen
es_es: <emphasis>YENDO MÁS ALLÁ</emphasis> Comparación de versiones
it_it: <emphasis>APPROFONDIMENTI</emphasis> Confronto di versioni
ja_jp: <emphasis>GOING FURTHER</emphasis> バージョンの比較
zh_cn: <emphasis>更进一步</emphasis> 版本的对比

source: <primary>version, comparison</primary>
de_de: <primary>Version, Vergleich</primary>
es_es: <primary>versión, comparación</primary>
it_it: <primary>versione, confronto</primary>
ja_jp: <primary>バージョン、比較</primary>
zh_cn: <primary>版本，对比</primary>

source: <primary>comparison of versions</primary>
de_de: <primary>Vergleich von Versionen</primary>
es_es: <primary>comparación de versiones</primary>
it_it: <primary>confronto di versioni</primary>
ja_jp: <primary>バージョンの比較</primary>
zh_cn: <primary>对比版本</primary>

source: Since <command>dpkg</command> is the program for handling Debian packages, it also provides the reference implementation of the logic of comparing version numbers. This is why it has a <literal>--compare-versions</literal> option, usable by external programs (especially configuration scripts executed by <command>dpkg</command> itself). This option requires three parameters: a version number, a comparison operator, and a second version number. The different possible operators are <literal>lt</literal> (strictly less than), <literal>le</literal> (less than or equal to), <literal>eq</literal> (equal), <literal>ne</literal> (not equal), <literal>ge</literal> (greater than or equal to), and <literal>gt</literal> (strictly greater than). If the comparison is correct, <command>dpkg</command> returns 0 (success); if not, it gives a non-zero return value (indicating failure).
ja_jp: <command>dpkg</command> は Debian パッケージを取り扱うプログラムですから、バージョン番号の比較ロジックのリファレンス実装も提供します。このため、<literal>--compare-versions</literal> オプションがあり、外部プログラム (特に <command>dpkg</command> 自身が呼び出す設定スクリプト) が使いやすいようになっています。このオプションは 3 つのパラメータを要求します: バージョン番号、比較演算子、2 番目のバージョン番号です。使える演算子は <literal>lt</literal> (より小さい)、<literal>le</literal> (以下)、<literal>eq</literal> (等しい)、<literal>ne</literal> (等しくない)、<literal>ge</literal> (以上)、<literal>gt</literal> (より大きい) です。比較が正しければ <command>dpkg</command> は 0 (成功) を返します; 間違っていれば、非ゼロ (失敗) を返します。

source: Note the unexpected failure of the last comparison: for <command>dpkg</command>, <literal>pre</literal>, usually denoting a pre-release, has no particular meaning, and this program compares the alphabetic characters in the same way as the numbers (a &lt; b &lt; c ...), in alphabetical order. This is why it considers “<literal>0pre3</literal>” to be greater than “<literal>0</literal>”. When we want a package's version number to indicate that it is a pre-release, we use the tilde character, “<literal>~</literal>”:
ja_jp: 一見 0 (成功) を返すように思われる最後の比較が 1 (失敗) を返した点に注意しましょう: <command>dpkg</command> にとって、通常は事前リリースを意味する <literal>pre</literal> には特別な意味がありません、このプログラムはアルファベット文字を数字と同じ方法で (a &lt; b &lt; c ...)、アルファベット順に、比較します。このため、「<literal>0pre3</literal>」は「<literal>0</literal>」より大きいというわけです。パッケージのバージョン番号に事前リリースであるという意味を持たせたい場合、チルダ文字「<literal>~</literal>」を使ってください。

source: <command>dpkg</command>'s Log File
de_de: <command>dpkg</command>s Protokolldatei
es_es: Archivo de registro de <command>dpkg</command>
it_it: File di registro di <command>dpkg</command>
ja_jp: <command>dpkg</command> のログファイル
zh_cn: <command>dpkg</command>的日志文件

source: <command>dpkg</command> keeps a log of all of its actions in <filename>/var/log/dpkg.log</filename>. This log is extremely verbose, since it details every one of the stages through which packages handled by <command>dpkg</command> go. In addition to offering a way to track dpkg's behavior, it helps, above all, to keep a history of the development of the system: one can find the exact moment when each package has been installed or updated, and this information can be extremely useful in understanding a recent change in behavior. Additionally, all versions being recorded, it is easy to cross-check the information with the <filename>changelog.Debian.gz</filename> for packages in question, or even with online bug reports.
ja_jp: <command>dpkg</command> は <filename>/var/log/dpkg.log</filename> に作業のすべてを記録します。このログは極めて詳細です、なぜなら <command>dpkg</command> がパッケージに対して行った操作の各段階すべてを詳しく記録しているからです。dpkg の挙動を追跡する方法を提供することに加えて、これはシステムの変化の歴史を保存するのに役立ちます: パッケージがインストールされたり更新された正確な日時を探す事が可能ですし、この情報は最近の挙動変化を理解するのに極めて便利です。加えて、すべてのバージョンが記録されていますから、注目しているパッケージの <filename>changelog.Debian.gz</filename> またはオンラインバグ報告と情報を簡単に照合できます。

source: Multi-Arch Support
ja_jp: マルチアーキテクチャサポート

source: <primary>Multi-Arch</primary>
ja_jp: <primary>マルチアーキテクチャ</primary>

source: <primary>architecture</primary><secondary>multi-arch support</secondary>
ja_jp: <primary>アーキテクチャ</primary><secondary>マルチアーキテクチャサポート</secondary>

source: All Debian packages have an <literal>Architecture</literal> field in their control information. This field can contain either “<literal>all</literal>” (for packages that are architecture independent) or the name of the architecture that it targets (like “amd64”, “armhf”, …). In the latter case, by default, <command>dpkg</command> will only accept to install the package if its architecture matches the host's architecture as returned by <command>dpkg --print-architecture</command>.
ja_jp: すべての Debian パッケージは<literal>Architecture</literal> フィールドがあります。このフィールドでは、「<literal>all</literal>」(アーキテクチャに依存しないパッケージ) または対象のアーキテクチャの名前 (「amd64」、「armhf」、…) のどちらか一方を指定します。後者の場合、初期設定では、<command>dpkg</command> は <command>dpkg --print-architecture</command> で返されるホストのアーキテクチャと一致するアーキテクチャ向けのパッケージのインストールだけを受け入れます。

source: This restriction ensures that users do not end up with binaries compiled for an incorrect architecture. Everything would be perfect except that (some) computers can run binaries for multiple architectures, either natively (an “amd64“ system can run “i386” binaries) or through emulators.
ja_jp: この制約は、ユーザが異なるアーキテクチャ向けにコンパイルされたバイナリを使う羽目にならないようにしています。(一部の) コンピュータが複数のアーキテクチャのバイナリを実行できる場合、例えば元から可能な場合(「amd64」システムが「i386」バイナリを実行できる) やエミュレータを介す場合、を除けばこれが理想的です。

source: Enabling Multi-Arch
ja_jp: マルチアーキテクチャの有効化

source: <command>dpkg</command>'s multi-arch support allows users to define “foreign architectures” that can be installed on the current system. This is simply done with <command>dpkg --add-architecture</command> like in the example below. There's a corresponding <command>dpkg --remove-architecture</command> to drop support of a foreign architecture, but it can only be used when no packages of this architecture remain.
ja_jp: <command>dpkg</command> のマルチアーキテクチャサポートのお陰で、ユーザは現在のシステムにインストール可能な「外来アーキテクチャ」を定義できます。これを行うには、以下に示す通り <command>dpkg --add-architecture</command> を使ってください。関連して、<command>dpkg --remove-architecture</command> は外来アーキテクチャのサポートを取り止めますが、取り止めたいアーキテクチャのパッケージが残っていた場合には失敗します。
