Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: <primary>source (package)</primary>
de_de: <primary>Quelle (Paket)</primary>
es_es: <primary>fuente (paquete)</primary>
it_it: <primary>sorgente (pacchetto)</primary>
zh_cn: <primary>源 （软件包）</primary>

source: A source package is usually comprised of three files, a <filename>.dsc</filename>, a <filename>.orig.tar.gz</filename>, and a <filename>.debian.tar.gz</filename> or <filename>.diff.gz</filename>. They allow creation of binary packages (<filename>.deb</filename> files described above) for the program(s) from their source code, written in a programming language.
de_de: Ein Quellpaket besteht normalerweise aus drei Dateien, einer <filename>.dsc</filename>, einer <filename>.orig.tar.gz</filename> und einer <filename>.debian.tar.gz</filename> oder <filename>.diff.gz</filename>. Sie ermöglichen es, aus ihrem Quellcode, der in einer Programmiersprache geschrieben ist, Binärpakete für das oder die Programm(e) zu erstellen (<filename>.deb</filename>-Dateien, wie oben beschrieben).
es_es: Un paquete fuente generalmente consiste de tres archivos: uno <filename>.dsc</filename>, uno <filename>.orig.tar.gz</filename> y uno <filename>.debian.tar.gz</filename> o <filename>.diff.gz</filename>. Ellos permiten la creación de paquetes binarios (<filename>.deb</filename> descriptos anteriormente) de los programas desde su código fuente escrito en un lenguaje de programación.
it_it: Un pacchetto sorgente è normalmente composto da tre file, un <filename>.dsc</filename>, un <filename>.orig.tar.gz</filename> e un <filename>.debian.tar.gz</filename> o <filename>.diff.gz</filename>. Essi permettono la creazione di pacchetti binari (i file <filename>.deb</filename> descritti precedentemente) per uno o più programmi dal loro codice sorgente, scritto in un linguaggio di programmazione.
zh_cn: 源码软件包通常由三个文件组成，一个<filename>.dsc</filename>，一个<filename>.orig.tar.gz</filename>，和一个<filename>.debian.tar.gz</filename>或者<filename>.diff.gz</filename>。它们通过源代码用编程语言创建出二进制软件包（<filename>.deb</filename> 文件如上所述）。

source: The <filename>.dsc</filename> (Debian Source Control) file is a short text file containing an RFC 2822 header (just like the <filename>control</filename> file studied in <xref linkend="section.control" />) which describes the source package and indicates which other files are part thereof. It is signed by its maintainer, which guarantees authenticity. See <xref linkend="sect.package-authentication" /> for further details on this subject.
de_de: Die Datei <filename>.dsc</filename> (Debian Source Control) ist eine kurze Textdatei, die einen RFC 2822 Header enthält (genau wie die in <xref linkend="section.control" /> betrachtete <filename>control</filename>-Datei), der das Quellpaket beschreibt und angibt, welche anderen Dateien dazugehören. Sie ist von ihrem Betreuer signiert, wodurch Authentizität gewährleistet ist. Siehe <xref linkend="sect.package-authentication" /> für weitere Einzelheiten zu diesem Thema.
es_es: El archivo <filename>.dsc</filename> («Debian Source Control»: control de fuente Debian) es un archivo de texto corto que contiene una cabecera RFC 2822 (de la misma forma que el archivo <filename>control</filename> estudiado en la <xref linkend="section.control" />) que describe el paquete fuente e indica qué otros archivos forman parte del mismo. Está firmado por su encargado, lo que garantiza su autenticidad. Revise la <xref linkend="sect.package-authentication" /> para más detalles sobre este tema.
it_it: Il file <filename>.dsc</filename> (Debian Source Control) è un breve file di testo che contiene un'intestazione RFC 2822 (proprio come il file <filename>control</filename> esaminato nella <xref linkend="section.control" />) che descrive il pacchetto sorgente e indica quali altri file ne fanno parte. È firmato dal suo manutentore, il che garantisce la sua autenticità. Vedere la <xref linkend="sect.package-authentication" /> per ulteriori dettagli su questo argomento.
zh_cn: <filename>.dsc</filename> （Debian 源码控制）文件包含了一段RFC 2822的文件头（和<filename>control</filename>文件的<xref linkend= "section.control" />类似），这是一个很短的文本，用来描述源码包和表示其它文件部分，并且有一个维护者签名来保证授权的真实性。参考<xref linkend="sect.package-authentication" /> 对这个条目的更进一步详情。

source: It is important to note here that there is no strong correspondence between the name of the source package and that of the binary packages that they generate. It is easy enough to understand if you know that each source package may generate several binary packages. This is why the <filename>.dsc</filename> file has fields for <literal>Source</literal> and <literal>Binary</literal> to explicitly name the source package and store the list of binary packages that it generates.
de_de: Es ist hier wichtig festzustellen, dass es keine enge Beziehung zwischen dem Namen eines Quellpakets und der daraus erstellten Binärpakete gibt. Dies ist leicht einzusehen, wenn man weiß, dass jedes Quellpaket verschiedene Binärpakete erzeugen kann. Daher hat die <filename>.dsc</filename>-Datei Zeilen für <literal>Source</literal> und <literal>Binary</literal>, um so ausdrücklich das Quellpaket zu nennen und eine Liste von Binärpaketen zu speichern, die es erzeugt.
es_es: Es importante saber que no hay una correspondencia estricta entre el nombre de un paquete fuente y el de los paquetes binarios que genera. Es suficientemente fácil de entender si sabe que cada paquete fuente puede generar varios paquetes binarios. Es por esto que el archivo <filename>.dsc</filename> tiene los campos <literal>Source</literal> y <literal>Binary</literal> para nombrar explícitamente el paquete fuente y almacenar la lista de paquetes binarios que genera, respectivamente.
it_it: È importante notare qui che non c'è una forte corrispondenza tra il nome del pacchetto sorgente e quello dei pacchetti binari che genera. È abbastanza facile da capire se si sa che ogni pacchetto sorgente può generare diversi pacchetti binari. Questo è il motivo per cui il file <filename>.dsc</filename> ha dei campi <literal>Source</literal> e <literal>Binary</literal> per nominare esplicitamente il pacchetto sorgente e memorizzare l'elenco dei pacchetti binari che esso genera.
zh_cn: 非常重要的是，这里要注意的是源码包的名字和它们产生的二进制包有没有强烈的对应关系。这里很容易理解如果你知道每个源码包都可能会产生一些二进制包。这就是为什么<filename>.dsc</filename>文件有一个字段为<literal>源码</literal>和<literal>二进制</literal>来明确命名源码包和存储它所产生的二进制软件包列表。

source: Quite frequently, a source package (for a certain group of programs) can generate several binary packages. The reasons are multiple: a program may often be used in different contexts, so a shared library may be installed to make an application work (for example, <emphasis role="pkg">libc6</emphasis>), or when it can be installed to develop a new program (<emphasis role="pkg">libc6-dev</emphasis> will then be the correct package). We find the same logic for client/server services where we want to install the server part on one machine and the client part on others (this is the case, for example, of <emphasis role="pkg">openssh-server</emphasis> and <emphasis role="pkg">openssh-client</emphasis>).
de_de: Nicht selten kann ein Quellpaket (für eine bestimmte Gruppe von Programmen) verschiedene Binärpakete erzeugen. Die Gründe sind manningfach: häufig kann ein Programm in unterschiedlichen Zusammenhängen verwendet werden. Dann kann eine gemeinsame Bibliothek installiert werden, um eine Anwendung zum Laufen zu bringen (zum Beispiel <emphasis role="pkg">libc6</emphasis>). Oder es wird installiert, um ein neues Programm zu entwickeln (dann wäre <emphasis role="pkg">libc6-dev</emphasis> das richtige Paket). Wir finden den gleichen Gedankengang bei Client/Server-Diensten, bei denen wir den Serverteil auf einem Rechner installieren möchten und den Clientteil auf anderen (dies ist zum Beispiel bei <emphasis role="pkg">openssh-server</emphasis> und <emphasis role="pkg">openssh-client</emphasis> der Fall).
es_es: Frecuentemente un paquete fuente (para un cierto grupo de programas) puede generar varios paquetes binarios. Las razones son múltiples: un programa puede ser utilizado en varios contextos, una biblioteca compartida puede ser instalada para hacer funcionar una aplicación (por ejemplo, <emphasis role="pkg">libc6</emphasis>) o para desarrollar un nuevo programa (<emphasis role="pkg">libc6-dev</emphasis> sería el paquete correcto). Encontramos la misma lógica para servicios cliente/servidor donde deseamos instalar el servidor en una máquina y la parte cliente en otras (este es el caso, por ejemplo, de <emphasis role="pkg">openssh-server</emphasis> y <emphasis role="pkg">openssh-client</emphasis>).
it_it: Piuttosto di frequente, un pacchetto sorgente (per un certo gruppo di programmi) può generare diversi pacchetti binari. Le ragioni sono molteplici: un programma può spesso essere usato in contesti diversi, per cui una libreria condivisa può essere installata per far funzionare un'applicazione (per esempio <emphasis role="pkg">libc6</emphasis>) o può essere installata per sviluppare un nuovo programma (<emphasis role="pkg">libc6-dev</emphasis> sarà allora il pacchetto corretto). La stessa logica si trova per servizi client/server dove la parte server è installata su una macchina e la parte client su altre (questo è il caso, per esempio, di <emphasis role="pkg">openssh-server</emphasis> e di <emphasis role="pkg">openssh-client</emphasis>).
zh_cn: 相当频繁的是，一个源码包（比如一组特定的程序）可以产生一些二进制包。究其原因是多方面的：一个程序可能经常被用在不同的上下文中，因此可能被安装在一个共享库中以供一个应用程序正常运行（比如：<emphasis role="pkg">libc6</emphasis>），或当它安装后又开发了新的程序（<emphasis role="pkg">libc6-dev</emphasis>将会是正确的软件包）。我们安装在一个机器的服务端的部分和客户端的部分会有一些类似的逻辑（这种情况下，比如，<emphasis role="pkg">openssh-server</emphasis> 和<emphasis role="pkg">openssh-client</emphasis>）。

source: Since Debian <emphasis role="distribution">Squeeze</emphasis>, Debian developers have the option to use new formats that correct many problems of the historical format. Format <literal>3.0 (quilt)</literal> can combine multiple upstream archives in the same source package: in addition to the usual <filename>.orig.tar.gz</filename>, supplementary <filename>.orig-<replaceable>component</replaceable>.tar.gz</filename> archives. This is useful with software that are distributed in several upstream components but for which a single source package is desired. These archives can also be compressed with <command>bzip2</command> rather than <command>gzip</command> (<command>lzma</command> and <command>xz</command> are supported by <command>dpkg-source</command> but not accepted into the official archive), which saves disk space and network resources. Finally, the monolithic patch, <filename>.diff.gz</filename> is replaced by a <filename>.debian.tar.gz</filename> archive containing the compiling instructions and a set of upstream patches contributed by the package maintainer. These last are recorded in a format compatible with <command>quilt</command>, a tool that facilitates the management of a series of patches.
de_de: Seit Debian <emphasis role="distribution">Squeeze</emphasis> haben Debianentwickler die Möglichkeit, neue Formate zu verwenden, die zahlreiche Probleme des früheren Formats beheben. Format <literal>3.0 (quilt)</literal> kann mehrere Ursprungsarchive in einem Quellpaket vereinen: zusätzlich zu den üblichen <filename>.orig.tar.gz</filename>-Archiven ergänzende <filename>.orig-<replaceable>komponente</replaceable>.tar.gz</filename>-Archive. Dies ist bei Software hilfreich, die in Form verschiedener Ursprungskomponenten veröffentlicht wird, für die aber ein einzelnes Quellpaket erwünscht ist. Diese Archive können auch mit <command>bzip2</command> komprimiert werden statt mit <command>gzip</command> (<command>lzma</command> und <command>xz</command> werden von <command>dpkg-source</command> unterstützt, aber werden nicht für die offiziellen Archive akzeptiert), wodurch Speicherplatz und Netzwerkressourcen gespart werden. Schließlich wurde der monolithische Patch <filename>.diff.gz</filename> durch ein <filename>.debian.tar.gz</filename>-Archiv ersetzt, das die Kompilierungsanweisungen enthält und einen Satz von Ursprungspatches, die vom Paketbetreuer beigesteuert wurden. Letztere sind in einem Format aufgezeichnet, das mit <command>quilt</command> kompatibel ist, einem Programm, das die Verwaltung einer Reihe von Patches erleichtert.
es_es: Desde Debian <emphasis role="distribution">Squeeze</emphasis>, los desarrolladores Debian tienen la opción de utilizar nuevos formatos que corrigen varios problemas del formato histórico. El formato <literal>3.0 (quilt)</literal> puede combinar varios compendios de origen en el mismo paquete fuente: compendios <filename>.orig-<replaceable>componente</replaceable>.tar.gz</filename> además del <filename>.orig.tar.gz</filename> usual. Esto es útil con el software distribuido desde origen en varios componentes pero para el que se desea sólo un paquete fuente. Estos compendios también puede comprimirse con <command>bzip2</command> en lugar de <command>gzip</command> (<command>dpkg-source</command> acepta también <command>lzma</command> y <command>xz</command> pero no son aceptados en el archivo oficial), lo que ahorra espacio en disco y recursos de red. Finalmente, se reemplaza el parche monolítico <filename>.diff.gz</filename> por un compendio <filename>.debian.tar.gz</filename> que contiene las instrucciones de compilación y un conjunto de parches al origen contribuidos por el desarrollador del paquete. Estos últimos son registrados en un formato compatible con <command>quilt</command>, una herramienta que facilita la gestión de una serie de parches.
it_it: A partire da Debian <emphasis role="distribution">Squeeze</emphasis>, gli sviluppatori Debian hanno l'opzione di usare dei nuovi formati che correggono molti problemi del formato storico. Il formato <literal>3.0 (quilt)</literal> può unire più archivi a monte in uno stesso pacchetto sorgente: in aggiunta al solito <filename>.orig.tar.gz</filename>, archivi supplementari <filename>.orig-<replaceable>componente</replaceable>.tar.gz</filename>. Ciò è utile con software che è distribuito in diversi componenti a monte ma per il quale si desidera un singolo pacchetto sorgente. Questi archivi possono anche essere compressi con <command>bzip2</command> piuttosto che con <command>gzip</command> (<command>lzma</command> e <command>xz</command> sono supportati da <command>dpkg-source</command> ma non accettati nell'archivio ufficiale), il che risparmia spazio su disco e risorse di rete. Infine, la patch monolitica, <filename>.diff.gz</filename>, è sostituito da un archivio <filename>.debian.tar.gz</filename> che contiene le istruzioni di compilazione e un insieme di patch contribuiti dal manutentore del pacchetto. Questi ultimi sono registrati in un formato compatibile con <command>quilt</command>, uno strumento che facilita la gestione di una serie di patch.
zh_cn: 从Debian <emphasis role="distribution">Squeeze</emphasis>开始，Debian的开发人员就可以选择使用新的格式来纠正历史格式的许多问题。<literal>3.0 (quilt)</literal> 可以合并上游多个存档的同一个源码包：除了通常的<filename>.orig.tar.gz</filename>，补充的<filename>.orig-<replaceable>组件</replaceable>.tar.gz</filename>的档案。当一个软件分布在不同的上游组件时，只需要一个单一的源码包，这很有用。这些档案可以被<command>bzip2</command>而非<command>gzip</command>（<command>lzma</command>和<command>xz</command> 都被<command>dpkg-source</command>所支持，但不被官方归档接受。）压缩，从而节省磁盘空间和网络资源。最后，单片的补丁，<filename>.diff.gz</filename>被<filename>.debian.tar.gz</filename>这个归档替代。这个归档包含了编译说明和软件包维护者贡献的一组上游的补丁包。这些都记录在兼容的一种格式<command>quilt</command>里面，这种工具有利于管理一系列的补丁。

source: The <filename>.orig.tar.gz</filename> is an archive containing the source code as provided by the original developer. Debian package maintainers are asked to not modify this archive in order to be able to easily check the source and integrity of the file (by simple comparison with a checksum) and to respect the wishes of some authors.
de_de: <filename>.orig.tar.gz</filename> ist ein Archiv, das den Programm-Quellcode enthält, wie er vom ursprünglichen Entwickler bereitgestellt wurde. Entwickler sind gebeten, dieses Archiv nicht zu verändern, damit es möglich ist, den Ursprung und die Integrität der Datei (durch einen einfachen Vergleich mit einer Prüfsumme) zu kontrollieren, und um die Wünsche mancher Autoren zu berücksichtigen.
es_es: El archivo <filename>.orig.tar.gz</filename> es un compendio que contiene el código fuente como es provisto por el desarrollador original. Se le pide a los encargados de paquetes Debian que no modifiquen este compendio para poder verificar fácilmente el origen e integridad del archivo (comparándolo simplemente con una suma de verificación) y para respetar los deseos de algunos autores.
it_it: Il <filename>.orig.tar.gz</filename> è un archivio che contiene il codice sorgente del programma come fornito dallo sviluppatore originale. Ai manutentori dei pacchetti Debian viene chiesto di non modificare questo archivio in modo da poter facilmente verificare la fonte e l'integrità del file (con un semplice confronto con una somma di controllo) e per rispettare i desideri di alcuni autori.
zh_cn: <filename>.orig.tar.gz</filename>是一种归档包含了最初开发者的源代码。Debian软件包维护者会问要不要修改此存档，以便能够更容易地检查文件的来源和完整性（与校验来简单的比较），并尊重一些作者的意愿。

source: The <filename>.debian.tar.gz</filename> contains all of the modifications made by the Debian maintainer, especially the addition of a <filename>debian</filename> directory containing instructions to execute to construct a Debian package.
de_de: Das <filename>.debian.tar.gz</filename>-Archiv enthält alle vom Debian-Betreuer vorgenommenen Veränderungen, insbesondere auch ein ergänzendes <filename>debian</filename>-Verzeichnis, das Ausführungsanweisungen für die Erstellung eines Debian-Paketes enthält.
es_es: El archivo <filename>.debian.tar.gz</filename> contiene todas las modificaciones realizadas por el desarrollador Debian, especialmente el agregado de un directorio <filename>debian</filename> que contiene las instrucciones para construir un paquete Debian.
it_it: <filename>.debian.tar.gz</filename> contiene tutte le modifiche fatte dal manutentore Debian, specialmente l'aggiunta della directory <filename>debian</filename> che contiene le istruzioni da eseguire per costruire un pacchetto Debian.
zh_cn: <filename>.debian.tar.gz</filename> 包含了Debian维护者的所有修改，特别增加了一个<filename>debian</filename>目录，这个目录包含了要执行的指令用来构建一个Debian软件包

source: If you have a source package, you can use the <command>dpkg-source</command> (from the <emphasis>dpkg-dev</emphasis> package) to decompress it:
de_de: Falls Sie ein Quellpaket haben, können Sie <command>dpkg-source</command> (aus dem <emphasis>dpkg-dev</emphasis>-Paket) benutzen, um es zu entpacken:
es_es: Si tiene un paquete fuente, puede utilizar <command>dpkg-source</command> (del paquete <emphasis>dpkg-dev</emphasis>) para descomprimirlo:
it_it: Avendo un pacchetto sorgente, si può usare <command>dpkg-source</command> (dal pacchetto <emphasis>dpkg-dev</emphasis>) per decomprimerlo:
zh_cn: 如果你有一个源码包，你可以使用<command>dpkg-source</command>(来自<emphasis>dpkg-dev</emphasis>软件包)来解压它

source: <computeroutput>$ </computeroutput><userinput>apt-get source <replaceable>package</replaceable></userinput>
es_es: <computeroutput>$ </computeroutput><userinput>apt-get source <replaceable>paquete</replaceable></userinput>
it_it: <computeroutput>$ </computeroutput><userinput>apt-get source <replaceable>pacchetto</replaceable></userinput>

source: The source package is the foundation of everything in Debian. All Debian packages come from a source package, and each modification in a Debian package is the consequence of a modification made to the source package. The Debian maintainers work with the source package, knowing, however, the consequences of their actions on the binary packages. The fruits of their labors are found, thus, in the source packages available from Debian: you can easily go back and follow everything.
de_de: Das Quellpaket ist die Grundlage für alles in Debian. Alle Debian-Pakete entstammen einem Quellpaket, und jede Veränderung in einem Debian-Paket ist die Folge einer Veränderung in einem Quellpaket. Die Debian-Betreuer arbeiten mit dem Quellpaket, kennen jedoch die Auswirkungen ihrer Handlungen auf die Binärpakete. Die Früchte ihrer Arbeit sind daher in den von Debian bereitgestellten Quellpaketen zu finden: Sie können problemlos zurückgehen und alles verfolgen.
es_es: El paquete fuente es la base de todo en Debian. Todos los paquetes Debian provienen de un paquete fuente y cada modificación en un paquete Debian es la consecuencia de una modificación realizada al paquete fuente. Los desarrolladores Debian trabajan con el paquete fuente sabiendo, sin embargo, las consecuencias de sus acciones en los paquetes binarios. Los frutos de su labor se encuentran, entonces, en los paquetes fuentes disponibles desde Debian: puede volver atrás fácilmente y seguir todo.
it_it: Il pacchetto sorgente è alla base di tutto in Debian. Tutti i pacchetti Debian provengono da un pacchetto sorgente e ogni modifica in un pacchetto Debian è la conseguenza di una modifica fatta al pacchetto sorgente. I manutentori Debian lavorano con i pacchetti sorgenti, conoscendo, però, le conseguenze delle loro azioni sui pacchetti binari. I frutti del loro lavoro si trovano, perciò, nei pacchetti sorgenti disponibili da Debian: si può facilmente tornare indietro e seguire ogni cosa.
zh_cn: 源码包是Debian的基础。所有的Debian软件包都来自源码包，在Debian软件包中每次修改后分发出的源码包。Debian的维护者在为此而努力，维护者修改所产生的二进制包，他们的劳动成果得到尊敬，这些源码包可以你可以从Debian的源里获取：你可以很容易地回去并且继续所有的。

source: When a new version of a package (source package and one or more binary packages) arrives on the Debian server, the source package is the most important. Indeed, it will then be used by a network of machines of different architectures for compilation of the various architectures supported by Debian. The fact that the developer also sends one or more binary packages for a given architecture (usually i386 or amd64) is relatively unimportant, since these could just as well have been automatically generated.
de_de: Wenn eine neue Version eines Pakets (Quellpaket und ein oder mehrere Binärpakete) beim Debian-Server eintrifft, ist das Quellpaket das wichtigste. Es wird dann nämlich von einem Netzwerk aus Rechnern verschiedener Architekturen benutzt, um Kompilierungen für die verschiedenen von Debian unterstützten Architekturen zu erstellen. Die Tatsache, dass der Entwickler auch ein oder mehrere Binärpakete für eine bestimmte Architektur mitschickt (gewöhnlich i386 oder amd64), ist relativ unwichtig, da diese genauso gut automatisch erzeugt worden sein könnten.
es_es: Cuando llega una nueva versión de un paquete (paquete fuente y uno o más paquetes binarios) al servidor Debian, el paquete fuente es el más importante. Será utilizado luego por una red de equipos de diferentes arquitecturas para compilar las diferentes arquitecturas con las que Debian es compatible. El hecho de que los desarrolladores también envíen uno o más paquetes binarios para una arquitectura dada (generalmente i386 o amd64) es de relativamente poca importancia ya que los mismos bien podrían haberse generado automáticamente.
it_it: Quando una nuova versione di un pacchetto (pacchetto sorgente e uno o più pacchetti binari) arriva su un server Debian, il pacchetto sorgente è il più importante. Infatti, sarà usato da una rete di macchine con architetture differenti per la compilazione delle varie architetture supportate da Debian. Il fatto che lo sviluppatore invii anche uno o più pacchetti binari per una data architettura (solitamente i386 o amd64) è relativamente non importante, dal momento che potrebbero anche essere stati generati automaticamente.
zh_cn: 当Debian服务器有新版本的软件包时（源码包或者是二进制包），源码包最重要。实际上，它将被用于通过网络编译的Debian来支持不同的架构，不同的机器。事实上，开发商也针对特定的架构（通常是i386或amd64）来发行一个或者多个二进制包，这其实并不重要，因为它们可以很好地自动生成。
