Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: <command>dpkg</command> is the base command for handling Debian packages on the system. If you have <filename>.deb</filename> packages, it is <command>dpkg</command> that allows installation or analysis of their contents. But this program only has a partial view of the Debian universe: it knows what is installed on the system, and whatever it is given on the command line, but knows nothing of the other available packages. As such, it will fail if a dependency is not met. Tools such as <command>apt-get</command>, on the contrary, will create a list of dependencies to be installed as automatically as possible.
de_de: <command>dpkg</command> ist der Grundbefehl zum Umgang mit Debian-Paketen auf dem System. Falls Sie <filename>.deb</filename>-Pakete haben, ermöglicht <command>dpkg</command> es Ihnen, sie zu installieren oder ihren Inhalt zu analysieren. Aber dieses Programm sieht nur einen begrenzten Ausschnitt des Debian-Universums: es weiß, was auf dem System installiert ist und was auch immer in der Befehlszeile eingegeben wird, aber es weiß nichts von den anderen verfügbaren Paketen. Daher wird es scheitern, wenn eine Abhängigkeit nicht erfüllt ist. Im Gegensatz hierzu werden Programme wie <command>apt-get</command> eine Liste von Abhängigkeiten erstellen, die soweit wie möglich automatisch installiert werden müssen.
es_es: <command>dpkg</command> es el programa base para manejar paquetes Debian en el sistema. Si tiene paquetes <filename>.deb</filename>, <command>dpkg</command> es lo que permite instalar o analizar sus contenidos. Pero este programa sólo tiene una visión parcial del universo Debian: sabe lo que está instalado en el sistema y lo que sea que se le provee en la línea de órdenes, pero no sabe nada más de otros paquetes disponibles. Como tal, fallará si no se satisface una dependencia. Por el contrario, herramientas como <command>apt-get</command> crearán una lista de dependencias a instalar tan automáticamente como les sea posible.
it_it: <command>dpkg</command> è il comando di base per gestire i pacchetti Debian sul sistema. Se si hanno dei pacchetti <filename>.deb</filename>, è <command>dpkg</command> che permette l'installazione o l'analisi del loro contenuto. Ma questo programma ha solo una visione parziale dell'universo Debian: conosce cosa è installato sul sistema e ciò che è dato sulla riga di comando, ma non conosce nulla degli altri pacchetti disponibili. Perciò, fallirà se una dipendenza non è soddisfatta. Strumenti come <command>apt-get</command>, al contrario, creano un elenco di dipendenze da installare il più automaticamente possibile.
zh_cn: <command>dpkg</command>是Debian软件包的基础操作命令。如果你有一个<filename>.deb</filename>软件包，<command>dpkg</command>可以来安装或者是分析它的内容。但是这个程序仅仅只可以看到一些局部的：它知道什么将要安在系统上，不管你在是命令上还是没有可用的软件包的时候。如果不能满足依赖它就会失败。而相反的是<command>apt-get</command>，它会创建一个依赖的列表，并且尽可能的自动安装。

source: <command>dpkg</command> should be seen as a system tool (backend), and <command>apt-get</command> as a tool closer to the user, which overcomes the previous limitations. These tools work together, each one with its particularities, suited to specific tasks.
de_de: <command>dpkg</command> sollte als ein Systemprogramm (backend) angesehen werden und <command>apt-get</command> als ein Programm, das dem Nutzer näher steht und die zuvor erwähnten Einschränkungen überwindet. Diese Programme arbeiten zusammen, jedes mit seinen Besonderheiten und seiner Eignung für bestimmte Aufgaben.
es_es: Se debe ver a <command>dpkg</command> como una herramienta de sistema (tras bambalinas) y <command>apt-get</command> como una herramienta más cerca del usuario que evita las limitaciones anteriores. Estas herramientas trabajan juntas, cada una con sus particularidades, adecuadas para tareas específicas.
it_it: <command>dpkg</command> dovrebbe esere visto come uno strumento di sistema (backend) e <command>apt-get</command> come uno strumento più vicino all'utente, che supera le precedenti limitazioni. Questi strumenti lavorano insieme, ognuno con le proprie peculiarità, adatte a compiti specifici.
zh_cn: <command>dpkg</command> 作为一个系统工具是可见的（backend）,<command>apt-get</command>作为一个工具和使用者联系紧密，它客服了以前的限制,这些工具一起工作，每个工具都有它存在的特殊性，适合特定的任务。

source: <primary>installation</primary><secondary>of packages</secondary>
de_de: <primary>Installation</primary><secondary>von Paketen</secondary>
es_es: <primary>instalación</primary><secondary>de paquetes</secondary>
it_it: <primary>installazione</primary><secondary>di pacchetti</secondary>
zh_cn: <primary>安装</primary><secondary>软件包</secondary>

source: <command>dpkg</command> is, above all, a tool for installing an already available Debian package (because it does not download anything). To do this, we use its <literal>-i</literal> or <literal>--install</literal> option.
de_de: <command>dpkg</command> ist vor allem ein Programm zur Installation eines bereits vorhandenen Debian-Pakets (da es nichts herunterlädt). Hierzu verwenden wir seine Option <literal>-i</literal> oder <literal>--install</literal>.
es_es: <command>dpkg</command> es, sobre todo, una herramienta para instalar un paquete Debian ya disponible (porque no descarga nada). Para hacer esto utilizamos su opción <literal>-i</literal> o <literal>--install</literal>.
it_it: <command>dpkg</command> è, soprattutto, uno strumento per installare un pacchetto Debian già disponibile (perché non scarica niente). Per fare ciò, si usa la sua opzione <literal>-i</literal> oppure <literal>--install</literal>.
zh_cn: <command>dpkg</command>总起来讲，它就是一个工具用来安装已经可用的Debian软件包（因为它不下载任何东西）。要做到这一点，我们使用它的<literal>-i</literal>或者是<literal>--install</literal>选项。

source: If you are not careful, the use of an option <literal>--force-*</literal> can lead to a system where the APT family of commands will refuse to function. In effect, some of these options allow installation of a package when a dependency is not met, or when there is a conflict. The result is an inconsistent system from the point of view of dependencies, and the APT commands will refuse to execute any action unless the action enables it to return the system to a consistent state (this often consists of installing the missing dependency or removing a problematic package). This often results in a message like this one, obtained after installing a new version of <emphasis role="pkg">rdesktop</emphasis> while ignoring its dependency on a newer version of the <emphasis role="pkg">libc6</emphasis>:
de_de: Falls Sie nicht vorsichtig sind, kann der Gebrauch einer der <literal>--force-*</literal>-Optionen zu einem System führen, bei dem die APT-Befehlsfamilie nicht mehr funktioniert. In der Tat erlauben es einige dieser Optionen, ein Paket zu installieren, obwohl eine Abhängigkeit nicht erfüllt ist, oder wenn ein Konflikt vorliegt. Das Ergebnis ist ein aus Sicht der Abhängigkeiten inkonsistentes System, und die APT-Befehle werden sich weigern, irgendeine Aktion auszuführen, es sei denn, dass diese Aktion es ihnen ermöglicht, das System wieder in einen konsistenten Zustand zurückzuführen (dies besteht oft darin, dass die fehlende Abhängigkeit installiert oder ein problematisches Paket entfernt wird). Häufig führt dies zu einer Meldung wie der folgenden, die angezeigt wurde, nachdem eine neue Version von <emphasis role="pkg">rdesktop</emphasis> installiert und dabei seine Abhängigkeit von einer neueren Version von <emphasis role="pkg">libc6</emphasis> ignoriert wurde:
es_es: Si no es cuidadoso, utilizar una opción <literal>--force-*</literal> puede llevar a un sistema en el que la familia de programas APT se negarán a funcionar. De hecho, algunas de estas opciones permitirán instalar un paquete cuando no se cumple una de sus dependencias o cuando existe un conflicto. El resultado será un sistema inconsistente desde el punto de vista de dependencias y los programas APT se negarán a efectuar cualquier acción que no le permite devolver el sistema a un estado consistente (que generalmente consiste en instalar la dependencia faltante o eliminar un paquete problemático). Esto resulta en mensajes como el siguiente, obtenido luego de instalar una nueva versión de <emphasis role="pjg">rdesktop</emphasis> ignorando su dependencia en una nueva versión de <emphasis role="pkg">libc6</emphasis>:
it_it: Se non si presta attenzione, l'uso di un'opzione <literal>--force-*</literal> può condurre a un sistema in cui la famiglia di comandi APT si rifiuterà di funzionare. Infatti, alcune di queste opzioni permettono l'installazione di un pacchetto quando una dipendenza non è soddisfatta o quando c'è un conflitto. Il risultato è un sistema non coerente dal punto di vista delle dipendenze e i comandi APT si rifiuteranno di eseguire qualsiasi azione a meno che l'azione non permetta di tornare a uno stato coerente (questo spesso consiste nell'installazione della dipendenza mancante o nella rimozione di un pacchetto problematico). Questo spesso risulta in un messaggio come il seguente, ottenuto dopo l'installazione di una nuova versione di <emphasis role="pkg">rdesktop</emphasis> ignorando la sua dipendenza da una nuova versione di <emphasis role="pkg">libc6</emphasis>:
zh_cn: 如果你不小心，使用了<literal>--force-*</literal>的一个选项，这可能会导致系统的APT系列的命令失效。实际上，其中一些选项允许安装软件包的时候忽略这些依赖，或者是当有冲突的时候忽略掉。这个结果从依赖性的角度来看会导致一个不一致的系统，而APT命令将拒绝执行任何操作，除非系统恢复到一致性的状态（这通常包括安装缺少的依赖，或者是删除掉有问题的软件包）。通常这样会导致这样的结果，安装一个新版本的<emphasis role="pkg">rdesktop</emphasis>时将忽略掉和<emphasis role="pkg">libc6</emphasis>之间的依赖性。

source: This manipulation is an ugly hack, and should never be used, except in the most extreme case of necessity. Quite frequently, a more fitting solution is to recompile the package that's causing the problem (see <xref linkend="sect.rebuilding-package" />) or use a new version (potentially corrected) from a site such as <literal>backports.debian.org</literal> (see <xref linkend="section.backports" />).
de_de: Diese Manipulation ist ein hässlicher Hack und sollte niemals benutzt werden, oder doch nur im äußersten Notfall. Häufig besteht eine bessere Lösung darin, das Paket, das das Problem verursacht, neu zu kompilieren (siehe <xref linkend="sect.rebuilding-package" />) oder eine neue (möglicherweise korrigierte) Version von einer Seite wie <literal>backports.debian.org</literal> zu verwenden (siehe <xref linkend="section.backports" />).
es_es: Esta manipulación es un atajo desagradable y no debería ser utilizado nunca excepto en los casos de más extrema necesidad. Muy frecuentemente, recompilar el paquete que está causando el problema (revise la <xref linkend="sect.rebuilding-package" />) o utilizar una nueva verión (potencialmente corregida) de un sitio como <literal>backports.debian.org</literal> (revise la <xref linkend="section.backports" />) son soluciones más adecuadas.
it_it: Questa manipolazione è una «porcheria» e non dovrebbe esser fatta, eccetto nei casi più estremi di necessità. Piuttosto di frequente, una soluzione più adatta è di ricompilare il pacchetto che sta causando il problema (consultare la <xref linkend="sect.rebuilding-package" />) o usare una nuova versione (potenzialmente corretta) da un sito come <literal>backports.debian.org</literal> (consultare la <xref linkend="section.backports" />).
zh_cn: 这种操作的方式像一个丑陋的黑客，绝不应该被使用，除非在最极端的情况下你必须要这样。相当频繁的是，一个更合适的解决方案是重新编译有问题的软件包（参见 <xref linkend="sect.rebuilding-package" />）或者是使用一个从<literal>backports.debian.org</literal>（参见<xref linkend="section.backports" />）网站获取的新版本（可能会纠正这个问题）。

source: Invoking <command>dpkg</command> with the <literal>-r</literal> or <literal>--remove</literal> option, followed by the name of a package, removes that package. This removal is, however, not complete: all of the configuration files and scripts, log files (system logs) and other user data handled by the package remain. The reason for keeping them is to disable the program by uninstalling it, while preserving the option to reinstall it quickly and with the same configurations. To completely remove everything associated with a package, use the <literal>-P</literal> or <literal>--purge</literal> option, followed by the package name.
de_de: Der Aufruf von <command>dpkg</command> mit der Option <literal>-r</literal> oder <literal>--remove</literal>, gefolgt von dem Paketnamen, entfernt das Paket. Dieses Entfernen ist jedoch nicht vollständig: alle Konfigurationsdateien und -skripte, Protokolldateien (Systemprotokolle) und andere vom Paket verarbeitete Nutzerdaten bleiben zurück. Sie werden zurückbehalten, um einerseits das Programm durch seine Deinstallation zu deaktivieren, andererseits aber die Option zu erhalten, es schnell und in derselben Konfiguration wieder zu installieren. Um alles, was mit einem Paket in Zusammenhang steht, vollständig zu entfernen, verwenden Sie die Option <literal>-P</literal> oder <literal>--purge</literal>, gefolgt von dem Paketnamen.
es_es: Ejecutar <command>dpkg</command> con la opción <literal>-r</literal> o <literal>--remove</literal> seguida del nombre de un paquete eliminará dicho paquete. Esta eliminación, sin embargo, no es completa: se mantendrán todos los archivos de configuración, scripts, archivos de registros (registros de sistema) y otros datos de usuarios que gestiona el paquete. La razón para mantenerlos es desactivar el programa al desinstalarlo pero preservando la opción de reinstalarlo rápidamente y con las mismas configuraciones. Para eliminar completamente todo lo asociado con un paquete, utilice la opción <literal>-P</literal> o <literal>--purge</literal> seguida del nombre del paquete.
it_it: Invocare <command>dpkg</command> con l'opzione <literal>-r</literal> o <literal>--remove</literal> seguita dal nome del pacchetto, rimuove tale pacchetto. Questa rimozione, comunque, non è completa: rimangono tutti i file di configurazione e gli script, i file di registro (registri di sistema) e altri dati dell'utente gestiti dal pacchetto. La ragione della loro conservazione è di disabilitare il programma disinstallandolo, preservando allo stesso tempo l'opzione di reinstallarlo velocemente e con la stessa configurazione. Per rimuovere completamente ogni cosa associata al pacchetto, usare l'opzione <literal>-P</literal> o <literal>--purge</literal> seguita dal nome del pacchetto.
zh_cn: 调用<command>dpkg</command>的<literal>-r</literal>或<literal>--remove</literal>选项，然后根据软件包的名字，删除掉这个软件包。这样删除是不完整的：所有的配置文件和脚本，日志文件（系统日志）和其他的软件包交互的数据都会被保留。保存这些文件的理由是禁止程序卸载掉它，以便在重新安装的时候很迅速，并且有相同的配置。要完全移除掉和一个软件包相关联的一切，请使用<literal>-P</literal>或<literal>-purge</literal>选项，后面跟随软件包名。

source: Other <command>dpkg</command> Features
de_de: Andere <command>dpkg</command>-Merkmale
es_es: Otras características de <command>dpkg</command>
it_it: Altre funzionalità di <command>dpkg</command>
zh_cn: 其他的<command>dpkg</command>特性

source: Most options are available in the “long” version (one or more relevant words, preceded by a double dash) or a “short” version (a single letter, often the initial of one word from the long version, and preceded by a single dash). This convention is so common that it is a POSIX standard. <indexterm><primary>POSIX</primary></indexterm> <indexterm><primary>option</primary><secondary>POSIX</secondary></indexterm>
de_de: Die meisten Optionen gibt es sowohl in einer „langen“ Version (ein oder mehrere einschlägige Wörter mit einem vorangestellten doppelten Gedankenstrich) als auch in einer „kurzen“ Version (ein einzelner Buchstabe, häufig der Anfangsbuchstabe einer der Wörter der langen Version, mit einem einzelnen vorangestellten Gedankenstrich). Dieser Grundsatz ist so sehr verbreitet, dass er ein POSIX-Standard ist. <indexterm><primary>POSIX</primary></indexterm> <indexterm><primary>Option</primary><secondary>POSIX</secondary></indexterm>
es_es: La mayoría de las opciones se encuentran disponibles en versión «larga» (una o más palabras relevantes precedidas por doble guión) o en versión «corta» (una única letra, normalmente la primera de las letras de la versión larga, y precedida por un único guión). Esta convención es tan común que constituye un estándar POSIX. <indexterm><primary>POSIX</primary></indexterm> <indexterm><primary>opción</primary><secondary>POSIX</secondary></indexterm>
it_it: La maggior parte delle opzioni è disponibile nella versione «lunga» (una o più parole precedute da due trattini) o nella versione «corta» (una singola lettera, spesso l'iniziale di una parola della versione lunga, preceduta da un singolo trattino). Questa convenzione è così comune che è uno standard POSIX. <indexterm><primary>POSIX</primary></indexterm> <indexterm><primary>opzione</primary><secondary>POSIX</secondary></indexterm>
zh_cn: 大多数选项都在“长”的版本里面（一个或者多个相关的词，前面加两个中短线‘--’）或者是一个“短”的版本（一个字母，这个字母通常来自于长版本的词，前面用一个中短线来表示‘-’）。这个约定是POSIX的标准风格。<indexterm><primary>POSIX</primary></indexterm> <indexterm><primary>选项</primary><secondary>POSIX</secondary></indexterm>

source: Before concluding this section, we note that some <command>dpkg</command> options may query the internal database in order to obtain information. Giving first the long options and then corresponding short options (that will evidently take the same possible arguments) we cite <literal>--listfiles <replaceable>package</replaceable></literal> (or <literal>-L</literal>), which lists the files installed by this package; <literal>--search <replaceable>file</replaceable></literal> (or <literal>-S</literal>), which finds the package from which the file comes; <literal>--status <replaceable>package</replaceable></literal> (or <literal>-s</literal>), which displays the headers of an installed package; <literal>--list</literal> (or <literal>-l</literal>), which displays the list of packages known to the system and their installation status; <literal>--contents <replaceable>file.deb</replaceable></literal> (or <literal>-c</literal>), which lists the files in the Debian package specified; <literal>--info<replaceable> file.deb </replaceable></literal> (or <literal>-I</literal>), which displays the headers of the Debian package.
de_de: Bevor wir dieses Kapitel abschließen, möchten wir noch anmerken, dass einige <command>dpkg</command>-Optionen die interne Datenbank abfragen, um Informationen zu erhalten. Wir führen hierzu folgende Beispiele zunächst in der langen Version und dann der entsprechenden kurzen Version (die natürlich dieselben Parameter haben kann) an: <literal>--listfiles <replaceable>paket</replaceable></literal> (oder <literal>-L</literal>), listet die von diesem Paket installierten Dateien auf; <literal>--search <replaceable>datei</replaceable></literal> (oder <literal>-S</literal>), stellt das Paket fest, aus dem die Datei stammt; <literal>--status <replaceable>paket</replaceable></literal> (oder <literal>-s</literal>), zeigt die Kopfzeilen eines installierten Pakets an; <literal>--list</literal> (oder <literal>-l</literal>), zeigt eine Liste der Pakete an, die dem System bekannt sind, und ihren Installationsstatus; <literal>--contents <replaceable>datei.deb</replaceable></literal> (oder <literal>-c</literal>), führt die in dem genannten Debian-Paket enthaltenen Dateien auf; <literal>--info<replaceable> datei.deb </replaceable></literal> (oder <literal>-I</literal>), zeigt die Kopfzeilen des Debian-Pakets an.
es_es: Antes de finalizar esta sección, resaltaremos que algunas opciones de <command>dpkg</command> pueden consultar la base de datos internas para obtener información. Daremos primero las opciones en su versión larga y luego la versión corta correspondiente (que evidentemente aceptarán los mismos parámetros posibles) de las opciones: <literal>--listfiles <replaceable>paquete</replaceable></literal> (o <literal>-L</literal>), que listará los archivos instalados por este paquete; <literal>--search <replaceable>archivo</replaceable></literal> (o <literal>-S</literal>), que encontrará el paquete del que proviene el archivo; <literal>--status <replaceable>paquete</replaceable></literal> (o <literal>-s</literal>), que mostrará las cabeceras de un paquete instalado; <literal>--list</literal> (o <literal>-l</literal>), que mostrará la lista de paquetes conocidos por el sistema y su estado de instalación; <literal>--contents <replaceable>archivo.deb</replaceable></literal> (o <literal>-c</literal>), que listará los archivos en el paquete Debian especificado; <literal>--info <replaceable>archivo.deb</replaceable></literal> (o <literal>-I</literal>), que mostrará las cabeceras del paquete Debian.
it_it: Prima di concludere questa sezione, si noti che alcune opzioni di <command>dpkg</command> possono interrogare il database interno per ottenere informazioni. Mostrando prima le opzioni lunghe e poi le corrispondenti opzioni corte (che evidentemente accettano i soliti argomenti) we cite <literal>--listfiles <replaceable>pacchetto</replaceable></literal> (o <literal>-L</literal>), che elenca i file installati da questo pacchetto; <literal>--search <replaceable>file</replaceable></literal> (o <literal>-S</literal>), che trova il pacchetto da cui proviene il file; <literal>--status <replaceable>pacchetto</replaceable></literal> (o <literal>-s</literal>), che mostra le intestazioni di un pacchetto installato; <literal>--list</literal> (o <literal>-l</literal>), che mostra l'elenco dei pacchetti conosciuti dal sistema e il loro stato di installazione; <literal>--contents <replaceable>file.deb</replaceable></literal> (o <literal>-c</literal>), che elenca i file nel pacchetto Debian specificato; <literal>--info<replaceable> file.deb </replaceable></literal> (o <literal>-I</literal>), che mostra le intestazioni del pacchetto Debian.
zh_cn: 本节结束前，我们注意到，一些<command>dpkg</command>选项可以查询内部的数据库以便获得信息。第一个长的选项，然后是对应的短的选项（显然它们采取的参数是相同的），我们列举<literal>--listfiles <replaceable>软件包</replaceable></literal>（或<literal>-L</literal>），这会列出这个软件包安装的文件；<literal>--search <replaceable>file</replaceable></literal> （或<literal>-S</literal>），这会查找软件包从哪些文件来；<literal>--status <replaceable>软件包</replaceable></literal>（或<literal>-s</literal>）,这会显示已安装的软件包的头字段；<literal>--list</literal> （或<literal>-l</literal>），这会显示系统中已知的软件包的列表和它们的安装状态；<literal>--contents <replaceable>file.deb</replaceable></literal> （或<literal>-c</literal>）,这会列出指定的Debian软件包的文件信息；<literal>--info<replaceable> file.deb </replaceable></literal> （或<literal>-I</literal>），这会显示Debian软件包的头字段。
