Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: These options apply to <command>dpkg</command>, but most of the time the administrator will work directly with the <command>aptitude</command> or <command>apt-get</command> programs. It is, thus, necessary to know the syntax used to indicate the options to pass to the <command>dpkg</command> command (their command line interfaces are very similar).
de_de: Diese Optionen gelten für <command>dpkg</command>, aber meistens wird der Administrator direkt mit den Programmen <command>aptitude</command> oder <command>apt-get</command> arbeiten. Es ist daher erforderlich, die Syntax zu kennen, die zur Bezeichnung der Optionen verwendet wird, die an <command>dpkg</command> weitergeleitet werden (ihre Befehlszeilen-Schnittstellen sind sehr ähnlich).
es_es: Estas opciones sólo son válidas para <command>dpkg</command>, pero la mayor parte del tiempo el administrador trabajará directamente con los programas <command>aptitude</command> o <command>apt-get</command>. Es, por lo tanto, necesario saber la sintaxis necesaria para indicar las opciones a pasar a <command>dpkg</command> (sus opciones son muy similares).
it_it: Queste opzioni si applicano a <command>dpkg</command>, ma la maggior parte del tempo l'amministratore lavorerà direttamente con i programmi <command>aptitude</command> o <command>apt-get</command>. È, perciò, necessario conoscere la sintassi usata per indicare le opzioni da passare al comando <command>dpkg</command> (le loro interfacce da riga di comando sono molto simili).
ja_jp: これらは <command>dpkg</command> ののオプションですが、ほとんどの場合管理者は <command>aptitude</command> または <command>apt-get</command> プログラムを使って作業を行います。そのため、<command>dpkg</command> コマンドにオプションを渡すための構文を知らなければいけません (両者のコマンドラインインターフェースはとてもよく似ています)。
zh_cn: 这些选项使用<command>dpkg</command>，但是大多数时间管理员会直接用<command>aptitude</command> 或<command>apt-get</command>。实际上，有必要知道dpkg的语法参数来使用<command>dpkg</command>命令（命令行的界面是非常相似的）。

source: These options can be stored directly in <command>apt</command>'s configuration. To do so, simply write the following line in the <filename>/etc/apt/apt.conf.d/local</filename> file:
ja_jp: これらのオプションを直接 <command>apt</command> の設定に保存しておく事も可能です。これを行うには、<filename>/etc/apt/apt.conf.d/local</filename> ファイルに以下の行を追加してください:

source: Including this option in the configuration file means that it will also be used in a graphical interface such as <command>aptitude</command>.
ja_jp: 設定ファイルにこのオプションを含めることは、<command>aptitude</command> のようなグラフィカルインターフェースでもこのオプションを使う事を意味しています。

source: <emphasis>GOING FURTHER</emphasis> Force dpkg to ask configuration file questions
de_de: <emphasis>WEITERE SCHRITTE</emphasis> Zwinge dpkg, Fragen zur Konfigurationsdatei zu stellen
es_es: <emphasis>YENDO MÁS ALLÁ</emphasis> Obligando a dpkg a preguntar sobre los archivos de configuración
it_it: <emphasis>APPROFONDIMENTI</emphasis> Obbligare dpkg a porre le domande del file di configurazione
ja_jp: <emphasis>GOING FURTHER</emphasis> 設定ファイルに関連する質問を強制する
zh_cn: <emphasis>更进一步</emphasis> 强制dpkg询问配置文件问题

source: The <command>--force-confask</command> option requires <command>dpkg</command> to display the questions about the configuration files, even in cases where they would not normally be necessary. Thus, when reinstalling a package with this option, <command>dpkg</command> will ask the questions again for all of the configuration files modified by the administrator. This is very convenient, especially for reinstalling the original configuration file if it has been deleted and no other copy is available: a normal re-installation won't work, because <command>dpkg</command> considers removal as a form of legitimate modification, and, thus, doesn't install the desired configuration file.
ja_jp: <command>--force-confask</command> オプションを使うと、<command>dpkg</command> は通常は質問の必要がない場合でも設定ファイルに関する質問を表示します。このため、このオプションを付けてパッケージを再インストールすると、<command>dpkg</command> は管理者が修正したすべての設定ファイルに関して再度質問します。これはとくに設定ファイルが削除され、コピーも残っていない状態でオリジナルの設定ファイルを再インストールしたい場合にとても便利です: 通常の再インストールではダメな場合にこれを使います。なぜなら、<command>dpkg</command> は削除を合理的な変更の一種と考えており、オリジナルの設定ファイルをインストールしないからです。

source: Structure of a Source Package
de_de: Struktur eines Quellpakets
es_es: Estructura de un paquete fuente
it_it: Struttura di un pacchetto sorgente
ja_jp: ソースパッケージの構造
zh_cn: 源软件包的结构

source: <primary>package</primary><secondary>source package</secondary>
de_de: <primary>Paket</primary><secondary>Quellpaket</secondary>
es_es: <primary>paquete</primary><secondary>fuente</secondary>
it_it: <primary>pacchetto</primary><secondary>pacchetto sorgente</secondary>
ja_jp: <primary>パッケージ</primary><secondary>ソースパッケージ</secondary>
zh_cn: <primary>软件包</primary><secondary>源软件包</secondary>

source: <primary>source</primary><secondary>package</secondary>
ja_jp: <primary>ソース</primary><secondary>パッケージ</secondary>

source: Format
es_es: Formato
it_it: Formato
ja_jp: フォーマット
zh_cn: 格式

source: <primary>DSC file</primary>
de_de: <primary>DSC-Datei</primary>
es_es: <primary>archivo DSC</primary>
it_it: <primary>file DSC</primary>
ja_jp: <primary>DSC ファイル</primary>
zh_cn: <primary>DSC 文件</primary>

source: <primary><filename>diff.gz</filename> file</primary>
de_de: <primary><filename>diff.gz</filename>-Datei</primary>
es_es: <primary>archivo <filename>diff.gz</filename></primary>
ja_jp: <primary><filename>diff.gz</filename> ファイル</primary>
zh_cn: <primary><filename>diff.gz</filename> 文件</primary>

source: <primary><filename>debian.tar.gz</filename> file</primary>
ja_jp: <primary><filename>debian.tar.gz</filename> ファイル</primary>

source: <primary><filename>orig.tar.gz</filename> file</primary>
ja_jp: <primary><filename>orig.tar.gz</filename> ファイル</primary>

source: A source package is usually comprised of three files, a <filename>.dsc</filename>, a <filename>.orig.tar.gz</filename>, and a <filename>.debian.tar.gz</filename> (or <filename>.diff.gz</filename>). They allow creation of binary packages (<filename>.deb</filename> files described above) from the source code files of the program, which are written in a programming language.
ja_jp: ソースパッケージは通常 <filename>.dsc</filename>、<filename>.orig.tar.gz</filename>、<filename>.debian.tar.gz</filename> (または <filename>.diff.gz</filename>) の 3 つのファイルで構成されています。これらのファイルを使って、プログラミング言語で書かれたプログラムのソースコードファイルからバイナリパッケージ (上で説明した <filename>.deb</filename> ファイル) を作成します。

source: The <filename>.dsc</filename> (Debian Source Control) file is a short text file containing an RFC 2822 header (just like the <filename>control</filename> file studied in <xref linkend="sect.control" />) which describes the source package and indicates which other files are part thereof. It is signed by its maintainer, which guarantees authenticity. See <xref linkend="sect.package-authentication" /> for further details on this subject.
ja_jp: <filename>.dsc</filename> (Debian Source Control) ファイルは RFC 2822 ヘッダを含む短いテキストファイル (<xref linkend="sect.control" />で述べた <filename>control</filename> ファイルと似ています) で、ソースパッケージを説明し、他のどのファイルがパッケージ一部であるかを表明しています。メンテナはこのファイルを署名することで、信頼性を保証しています。より詳しい情報は<xref linkend="sect.package-authentication" />をご覧ください。

source: A <filename>.dsc</filename> file
de_de: Eine <filename>.dsc</filename>-Datei
es_es: Un archivo <filename>.dsc</filename>
it_it: Un file <filename>.dsc</filename>
ja_jp: <filename>.dsc</filename> ファイルの一例
zh_cn: 一个<filename>.dsc</filename> 文件

source: <primary><literal>Build-Depends</literal>, header field</primary>
de_de: <primary><literal>Build-Depends</literal>, Kopfzeile</primary>
es_es: <primary><literal>Build-Depends</literal>, campo de cabecera</primary>
it_it: <primary><literal>Build-Depends</literal>, campo dell'intestazione</primary>
ja_jp: <primary><literal>Build-Depends</literal>、ヘッダフィールド</primary>
zh_cn: <primary><literal>编译-依赖</literal>，头字段</primary>

source: Note that the source package also has dependencies (<literal>Build-Depends</literal>) completely distinct from those of binary packages, since they indicate tools required to compile the software in question and construct its binary package.
de_de: Beachten Sie, dass das Quellpaket ebenfalls Abhängigkeiten (<literal>Build-Depends</literal>) hat, die jedoch mit denen der Binärpakete nichts gemein haben, da sie die Programme benennen, die erforderlich sind, um die betreffende Software zu kompilieren und sein Binärpaket zu erstellen.
es_es: Note que el paquete fuente también tiene dependencias (<literal>Build-Depends</literal>) completamente distintas de aquellas del paquete binario ya que indican las herramientas necesarias para compilar el software en cuestión y construir su paquete binario.
it_it: Notare che anche il pacchetto sorgente ha delle dipendenze (<literal>Build-Depends</literal>) completamente distinte da quelle del pacchetto binario, dal momento che indicano gli strumenti richiesti per compilare il software in questione e costruire il suo pacchetto binario.
ja_jp: ソースパッケージはまた依存関係 (<literal>Build-Depends</literal>) を持っていることに注意してください。依存関係の意味は、バイナリパッケージのそれとは全く異なり、このソフトウェアをコンパイルしてバイナリパッケージを作るのに必要なツールを表しています。
zh_cn: 需要注意的是从二进制包编译出来的源码包也完全不同，它也有依赖关系（<literal>编译-依赖</literal>），因为它们需要编译器来编译和构建它们的源码包。

source: <emphasis>CAUTION</emphasis> Distinct namespaces
de_de: <emphasis>VORSICHT</emphasis> Unterschiedliche Namensräume
es_es: <emphasis>PRECAUCIÓN</emphasis> Espacios de nombres distintos
it_it: <emphasis>ATTENZIONE</emphasis> Spazi di nomi distinti
ja_jp: <emphasis>CAUTION</emphasis> 異なる名前空間
zh_cn: <emphasis>当心</emphasis> 不同的命名空间

source: It is important to note here that there is no required correspondence between the name of the source package and that of the binary package(s) that it generates. It is easy enough to understand if you know that each source package may generate several binary packages. This is why the <filename>.dsc</filename> file has the <literal>Source</literal> and <literal>Binary</literal> fields to explicitly name the source package and store the list of binary packages that it generates.
ja_jp: ここで、ソースパッケージの名前とバイナリパッケージの名前を一致させる必要がないという点によく注意してください。単一のソースパッケージが複数のバイナリパッケージを生成している事を知ったら、これはすぐに理解できるでしょう。このため <filename>.dsc</filename> ファイルはソースパッケージを明確に名付けて、生成されるバイナリパッケージのリストを保存するために <literal>Source</literal> と <literal>Binary</literal> フィールドを持っています。

source: <emphasis>CULTURE</emphasis> Why divide into several packages
de_de: <emphasis>KULTUR</emphasis> Warum in mehrere Pakete aufteilen
es_es: <emphasis>CULTURA</emphasis> Porqué dividir en varios paquetes
it_it: <emphasis>CULTURA</emphasis> Perché dividere in diversi pacchetti
ja_jp: <emphasis>CULTURE</emphasis> 複数のパッケージに分割する理由
zh_cn: <emphasis>文化</emphasis> 为什么要分成几个软件包

source: Quite frequently, a source package (for a given software) can generate several binary packages. The split is justified by the possibility to use (parts of) the software in different contexts. Consider a shared library, it may be installed to make an application work (for example, <emphasis role="pkg">libc6</emphasis>), or it can be installed to develop a new program (<emphasis role="pkg">libc6-dev</emphasis> will then be the correct package). We find the same logic for client/server services where we want to install the server part on one machine and the client part on others (this is the case, for example, of <emphasis role="pkg">openssh-server</emphasis> and <emphasis role="pkg">openssh-client</emphasis>).
ja_jp: (単独のソフトウェアの) ソースパッケージから複数のバイナリパッケージが作られるのは極めてよくある事です。ソフトウェアの分割は、ソフトウェアが異なる状況下で使われる可能性がある場合に、正当化されます。共有ライブラリについて考えてみましょう。これは (例えば、<emphasis role="pkg">libc6</emphasis> は) アプリケーションを動作させるためにインストールされる場合もあれば、新しいプログラムを開発するためにインストールされる場合もあります (開発する場合は <emphasis role="pkg">libc6-dev</emphasis> が適切です)。クライアント/サーバサービスに対しても同じ事が言えます。あるマシンにはサーバ部分を、別のマシンにはクライアント部分をインストールしたい (例えば <emphasis role="pkg">openssh-server</emphasis> と <emphasis role="pkg">openssh-client</emphasis> がこの場合に相当します) 事もあるでしょう。

source: Just as frequently, the documentation is provided in a dedicated package: the user may install it independently from the software, and may at any time choose to remove it to save disk space. Additionally, this also saves disk space on the Debian mirrors, since the documentation package will be shared amongst all of the architectures (instead of having the documentation duplicated in the packages for each architecture).
de_de: Genauso oft wird die Dokumentation in einem speziell dafür vorgesehenen Paket bereitgestellt: der Nutzer kann es unabhängig von der Software installieren und sich jederzeit dazu entschließen, es zu entfernen, um Speicherplatz zu sparen. Darüberhinaus spart dies auch Speicherplatz auf den Debian Spiegelservern, da alle Dokumentationspakete von allen Architekturen gemeinsam benutzt werden (anstatt die Dokumentation mehrfach in den Paketen jeder Architektur zu haben).
es_es: Tan frecuentemente también se provee la documentación en un paquete dedicado: el usuario puede instalarla independientemente del software y puede elegir eliminarla en cualquier momento para ahorrar espacio en disco. Adicionalmente, esto también ahorra espacio en disco en las réplicas Debian ya que todas las arquitecturas comparten los paquetes de documentación (en lugar de tener la documentación duplicada en los paquetes para cada arquitectura).
it_it: Altrettanto di frequente, la documentazione è fornita in un pacchetto dedicato: l'utente può installarla indipendentemente dal software e può in qualsiasi momento scegliere di rimuoverla per risparmiare spazio su disco. Inoltre, ciò risparmia spazio su disco anche sui mirror di Debian, dal momento che il pacchetto con la documentazione sarà condiviso tra tutte le architetture (invece di avere la documentazione duplicata nei pacchetti per ogni architettura).
ja_jp: 同じくらいの頻度で、文書は専用のパッケージで提供される事が多いです: ユーザは文書とソフトウェアを別々にインストールしたいかもしれませんし、ディスク領域を節約するために文書を削除したいと考えるかもしれません。加えて、こうすることで Debian ミラーのディスク領域も節約できます。なぜなら、文書パッケージはすべてのアーキテクチャで (各アーキテクチャ向けのパッケージ毎に文書の複製を持つ代わりに) 共有されるからです。
zh_cn: 一样频繁的是，在一个专用的软件包提供的文档中：用户可以安装独立的软件，并且可以在任何时候选择删除掉以节省磁盘空间。此外，这也节省了Debian镜像的磁盘空间，因为在所有的节点中（而不是在每个节点的都用一样的文档软件包）将共享这个文档软件包。

source: <emphasis>PERSPECTIVE</emphasis> Different source package formats
de_de: <emphasis>AUSBLICK</emphasis> Verschiedene Quellpaket-Formate
es_es: <emphasis>PERSPECTIVA</emphasis> Diferentes formatos de paquetes fuente
it_it: <emphasis>IN PROSPETTIVA</emphasis> Differenti formati di pacchetti sorgenti
ja_jp: <emphasis>PERSPECTIVE</emphasis> 様々なソースパッケージのフォーマット
zh_cn: <emphasis>洞察</emphasis>不同格式的源码包

source: Originally there was only one source package format. This is the <literal>1.0</literal> format, which associates an <filename>.orig.tar.gz</filename> archive to a <filename>.diff.gz</filename> “debianization” patch (there is also a variant, consisting of a single <filename>.tar.gz</filename> archive, which is automatically used if no <filename>.orig.tar.gz</filename> is available).
de_de: Ursprünglich gab es nur ein Quellpaket-Format. Dies ist das <literal>1.0</literal>-Format, das ein <filename>.orig.tar.gz</filename>-Archiv einem <filename>.diff.gz</filename>-„Debianisierungspatch“ zuordnet (es gibt auch eine Variante, die aus einem einzeln <filename>.tar.gz</filename>-Archiv besteht, das automatisch verwendet wird, wenn kein <filename>.orig.tar.gz</filename> verfügbar ist).
es_es: Originalmente sólo existía un formato de paquete fuente. Este es el formato <literal>1.0</literal> que asocia un compendio <filename>.orig.tar.gz</filename> con un parche de «debianización» <filename>.diff.gz</filename> (también hay una variante que consiste de un simple compendio <filename>.tar.gz</filename>, utilizada automáticamente si hay disponible un archivo <filename>.orig.tar.gz</filename>).
it_it: Inizialmente c'era un solo formato per i pacchetti sorgenti. È il formato <literal>1.0</literal> che associa un archivio <filename>.orig.tar.gz</filename> a una patch <filename>.diff.gz</filename> di «debianizzazione» (c'è anche una variante che consiste di un singolo archivio <filename>.tar.gz</filename> che è usato automaticamente se non c'è alcun <filename>.orig.tar.gz</filename> disponibile).
ja_jp: もともとソースパッケージのフォーマットは 1 種類だけでした。これが <literal>1.0</literal> フォーマットで、<filename>.orig.tar.gz</filename> アーカイブを <filename>.diff.gz</filename> 「debianization」パッチで結合します (このフォーマットには亜種があります。これは単独の <filename>.tar.gz</filename> アーカイブを含んでおり、<filename>.orig.tar.gz</filename> が無ければこのアーカイブが使われます)。
zh_cn: 本来只有一个原始的软件包格式，像<literal>1.0</literal>这样的格式，它关联了<filename>.orig.tar.gz</filename>和<filename>.diff.gz</filename>“Debian化”的补丁（还有一个变种，由一个单一的<filename>.tar.gz</filename>归档，当<filename>.orig.tar.gz</filename>不可用时它会自动使用。）

source: Since Debian <emphasis role="distribution">Squeeze</emphasis>, Debian developers have the option to use new formats that correct many problems of the historical format. Format <literal>3.0 (quilt)</literal> can combine multiple upstream archives in the same source package: in addition to the usual <filename>.orig.tar.gz</filename>, supplementary <filename>.orig-<replaceable>component</replaceable>.tar.gz</filename> archives can be included. This is useful with software that are distributed in several upstream components but for which a single source package is desired. These archives can also be compressed with <command>bzip2</command> or <command>xz</command> rather than <command>gzip</command> (<command>lzma</command> is also supported by <command>dpkg-source</command> but not accepted into the official archive), which saves disk space and network resources. Finally, the monolithic patch, <filename>.diff.gz</filename> is replaced by a <filename>.debian.tar.gz</filename> archive containing the compiling instructions and a set of upstream patches contributed by the package maintainer. These last are recorded in a format compatible with <command>quilt</command> — a tool that facilitates the management of a series of patches.
ja_jp: Debian <emphasis role="distribution">Squeeze</emphasis> 以降、Debian 開発者は新しいフォーマットを使う事ができるようになりました。このフォーマットは昔使われていたフォーマットにあった多くの問題を修正しています。フォーマット <literal>3.0 (quilt)</literal> は複数の上流開発アーカイブを同じソースパッケージの中に混ぜ合わせる事が可能になりました: いつもの <filename>.orig.tar.gz</filename> に加えて、補足用の <filename>.orig-<replaceable>component</replaceable>.tar.gz</filename> アーカイブを含める事が可能です。これは単独のソースパッケージが望まれるソフトウェアが複数の上流開発元によって配布されている場合に便利です。これらのアーカイブは <command>gzip</command> の代わりに <command>bzip2</command> または <command>xz</command> を使って圧縮できます (<command>dpkg-source</command> は <command>lzma</command> もサポートしていますが、公式アーカイブでは認められません)。これらの圧縮方式はディスク領域とネットワークリソースを節約できます。最後に、単独のパッチ <filename>.diff.gz</filename> はコンパイル方法、パッケージメンテナが作った上流開発に対するパッチ群が納められた <filename>.debian.tar.gz</filename> アーカイブに置き換えられました。最後のファイルはパッチ群を楽に管理するツール <command>quilt</command> と互換性のあるフォーマットで記録されます。

source: The <filename>.orig.tar.gz</filename> file is an archive containing the source code as provided by the original developer. Debian package maintainers are asked to not modify this archive in order to be able to easily check the origin and integrity of the file (by simple comparison with a checksum) and to respect the wishes of some authors.
ja_jp: <filename>.orig.tar.gz</filename> ファイルはオリジナルの開発者が提供するソースコードを含むアーカイブです。Debian パッケージメンテナは、ファイルの出所と整合性を簡単に (チェックサムによる単純な比較で) 確認できるようにするために、さらに一部の作者からの希望を尊重するために、アーカイブを変更しない事を要求されました。

source: The <filename>.debian.tar.gz</filename> contains all of the modifications made by the Debian maintainer, especially the addition of a <filename>debian</filename> directory containing the instructions to execute to construct a Debian package.
ja_jp: <filename>.debian.tar.gz</filename> には Debian メンテナが行ったすべての変更、特に Debian パッケージを作成する際に実行される命令を収めた <filename>debian</filename> ディレクトリの追加、が含まれています。

source: <emphasis>TOOL</emphasis> Decompressing a source package
de_de: <emphasis>HILFSPROGRAMM</emphasis> Ein Quellpaket entpacken
es_es: <emphasis>HERRAMIENTA</emphasis> Descomprimiendo un paquete fuente
it_it: <emphasis>STRUMENTO</emphasis> Decomprimere un pacchetto sorgente
ja_jp: <emphasis>TOOL</emphasis> ソースパッケージの展開
zh_cn: <emphasis>工具</emphasis> 解压缩源码包

source: <primary>decompressing, source package</primary>
ja_jp: <primary>展開、ソースパッケージ</primary>

source: <primary>uncompressing, source package</primary>
ja_jp: <primary>解凍、ソースパッケージ</primary>

source: <primary>unpacking</primary><secondary>source package</secondary>
ja_jp: <primary>解凍</primary><secondary>ソースパッケージの</secondary>

source: If you have a source package, you can use the <command>dpkg-source</command> command (from the <emphasis>dpkg-dev</emphasis> package) to decompress it:
ja_jp: ソースパッケージを持っていれば、(<emphasis>dpkg-dev</emphasis> パッケージに含まれる) <command>dpkg-source</command> コマンドを使ってソースパッケージを展開できます:

source: You can also use <command>apt-get</command> to download a source package and unpack it right away. It requires that the appropriate <emphasis>deb-src</emphasis> lines be present in the <filename>/etc/apt/sources.list</filename> file, however (for further details, see <xref linkend="sect.apt-sources.list" />). These are used to list the “sources” of source packages (meaning the servers on which a group of source packages are hosted).
de_de: Sie können auch <command>apt-get</command> dazu benutzen, ein Quellpaket herunterzuladen und direkt zu entpacken. Hierzu ist es jedoch erforderlich, dass die entsprechenden <emphasis>deb-src</emphasis>-Zeilen in der Datei <filename>/etc/apt/sources.list</filename> vorhanden sind (für weitere Einzelheiten siehe <xref linkend="sect.apt-sources.list" />). Diese dienen dazu, die „Quellen“ der Quellpakete aufzulisten (das heißt, die Server, die eine Gruppe von Quellpaketen beherbergen).
es_es: También puede utilizar <command>apt-get</command> para descargar un paquete fuente y descomprimirlo inmediatamente. Necesita, sin embargo, que las líneas <emphasis>deb-src</emphasis> apropiadas estén presentes en el archivo <filename>/etc/apt/sources.list</filename> (para maś detalles, revise la <xref linkend="sect.apt-sources.list" />). Éstas son utilizadas para listar los orígenes de los paquetes fuente (los servidores en los que se encuentran un grupo de paquetes fuente).
it_it: Si può anche usare <command>apt-get</command> per scaricare un pacchetto sorgente e scompattarlo immediatamente. È richiesto che le appropriate righe <emphasis>deb-src</emphasis> siano presenti nel file <filename>/etc/apt/sources.list</filename> (per ulteriori dettagli vedere la <xref linkend="sect.apt-sources.list" />). Esse sono usate per elencare le «fonti» di un pacchetto sorgente (intendendo i server sui quali è ospitato un gruppo di pacchetti sorgenti).
ja_jp: <command>apt-get</command> を使えば、ソースパッケージをダウンロードしてすぐに解凍する事も可能です。しかしながら、これを行うには、適切な <emphasis>deb-src</emphasis> 行が <filename>/etc/apt/sources.list</filename> ファイルに書かれていなければいけません (より詳しい情報は <xref linkend="sect.apt-sources.list" /> を参照してください)。この行はソースパッケージの「ソース」(ソースパッケージがホストされているサーバ群) を表すために使われます。
zh_cn: 你也可以使用<command>apt-get</command>来下载一个源码包并正确的把它解压。它需要合适的<emphasis>deb-src</emphasis>在<filename>/etc/apt/sources.list</filename>文件中，但是（进一步详细的说，请参阅<xref linkend="sect.apt-sources.list" />）。这些都使用了列出来的“源”的源码包（即服务器中有一组被托管的源码包。）

source: Usage within Debian
de_de: Verwendung innerhalb von Debian
es_es: Utilización dentro de Debian
it_it: Uso con Debian
ja_jp: Debian 内の使い方
zh_cn: Debian中的使用

source: The source package is the foundation of everything in Debian. All Debian packages come from a source package, and each modification in a Debian package is the consequence of a modification made to the source package. The Debian maintainers work with the source package, knowing, however, the consequences of their actions on the binary packages. The fruits of their labors are thus found in the source packages available from Debian: you can easily go back to them and everything stems from them.
ja_jp: ソースパッケージは Debian のすべての基礎です。すべての Debian パッケージはソースパッケージから作られ、Debian パッケージに対する変更はソースパッケージを変更することで行われます。しかしながら、Debian メンテナはバイナリパッケージに対する活動の結果を理解しているため、ソースパッケージを使って作業を行っています。そんなわけで、彼らの労苦の成果は Debian から入手できるソースパッケージの中にあります: 簡単にソースパッケージに戻り、すべてをソースパッケージから生成する事も可能です。
