Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: Let us discuss the first case in greater detail with an example: all mail servers, such as <emphasis role="pkg">postfix</emphasis> or <emphasis role="pkg">sendmail</emphasis> are said to “provide” the <emphasis role="pkg">mail-transport-agent</emphasis> virtual package. Thus, any package that needs this service to be functional (e.g. a mailing list manager, such as <emphasis role="pkg">smartlist</emphasis> or <emphasis role="pkg">sympa</emphasis>) simply states in its dependencies that it requires a <emphasis role="pkg">mail-transport-agent</emphasis> instead of specifying a large yet incomplete list of possible solutions (e.g. <command>postfix | sendmail | exim | …</command>). Furthermore, it is useless to install two mail servers on the same machine, which is why each of these packages declares a conflict with the <emphasis role="pkg">mail-transport-agent</emphasis> virtual package. The conflict with itself is ignored by the system, but this technique will prohibit the installation of two mail servers side by side.
de_de: Lassen Sie uns den ersten Fall anhand eines Beispiels ausführlicher erörtern: alle Mailserver, wie <emphasis role="pkg">postfix</emphasis> oder <emphasis role="pkg">sendmail</emphasis>, „stellen“ angeblich das virtuelle Paket <emphasis role="pkg">mail-transport-agent</emphasis> „bereit“. Daher erklärt jedes Paket, das diesen Service benötigt, um funktionsfähig zu sein (z. B. Mailinglisten-Manager wie <emphasis role="pkg">smartlist</emphasis> oder <emphasis role="pkg">sympa</emphasis>), in seinen Abhängigkeiten einfach, dass es einen <emphasis role="pkg">mail-transport-agent</emphasis> benötigt, anstatt eine lange, jedoch unvollständige Liste möglicher Lösungen aufzustellen (z. B. <command>postfix | sendmail | exim | …</command>). Außerdem wäre es sinnlos, zwei Mailserver auf demselben Rechner zu installieren, weshalb jedes dieser Pakete einen Konflikt mit dem virtuellen Paket <emphasis role="pkg">mail-transport-agent</emphasis> angibt. Der Konflikt mit sich selbst wird vom System ignoriert, jedoch verhindert dieses Verfahren. dass zwei Mailserver nebeneinander installiert werden.
es_es: Discutamos con más detalles el primer caso con un ejemplo: se dice que todos los servicios de correo, como <emphasis role="pkg">postfix</emphasis> o <emphasis role="pkg">sendmail</emphasis> «proveen» el paquete virtual <emphasis role="pkg">mail-transport-agent</emphasis>. Por lo tanto, cualquier paquete que necesite este servicio para funcionar (por ejemplo, un gestor de listas de correo como <emphasis role="pkg">smartlist</emphasis> o <emphasis role="pkg">sympa</emphasis>) simplemente indican en sus dependencias que requieren de <emphasis role="pkg">mail-transport-agent</emphasis> en lugar de especificar una lista larga y aún incompleta de posibles soluciones (por ejemplo <command>postfix | sendmail | exim | ...</command>). Lo que es más, es inútil instalar dos servidores de correo en el mismo equipo, por lo que cada uno de estos paquetes declara un conflicto con el paquete virtual <emphasis role="pkg">mail-transport-agent</emphasis>. El conflicto con sí mismo es ignorado por el sistema, pero esta técnica prohibirá la instalación de dos servidores de correo simultáneamente.
it_it: Il primo caso può essere discusso nei dettagli con un esempio: si dice che tutti server di posta come <emphasis role="pkg">postfix</emphasis> o <emphasis role="pkg">sendmail</emphasis> «forniscono» il pacchetto virtuale <emphasis role="pkg">mail-transport-agent</emphasis>. Perciò, ogni pacchetto che abbia bisogno di questo servizio per funzionare (es. un gestore di mailing list come <emphasis role="pkg">smartlist</emphasis> o <emphasis role="pkg">sympa</emphasis>) semplicemente dichiara nelle proprie dipendenze di richiedere <emphasis role="pkg">mail-transport-agent</emphasis> invece di specificare un elenco lungo e, nonostante ciò, incompleto di possibili soluzioni (es. <command>postfix | sendmail | exim | …</command>). Inoltre è inutile installare due server di posta sulla stessa macchina, questo è il motivo per cui ognuno di tali pacchetti dichiara un conflitto con il pacchetto virtuale <emphasis role="pkg">mail-transport-agent</emphasis>. Il conflitto di un pacchetto con sé stesso viene ignorato dal sistema, ma questa tecnica proibisce l'installazione contemporanea di due server di posta.
zh_cn: 让我们讨论更详细的例子：所有的邮件服务器，比如<emphasis role="pkg">postfix</emphasis>或者 <emphasis role="pkg">sendmail</emphasis> 都说可以“提供”<emphasis role="pkg">邮件传输代理</emphasis>的虚软件包。因此，任何需要此服务功能的软件包（例如 邮件列表管理器，比如<emphasis role="pkg">smartlist</emphasis>或者是<emphasis role="pkg">sympa</emphasis>）的这些单一状态的依赖关系,需要<emphasis role="pkg">邮件传输代理</emphasis>来代替指定一个庞大但不完整的可能的解决方案列表（如<command>postfix | sendmail | exim | ...</command>）。此外，安装两个邮件服务器在一个机器上是没用的，这就是为什么这些软件包会声明一个冲突在<emphasis role="pkg">邮件传输代理</emphasis>的虚拟软件包中。系统本身会忽略这个冲突，但是这种技术会禁止两个邮件服务器的同时安装。

source: For virtual packages to be useful, everyone must agree on their name. This is why they are standardized in the Debian Policy. The list includes among others <emphasis role="pkg">mail-transport-agent</emphasis> for mail servers, <emphasis role="pkg">c-compiler</emphasis> for C programming language compilers, <emphasis role="pkg">www-browser</emphasis> for web browsers, <emphasis role="pkg">httpd</emphasis> for web servers, <emphasis role="pkg">ftp-server</emphasis> for FTP servers, <emphasis role="pkg">x-terminal-emulator</emphasis> for terminal emulators in graphical mode (<command>xterm</command> ), and <emphasis role="pkg">x-window-manager</emphasis> for window managers.
de_de: Damit virtuelle Pakete brauchbar sind, müssen alle sich über ihre Namen einig sein. Daher sind diese in den Debian-Richtlinien standardisiert. Die Liste enthält unter anderem <emphasis role="pkg">mail-transport-agent</emphasis> für Mailserver, <emphasis role="pkg">c-compiler</emphasis> für Kompilierer der Programmiersprache C, <emphasis role="pkg">www-browser</emphasis> für Webbrowser, <emphasis role="pkg">httpd</emphasis> für Webserver, <emphasis role="pkg">ftp-server</emphasis> für FTP-Server, <emphasis role="pkg">x-terminal-emulator</emphasis> für Terminal-Emulatoren im Grafikmodus (<command>xterm</command>) und <emphasis role="pkg">x-window-manager</emphasis> für Fenstermanager.
es_es: Para que un paquete virtual sea útil, todos deben estar de acuerdo en su nombre. Es porque eso que están estandarizados en la Normativa Debian. Esta lista incluye, entre otros, <emphasis role="pkg">mail-transport-agent</emphasis> para servidores de correo, <emphasis role="pkg">c-compiler</emphasis> para compiladores del lenguaje de programación C, <emphasis role="pkg">www-browser</emphasis> para navegadores web, <emphasis role="pkg">httpd</emphasis> para servidores web, <emphasis role="pkg">ftp-server</emphasis> para servidores FTP, <emphasis role="pkg">x-terminal-emulator</emphasis> para emuladores de terminal en modo gráfico (<command>xterm</command>) y <emphasis role="pkg">x-window-manager</emphasis> para gestores de ventanas.
it_it: Perché i pacchetti virtuali siano utili, tutti devono concordare sul loro nome. Questo è il motivo per cui sono standardizzati nella Policy Debian. L'elenco include tra gli altri <emphasis role="pkg">mail-transport-agent</emphasis> per i server di posta, <emphasis role="pkg">c-compiler</emphasis> per i compilatori del linguaggio di programmazione C, <emphasis role="pkg">www-browser</emphasis> per i browser web, <emphasis role="pkg">httpd</emphasis> per i server web, <emphasis role="pkg">ftp-server</emphasis> per i server FTP, <emphasis role="pkg">x-terminal-emulator</emphasis> per gli emulatori di terminale in modalità grafica (<command>xterm</command>) e <emphasis role="pkg">x-window-manager</emphasis> per i window manager.
zh_cn: 对于虚拟软件包有用的是，每个人都必须同意它们的名字。这就是为什么他们制定Debian政策的标准化。这个列表包括了<emphasis role="pkg">邮件传输代理</emphasis>的邮件服务器，<emphasis role="pkg">C-编译器</emphasis>的C编程语言的编译器，<emphasis role="pkg">www-浏览器</emphasis>的网页浏览器，<emphasis role="pkg">httpd</emphasis>的web服务器，<emphasis role="pkg">ftp-server</emphasis>的FTP服务器，<emphasis role="pkg">x-终端模拟器</emphasis>的图形界面的终端模拟器(<command>xterm</command>),和<emphasis role="pkg">X窗口管理器</emphasis>的窗口管理器。

source: The full list can be found on the Web, at <ulink type="block" url="http://www.debian.org/doc/packaging-manuals/virtual-package-names-list.txt" />
de_de: Die vollständige Liste ist im Internet unter der URL <ulink type="block" url="http://www.debian.org/doc/packaging-manuals/virtual-package-names-list.txt" /> zu sehen.
es_es: Puede encontrar la lista completa en la web, en <ulink type="block" url="http://www.debian.org/doc/packaging-manuals/virtual-package-names-list.txt" />
it_it: L'elenco completo si può trovare sul Web, all'indirizzo <ulink type="block" url="http://www.debian.org/doc/packaging-manuals/virtual-package-names-list.txt" />
zh_cn: 完整的列表在互联网上，地址是<ulink type="block" url="http://www.debian.org/doc/packaging-manuals/virtual-package-names-list.txt" />

source: The <literal>Provides</literal> field is again interesting when the content of a package is included in a larger package. For example, the <emphasis role="pkg">libdigest-md5-perl</emphasis> Perl module was an optional module in Perl 5.6, and has been integrated as standard in Perl 5.8 (and later versions, such as 5.10 present in <emphasis role="distribution">Squeeze</emphasis>). As such, the package <emphasis role="pkg">perl</emphasis> has since version 5.8 declared <literal>Provides: libdigest-md5-perl</literal> so that the dependencies on this package are met if the user has Perl 5.8 or 5.10. The <emphasis role="pkg">libdigest-md5-perl</emphasis> package itself has eventually been deleted, since it no longer had any purpose when old Perl versions were removed.
de_de: Die <literal>Provides</literal>-Zeile ist dagegen von Interesse, wenn der Inhalt eines Pakets in einem größeren Paket enthalten ist. So war zum Beispiel das Perl-Modul <emphasis role="pkg">libdigest-md5-perl</emphasis> ein optionales Modul in Perl 5.6 und ist als Standard in Perl 5.8 (und späteren Versionen wie der aktuellen Version 5.10 in <emphasis role="distribution">Squeeze</emphasis>) integriert worden. Daher gibt das Paket <emphasis role="pkg">perl</emphasis> seit der Version 5.8 <literal>Provides: libdigest-md5-perl</literal> an, so dass die Abhängigkeiten dieses Pakets erfüllt sind, falls der Nutzer Perl 5.8 oder 5.10 hat. Das Paket <emphasis role="pkg">libdigest-md5-perl</emphasis> selbst ist irgendwann gelöscht worden, da es keinen weiteren Nutzen mehr hatte, nachdem alte Perl-Versionen entfernt worden waren.
es_es: El campo <literal>Provides</literal> es nuevamente interesante cuando se incluye el contenido del paquete en un paquete más grande. Por ejemplo, el módulo Perl <emphasis role="pkg">libdigest-md5-perl</emphasis> era un módulo opcional en Perl 5.6 y fue integrado como estándar en Perl 5.8 (y versiones siguientes, como 5.10 que está presente en <emphasis role="distribution">Squeeze</emphasis>). Como tal, el paquete <emphasis role="pkg">perl</emphasis> desde su versión 5.8 declara <literal>Provides: libdigest-md5-perl</literal> para que se cumplan las dependencias de este paquete si el usuario tiene Perl 5.8 o 5.10. El paquete <emphasis role="pkg">libdigest-md5-perl</emphasis> en sí fue eventualmente eliminado ya que no tenía propósito cuando las versiones antiguas de Perl fueron retiradas.
it_it: Il campo <literal>Provides</literal> è interessante anche quando il contenuto di un pacchetto è incluso in un pacchetto più grande. Per esempio, il modulo Perl <emphasis role="pkg">libdigest-md5-perl</emphasis> era un modulo opzionale in Perl 5.6 ed è stato integrato come standard in Perl 5.8 (e in versioni successive, come la 5.10 presente in <emphasis role="distribution">Squeeze</emphasis>). Perciò, dalla versione 5.8 il pacchetto <emphasis role="pkg">perl</emphasis> ha dichiarato <literal>Provides: libdigest-md5-perl</literal> così che le dipendenze da questo pacchetto sono soddisfate se l'utente ha Perl 5.8 o 5.10. Il pacchetto <emphasis role="pkg">libdigest-md5-perl</emphasis> vero e proprio è stato infine eliminato dal momento che non aveva più alcuno scopo quando le vecchie versioni di Perl sono state rimosse.
zh_cn: <literal>预备</literal>字段又是有趣的，当一个软件包的内容包含在另一个更大的软件包。例如<emphasis role="pkg">libdigest-md5-perl</emphasis>的Perl模块是Perl5.6中的一个可选的模块，并已整合到Perl5.8（或更高的版本，比如目前的5.10，在<emphasis role="pkg">Squeeze</emphasis>）的标准中。因此，软件包<emphasis role="pkg">PERL</emphasis>的5.8版本后，如果用户拥有Perl5.8或Perl5.10，都申明了<literal>预备:libdigest-md5-perl</literal>以便满足这个软件包的依赖关系。当老的Perl版本删除的时候，libdigest-md5-perl软件包没有存在的目的的时候，<emphasis role="pkg">libdigest-md5-perl</emphasis>软件包本身最终会被删除。

source: Virtual packages suffer from some troubling limitations, the most significant of which being the absence of a version number. To return to the previous example, a dependency such as <literal>Depends: libdigest-md5-perl (&gt;= 1.6)</literal>, despite the presence of Perl 5.10, will never be considered as satisfied by the packaging system — while in fact it most likely is satisfied. Unaware of this, the package system chooses the least risky option, assuming that the versions do not match.
de_de: Virtuelle Pakete leiden an einigen störenden Einschränkungen, von denen die wichtigste das Fehlen einer Versionsnummer ist. Um zum vorhergehenden Beispiel zurückzukehren: eine Abhängigkeit wie <literal>Depends: libdigest-md5-perl (&gt;= 1.6)</literal> wird trotz der Anwesenheit von Perl 5.10 von der Paketverwaltung niemals als erfüllt angesehen werden - obwohl sie in Wirklichkeit höchstwahrscheinlich erfüllt ist. In Unkenntnis dieser Tatsache wählt die Paketverwaltung die risikoärmste Option und geht davon aus, dass die Versionen nicht übereinstimmen.
es_es: Los paquetes virtuales sufren de algunas limitaciones problemáticas, la más importante de ellas es la ausencia de un número de versión. Volviendo al ejemplo anterior, una dependencia como <literal>Depends: libdigest-md5-perl (&gt;= 1.6)</literal> nunca será considerada como satisfecha aún en presencia de Perl 5.10 — cuando de hecho es altamente probable que esté satisfecha. Sin conocimientos de esto el sistema de paquetes selecciona la opción menos riesgosa y asume que las versiones no coinciden.
it_it: I pacchetti virtuali soffrono di alcune limitazioni problematiche, la più significativa delle quali è l'assenza di un numero di versione. Per tornare all'esempio precedente, una dipendenza come <literal>Depends: libdigest-md5-perl (&gt;= 1.6)</literal>, nonostante la presenza di Perl 5.10, non sarà mai considerata soddisfatta dal sistema dei pacchetti, mentre in realtà molto probabilmente è soddisfatta. Inconsapevole di ciò, il sistema dei pacchetti sceglie l'opzione meno rischiosa supponendo che le versioni non coincidano.
zh_cn: 虚拟软件包受到了一些令人不安的限制，最明显的就是在一个版本号下。返回前面的例子中，一个依赖关系<literal>依赖：libdigest-md5-perl (大于等于1.6)</literal>,尽管Perl 5.10已经存在了，但这绝不会被视为满足软件包系统的依赖 — 但其实它最有可能被满足。意识到这一点的话，软件包系统在版本号不匹配的情况下会选择风险最小的选项。

source: In the <emphasis role="pkg">apt</emphasis> example above, we can see the presence of a field that we have not yet described, the <literal>Tag</literal> field. This field does not describe a relationship between packages, but is simply a way of categorizing a package in a thematic taxonomy. This classification of packages according to several criteria (type of interface, programming language, domain of application, etc.) is a recent development in Debian. For this purpose, it is not yet integrated in all of its tools; <command>aptitude</command> displays these tags, and allows them to be used as search criteria. For those who are repelled by <command>aptitude</command>'s search criteria, the following site allows navigation of the tag database:<ulink type="block" url="http://debtags.alioth.debian.org/" />
de_de: In obenstehendem <emphasis role="pkg">apt</emphasis>-Beispiel sehen wir eine Zeile, die wir noch nicht erläutert haben: die <literal>Tag</literal>-Zeile. Diese Zeile beschreibt keine Beziehung zwischen Paketen, sondern ist eine einfache Möglichkeit, ein Paket in einer thematischen Taxonomie zu kategorisieren. Diese Einordnung von Paketen aufgrund verschiedener Kriterien (Art der Schnittstelle, Programmiersprache, Verwendungsbereich usw.) ist eine neuere Entwicklung in Debian. Für diesen Zweck ist es noch nicht in allen Hilfsprogrammen integriert; <command>aptitude</command> zeigt diese Kennzeichnungen an und erlaubt es, sie als Suchkriterien zu verwenden. Für diejenigen, denen <command>aptitude</command>s Suchkriterien nicht gefallen, ermöglicht folgende Seite das Durchsuchen der Kennzeichen-Datenbank: <ulink type="block" url="http://debtags.alioth.debian.org/" />
es_es: En el ejemplo anterior de <emphasis role="pkg">apt</emphasis> podemos ver la presencia de un campo que no hemos descripto todavía, el campo <literal>Tag</literal>. Este campo no describe la relación entre paquetes sino que es una forma simple de categorizar un paquete en una taxonomía temática. Esta clasificación de paquetes es según varios criterios (tipos de interfaz, lenguaje de programación, dominio de la aplicación, etc.) es un desarrollo reciente de Debian. Por esto no está integrado aún en todas sus herramientas; <command>aptitude</command> muestra estas etiquetas y permite utilizarlas como criterio de búsqueda. Para aquellos que evitan los criterios de búsqueda de <command>aptitude</command>, el siguiente sitio le permite navegar por la base de datos de etiquetas: <ulink type="block" url="http://debtags.alioth.debian.org/" />
it_it: Nell'esempio precedente su <emphasis role="pkg">apt</emphasis>, si può vedere la presenza di un campo che non è stato ancora descritto, il campo <literal>Tag</literal>. Questo campo non descrive una relazione tra pacchetti, ma è semplicemente un modo per categorizzare un pacchetto in una tassonomia tematica. Questa classificazione di pacchetti secondo diversi criteri (tipo di interfaccia, linguaggio di programmazione, campo di applicazione, ecc.) è uno sviluppo recente in Debian. Per questo scopo, non è ancora integrato in tutti i suoi strumenti; <command>aptitude</command> mostra queste etichette e permette di usarle come criteri di ricerca. Per coloro che provano repulsione verso i criteri di ricerca di <command>aptitude</command>, il seguente sito permette la navigazione del database delle etichette: <ulink type="block" url="http://debtags.alioth.debian.org/" />
zh_cn: 在上述的<emphasis role="pkg">apt</emphasis>的例子中，我们可以看到标签字段还没有被描述，<literal>标签</literal>字段的存在。该字段不描述软件包之间的关系，它仅仅是一个软件包专题分类方式。这种根据一些标准的程序包的分类（类型接口，编程语言，域名申请等）在Debian里是一个新的技术。为了这个目的，它目前还没有集成在下面这些工具中;<command>aptitude</command>显示这些标签，并允许它们被用作搜索条件。对于那些被排斥的<command>aptitude</command>的搜索条件，以下站点允许标签数据库的导航：<ulink type="block" url="http://debtags.alioth.debian.org/"/>

source: <emphasis>GOING FURTHER</emphasis> <command>dpkg</command> data directory
de_de: <emphasis>WEITERE SCHRITTE</emphasis> <command>dpkg</command>-Datenverzeichnis
es_es: <emphasis>YENDO MÁS ALLÁ</emphasis> Directorio de datos de <command>dpkg</command>
it_it: <emphasis>APPROFONDIMENTI</emphasis> La directory dei dati di <command>dpkg</command>
zh_cn: <emphasis>更进一步</emphasis><command>dpkg</command> 数据目录

source: <command>dpkg</command> will update the configuration files, asking the user to decide if it is unable to automatically manage this task. The details of this procedure are discussed in <xref linkend="section.conffiles" />.
de_de: <command>dpkg</command> aktualisiert dann die Konfigurationsdateien, wobei es den Nutzer auffordert, Entscheidungen zu treffen, falls es diese Aufgabe nicht selbsttätig erledigen kann. Die Einzelheiten dieses Vorgangs sind in <xref linkend="section.conffiles" /> erläutert.
es_es: <command>dpkg</command> actualizará los archivos de configuración, pidiéndole al usuario que decida si no es capaz de administrar esta tarea automáticamente. Los detalles de este proceso son discutidos en la <xref linkend="section.conffiles" />.
it_it: <command>dpkg</command> aggiornerà i file di configurazione chiedendo all'utente di decidere se non è in grado di gestire automaticamente questo compito. I dettagli di questa procedura sono discussi nella <xref linkend="section.conffiles" />.
zh_cn: <command>dpkg</command>将要求用户来决定如果dpkg不能自动管理这些任务,那么它就会更新这些配置文件。此过程的细节在这里被讨论<xref linkend="section.conffiles" />。

source: <command>dpkg</command> executes <command>postrm remove</command>. All of the configuration scripts, except <filename>postrm</filename>, are removed. If the user has not used the “purge” option, the operations are completed there.
de_de: <command>dpkg</command> führt <command>postrm remove</command> aus. Hierdurch werden alle Konfigurationsskripte bis auf <filename>postrm</filename> entfernt. Falls der Nutzer nicht die Option „purge“ benutzt hat, ist der Vorgang hiermit abgeschlossen.
es_es: <command>dpkg</command> ejecuta <command>postrm remove</command>. Se eliminan todos los scripts de configuración excepto <filename>postrm</filename>. Si el usuario no utilizó la opción «purgar» («purge»), las operaciones terminan aquí.
it_it: <command>dpkg</command> esegue <command>postrm remove</command>. Tutti gli script di configurazione, eccetto <filename>postrm</filename>, vengono rimossi. Se l'utente non ha usato l'opzione «purge», le operazioni sono terminate qui.
zh_cn: <command>dpkg</command> 执行<command>postrm 移除</command>. 除了<filename>postrm</filename>之外的所有配置脚本都会被移除。如果用户没有使用“purge”选项，所有的操作将在这里完成。

source: <primary><command>dpkg</command>, internal operation</primary>
de_de: <primary><command>dpkg</command>, interner Ablauf</primary>
es_es: <primary><command>dpkg</command>, operación interna</primary>
it_it: <primary><command>dpkg</command>, funzionamento interno</primary>
zh_cn: <primary><command>dpkg</command>,内部操作</primary>

source: <primary><filename>config</filename>, <filename>debconf</filename> script</primary>
es_es: <primary><filename>config</filename>, script <filename>debconf</filename></primary>
it_it: <primary><filename>config</filename>, script di <filename>debconf</filename></primary>
zh_cn: <primary><filename>配置</filename>，<filename>debconf</filename> 脚本</primary>

source: <emphasis>VOCABULARY</emphasis> Purge, complete removal
de_de: <emphasis>WÖRTERVERZEICHNIS</emphasis> „Purge“, vollständiges Entfernen
es_es: <emphasis>VOCABULARIO</emphasis> Purgar, eliminación completa
it_it: <emphasis>VOCABOLARIO</emphasis> Purge, eliminazione completa
zh_cn: <emphasis>VOCABULARY</emphasis> Purge,完全移除
