Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: The four scripts detailed below are complemented by a <filename>config</filename> script, provided by packages using <command>debconf</command> to acquire information from the user for configuration. During installation, this script defines in detail the questions asked by <command>debconf</command>. The responses are recorded in the <command>debconf</command> database for future reference. The script is generally executed by <command>apt</command> prior to installing packages one by one in order to group all the questions and ask them all to the user at the beginning of the process. The pre- and post-installation scripts can then use this information to operate according to the user's wishes.
de_de: Die vier im folgenden beschriebenen Skripte werden durch ein <filename>config</filename>-Skript ergänzt, das von Paketen bereitgestellt wird, die <command>debconf</command> verwenden, um vom Nutzer Informationen für die Konfigurierung zu bekommen. Während der Installation bestimmt dieses Skript im Einzelnen die Fragen, die von <command>debconf</command> gestellt werden. Die Antworten werden zur späteren Verwendung in der <command>debconf</command>-Datenbank aufgezeichnet. Das Skript wird von <command>apt</command> normalerweise ausgeführt, bevor es ein Paket nach dem anderen installiert, um so alle Fragen zu gliedern und sie dem Nutzer vollständig zu Beginn des Vorgangs zu stellen. Die Vor- und Nachinstallationsskripte können dann diese Information verwenden, um den Wünschen des Nutzers entsprechend zu agieren.
es_es: Los cuatro scripts que aparecen detallados a continuación se complementan con un script <filename>config</filename> provisto por los paquetes que utilizan <command>debconf</command> para adquirir información de configuración del usuario. Durante la instalación este script define en detalle las preguntas realizadas por <command>debconf</command>. Se graban las respuestas en la base de datos de <command>debconf</command> para futuras referencias. Generalmente <command>apt</command> ejecuta el script antes de instalar los paquetes uno por uno para agrupar las preguntas y realizarlas todas al usuario al comienzo del proceso. Los scripts de pre y postinstalación pueden utilizar esta información para operar según los deseos del usuario.
it_it: I quattro script descritti più avanti sono complementati da uno script <filename>config</filename>, fornito dai pacchetti usando <command>debconf</command> per acquisire dall'utente le informazioni per la configurazione. Durante l'installazione, questo script definisce nei dettagli le domande poste da <command>debconf</command>. Le risposte sono registrate del database di <command>debconf</command> per usi futuri. Lo script è generalmente eseguito da <command>apt</command> prima di installare i pacchetti uno per uno in modo da raggruppare tutte le domande e porle all'utente all'inizio del procedimento. Gli script pre- e post-installazione possono quindi usare queste informazioni per operare secondo i desideri dell'utente.
zh_cn: 软件包使用了<command>debconf</command>从用户的配置那里获取信息，辅以下面四个<filename>config</filename>脚本，如下。在安装过程中，这个脚本定义详细的debconf的一些问题。响应被记录在<command>debconf</command>数据库以供将来参考。脚本通常易于<command>apt</command>优先安装软件包的时候逐一执行，以便分组所有的问题并且要求用户在进程开始前执行。前-和 安装后脚本就可以根据用户的意愿来使用此信息进行操作。

source: <emphasis>TOOL</emphasis> <command>debconf</command>
de_de: <emphasis>HILFSPROGRAMM</emphasis> <command>debconf</command>
es_es: <emphasis>HERRAMIENTA</emphasis> <command>debconf</command>
it_it: <emphasis>STRUMENTO</emphasis> <command>debconf</command>
zh_cn: <emphasis>工具</emphasis> <command>debconf</command>

source: <command>debconf</command> was created to resolve a recurring problem in Debian. All Debian packages unable to function without a minimum of configuration used to ask questions with calls to the <command>echo</command> and <command>read</command> commands in shell scripts such as <filename>postinst</filename> and similar scripts. But this also means that during a large installation or update the user must stay with their computer to respond to various questions that may arise at any time. These manual interactions have now been almost entirely dispensed with, thanks to the <command>debconf</command> tool.
de_de: <command>debconf</command> wurde entwickelt, um ein in Debian immer wiederkehrendes Problem zu lösen. Alle Debian-Pakete, die ohne eine wenigstens minimale Konfiguration nicht funktionieren konnten, stellten gewöhnlich Fragen, indem sie die Befehle <command>echo</command> und <command>read</command> in Shell-Skripten wie <filename>postinst</filename> oder ähnlichen aufriefen. Dies bedeutete jedoch, dass der Nutzer während einer umfangreichen Installation oder Aktualisierung beim Rechner bleiben musste, um diverse Fragen, die sich jederzeit ergeben konnten, zu beantworten. Auf dieses manuelle Zusammenwirken kann inzwischen dank <command>debconf</command> fast vollständig verzichtet werden.
es_es: Se creó <command>debconf</command> para resolver un problema recurrente en Debian. Todos los paquetes Debian que no pueden funcionar sin un mínimo de configuración solían hacer preguntar ejecutando <command>echo</command> y <command>read</command> en scripts como <filename>postinst</filename> o similares. Pero esto también resultaba que durante una instalación o actualización grande el usuario debía mantenerse frente al equipo para responder a las varias preguntas que podían surgir en cualquier momento. Se han evitado la mayoría de todas estas interacciones manuales gracias a la herramienta <command>debconf</command>.
it_it: <command>debconf</command> è stato creato per risolvere un problema ricorrente in Debian. Tutti i pacchetti Debian che non sono in grado di funzionare senza un minimo di configurazione ponevano le loro domande con chiamate ai comandi <command>echo</command> e <command>read</command> in script della shell come <filename>postinst</filename> e script simili. Ma questo significava che durante un'installazione o un aggiornamento importante l'utente doveva stare davanti al computer per rispondere alle varie domande che potevano essere poste in qualsiasi momento. Queste interazioni manuali sono quasi completamente eliminate grazie allo strumento <command>debconf</command>.
zh_cn: <command>debconf</command>被创建用来解决Debian中一些重现的问题。所有的Debian软件包在没有最小配置的时候都无法发挥作用，这些配置通常会用在<command>echo</command>和<command>read</command>这些命令的shell脚本中比如<filename>postinst</filename>和一些类似的脚本。这也意味着当大型的安装或者更新的时候，用户必须和他们的电脑在一起，以便随时应对可能出现的各种问题。这些手工的交互现在已经几乎全部都免除了，这全都要感谢<command>debconf</command>工具。

source: <command>debconf</command> has many interesting features: it requires the developer to specify user interaction; it allows localization of various strings of characters posted (all translations are stored in the <filename>templates</filename> file describing the interactions); it has different display models for presenting the questions to the user (text mode, graphical mode, non-interactive); and it allows creation of a central database of responses to share the same configuration with several computers... but the most important is that it is now possible to present all of the questions in a block to the user prior to starting a long installation or update process. The user can go about their business while the system handles the installation on its own, without having to stay there staring at the screen waiting for questions.
de_de: <command>debconf</command> hat zahlreiche interessante Merkmale: es verlangt vom Entwickler, Interaktionen mit dem Nutzer festzulegen; es erlaubt die Lokalisierung der Eingabe verschiedener Zeichenfolgen (alle Übersetzungen der Interaktionsbezeichnungen sind in der <filename>Template</filename>-Datei gespeichert); es verfügt über verschiedene Anzeigearten zur Darstellung der Fragen an den Nutzer (Textmodus, Grafikmodus, nicht interaktiv); und es ermöglicht die Erstellung einer zentralen Datenbank von Antworten, um so dieselbe Konfiguration mit verschiedenen Rechnern zu teilen... aber das Wichtigste ist, dass es jetzt möglich ist, dem Nutzer vor Beginn einer langen Installation oder Aktualisierung alle Fragen in einem Block zu stellen. Der Nutzer kann dann andere Aufgaben erledigen, während das System die Installation selbstständig erledigt, und er braucht nicht mehr vor Ort zu bleiben und in Erwartung möglicher Fragen auf den Bildschirm zu starren.
es_es: <command>debconf</command> tiene muchas funcionalidades interesantes: requiere que el desarrollador especifique la interacción con el usuario, permite localización de varias cadenas de caracteres mostradas (se guardan todas las traducciones en el archivo <filename>templates</filename> describiendo las interacciones), tiene diferentes modelos de visualización para presentar las preguntas al usuario (modo texto, modo gráfico, no interactivo) y permite la creación de una base de datos central de respuestas para compartir la misma configuración entre varios equipos... pero la más importante es que ahora es posible presentar todas las preguntas en bloque al usuario antes de comenzar un largo proceso de instalación o actualización. Mientras el sistema se encarga de la instalación por sí mismo, el usuario puede ocuparse de otras tareas sin necesidad de quedarse mirando la pantalla esperando preguntas.
it_it: <command>debconf</command> ha molte caratteristiche interessanti: richiede che lo sviluppatore specifichi l'interazione con l'utente; permette la localizzazione di varie stringhe di caratteri visualizzate (tutte le traduzioni sono memorizzate nel file <filename>templates</filename> che descrive le interazioni); ha diversi modelli di visualizzazione per sottoporre le domande all'utente (modalità testo, modalità grafica, non interattiva); permette la creazione di un database centrale di risposte per condividere la stessa configurazione con diversi computer... ma la più importante è che ora è possibile presentare tutte le domande in blocco prima di iniziare un lungo processo di installazione o di aggiornamento. L'utente può fare altre cose mentre il sistema gestisce da solo l'installazione, senza dove stare a fissare lo schermo in attesa di domande.
zh_cn: <command>debconf</command>有许多有趣的特性：它要求开发者指定用户的交互；它也允许张贴本地化的各种字符和字符串（所有翻译都存储在<filename>缓存</filename>文件中来描述相互作用）；它有不同的显示模式，用户提出问题可以通过（文本模式，图形模式，非交互模式）；它也允许一个中央数据库中创建响应与多台计算机共享相同的配置。。。最重要的是，用户在开始很长的安装或者更新之前能提前出现问题，用户可以在系统处理安装的时候去了解这个问题，而不必呆在那里，盯着屏幕，等待问题出现。

source: In addition to the configuration files mentioned in the previous sections, the <filename>control.tar.gz</filename> file in a Debian package contains others. The first, <filename>md5sums</filename>, contains the list of digital fingerprints for all of the package's files. Its main advantage is that it allows a tool such as <command>debsums</command> (which we will study in <xref linkend="section.debsums" />) to check if these files have been modified since their installation.
de_de: Zusätzlich zu den in den vorherigen Kapiteln genannten Konfigurationsdateien enthält die <filename>control.tar.gz</filename>-Datei eines Debian-Pakets weitere. Die erste, <filename>md5sums</filename>, enthält eine Liste der digitalen Fingerabdrücke aller Dateien des Pakets. Ihr Hauptvorteil besteht darin, dass sie es einem Programm wie <command>debsums</command> (auf das wir in <xref linkend="section.debsums" /> noch näher eingehen werden) ermöglicht zu überprüfen, ob diese Dateien seit ihrer Installierung verändert worden sind.
es_es: Además de los archivos de configuración mencionados en la sección anterior, el archivo <filename>control.tar.gz</filename> en un paquete Debian contiene otros. El primero, <filename>md5sums</filename> contiene una lista de las huellas digitales de todos los archivos del paquete. Su principal ventaja es que permite que herramientas como <command>debsums</command> (que estudiaremos en la <xref linkend="section.debsums" />) chequeen si estos archivos fueron modificados desde su instalación.
it_it: Oltre ai file di configurazione menzionati nelle sezioni precedenti, il file <filename>control.tar.gz</filename> contenuto in un pacchetto Debian ne contiene altri. Il primo, <filename>md5sums</filename>, contiene l'elenco delle impronte digitali per tutti i file del pacchetto. Il suo vantaggio principale è che permette a uno strumento come <command>debsums</command> (che sarà studiato nella <xref linkend="section.debsums" />) di controllare se questi file sono stati modificati dopo la loro installazione.
zh_cn: 除了在前面的章节中提到的配置文件，Debian中的<filename>control.tar.gz</filename>包含了其他的。第一，<filename>md5sums</filename>，包含了所有软件包文件的数字签名指纹。其主要的优点是可以让一个工具比如说<command>debsums</command>（我们将研究<xref linkend="section.debsums" />）来检查它们是否在安装前被篡改过。

source: <filename>conffiles</filename> lists package files that must be handled as configuration files. This involves a special handling, since configuration files can be modified by the administrator, and the changes are usually preserved during a package update.
de_de: <filename>conffiles</filename> führt Paketdateien auf, die als Konfigurationsdateien behandelt werden müssen. Dies geht mit einer besonderen Handhabung einher, da Konfigurationsdateien durch den Administrator angepasst werden können, und da diese Anpassungen bei einer Paketaktualisierung normalerweise erhalten bleiben.
es_es: <filename>conffiles</filename> lista los archivos del paquete que tienen que administrarse como archivos de configuración. Eso requiere una gestión especial ya que el administrador puede modificar los archivos de configuración y generalmente se preservan los cambios durante la actualización de un paquete.
it_it: <filename>conffiles</filename> elenca i file del pacchetto che devono essere gestiti come file di configurazione. Questo comporta una gestione speciale dal momento che i file di configurazione possono essere modificati dall'amministratore e le modifiche sono normalmente preservate durante l'aggiornamento di un pacchetto.
zh_cn: <filename>冲突</filename>文件的列出必须处理配置文件的软件包。这涉及到了一个特殊的处理，因为配置文件是可以被管理员修改的，而软件包更新期间的配置文件是会被保留的。

source: <command>dpkg</command> handles configuration file updates, but regularly interrupts these operations to ask for input from the administrator. This makes it less than enjoyable for those who wish to run updates in a non-interactive manner. This is why this program offers options that allow the system to respond automatically according to the same logic: <command>--force-confold</command> retains the old version of the file; <command>--force-confnew</command> will use the new version of the file (these choices are respected, even if the file has not been changed by the administrator, which only rarely has the desired effect). Adding the <command>--force-confdef</command> option tells <command>dpkg</command> to use the default option when a choice is offered (in other words, when the original configuration file has not been touched), and only uses <command>--force-confnew</command> or <command>--force-confold</command> for other cases.
de_de: <command>dpkg</command> erledigt die Aktualisierung von Konfigurationsdateien, unterbricht aber regelmäßig diese Aktionen, um den Administrator um Eingaben zu bitten. Dies ist für diejenigen, die Aktualisierungen in einer nicht-interaktiven Weise ablaufen lassen möchten, weniger erfreulich. Daher bietet dieses Programm auch Optionen an, die es dem System ermöglichen, selbstständig in Übereinstimmung mit der gleichen Logik zu verfahren: <command>--force-confold</command> behält die alte Dateiversion; <command>--force-confnew</command> verwendet die neue (diese Auswahlmöglichkeiten werden selbst dann eingehalten, wenn die Datei nicht vom Administrator verändert wurde, was selten den gewünschten Effekt hat). Durch Hinzufügen der Option <command>--force-confdef</command> wird <command>dpkg</command> mitgeteilt, dass es die Standardoption verwenden soll, wenn eine Auswahl angeboten wird (anders ausgedrückt, wenn die ursprüngliche Konfigurationsdatei nicht angerührt worden ist), und dass es die Optionen <command>--force-confnew</command> oder <command>--force-confold</command> nur in den anderen Fällen verwenden soll.
es_es: <command>dpkg</command> administra la actualización de los archivos de configuración pero interrumpe estas operaciones frecuentemente para pedir información al administrador. Esto lo hace menos placentero para aquellos que desean ejecutar actualizaciones de forma no interactiva. Es por esto que éste programa ofrece opciones que le permiten al sistema responder automáticamente según la misma lógica: <command>--force-confold</command> mantiene los archivos de configuración anteriores; <command>--force-confnew</command> utilizará la nueva versión del archivo (se respetan estas opciones aún cuando el archivo no fue modificado por el administrador, que rara vez tienen el efecto deseado). Agregar la opción <command>--force-confdef</command> le dice a <command>dpkg</command> que utilice la opción predeterminada sólo cuando se le presente una (en otras palabras, cuando el archivo de configuración original no fue modificado) y sólo utilice <command>--force-confnew</command> o <command>--force-confold</command> para los otros casos.
it_it: <command>dpkg</command> gestisce gli aggiornamenti del file di configurazione, ma interrompe regolarmente queste operazioni per chiedere input dall'amministratore. Questo lo rende poco piacevole per chi desidera eseguire gli aggiornamenti in maniera non interattiva. Questo è il motivo per cui questo programma offre opzioni che permettono al sistema di rispondere automaticamente secondo la stessa logica: <command>--force-confold</command> mantiene la vecchia versione del file; <command>--force-confnew</command> userà la nuova versione del file (queste scelte sono rispettate anche se il file non è stato cambiato dall'amministratore, cosa che solo raramente ha l'effetto desiderato). L'aggiunta dell'opzione <command>--force-confdef</command> dice a <command>dpkg</command> di usare l'opzione predefinita quando è offerta una scelta (in altre parole, quando il file di configurazione originale non è stato toccato) e usa <command>--force-confnew</command> o <command>--force-confold</command> per gli altri casi.
zh_cn: <command>dpkg</command>处理配置文件更新，但是经常中断来自管理员的输入的操作要求。这使得用户对于那些愿意在非交互式的方式上运行的更新感到不愉快。这就是为什么这个程序提供了选项，让系统根据同样的逻辑来自动响应：<command>--force-confold</command>会强制保留老版本的文件；<command>--force-confnew</command>将使用新版本的文件（这些选择让你感到被尊重，即使文件不是由管理员改变的，这会产生很少的预期的效果。）。添加<command>--force-confdef</command>选项会告诉<command>dpkg</command>命令使用默认的选项时，提供选择（换句话说，不去修改原来的配置文件），而只使用<command>--force-confnew</command>或者<command>--force-confold</command>在其他情况下

source: These options can be stored directly in the configuration for the <command>apt</command> program, rather than specified them each time on the command line. To do so, simply write the following line in the <filename>/etc/apt/apt.conf.d/local</filename> file:
de_de: Diese Optionen können direkt in der Konfiguration des <command>apt</command>-Programms gespeichert werden, statt sie jedesmal auf der Befehlszeile anzugeben. Hierzu schreiben Sie einfach die folgende Zeile in die Datei <filename>/etc/apt/apt.conf.d/local</filename>:
es_es: Estas opciones pueden almacenarse directamente en la configuración del programa <command>apt</command> en lugar de especificarlas en cada ejecución. Para esto, simplemente escriba la siguiente línea en el archivo <filename>/etc/apt/apt.conf.d/local</filename>:
it_it: Queste opzioni possono essere memorizzate direttamente nella configurazione del programma <command>apt</command>, invece che specificarle ogni volta sulla riga di commando. Per far ciò, è sufficiente scrivere la riga seguente nel file <filename>/etc/apt/apt.conf.d/local</filename>:
zh_cn: 这个选项会<command>apt</command>直接存储在配置文件中，相比每次在命令行中指定。这样做，只需要写入<filename>/etc/apt/apt.conf.d/local</filename>文件里：

source: Including this option in the configuration file will allow it to also be used in a graphical interface such as <command>aptitude</command>.
de_de: Die Aufnahme dieser Option in die Konfigurationsdatei ermöglicht es, sie auch in einer grafischen Schnittstelle wie <command>aptitude</command> zu verwenden.
es_es: Incluir esta opción en el archivo de configuración permitirá que también sea utilizada en una interfaz gráfica como <command>aptitude</command>.
it_it: Includere questa opzione nel file di configurazione permetterà di usarlo anche in un'interfaccia grafica come <command>aptitude</command>.
zh_cn: 在配置文件中包含该选项将允许它也可以在图形界面中使用，如<command>aptitude</command>。

source: The option, <command>--force-confask</command> requires <command>dpkg</command> to display the questions about the configuration files, even in cases where they would not normally be necessary. Thus, when reinstalling a package with this option, <command>dpkg</command> will ask the questions again for all of the configuration files modified by the administrator. This is very convenient, especially for reinstalling the original configuration file if it has been deleted and no other copy is available: a normal re-installation won't work, because <command>dpkg</command> considers removal as a form of legitimate modification, and, thus, doesn't install the desired configuration file.
de_de: Die Option <command>--force-confask</command> zwingt <command>dpkg</command> dazu, die Fragen zu den Konfigurationsdateien selbst in den Fällen anzuzeigen, in denen sie normalerweise nicht notwendig wären. So wird <command>dpkg</command> bei der Re-Installation eines Pakets mit dieser Option erneut die Fragen zu allen Konfigurationsdateien stellen, die vom Administrator verändert worden sind. Dies ist vor allem sehr praktisch für das erneute Installieren der ursprünglichen Konfigurationsdatei, falls sie gelöscht worden ist oder keine andere Kopie verfügbar ist: eine normale Re-Installation würde nicht funktionieren, weil <command>dpkg</command> das Entfernen als eine zulässige Form der Veränderung ansieht und daher die gewünschte Konfigurationsdatei nicht installiert.
es_es: La opción <command>--force-confask</command> obliga a <command>dpkg</command> a mostrar las preguntas sobre archivos de configuración aún en los casos en los que no serían necesarias normalmente. Por lo tanto, al reinstalar un paquete con esta opción <command>dpkg</command> preguntará nuevamente sobre todos los archivos de configuración modificados por el administrador. Esto es muy conveniente, especialmente para reinstalar el archivo de configuración original si éste fue borrado y no posee otra copia disponible: una reinstalación normal no funcionará porque <command>dpkg</command> considera la eliminación como una forma legítima de modificación del archivo por lo que no lo instalará nuevamente.
it_it: L'opzione <command>--force-confask</command> richiede che <command>dpkg</command> visualizzi le domande sui file di configurazione, anche nei casi in cui non sarebbe normalmente necessario. Perciò, durante la reinstallazione di un pacchetto con questa opzione, <command>dpkg</command> porrà di nuovo le domande per tutti i file di configurazione modificati dall'amministratore. Questo è molto comodo, specialmente per reinstallare il file di configurazione originale se è stato eliminato e non ne è disponibile un'altra copia: una normale reinstallazione non funzionerebbe perché <command>dpkg</command> considera la rimozione come una forma legittima di modifica e perciò non installa il file di configurazione desiderato.
zh_cn: 选项<command>--force-confask</command>需要<command>dpkg</command>来显示关于配置文件的问题，通常这都是不必要的。因此，当重新安装一个软件包的时候使用此选项，<command>dpkg</command>会再次询问所有的被管理员修改的配置文件的问题。这相当方便，尤其是如果原来的配置文件已经被删除，并且没有其他的备份会导致你无法正常安装。因为<command>dpkg</command>命令会认为这是一个合法的修改因此而不会安装所需的配置文件。
