Repository: Neamar/KISS
Catalog: */05_packaging-system.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn

source: <computeroutput># </computeroutput><userinput>dpkg --print-architecture</userinput> <computeroutput>amd64 # </computeroutput><userinput>dpkg --print-foreign-architectures</userinput> <computeroutput># </computeroutput><userinput>dpkg -i gcc-4.7-base_4.7.2-5_armhf.deb</userinput> <computeroutput>dpkg: error processing gcc-4.7-base_4.7.2-5_armhf.deb (--install): package architecture (armhf) does not match system (amd64) Errors were encountered while processing: gcc-4.7-base_4.7.2-5_armhf.deb # </computeroutput><userinput>dpkg --add-architecture armhf</userinput> <computeroutput># </computeroutput><userinput>dpkg --add-architecture armel</userinput> <computeroutput># </computeroutput><userinput>dpkg --print-foreign-architectures</userinput> <computeroutput>armhf armel # </computeroutput><userinput>dpkg -i gcc-4.7-base_4.7.2-5_armhf.deb</userinput> <computeroutput>Selecting previously unselected package gcc-4.7-base:armhf. (Reading database ... 97399 files and directories currently installed.) Unpacking gcc-4.7-base:armhf (from gcc-4.7-base_4.7.2-5_armhf.deb) ... Setting up gcc-4.7-base:armhf (4.7.2-5) ... # </computeroutput><userinput>dpkg --remove-architecture armhf</userinput> <computeroutput>dpkg: error: cannot remove architecture 'armhf' currently in use by the database # </computeroutput><userinput>dpkg --remove-architecture armel</userinput> <computeroutput># </computeroutput><userinput>dpkg --print-foreign-architectures</userinput> <computeroutput>armhf</computeroutput>
ja_jp: <computeroutput># </computeroutput><userinput>dpkg --print-architecture</userinput> <computeroutput>amd64 # </computeroutput><userinput>dpkg --print-foreign-architectures</userinput> <computeroutput># </computeroutput><userinput>dpkg -i gcc-4.7-base_4.7.2-5_armhf.deb</userinput> <computeroutput>dpkg: gcc-4.7-base_4.7.2-5_armhf.deb の処理中にエラーが発生しました (--install): パッケージアーキテクチャ (armhf) がシステム (amd64) と一致しません 処理中にエラーが発生しました: gcc-4.7-base_4.7.2-5_armhf.deb # </computeroutput><userinput>dpkg --add-architecture armhf</userinput> <computeroutput># </computeroutput><userinput>dpkg --add-architecture armel</userinput> <computeroutput># </computeroutput><userinput>dpkg --print-foreign-architectures</userinput> <computeroutput>armhf armel # </computeroutput><userinput>dpkg -i gcc-4.7-base_4.7.2-5_armhf.deb</userinput> <computeroutput>(データベースを読み込んでいます ... 現在 97399 個のファイルとディレクトリがインストールされています。) (gcc-4.7-base_4.7.2-5_armhf.deb から) gcc-4.7-base:armhf を展開しています... gcc-4.7-base:armhf (4.7.2-5) を設定しています ... # </computeroutput><userinput>dpkg --remove-architecture armhf</userinput> <computeroutput>dpkg: エラー: データベースで現在使用中のアーキテクチャ 'armhf' を削除できません # </computeroutput><userinput>dpkg --remove-architecture armel</userinput> <computeroutput># </computeroutput><userinput>dpkg --print-foreign-architectures</userinput> <computeroutput>armhf</computeroutput>

source: <emphasis>NOTE</emphasis> APT's multi-arch support
ja_jp: <emphasis>NOTE</emphasis> APT のマルチアーキテクチャサポート

source: APT will automatically detect when dpkg has been configured to support foreign architectures and will start downloading the corresponding <filename>Packages</filename> files durings its update process.
ja_jp: APT は dpkg が外来アーキテクチャをサポートするように設定されているかを自動的に検出し、更新作業中に対応する <filename>Packages</filename> ファイルをダウンロードします。

source: Foreign packages can then be installed with <command>apt-get install <replaceable>package</replaceable>:<replaceable>architecture</replaceable></command>.
ja_jp: 外来パッケージをインストールするには <command>apt-get install <replaceable>package</replaceable>:<replaceable>architecture</replaceable></command> を使ってください。

source: <emphasis>IN PRACTICE</emphasis> Using proprietary i386 binaries on amd64
ja_jp: <emphasis>IN PRACTICE</emphasis> amd64 上でプロプライエタリな i386 バイナリを使う

source: There are multiple use cases for multi-arch, but the most popular one is the possibility to execute 32 bit binaries (i386) on 64 bit systems (amd64), in particular since several popular proprietary applications (like Skype) are only provided in 32 bit versions.
ja_jp: マルチアーキテクチャには複数の使用事例がありますが、特に人気の用例は、32 ビットバイナリ (i386) が 64 ビットシステム (amd64) で実行可能になる例です。その具体的理由は、複数の人気のプロプライエタリアプリケーション (例えば Skype) が 32 ビット版しか提供していないからです。

source: Before multi-arch, when you wanted to uses a 32 bit appliction on a 64 bit system, you had to install <emphasis role="pkg">ia32-libs</emphasis> to have 32 bit versions of the most popular libraries. That package was a huge hack that repackaged 32 bit libraries in an “amd64” package.
ja_jp: マルチアーキテクチャ以前、32 ビットアプリケーションを 64 ビットシステムで実行したければ、<emphasis role="pkg">ia32-libs</emphasis> をインストールすることで、システム内に人気の高いライブラリの 32 ビット版を持つ必要がありました。このパッケージは amd64 パッケージ内の 32 ビットライブラリを再パッケージ化した大規模なハックでした。

source: Multi-Arch Related Changes
ja_jp: マルチアーキテクチャ関連の変更

source: To make multi-arch actually useful and usable, libraries had to be repackaged and moved to an architecture-specific directory so that multiple copies (targeting different architectures) can be installed alongside. Such updated packages contain the “<literal>Multi-Arch: same</literal>” header field to tell the packaging system that the various architectures of the package can be safely co-installed (and that those packages can only satisfy dependencies of packages of the same architecture). Since multi-arch made its debut in Debian Wheezy, not all libraries have been converted yet (but all libraries which were embedded in <emphasis role="pkg">ia32-libs</emphasis> do!).
ja_jp: マルチアーキテクチャを実際に便利で使いやすいものにするためには、ライブラリを再パッケージ化しなければいけませんでした。さらに複数のコピー (対象の異なるアーキテクチャ) を同時にインストールできるようにするために、マルチアーキテクチャ専用のディレクトリにライブラリを移動しなければいけませんでした。このようにして更新されたパッケージには、このパッケージはアーキテクチャが違っても安全に同時インストールできること (そしてこのパッケージは自分と異なるアーキテクチャのパッケージの依存関係を満足することはできないこと) をパッケージ化システムに伝えるための「<literal>Multi-Arch: same</literal>」ヘッダフィールドが含まれていました。マルチアーキテクチャモードは Debian Wheezy で初登場しましたから、まだすべてのライブラリが変換されたわけではありません (<emphasis role="pkg">ia32-libs</emphasis> に組み込まれていたライブラリはすべて変換されました)。

source: $ <userinput>dpkg -s gcc-4.7-base</userinput> dpkg-query: error: --status needs a valid package name but 'gcc-4.7-base' is not: ambiguous package name 'gcc-4.7-base' with more than one installed instance Use --help for help about querying packages. $ <userinput>dpkg -s gcc-4.7-base:amd64 gcc-4.7-base:armhf | grep ^Multi</userinput> Multi-Arch: same Multi-Arch: same $ <userinput>dpkg -L libgcc1:amd64 |grep .so</userinput> /lib/x86_64-linux-gnu/libgcc_s.so.1 $ <userinput>dpkg -S /usr/share/doc/gcc-4.7-base/copyright</userinput> gcc-4.7-base:armhf, gcc-4.7-base:amd64: /usr/share/doc/gcc-4.7-base/copyright
ja_jp: $ <userinput>dpkg -s gcc-4.7-base</userinput> dpkg-query: エラー: --status は有効なパッケージ名を必要としますが、`gcc-4.7-base' はそうではありません: 1つ以上のインストール済み実体がある、あいまいなパッケージ名 'gcc-4.7-base' です パッケージ照会についてのヘルプには、--help を使用してください。 $ <userinput>dpkg -s gcc-4.7-base:amd64 gcc-4.7-base:armhf | grep ^Multi</userinput> Multi-Arch: same Multi-Arch: same $ <userinput>dpkg -L libgcc1:amd64 |grep .so</userinput> /lib/x86_64-linux-gnu/libgcc_s.so.1 $ <userinput>dpkg -S /usr/share/doc/gcc-4.7-base/copyright</userinput> gcc-4.7-base:armhf, gcc-4.7-base:amd64: /usr/share/doc/gcc-4.7-base/copyright

source: It is worth noting that <literal>Multi-Arch: same</literal> packages must have their names qualified with their architecture to be unambiguously identifiable. They also have the possibility to share files with other instances of the same package; <command>dpkg</command> ensures that all packages have bit-for-bit identical files when they are shared. Last but not least, all instances of a package must have the same version. They must thus be upgraded together.
ja_jp: <literal>Multi-Arch: same</literal> パッケージの場合、自分の名前にアーキテクチャの限定詞を付けて明確に識別できるようにしなければいけないことは注目に値します。このようなパッケージはアーキテクチャが異なる同じパッケージ間でファイルを共有する可能性を持っています; <command>dpkg</command> は、共有されたファイルはアーキテクチャが異なる同じパッケージ間であってもビット単位で一致する、事を期待します。最後に大事な事ですが、パッケージはアーキテクチャ毎にバージョンが違ってはいけません。アーキテクチャが異なるパッケージも必ず同時にアップグレードされなければいけません。

source: Multi-Arch support also brings some interesting challenges in the way dependencies are handled. Satisfying a dependency requires either a package marked “<literal>Multi-Arch: foreign</literal>” or a package whose architecture matches the one of the package declaring the dependency (in this dependency resolution process, architecture-independent packages are assumed to be of the same architecture than the host). A dependency can also be weakened to allow any architecture to fulfill it, with the <literal><replaceable>package</replaceable>:any</literal> syntax, but foreign packages can only satisfy such a dependency if they are marked “<literal>Multi-Arch: allowed</literal>”.
ja_jp: マルチアーキテクチャサポートによって、依存関係の取り扱い方法にいくつかの興味深い挑戦がなされました。あるパッケージの依存関係を満足させるためには、必要とされる側のパッケージは「<literal>Multi-Arch: foreign</literal>」と宣言されているか、依存パッケージ群の 1 つのパッケージとアーキテクチャが一致しているかのどちらか一方、を必要とします (依存関係解決処理中、アーキテクチャに依存しないパッケージはホストと同じアーキテクチャと仮定されます)。依存関係は <literal><replaceable>package</replaceable>:any</literal> 構文があれば、どんなアーキテクチャでも依存関係を満足できるように弱められましたが、外来パッケージを使ってこの構文で表記された依存関係を満足できるのは「<literal>Multi-Arch: allowed</literal>」と宣言されていた場合のみです。

source: Coexistence with Other Packaging Systems
de_de: Koexistenz mit anderen Paketierungssystemen
es_es: Coexistencia con otros sistemas paquetes
it_it: Coesistenza con altri sistemi di pacchetti
ja_jp: 他のパッケージ化システムとの共存
zh_cn: 与其它软件包共存

source: <primary>Red Hat Package Manager</primary>
de_de: <primary>Red Hat Paketmanager</primary>
es_es: <primary>Gestor de paquetes de Red Hat</primary>
ja_jp: <primary>Red Hat パッケージマネージャ</primary>
zh_cn: <primary>红帽的软件包管理</primary>

source: Debian packages are not the only software packages used in the free software world. The main competitor is the RPM format of the Red Hat Linux distribution and its many derivatives. Red Hat is a very popular, commercial distribution. It is thus common for software provided by third parties to be offered as RPM packages rather than Debian.
ja_jp: フリーソフトウェア世界では Debian パッケージ以外のソフトウェアパッケージも使われています。最大の競争相手は Red Hat Linux ディストリビューションとその派生物が使う RPM フォーマットです。Red Hat は非常に人気のある商用ディストリビューションです。そのため一般に、サードパーティが提供するソフトウェアは Debian パッケージではなく RPM パッケージで用意されます。

source: In this case, you should know that the program <command>rpm</command>, which handles RPM packages, is available as a Debian package, so it is possible to use this package format on Debian. Care should be taken, however, to limit these manipulations to extract the information from a package or to verify its integrity. It is, in truth, unreasonable to use <command>rpm</command> to install an RPM on a Debian system; RPM uses its own database, separate from those of native software (such as <command>dpkg</command>). This is why it is not possible to ensure a stable coexistence of two packaging systems.
de_de: Für diese Fälle sollten Sie wissen, dass das Programm <command>rpm</command>, das mit RPM-Paketen umgeht, als Debian-Paket verfügbar ist, so dass es möglich ist, dieses Paketformat auf Debian zu verwenden. Dabei sollte jedoch beachtet werden, diese Verarbeitungen darauf zu beschränken, Informationen aus dem Paket zu gewinnen oder seine Unversehrtheit zu überprüfen. Es ist dagegen unsinnig, <command>rpm</command> zur Installation eines RPM-Pakets auf einem Debian-System zu verwenden. RPM benutzt seine eigene Datenbank, die von denen für systemeigene Programme (wie zum Beispiel <command>dpkg</command>) verschieden ist. Daher kann eine stabile Koexistenz zweier Paketverwaltungssysteme nicht sichergestellt werden.
es_es: En este caso debe saber que el programa <command>rpm</command>, que gestiona los paquetes RPM, está disponible como un paquete Debian; por lo que es posible utilizar este formato de paquetes en Debian. Debe tener cuidado sin embargo, y limitar estas manipulaciones a extraer la información de un paquete o verificar su integridad. No es, en realidad, razonable utilizar <command>rpm</command> para instalar un paquete RPM en un sistema Debian; RPM utiliza su propia base de datos, separada de aquella del software nativo (como <command>dpkg</command>. Es por esto que no es posible asegurar una coexistencia estable de dos sistemas de paquetes.
it_it: In questo caso, si deve sapere che il programma <command>rpm</command>, che gestisce pacchetti RPM, è disponibile come pacchetto Debian, così è possibile usare questo formato di pacchetti su Debian. Si dovrebbe fare attenzione, comunque, a limitare queste manipolazioni all'estrazione di informazioni da un pacchetto o alla verifica della sua integrità. In realtà non è ragionevole usare <command>rpm</command> per installare un RPM su un sistema Debian; RPM usa un proprio database, separato da quello del software nativo (come <command>dpkg</command>). Questo è il motivo per cui non è possibile assicurare una coesistenza stabile dei due sistemi di pacchetti.
ja_jp: この場合、Debian では RPM パッケージを取り扱うプログラム <command>rpm</command> がパッケージとして用意されており、Debian では RPM パッケージフォーマットを使う事ができる事を知るべきです。しかしながら、パッケージから情報を引き出したり、整合性を検証するための操作は制限されていることに注意してください。実のところ、RPM を Debian システムにインストールするために <command>rpm</command> を使うのは合理的ではありません; RPM はネイティブソフトウェア (<command>dpkg</command> など) とは異なる自分自身のデータベースを使います。このため、2 つのパッケージ化システムを安定に共存させる事を保証するのは不可能です。
zh_cn: 这个情况下，你应该知道<command>rpm</command>程序是如何处理RPM软件包的，这种格式在Debian软件包中也可用。需要谨慎的使用，尽管如何，这些操作会限制从一个软件包中解压并且提取出信息以验证其完整性。实际上，不应该在Debian系统中使用<command>rpm</command>来安装一个RPM软件包；RPM使用了它自己的数据库以便和Debian的软件中分离（比如<command>dpkg</command>）。这也就是为什么不可能确保两个包管理系统共存在一个系统中，而这个系统还能保持稳定。

source: On the other hand, the <emphasis role="pkg">alien</emphasis> utility can convert RPM packages into Debian packages, and vice versa.
de_de: Dagegen kann das Programm <emphasis role="pkg">alien</emphasis> RPM-Pakete in Debian-Pakete umwandeln und umgekehrt.
es_es: Por el otro lado, la herramienta <emphasis role="pkg">alien</emphasis> puede convertir paquetes RPM en paquetes Debian y viceversa.
it_it: D'altra parte, l'utilità <emphasis role="pkg">alien</emphasis> può convertire pacchetti RPM in pacchetti Debian e viceversa.
ja_jp: 他方で、<emphasis role="pkg">alien</emphasis> ユーティリティは RPM パッケージを Debian パッケージに変換したりその逆を行う事が可能です。
zh_cn: 另一方面，<emphasis role="pkg">alien</emphasis> 可以把RPM软件包转换成Debian软件包，反之亦然。

source: <emphasis>COMMUNITY</emphasis> Encouraging the adoption of <filename>.deb</filename>
de_de: <emphasis>GEMEINSCHAFT</emphasis> Die Einführung von <filename>.deb</filename> fördern
es_es: <emphasis>COMUNIDAD</emphasis> Fomentando la adopción de <filename>.deb</filename>
it_it: <emphasis>COMUNITÀ</emphasis> Incoraggiare l'adozione di <filename>.deb</filename>
ja_jp: <emphasis>COMMUNITY</emphasis> <filename>.deb</filename> の採用を働きかける
zh_cn: <emphasis>社区</emphasis> 鼓励<filename>.deb</filename>的使用

source: If you regularly use the <command>alien</command> program to install RPM packages coming from one of your providers, do not hesitate to write to them and amicably express your strong preference for the <filename>.deb</filename> format. Note that the format of the package is not everything: a <filename>.deb</filename> package built with <command>alien</command> or prepared for a version of Debian different than that which you use, or even for a derivative distribution like Ubuntu, would probably not offer the same level of quality and integration as a package specifically developed for Debian <emphasis role="distribution">Wheezy</emphasis>.
ja_jp: 提供者から受け取った RPM パッケージをインストールするために、日常的に <command>alien</command> プログラムを使っているのなら、提供者に手紙を出して <filename>.deb</filename> フォーマットを強く欲しがっている事を平和的に表現してください。パッケージのフォーマットがすべてではないことに注意してください: <command>alien</command> で作った <filename>.deb</filename> パッケージや、あなたの使っているバージョンと異なる Debian のバージョン用として準備されたパッケージや、Ubuntu などの派生ディストリビューション用として準備されたパッケージは Debian <emphasis role="distribution">Wheezy</emphasis> 専用に開発されたパッケージと比べて品質や整合性が違うかもしれません。

source: You will find that this process is extremely simple. You must know, however, that the package generated does not have any dependency information, since the dependencies in the two packaging formats don't have systematic correspondence. The administrator must thus manually ensure that the converted package will function correctly, and this is why Debian packages thus generated should be avoided as much as possible. Fortunately, Debian has the largest collection of software packages of all distributions, and it is likely that whatever you seek is already in there.
ja_jp: 変換作業が極めて単純だという事がわかるでしょう。しかしながら、生成されたパッケージには依存関係の情報が含まれない事を知らなければいけません。なぜなら、2 つのパッケージフォーマットの依存関係の間に系統的な対応関係が無いからです。管理者は変換されたパッケージが正しく動く事を手作業で保証しなければいけません。そのため、生成された Debian パッケージを使うのは可能な限り避けるべきです。幸いなことに、Debian が用意しているソフトウェアパッケージの数はすべてのディストリビューションの中で最も多く、探しているものは何でも用意されていそうに見えます。

source: Looking at the man page for the <command>alien</command> command, you will also note that this program handles other packaging formats, especially the one used by the Slackware distribution (it is made of a simple <filename>tar.gz</filename> archive).
ja_jp: <command>alien</command> コマンドの man ページを見ると、このプログラムが他のパッケージフォーマット、特に (単純な <filename>tar.gz</filename> アーカイブで作られている) Slackware ディストリビューションで使われているフォーマット、を取り扱う事も可能なことに気が付くでしょう。

source: The stability of the software deployed using the <command>dpkg</command> tool contributes to Debian's fame. The APT suite of tools, described in the following chapter, preserves this advantage, while relieving the administrator from managing the status of packages, a necessary but difficult task.
de_de: Die Stabilität der Software, die unter Verwendung des Programms <command>dpkg</command> zum Einsatz gebracht wird, trägt zu Debians gutem Ruf bei. Die Programmgarnitur APT, die im folgenden Kapitel beschrieben wird, bewahrt diesen Vorzug, während sie gleichzeitig den Administrator davon entlastet, den Status von Paketen verwalten zu müssen, eine notwendige aber schwierige Aufgabe.
es_es: La estabilidad del software desplegado con la herramienta <command>dpkg</command> contribuye a la fama de Debian. La suite de herramientas APT descrita en el próximo capítulo preserva esta ventaja al mismo tiempo que liberan al administrador de la carga de gestionar el estado de los paquetes, una tarea difícil pero necesaria.
it_it: La stabilità del software installato usando lo strumento <command>dpkg</command> contribuisce alla fama di Debian. La suite di strumenti APT, descritta nel capitolo seguente, mantiene questo vantaggio, sollevando l'amministratore dal gestire lo stato dei pacchetti, un compito necessario, ma difficile.
ja_jp: <command>dpkg</command> ツールを使って配置されたソフトウェアの安定性は Debian の名声に寄与しています。次の章で説明する APT ツール集はこの長所を引き継いで、さらに、管理者が不可欠だが難しい作業であるパッケージの状態管理をしなくても済むようにしました。
zh_cn: <command>dpkg</command>作为一个稳定的工具有助于提高Debian的名字。APT套件工具，在下面的章节中会告诉我们，它不但保留了这一优势，同时减轻了管理员管理软件包这一必须但是艰难得任务的负担。

source: The Debian package format is designed so that its content may be extracted on any Unix system that has the classic commands <command>ar</command>, <command>tar</command>, and <command>gzip</command>. This seemingly trivial property is important for portability and disaster recovery.
de_de: Das Debian-Paketformat ist so gestaltet, dass sein Inhalt auf jedem Unixsystem entpackt werden kann, das über die klassischen Befehle <command>ar</command>, <command>tar</command> und <command>gzip</command> verfügt. Diese scheinbar belanglose Eigenschaft ist wichtig für die Portierbarkeit und Wiederherstellung.
es_es: El formato del paquete Debian fue diseñado para que su contenido pueda ser extraído en cualquier sistema Unix que tenga los programas clásicos <command>ar</command>, <command>tar</command> y <command>gzip</command>. Esta propiedad aparentemente trivial es importante para portabilidad y recuperación en caso de desastres.
it_it: Il formato dei pacchetti Debian è progettato in modo che il suo contenuto possa essere estratto su qualsiasi sistema Unix che abbia i classici comandi <command>ar</command>, <command>tar</command> e <command>gzip</command>. Questa proprietà apparentemente banale è importante per la portabilità e il disaster recovery.
zh_cn: Debian 软件包格式的设计，使得它的内容能在任何有 <command>ar</command>、<command>tar</command> 和 <command>gzip</command> 这几个常用命令的 Unix 系统上解压出来。这个看起来非常简单的属性，对可移植性和灾难恢复却非常重要。

source: Imagine, for example, that you mistakenly deleted the <command>dpkg</command> program, and that you could thus no longer install Debian packages. <command>dpkg</command> being a Debian package itself, it would seem your system would be done for... Fortunately, you know the format of a package and can therefore download the <filename>.deb</filename> file of the <emphasis role="pkg">dpkg</emphasis> package and install it manually (see the “TOOLS” sidebar). If by some misfortune one or more of the programs <command>ar</command>, <command>tar</command> or <command>gzip</command> have disappeared, you will only need to copy the missing program from another system (since each of these operates in a completely autonomous manner, without dependencies, a simple copy will suffice).
de_de: Nehmen Sie zum Beispiel an, dass Sie aus Versehen das Programm <command>dpkg</command> gelöscht haben, und dass Sie daher keine Debian-Pakete mehr installieren können. Da <command>dpkg</command> selbst ein Debian-Paket ist, sieht es so aus, als ob ihr System erledigt sei... Zum Glück kennen Sie das Format eines Pakets und können daher die <filename>.deb</filename>-Datei des <emphasis role="pkg">dpkg</emphasis>-Pakets herunterladen und es manuell installieren (siehe Seitenleiste „HILFSPROGRAMME“). Wenn durch ein Missgeschick eines oder mehrere der Programme <command>ar</command>, <command>tar</command> oder <command>gzip</command> verschwunden sind, brauchen Sie nur das fehlende Programm von einem anderen System zu kopieren (da jedes von ihnen auf vollständig autonome Weise ohne Abhängigkeiten arbeitet, reicht eine einfache Kopie aus).
es_es: Imagine por ejemplo que eliminó por error el programa <command>dpkg</command> y que, por lo tanto, ya no puede instalar paquetes Debian. Siendo <command>dpkg</command> un paquete en sí mismo pareciera como que su sistema estuviese condenado... afortunadamente conoce el formato de un paquete y puede descargar el archivo <filename>.deb</filename> para el paquete <emphasis role="pkg">dpkg</emphasis> e instalarlo manualmente (revise el recuadro «HERRAMIENTAS»). Si por cualquier motivo o problema uno o más de los programas <command>ar</command>, <command>tar</command> o <command>gzip</command> desaparecieron sólo necesitará copiar el programa faltante de otro sistema (ya que cada uno de ellos funciona de forma completamente autónoma una simple copia bastará).
it_it: Per esempio, si immagini di aver eliminato per errore il programma <command>dpkg</command> e perciò di non potere più installare pacchetti Debian. Dal momento che <command>dpkg</command> è esso stesso un pacchetto Debian, sembrerebbe che il sistema sia spacciato… Fortunatamente, si conosce il formato di un pacchetto e perciò si può scaricare il file <filename>.deb</filename> del pacchetto <emphasis role="pkg">dpkg</emphasis> e installarlo manualmente (si veda la barra laterale «STRUMENTI»). Se per sfortuna uno o più dei programmi <command>ar</command>, <command>tar</command> o <command>gzip</command> è scomparso, sarà necessario solamente copiare il programma mancante da un altro sistema (dal momento che ognuno di essi opera in maniera completamente autonoma, senza dipendenze, una semplice copia è sufficiente).
zh_cn: 想象一下，比如你不小心删除了 <command>dpkg</command> 程序，于是你再也无法安装 Debian 软件包了。<command>dpkg</command> 它本身也是一个 Debian 软件包，看起来你的系统又需要……幸运的是，你了解软件包的格式，所以你可以下载 <emphasis role="pkg">dpkg</emphasis> 软件包的 <filename>.deb</filename> 格式，然后手动安装它（详见“工具”提示栏）。如果 <command>ar</command>、<command>tar</command> 或 <command>gzip</command> 之中的一个或多个不幸也消失了，你只需要从另外一个系统拷贝一份过来就行了（因为它们每个程序都是独立的，没有依赖其它程序，所以简单地拷贝就够了）。
