Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: Maintenance and Updates: The APT Tools
de_de: Wartung und Aktualisierung: Die APT-Tools
ja_jp: 保守と更新: APT ツール
pl_pl: Konserwacja i aktualizacje: Narzędzia APT
pt_br: Manutenções e atualizações: As ferramentas APT

source: What makes Debian so popular with administrators is how easily software can be installed and how easily the whole system can be updated. This unique advantage is largely due to the <emphasis>APT</emphasis> program, that Falcot Corp administrators studied with enthusiasm.
ja_jp: Debian が管理者に人気がある理由は、ソフトウェアのインストールが簡単で、システム全体の更新が簡単だからです。この比類なき長所は、主として<emphasis>APT</emphasis> プログラムが荷っており、Falcot Corp の管理者はこれについて熱心に学びました。
pl_pl: Tym co sprawia, że Debian jest tak popularny wśród administratorów, jest łatwość instalacji nowych programów oraz aktualizowania całego systemu. Ta unikatowa zaleta wynika głównie z zastosowania programu <emphasis>APT</emphasis>, którego administratorzy Falcot Corp uczyli się z zapałem.

source: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm> APT is the abbreviation for Advanced Package Tool. What makes this program “advanced” is its approach to packages. It doesn't simply evaluate them individually, but it considers them as a whole and produces the best possible combination of packages depending on what is available and compatible (according to dependencies).
de_de: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm>APT ist die Abkürzung für Advanced Package Tool (fortschrittliches Paketierungstool). Den Begriff fortschrittlich verdient sich das Tool durch sein Herangehen an Pakete. Es bewertet diese nicht einfach individuell, sondern betrachtet die Pakete als Ganzes und erzeugt die bestmögliche Kombination von Paketen abhängig davon, welche (je nach Abhängigkeit) verfügbar und kompatibel sind.
ja_jp: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm> APT は Advanced Package Tool の略称です。このプログラムを「先進的」たらしめているものとは、パッケージの取り扱い方です。APT はパッケージを独立なものとして簡単に評価するのではなく、パッケージ全体を考慮し、(依存関係に従って) 利用可能で矛盾のないパッケージを選び出すことで、実現可能で最適なパッケージの組み合わせを作り出します。
pl_pl: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm> APT jest skrótem od angielskiego Advanced Package Tool - Zaawansowane narzędzie zarządzania pakietami. Tym, co sprawia, że program jest 'zaawansowany', jest traktowanie pakietów. Nie przetwarza ich indywidualnie, lecz uważa je za całość i tworzy najlepszą możliwą kombinację pakietów w zależności od tego, co jest dostępne i kompatybilne (zgodnie z zależnościami).
pt_br: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm> APT é a sigla de Advanced Package Tool (ferramenta de pacotes avançada). O que faz dele "avançado" é sua abordagem quanto a pacotes. Ele não os avalia individualmente, mas considera-os como um todo e produz as melhores combinações de pacotes possível dependendo do que está disponível e compatível (de acordo com as dependências).

source: <emphasis>VOCABULARY</emphasis> Package source and source package
de_de: <emphasis>WÖRTERVERZEICHNIS</emphasis> Paketquellen und Quellpakete
ja_jp: <emphasis>VOCABULARY</emphasis> パッケージソースとソースパッケージ
pl_pl: <emphasis>SŁOWNICZEK</emphasis> Źródło pakietu i pakiet źródłowy
pt_br: <emphasis>VOCABULÁRIO</emphasis> fonte do pacote e pacote fonte

source: The word <emphasis>source</emphasis> can be ambiguous. A source package — a package containing the source code of a program — should not be confused with a package source — a repository (website, FTP server, CD-ROM, local directory, etc.) which contains packages.
de_de: Der Begriff <emphasis>Quelle</emphasis> wird mehrdeutig verwendet. Ein Quellpaket – ein Paket, das den Quelltext eines Programms enthält – sollte nicht mit mit einer Paketquelle verwechselt werden – einem Depot (Website, FTP Server, CD-ROM, lokales Verzeichnis, etc.), das Pakete zur Verfügung stellt .
ja_jp: <emphasis>ソース</emphasis> という言葉は意味があいまいになる場合があります。ソースパッケージ - プログラムのソースコードを含んだパッケージ - をパッケージソース - パッケージが保存されているリポジトリ (ウェブサイト、FTP サーバ、CD-ROM、ローカルディレクトリなど) - と混同してはいけません。
pl_pl: Słowo <emphasis>źródło</emphasis> może być niejednoznaczne. Pakietu źródłowego — pakietu zawierającego kod źródłowy programu — nie należy mylić ze źródłem pakietu — repozytorium (strona www, serwer FTP, CD-ROM, lokalny katalog, itp.), które zawiera pakiety.
pt_br: A palavra <emphasis>origem (fonte)</emphasis> pode ser ambígua. Um pacote de origem (fonte) - um pacote contendo o código fonte de um programa - não deve ser confundido com origem (fonte) do pacote - um repositório (site de internet, servidor FTP, CD-ROM, diretório local, etc.) o qual contém pacotes.

source: APT needs to be given a “list of package sources”: the file <filename>/etc/apt/sources.list</filename> will list the different repositories (or “sources”) that publish Debian packages. APT will then import the list of packages published by each of these sources. This operation is achieved by downloading <filename>Packages.{gz,bz2,lzma,xz}</filename> files (in case of a source of binary packages) and <filename>Sources.{gz,bz2,lzma,xz}</filename> (in case of a source of source packages) and by analyzing their contents. When an old copy of these files is already present, APT can update it by only downloading the differences (see sidebar <xref linkend="sidebar.apt-pdiff" />).
ja_jp: APT には「パッケージソースのリスト」を与える必要があります: <filename>/etc/apt/sources.list</filename> には Debian パッケージを公開している様々なリポジトリ (または「ソース」) が記載されています。APT はそれぞれのソースが公開しているパッケージのリストを取り込みます。この作業は <filename>Packages.{gz,bz2,lzma,xz}</filename> ファイル (バイナリパッケージのソースの場合) と <filename>Sources.{gz,bz2,lzma,xz}</filename> (ソースパッケージのソースの場合) をダウンロードして、内容を解析することで実現されます。これらのファイルの古いコピーが既にあるのなら、APT は差分だけをダウンロードしてファイルを更新します (傍注 <xref linkend="sidebar.apt-pdiff" />を参照してください)。
pl_pl: APTowi trzeba dostarczyć "listę źródeł pakietów": plik <filename>/etc/apt/sources.list</filename> będzie zawierał listę różnych repozytoriów (lub "źródeł"), które publikują pakiety Debiana. Wtedy APT zaimportuje listę pakietów opublikowanych przez każde ze źródeł. Operacja jest dokonywana przez pobranie plików <filename>Packages.{gz,bz2,lzma,xz}</filename> (w przypadku źródła dostarczającego pakiety binarne) i <filename>Sources.{gz,bz2,lzma,xz}</filename> (w przypadku źródła dostarczającego pakiety źródłowe), a następnie analizę ich zawartość. Gdy stara kopia tych plików jest obecna w systemie, APT może zaktualizować ją przez pobranie jedynie różnic (spójrz na fiszkę <xref linkend="sidebar.apt-pdiff" />).

source: <emphasis>BACK TO BASICS</emphasis> <command>gzip</command>, <command>bzip2</command>, <command>LZMA</command> and <command>XZ</command> Compression
de_de: <emphasis>ZURÜCK ZU DEN GRUNDLAGEN</emphasis> <command>gzip</command>, <command>bzip2</command>, <command>LZMA</command> und <command>XZ</command> Komprimierung
ja_jp: <emphasis>BACK TO BASICS</emphasis> <command>gzip</command>、<command>bzip2</command>、<command>LZMA</command>、<command>XZ</command> 圧縮
pl_pl: <emphasis>WRACAJĄC DO PODSTAW</emphasis> Kompresja <command>gzip</command>, <command>bzip2</command>, <command>LZMA</command> i <command>XZ</command>
pt_br: <emphasis>DE VOLTA AO BÁSICO</emphasis> <command>gzip</command>, <command>bzip2</command>, <command>LZMA</command> e <command>XZ</command> Compressão

source: A <filename>.gz</filename> extension refers to a file compressed with the <command>gzip</command> utility. <command>gzip</command> is the fast and efficient traditional Unix utility to compress files. Newer tools achieve better rates of compression but require more resources (computation time and memory) to compress and uncompress a file. Among them, and by order of appearance, there are <command>bzip2</command> (generating files with a <filename>.bz2</filename> extension), <command>lzma</command> (generating <filename>.lzma</filename> files) and <command>xz</command> (generating <filename>.xz</filename> files).
ja_jp: <filename>.gz</filename> 拡張子は <command>gzip</command> ユーティリティで圧縮されたファイルを意味しています。<command>gzip</command> は高速で効果的にファイルを圧縮する伝統的 Unix ユーティリティです。新しいツールは、ファイルを圧縮および展開するために、高い圧縮効率を達成しますが、多くのリソース (計算時間とメモリ) を必要とします。その中でも、登場順に、<command>bzip2</command> (<filename>.bz2</filename> 拡張子のファイルを生成)、<command>lzma</command> (<filename>.lzma</filename> ファイル)、<command>xz</command> (<filename>.xz</filename> ファイル) などがあります。
pl_pl: Rozszerzenie <filename>.gz</filename> oznacza plik skompresowany za pomocą narzędzia <command>gzip</command>. <command>gzip</command> jest szybkim i efektywnym tradycyjnym narzędziem Uniksa do kompresji plików. Nowsze narzędzia osiągają lepsze wskaźniki kompresji, ale wymagają więcej zasobów (czasu obliczeniowego i pamięci) do kompresowania i dekompresowania plików. Wśród nich, oraz w kolejności występowania, są <command>bzip2</command> (tworzący pliki z rozszerzeniem <filename>.bz2</filename>), <command>lzma</command> (tworzący pliki <filename>.lzma</filename>) oraz <command>xz</command> (tworzący pliki <filename>.xz</filename>).

source: Filling in the <filename>sources.list</filename> File
de_de: Befüllen der <filename>sources.list</filename> Datei
ja_jp: <filename>sources.list</filename> ファイルの内容
pl_pl: Wypełnianie pliku <filename>sources.list</filename>
pt_br: Preenchendo no arquivo <filename>sources.list</filename> Arquivo

source: <primary>source</primary><secondary>of packages</secondary>
ja_jp: <primary>ソース</primary><secondary>パッケージの</secondary>

source: <primary>package</primary><secondary>source of</secondary>
de_de: <primary>Paket</primary><secondary>Quelle von</secondary>
ja_jp: <primary>パッケージの</primary><secondary>ソース</secondary>
pt_br: <primary>pacote</primary><secondary>origem de</secondary>

source: Syntax
ja_jp: 構文
pl_pl: Składnia

source: Each active line of the <filename>/etc/apt/sources.list</filename> file contains the description of a source, made of 3 parts separated by spaces.
de_de: Jede aktive Zeile in der Datei <filename>/etc/apt/sources.list</filename> enthält die Beschreibung einer Quelle, bestehend aus drei, durch Kommata getrennten, Teilen.
ja_jp: <filename>/etc/apt/sources.list</filename> ファイルの各有効行には、空白で分割された 3 つの部分からなる、ソースの説明が含まれています。
pl_pl: Każda aktywna linia pliku <filename>/etc/apt/sources.list</filename> zawiera opis źródła, tworzony z 3 części oddzielonych spacjami.
pt_br: Cada linha ativa do arquivo <filename>/etc/apt/sources.list</filename> contém a descrição da origem, feita de 3 partes separadas por espaços.

source: The first field indicates the source type:
de_de: Das erste Feld bezeichnet die Art der Quelle:
ja_jp: 1 番目のフィールドはソースタイプです:
pl_pl: Pierwsze pole określa rodzaj źródła:
pt_br: O primeiro campo indica o tipo da origem:

source: “<literal>deb</literal>” for binary packages,
de_de: “<literal>deb</literal>” für Binärpakete,
ja_jp: 「<literal>deb</literal>」はバイナリパッケージ用、
pl_pl: “<literal>deb</literal>” dla pakietów binarnych,
pt_br: “<literal>deb</literal>” para pacotes binários,

source: “<literal>deb-src</literal>” for source packages.
de_de: “<literal>deb-src</literal>” für Quellpakete.
ja_jp: 「<literal>deb-src</literal>」はソースパッケージ用です。
pl_pl: “<literal>deb-src</literal>” dla pakietów źródłowych.
pt_br: “<literal>deb-src</literal>” para pacotes de código fonte.

source: The second field gives the base URL of the source (combined with the filenames present in the <filename>Packages.gz</filename> files, it must give a full and valid URL): this can consist in a Debian mirror or in any other package archive set up by a third party. The URL can start with <literal>file://</literal> to indicate a local source installed in the system's file hierarchy, with <literal>http://</literal> to indicate a source accessible from a web server, or with <literal>ftp://</literal> for a source available on an FTP server. The URL can also start with <literal>cdrom://</literal> for CD-ROM/DVD-ROM/Blu-ray disc based installations, although this is less frequent, since network-based installation methods are more and more common.
ja_jp: 2 番目のフィールドはパッケージソースの基点 URL です (<filename>Packages.gz</filename> ファイル内のファイル名と組み合わせます、これは完全で有効な URL でなければいけません): 起点 URL には Debian ミラーまたはサードパーティが提供する他のパッケージアーカイブを指定できます。URL は、システムのファイル階層構造内にあるローカルソースを表す <literal>file://</literal>、ウェブサーバにあるソースを示す <literal>http://</literal>、FTP サーバにあるソースを示す <literal>ftp://</literal>、で始める事が可能です。この URL はまた CD-ROM/DVD-ROM/ブルーレイディスクからインストールした事を表す <literal>cdrom://</literal> で始める事も可能です。しかしこれはそれほど多くありません。なぜなら、ネットワークを使ったインストール方法がずっと一般的だからです。
pl_pl: Drugie pole zawiera bazowy URL źródła (w połączeniu z nazwami w pliku <filename>Packages.gz</filename>, stanowi pełny i prawomocny adres URL): może on znajdować się na serwerze lustrzanym Debiana lub w innym archiwum pakietu utworzonego przez stronę trzecią. URL może rozpoczynać się od <literal>file://</literal> wskazując lokalne źródło zainstalowane w systemowej hierarchii plików, <literal>http://</literal> wskazując źródło dostępne z serwera WWW, lub <literal>ftp://</literal> dla źródła dostępnego na serwerze FTP. Adres URL może również rozpoczynać się od <literal>cdrom://</literal> dla instalacji z płyty CD-ROM/DVD-ROM/Blu-ray, chociaż ten jest rzadziej spotykany, ponieważ metody instalacji oparte na sieci są coraz bardziej powszechne.

source: The syntax of the last field depends on the structure of the repository. In the simplest cases, you can simply indicate a subdirectory (with a required trailing slash) of the desired source (this is often a simple “<filename>./</filename>” which refers to the absence of a subdirectory — the packages are then directly at the specified URL). But in the most common case, the repositories will be structured like a Debian mirror, with multiple distributions each having multiple components. In those cases, name the chosen distribution (by its “codename” — see the list in sidebar <xref linkend="sidebar.bruce-perens" /> — or by the corresponding “suites” — <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>), then the components (or sections) to enable (chosen between <literal>main</literal>, <literal>contrib</literal>, and <literal>non-free</literal> in a typical Debian mirror).
ja_jp: 最後のフィールドの構文はリポジトリの構造に依存します。最も単純な場合、このフィールドにはソースから見たサブディレクトリ (末尾スラッシュ必須) を指定します (サブディレクトリが無い - パッケージが指定された URL の直下に有る - 事を示す単純な「<filename>./</filename>」の場合が多いです)。しかし最も多く見られるのは、リポジトリが Debian ミラーのように構造化されている、つまり、複数のコンポーネントを持つ複数のディストリビューションを配布している場合です。この場合、そのマシンのディストリビューションの名前 (「コードネーム」- 傍注 <xref linkend="sidebar.bruce-perens" /> を参照 - または対応する「スイート」- <literal>stable</literal>、<literal>testing</literal>、<literal>unstable</literal>) を指定し、その後に有効化するコンポーネント (またはセクション) を指定します (典型的な Debian ミラーでは <literal>main</literal>、<literal>contrib</literal>、<literal>non-free</literal> から選びます)。
pl_pl: Składnia ostatniego pola zależy od struktury repozytorium. W najprostszym przypadku, można zwyczajnie wskazać podkatalog (z wymaganym ukośnikiem na końcu) pożądanego źródła (często jest to po prostu “<filename>./</filename>”, które sygnalizuje brak podkatalogu — pakiety są wtedy bezpośrednio pod wskazanym adresem URL). W najczęściej spotykanym przypadku, repozytoria będą miały strukturę serwera lustrzanego Debiana, z wieloma dystrybucjami, z których każda zawiera wiele komponentów. W tych przypadkach należy podać nazwę wybranej dystrybucji (poprzez jej "nazwę kodową" — spójrz na listę w fiszce <xref linkend="sidebar.bruce-perens" /> — lub odpowiednie "wydania" — <literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal>), a następnie komponenty (lub sekcje) aby aktywować (wybrane spośród <literal>main</literal>, <literal>contrib</literal> i <literal>non-free</literal> na typowym serwerze lustrzanym Debiana).

source: <emphasis>VOCABULARY</emphasis> The <literal>main</literal>, <literal>contrib</literal> and <literal>non-free</literal> archives
ja_jp: <emphasis>VOCABULARY</emphasis> <literal>main</literal>、<literal>contrib</literal>、<literal>non-free</literal> アーカイブ
pl_pl: <emphasis>SŁOWNICZEK</emphasis> Archiwa <literal>main</literal>, <literal>contrib</literal> i <literal>non-free</literal>.

source: <primary>section</primary><secondary><literal>main</literal></secondary>
ja_jp: <primary>セクション</primary><secondary><literal>main</literal></secondary>

source: <primary><literal>main</literal>, section</primary>
ja_jp: <primary><literal>main</literal>、セクション</primary>

source: <primary>section</primary><secondary><literal>contrib</literal></secondary>
ja_jp: <primary>セクション</primary><secondary><literal>contrib</literal></secondary>

source: <primary><literal>contrib</literal>, section</primary>
ja_jp: <primary><literal>contrib</literal>、セクション</primary>

source: <primary>section</primary><secondary><literal>non-free</literal></secondary>
ja_jp: <primary>セクション</primary><secondary><literal>non-free</literal></secondary>

source: <primary><literal>non-free</literal>, section</primary>
ja_jp: <primary><literal>non-free</literal>、セクション</primary>

source: <primary>component (of a repository)</primary>
ja_jp: <primary>(リポジトリの) コンポーネント</primary>
pl_pl: <primary>komponent (w repozytorium)</primary>

source: Debian uses three sections to differentiate packages according to the licenses chosen by the authors of each work. <literal>Main</literal> gathers all packages which fully comply with the Debian Free Software Guidelines.
ja_jp: Debian では、パッケージの作者が決めたライセンスを基準に、パッケージを 3 つのセクションに分類しています。<literal>Main</literal> には Debian フリーソフトウェアガイドラインに適合するすべてのパッケージが収録されています。
pl_pl: Debian używa trzech sekcji do różnicowania pakietów według licencji wybranych przez autorów poszczególnych prac. <literal>Main</literal> gromadzi wszystkie pakiety w pełni zgodne z Wytycznymi Debiana dotyczącymi Wolnego Oprogramowania (DFSG).

source: The <literal>non-free</literal> archive is different because it contains software which does not (entirely) conform to these principles but which can nevertheless be distributed without restrictions. This archive, which is not officially part of Debian, is a service for users who could need some of those programs — however Debian always recommends giving priority to free software. The existence of this section represents a considerable problem for Richard M. Stallman and keeps the Free Software Foundation from recommending Debian to users.
ja_jp: これに対して、<literal>non-free</literal> アーカイブには、原則に (完全に) 従うわけではないものの制限なく配布する事を許されたソフトウェアが収録されています。このアーカイブは公式には Debian の一部ではなく、これらのプログラムを必要としている - しかし Debian は常にフリーソフトウェアを重点的に使う事を推奨します - ユーザ向けのサービスです。このセクションの存在は Richard M. Stallman さんにとって無視できない問題であり、このセクションがあるためフリーソフトウェア財団は Debian をユーザに推奨し続けています。
pl_pl: Archiwum <literal>non-free</literal> jest inne, ponieważ zawiera oprogramowanie, które nie jest (w całości) dostosowane do tych zasad, ale które mimo to mogą być rozpowszechniane bez ograniczeń. To archiwum, które nie jest oficjalnie częścią Debiana, jest usługą dla użytkowników, którzy mogą potrzebować niektórych z tych programów — jednak Debian zawsze zaleca nadawać priorytet wolnemu oprogramowaniu. Istnienie tej sekcji stanowi znaczący problem dla Richarda M. Stallmana i przez to Free Software Foundation nie rekomenduje Debiana użytkownikom.

source: <literal>Contrib</literal> (contributions) is a set of open source software which cannot function without some non-free elements. These elements can be software from the <literal>non-free</literal> section, or non-free files such as game ROMs, BIOS of consoles, etc. <literal>Contrib</literal> also includes free software whose compilation requires proprietary elements. This was initially the case for the OpenOffice.org office suite, which used to require a proprietary Java environment.
ja_jp: <literal>contrib</literal> (貢献) には、フリーでない要素を使わないと動かないオープンソースソフトウェアが収録されています。フリーでない要素とは <literal>non-free</literal> セクションからのソフトウェア、または例えばゲーム ROM、コンソールの BIOS、などのフリーでないファイルを指します。また、<literal>contrib</literal> にはコンパイルの際にプロプライエタリな要素を必要とするフリーソフトウェアが収録されています。当初これはプロプライエタリな Java 環境を必要とする OpenOffice.org オフィススイートのためのものでした。
pl_pl: <literal>Contrib</literal> (kontrybucje) jest zbiorem oprogramowania otwartoźródłowego, które nie może funkcjonować bez pewnych nie-wolnych elementów. Te elementy mogą pochodzić z sekcji <literal>non-free</literal> lub nie-wolnych plików, takich jak ROMy gier, BIOS konsol, itd. <literal>Contrib</literal> zawiera również oprogramowanie, którego kompilacja wymaga własnościowych elementów. Początkowo było tak w przypadku pakietu biurowego OpenOffice.org, który wymagał własnościowego środowiska Java.

source: <emphasis>TIP</emphasis> <filename>/etc/apt/sources.list.d/*.list</filename> files
de_de: <emphasis>TIPP</emphasis> <filename>/etc/apt/sources.list.d/*.list</filename> Dateien
ja_jp: <emphasis>TIP</emphasis> <filename>/etc/apt/sources.list.d/*.list</filename> ファイル
pl_pl: <emphasis>WSKAZÓWKA</emphasis> Pliki <filename>/etc/apt/sources.list.d/*.list</filename>
pt_br: <emphasis>DICA</emphasis> <filename>/etc/apt/sources.list.d/*.list</filename> arquivos

source: If many package sources are referenced, it can be useful to split them in multiple files. Each part is then stored in <filename>/etc/apt/sources.list.d/<replaceable>filename</replaceable>.list</filename> (see sidebar <xref linkend="sidebar.directory.d" />).
ja_jp: 多数のパッケージソースを利用する場合、これらを複数のファイルに分割すると便利かもしれません。この場合、各パッケージソースを <filename>/etc/apt/sources.list.d/<replaceable>filename</replaceable>.list</filename> に保存します (傍注 <xref linkend="sidebar.directory.d" />を参照してください)。
pl_pl: Jeżeli wymieniono wiele źródeł pakietów, dla wygody można je podzielić między kilka plików. Każda część jest wtedy przechowana w pliku <filename>/etc/apt/sources.list.d/<replaceable>nazwa_pliku</replaceable>.list</filename> (spójrz na fiszkę <xref linkend="sidebar.directory.d" />).

source: The <literal>cdrom</literal> entries describe the CD/DVD-ROMs you have. Contrary to other entries, a CD-ROM is not always available since it has to be inserted into the drive and since only one disc can be read at a time. For those reasons, these sources are managed in a slightly different way, and need to be added with the <command>apt-cdrom</command> program, usually executed with the <literal>add</literal> parameter. The latter will then request the disc to be inserted in the drive and will browse its contents looking for <filename>Packages</filename> files. It will use these files to update its database of available packages (this operation is usually done by the <command>apt-get update</command> command). From then on, APT can require the disc to be inserted if it needs one of its packages.
ja_jp: <literal>cdrom</literal> エントリはあなたの持っている CD/DVD-ROM を表しています。他のエントリと異なり、CD-ROM は常に利用可能ではありません。なぜなら、ディスクをドライブに挿入しなければいけませんし、一度に 1 つのディスクしか読めないからです。このような理由で、CD-ROM ソースは少し違う方法で管理されます。ソースを追加するには通常 <command>apt-cdrom</command> プログラムに <literal>add</literal> パラメータを付けて実行します。このようにプログラムを実行すると、ドライブにディスクを挿入するよう要求されます。プログラムはディスクの内容を閲覧して <filename>Packages</filename> ファイルを探します。このファイルは利用可能なパッケージデータベースを更新する際に利用されます (更新作業は <command>apt-get update</command> コマンドで実行されます)。そして、APT はディスクに含まれるパッケージが必要になったらディスクを挿入するように要求します。
pl_pl: Wpisy <literal>cdrom</literal> opisują CD/DVD-ROMy, które posiadasz. W przeciwieństwie do innych wpisów, CD-ROM nie zawsze jest dostępny, ponieważ musi być włożony do napędu i może być czytany tylko jeden na raz. Z wymienionych powodów, te źródła są zarządzane w nieco inny sposób i muszą być dodawane za pomocą programu <command>apt-cdrom</command>, zazwyczaj uruchamianego z parametrem <literal>add</literal>. W tym przypadku program zażąda włożenia płyty do napędu i przeszuka jej zawartość w poszukiwaniu plików <filename>Pakietów</filename>. Użyje tych plików do zaktualizowania bazy dostępnych pakietów (ta operacja jest zwykle wywoływana komendą <command>apt-get update</command>). Od tej pory APT może wymagać włożenia płyty, jeżeli będzie potrzebował któregoś z tych pakietów.
