Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: Most of <command>aptitude</command>'s features are accessible via the interactive interface as well as via command-lines. These command-lines will seem familiar to regular users of <command>apt-get</command> and <command>apt-cache</command>.
de_de: Die meisten Eigenschaften von <command>aptitude</command> sind sowohl über die interaktive Schnittstelle als auch über die Kommandozeile verfügbar. Diese Kommandos werden regelmäßigen Nutzern von <command>apt-get</command> und <command>apt-cache</command> bekannt vorkommen.
ja_jp: <command>aptitude</command> の機能のほとんどは対話型インターフェースだけでなくコマンドラインインターフェースからも利用できます。コマンドラインは <command>apt-get</command> と <command>apt-cache</command> を日常的に使っているユーザにとって身近なものでしょう。
pl_pl: Większość opcji <command>aptitude</command> jest dostępna zarówno przez interaktywny interfejs i w linii komend. Opisane polecenia powinny być znajome stałym użytkownikom <command>apt-get</command> i <command>apt-cache</command>.
pt_br: A maioria das funcionalidade do <command>aptitude</command> estão disponíveis tanto na interface interativa quanto na linha de comando. A interface de linha de comando é bem familiar para quem já usa os comandos <command>apt-get</command> e <command>apt-cache</command>.

source: The advanced features of <command>aptitude</command> are also available on the command-line. You can use the same package search patterns as in the interactive version. For example, if you want to cleanup the list of “manually installed” packages, and if you know that none of the locally installed programs require any particular libraries or Perl modules, you can mark the corresponding packages as automatic with a single command:
ja_jp: <command>aptitude</command> の先進的な機能はコマンドラインからも使えます。パッケージ検索パターンは対話的インターフェースの場合と同じです。例えば、「手作業でインストールされた」パッケージのリストを綺麗に片付けたい場合、インストール済みでパッケージ管理下に無いプログラムが特定のライブラリと Perl モジュールに依存していないと知っていれば、たった 1 つのコマンドで関連するパッケージを自動パッケージとしてマークする事が可能です:
pl_pl: Zaawansowane opcje <command>aptitude</command> są również dostępne w linii komend. Można używać tych samych wzorców wyszukiwania, co w wersji interaktywnej. Na przykład, jeżeli celem jest oczyszczenie listy "ręcznie zainstalowanych" pakietów i wiadomo, że żaden z lokalnie zainstalowanych programów nie wymaga jakichś konkretnych bibliotek modułów Perla, można oznaczyć wspomniane pakiety jako automatyczne za pomocą pojedynczej komendy:

source: Here, you can clearly see the power of the search pattern system of <command>aptitude</command>, which enables the instant selection of all the packages in the <literal>libs</literal> and <literal>perl</literal> sections.
de_de: Hier offenbart sich die Mächtigkeit der Mustersuche von <command>aptitude</command>, durch die es möglich ist, alle Pakete der Sektionen <literal>libs</literal> und <literal>perl</literal> gleichzeitig auszuwählen.
ja_jp: この検索例は、<literal>libs</literal> と <literal>perl</literal> セクションに含まれる全パッケージを簡単に選択しており、<command>aptitude</command> で使える検索パターンシステムの力を明確に表わしています。
pl_pl: Na przykładzie tej komendy można zauważyć prawdziwą potęgę systemu wzorców wyszukiwania <command>aptitude</command>, która pozwala natychmiastowo zaznaczyć wszystkie pakiety w sekcjach <literal>libs</literal> i <literal>perl</literal>.
pt_br: Aqui, você pode claramente ver o poder do sistema de padrões de busca do <command>aptitude</command>, que permite a seleção instantânea de todos os pacotes nas seções <literal>libs</literal> e <literal>perl</literal>.

source: Beware, if some packages are marked as automatic and if no other package depends on them, they will be removed immediately (after a confirmation request).
de_de: Beachten Sie: Wenn Pakete als automatisch markiert sind und kein anderes Paket von ihnen abhängt, werden sie bei der nächsten Gelegenheit (nach einer Rückfrage) entfernt.
ja_jp: あるパッケージが、自動パッケージとしてマークされたパッケージに依存していない場合、そのパッケージはすぐに (削除要求を確認した後に) 削除されます。この点について気を付けてください。
pl_pl: Należy jednak uważać, ponieważ jeżeli jakieś pakiety zostaną oznaczone jako automatyczne i nie są wymagane przez żaden inny pakiet, to zostaną natychmiast usunięte (po prośbie o potwierdzenie).
pt_br: Cuidado, se alguns pacotes são marcados como automáticos e se não há outros pacotes dependendo deles, eles serão removidos imediatamente (depois de uma confirmação).

source: Managing Recommendations, Suggestions and Tasks
de_de: Verwalten von Empfehlungen, Vorschläge und Aufgaben
ja_jp: 推奨パッケージ、提案パッケージ、タスクの管理
pl_pl: Zarządzanie Rekomendacjami, Sugestiami i Zadaniami
pt_br: Gerenciando Recomendações, Sugestões e Tarefas

source: Another interesting feature of <command>aptitude</command> is the fact that it respects recommendations between packages while still giving users the choice not to install them on a case by case basis. For example, the <emphasis role="pkg">gnome</emphasis> package recommends <emphasis role="pkg">gdebi</emphasis> (among others). When you select the former for installation, the latter will also be selected (and marked as automatic if not already installed on the system). Typing <keycombo><keycap>g</keycap></keycombo> will make it obvious: <emphasis role="pkg">gdebi</emphasis> appears on the summary screen of pending actions in the list of packages installed automatically to satisfy dependencies. However, you can decide not to install it by deselecting it before confirming the operations.
ja_jp: <command>aptitude</command> が提供するもう 1 つの興味深い特徴は、パッケージ間の推奨関係を尊重する点です。とは言え、個々の場合に応じて、推奨パッケージをインストールしないようにする事も可能です。例えば、<emphasis role="pkg">gnome</emphasis> パッケージは (数ある中でも特に) <emphasis role="pkg">gdebi</emphasis> のインストールを推奨しています。<emphasis role="pkg">gnome</emphasis> をインストールするよう選んだ場合、同時に <emphasis role="pkg">gdebi</emphasis> も選ばれます (既にシステムにインストール済みでない限り、自動パッケージとしてマークされます)。これを確認するには、<keycombo><keycap>g</keycap></keycombo> とタイプしてください: <emphasis role="pkg">gdebi</emphasis> は、依存関係を満足させる目的で自動的にインストールされたパッケージのリスト中、保留動作の要約画面に現れます。しかしながら、操作確認の前にインストールマークを外すことで、パッケージをインストールしないようにできます。
pl_pl: Kolejną ciekawą funkcją <command>aptitude</command> jest to, że uznaje rekomendacje pomiędzy pakietami, jednocześnie dla każdego przypadku dając użytkownikowi możliwość ich nie instalowania. Na przykład pakiet <emphasis role="pkg">gnome</emphasis> rekomenduje (między innymi) <emphasis role="pkg">gdebi</emphasis>. Kiedy pierwszy z nich zostanie wybrany do instalacji, to drugi również zostanie wybrany (i oznaczony jako automatyczny, jeżeli nie jest jeszcze zainstalowany). Po wpisaniu <keycombo><keycap>g</keycap></keycombo>, <emphasis role="pkg">gdebi</emphasis> pojawi się na ekranie podsumowania oczekujących akcji na liście pakietów zainstalowanych automatycznie dla rozwiązania zależności. Jednakże można zdecydować, aby pominąć jego instalację poprzez odznaczenie go przed zatwierdzeniem operacji.

source: Note that this recommendation tracking feature does not apply to upgrades. For instance, if a new version of <emphasis role="pkg">gnome</emphasis> recommends a package that it did not recommend formerly, the package won't be marked for installation. However, it will be listed on the upgrade screen so that the administrator can still select it for installation.
ja_jp: パッケージをアップグレードする場合、上で述べた推奨関係を追跡してインストールパッケージを自動選択する機能が作動しない点に注意してください。例えば、<emphasis role="pkg">gnome</emphasis> の新バージョンが、以前推奨していなかったパッケージを推奨している場合、このパッケージは選択されません。しかしながら、管理者がインストールの可否を選択できるように、このパッケージはアップグレード画面に表示されます。
pl_pl: Zauważ, że funkcja śledzenia rekomendacji nie stosuje się do uaktualnień. Na przykład, jeżeli nowa wersja <emphasis role="pkg">gnome</emphasis> rekomenduje pakiet, którego wcześniej nie rekomendowała, wtedy pakiet nie zostanie zaznaczony do instalacji. Jednakże nadal zostanie na liście ekranu uaktualnienia, tak żeby administrator mógł ja zaznaczyć do instalacji.

source: Suggestions between packages are also taken into account, but in a manner adapted to their specific status. For example, since <emphasis role="pkg">gnome</emphasis> suggests <emphasis role="pkg">dia-gnome</emphasis>, the latter will be displayed on the summary screen of pending actions (in the section of packages suggested by other packages). This way, it is visible and the administrator can decide whether to take the suggestion into account or not. Since it is only a suggestion and not a dependency or a recommendation, the package will not be selected automatically — its selection requires a manual intervention from the user (thus, the package will not be marked as automatic).
ja_jp: さらに、パッケージ間の提案関係が考慮されますが、そのやり方はパッケージを特定の表示状態にするだけです。例えば、<emphasis role="pkg">gnome</emphasis> は <emphasis role="pkg">dia-gnome</emphasis> を提案しており、<emphasis role="pkg">dia-gnome</emphasis> は保留動作の要約画面 (他のパッケージによって提案されたパッケージのセクションの中) に表示されるでしょう。このように、提案されたパッケージは一覧に表示され、管理者はこの提案に従ってインストールするか否かを決めます。パッケージ間の提案関係とは依存関係でも推奨関係でもないので、提案されたパッケージは自動的にインストールマークを付けられません - ユーザがインストールするか否かを手作業で選択します (このため、提案されたパッケージは自動パッケージとしてマークされません)。
pl_pl: Sugestie pomiędzy pakietami również są brane pod uwagę, ale w sposób dopasowany do ich szczególnego statusu. Na przykład, ponieważ <emphasis role="pkg">gnome</emphasis> sugeruje <emphasis role="pkg">dia-gnome</emphasis>, ten drugi zostanie wyświetlony na ekranie oczekujących akcji (w sekcji pakietów sugerowanych przez inne pakiety). W ten sposób jest to widoczne i administrator może zdecydować, czy wziąć pod uwagę sugestie, czy nie. Ze względu na to, że jest to tylko sugestia, a nie zależność lub rekomendacja, pakiet nie zostanie zaznaczony automatycznie — jego zaznaczenie wymaga ręcznej interwencji użytkownika (dlatego pakiet nie zostanie zaznaczony jako automatyczny).

source: In the same spirit, remember that <command>aptitude</command> makes intelligent use of the concept of task. Since tasks are displayed as categories in the screens of packages lists, you can either select a full task for installation or removal, or browse the list of packages included in the task to select a smaller subset.
ja_jp: 同様の姿勢で、<command>aptitude</command> はタスクの概念を上手に取り扱う事を思い出してください。タスクはパッケージの画面内にカテゴリとして表示されるため、ユーザはタスクのインストール作業および削除作業を、タスク全体に対して適用するか、タスクのパッケージの一部を選択してそれらに適用するかを選ぶ事が可能です。
pl_pl: W tym samym duchu, należy pamiętać, że <command>aptitude</command> inteligentnie wykorzystuje koncepcję zadań. Ze względu na to, że zadania są wyświetlane jako kategorie na ekranie list pakietów, możliwe jest zaznaczenia całego zadania do instalacji lub usunięcia, lub przeglądanie listy pakietów zawartych w zadaniu, aby zaznaczyć mniejszy podzbiór.

source: Better Solver Algorithms
de_de: Bessere Problemlösungs-Algorithmen
ja_jp: より良いソルバアルゴリズム
pl_pl: Lepsze Algorytmy Analityczne
pt_br: Algoritmos de Solução Melhores

source: To conclude this section, let's note that <command>aptitude</command> has more elaborate algorithms compared to <command>apt-get</command> when it comes to resolving difficult situations. When a set of actions is requested and when these combined actions would lead to an incoherent system, <command>aptitude</command> evaluates several possible scenarios and presents them in order of decreasing relevance. However, these algorithms are not failproof. Fortunately there is always the possibility to manually select the actions to perform. When the currently selected actions lead to contradictions, the upper part of the screen indicates a number of “broken” packages (and you can directly navigate to those packages by pressing <keycombo><keycap>b</keycap></keycombo>). It is then possible to manually build a solution for the problems found. In particular, you can get access to the different available versions by simply selecting the package with <keycombo><keycap>Enter</keycap></keycombo>. If the selection of one of these versions solves the problem, you should not hesitate to use the function. When the number of broken packages gets down to zero, you can safely go to the summary screen of pending actions for a last check before you apply them.
de_de: Um diesen Abschnitt zu beschließen, lassen Sie uns festhalten, dass <command>aptitude</command> im Vergleich zu <command>apt-get</command> über raffiniertere Algorithmen verfügt, wenn es darum geht, schwierige Situationen aufzulösen. Wenn eine Folge von gewünschten Aktionen in Kombination zu einem inkohärenten System führen würde, wertet <command>aptitude</command> verschiedene mögliche Szenarien aus und schlägt diese in absteigender Relevanz vor. Trotzdem sind diese Algorithmen nicht unfehlbar. Glücklicherweise besteht immer die Möglichkeit, die auszuführenden Aktionen von Hand auszuwählen. Wenn die aktuell ausgewählten Aktionen zu Widersprüchen führen, wird im oberen Teil des Bildschirms eine Anzahl von beschädigten Paketen angezeigt (Sie können mit <keycombo><keycap>b</keycap></keycombo> direkt zu diesen Paketen navigieren). Dann können Sie manuell eine Lösung für die gefundenen Probleme zusammenstellen. Im Besonderen haben Sie Zugang zu den verschiedenen verfügbaren Versionen, indem Sie das Paket mit <keycombo><keycap>Enter</keycap></keycombo> anwählen. Löst die Auswahl einer der verfügbaren Versionen das Problem, sollten Sie sich nicht scheuen, Gebrauch von dieser Funktion zu machen. Sinkt die Anzahl der beschädigten Pakete auf Null können Sie beruhigt in die Zusammenfassung der anstehenden Aktionen springen und diese ein letztes Mal prüfen, bevor Sie sie ausführen.
ja_jp: この節を締め括るために、<command>aptitude</command> は <command>apt-get</command> に比べてより複雑なアルゴリズム使って難しい状況を解決する、という点に注意しましょう。一連の動作が要求され、すべての動作を適用するとシステムの一貫性が失われる場合、<command>aptitude</command> は幾つかの解決策を検討し、適用後の一貫性が高い順に解決策を提示します。しかしながら、このアルゴリズムは単なるケアレスミスの予防策ではありません。幸いなことに、ユーザは常に手作業で適用する動作を選択できます。現在選択された動作によって矛盾が引き起こされる場合、画面の上の方に「壊れた」パッケージの数が表示されます (パッケージの選択を直接操作するには <keycombo><keycap>b</keycap></keycombo> を押してください)。そして、見つかった問題を手作業で解決する事も可能です。具体的に言うと、単純に <keycombo><keycap>Enter</keycap></keycombo> でパッケージを選択すれば、利用可能な複数のバージョンを確認できます。複数のバージョンから 1 つ選ぶだけで問題が解決されるなら、迷わずこの機能を使うべきです。壊れたパッケージの数がゼロになったら、動作適用前の最終確認のために、保留動作の要約画面に問題なく移動できるはずです。
pl_pl: W celu podsumowania tej sekcji należy zauważyć, że <command>aptitude</command> do rozwiązywania problemów używa bardziej zaawansowanych algorytmów w porównaniu z <command>apt-get</command>. Kiedy żądany zbiór akcji w połączeniu prowadziłby do rozbieżnego działania systemu <command>aptitude</command> ocenia kilka możliwych scenariuszy i prezentuje je w kolejności malejącej ważności. Algorytmy te nie są jednak niezawodne. Na szczęście zawsze istnieje możliwość ręcznego wybrania pożądanych akcji. W przypadku, gdy aktualnie zaznaczone akcje prowadzą do sprzeczności, górna część ekranu wskazuje liczbę "zepsutych" pakietów (można przejść do nich bezpośrednio po naciśnięciu <keycombo><keycap>b</keycap></keycombo>). Można wtedy ręcznie stworzyć rozwiązanie dla znalezionych problemów. W szczególności można uzyskać dostęp do różnych dostępnych wersji poprzez wybranie pakietu za pomocą klawisza <keycombo><keycap>Enter</keycap></keycombo>. Jeżeli wybranie jednej z tych wersji rozwiązuje problem, to użycie tej funkcji jest najprostszym rozwiązaniem. Kiedy już liczba zepsutych pakietów spadnie do zera, można bezpiecznie przejść do ekranu oczekujących akcji i jeszcze raz je sprawdzić przed zatwierdzeniem.
pt_br: Para concluir esta seção, note que o <command>aptitude</command> tem algoritmos mais elaborados comparado com o <command>apt-get</command> quando se trata de resolver situações difíceis. Quando um conjunto de ações é requerido e quando estas ações combinadas levam a um sistema incoerente, o <command>aptitude</command> calcula vários cenários possíveis e apresenta eles domais para o manos relevante. Entretanto, estes algoritmos não são à prova de falhas. Afortunadamente existe sempre a possibilidade de fazer uma seleção manual das ações a realizar. Quando as ações atualmente selecionadas levam a uma contradição, a parte de cima da tela indica um número de pacotes "quebrados" (e você pode diretamente navegar para estes pacotes pressionando <keycombo><keycap>b</keycap></keycombo>). É então possível construir manualmente uma solução para os problemas encontrados. Em particular, você pode obter acesso a diferentes versões disponíveis simplesmente selecionando o pacote com <keycombo><keycap>Enter</keycap></keycombo>. Se a seleção de uma destas versões resolve o problema, não hesite em usá-la. Quando o número de pacotes quebrados baixa a zero, você pode seguramente ir para a tela de resumo das ações pendentes para uma última verificação antes de aplicar as ações.

source: <emphasis>NOTE</emphasis> <command>aptitude</command>'s log
de_de: <emphasis>HINWEIS</emphasis> Die Protokolldatei von <command>aptitude</command>
ja_jp: <emphasis>NOTE</emphasis> <command>aptitude</command> のログ
pl_pl: <emphasis>ZAUWAŻ</emphasis> Dziennik <command>aptitude</command>'a
pt_br: <emphasis>NOTA</emphasis> logs do <command>aptitude</command>

source: Like <command>dpkg</command>, <command>aptitude</command> keeps a trace of executed actions in its logfile (<filename>/var/log/aptitude</filename>). However, since both commands work at a very different level, you cannot find the same information in their respective logfiles. While <command>dpkg</command> logs all the operations executed on individual packages step by step, <command>aptitude</command> gives a broader view of high-level operations like a system-wide upgrade.
de_de: Ebenso wie <command>dpkg</command> führt <command>aptitude</command> Buch über ausgeführte Aktionen – in seiner Protokolldatei (<filename>/var/log/aptitude</filename>). Da beide Programme auf sehr unterschiedlichen Ebenen arbeiten, finden sich in den Protokolldateien beider Programme unterschiedliche Informationen. Während <command>dpkg</command> alle auf individuelle Pakete angewendeten Operationen Schritt für Schritt protokolliert, stellt <command>aptitude</command> eine breitere Sicht auf einer höheren Ebene, wie zum Beispiel eine systemweite Aktualisierung, dar.
ja_jp: <command>dpkg</command> と同様に、<command>aptitude</command> は実行した動作をログファイル (<filename>/var/log/aptitude</filename>) に記録します。しかしながら、両方のコマンドは全く異なる階層で動いているので、それぞれのログファイルには異なる情報が含まれます。<command>dpkg</command> が各パッケージに対して行ったすべての動作を 1 つづつ記録するのに対し、<command>aptitude</command> はシステム全体のアップグレードなどの高レベル動作に対するより俯瞰的な情報を記録します。
pl_pl: Podobnie do <command>dpkg</command>, <command>aptitude</command> przechowuje listęp wykonanych akcji w pliku dziennika (<filename>/var/log/aptitude</filename>). Jednakże ze względu na to, że obie komendy działają na zupełnie innym poziomie, w ich plikach dziennika znajdują się różne informacje. Podczas, gdy <command>dpkg</command> zapisuje wszystkie operacje wykonywane krok po kroku dla każdego pakietu, <command>aptitude</command> daje bardziej ogólny widok na wysokopoziomowe operacje, takie jak uaktualnienie systemu.
pt_br: Assim como o <command>dpkg</command>, <command>aptitude</command> mantém um registro das ações executadas no seu arquivo de log (<filename>/var/log/aptitude</filename>). Entretanto, como os dois comandos trabalham em níveis muito diferentes, você não achará a mesma informação nos seus respectivos arquivos de log. Enquanto o <command>dpkg</command> loga todas as operações executadas em pacotes individuais, passo a passo, o <command>aptitude</command> dá uma visão geral das operações de alto nível, como uma atualização de sistema.

source: Beware, this logfile only contains a summary of operations performed by <command>aptitude</command>. If other front-ends (or even <command>dpkg</command> itself) are occasionally used, then <command>aptitude</command>'s log will only contain a partial view of the operations, so you can't rely on it to build a trustworthy history of the system.
de_de: Beachten Sie, dass die Protokolldatei nur eine Zusammenfassung der von <command>aptitude</command> ausgeführten Operationen umfasst. Wenn gelegentlich andere Benutzeroberflächen (oder gar <command>dpkg</command> selbst) benutzt werden, enthält die Protokolldatei von <command>aptitude</command> nur eine unvollständige Ansicht der durchgeführten Operationen, so dass Sie sich nicht auf diese Informationen verlassen können, um einen verlässlichen Verlauf des Systems wiederzugeben.
ja_jp: このログファイルには、<command>aptitude</command> が実行した操作の要約だけが含まれる点に注意してください。途中で他のフロントエンド (または <command>dpkg</command> 自身) が使われた場合、<command>aptitude</command> のログには、操作全体の一部分しか記録されません。このため、信頼できるシステムの履歴を確認したい場合に、このログは頼りになりません。
pl_pl: Należy jednak mieć na uwadze, że plik dziennika zawiera tylko podsumowanie operacji wykonanych przez <command>aptitude</command>. Jeżeli używane są inne interfejsy (lub nawet sam <command>dpkg</command>), to dzienniki <command>aptitude</command> będą zawierać jedynie częściowy zapis operacji, więc nie należy na nim polegać w celu tworzenia wiarygodnej historii systemu.
pt_br: Cuidado, este arquivo de log contém um resumo das operações realizadas pelo <command>aptitude</command>. Se outras interfaces (ou o próprio <command>dpkg</command>) forem usadas ocasionalmente, então o log do <command>aptitude</command> vai conter apenas uma visão parcial das operações, de forma que você não pode se basear simplesmente nele para ter uma história totalmente confiável do seu sistema.

source: <command>synaptic</command> is a graphical package manager for Debian which features a clean and efficient graphical interface based on GTK+/GNOME. Its many ready-to-use filters give fast access to newly available packages, installed packages, upgradable packages, obsolete packages and so on. If you browse through these lists, you can select the operations to be done on the packages (install, upgrade, remove, purge); these operations are not performed immediately, but put into a task list. A single click on a button then validates the operations, and they are performed in one go.
de_de: <command>synaptic</command> ist eine grafische Paketverwaltung für Debian mit einer klaren und effizienten Benutzeroberfläche auf Basis von GTK+/GNOME. Die vielen gebrauchsfertigen Filter bieten einen schnellen Zugriff auf neu verfügbare Pakete, installierte Pakete, aktualisierbare Pakete, überflüssige Pakete usw. Während Sie diese Listen durchgehen, können sie Operationen auswählen, die auf die Pakete angewendet werden (installieren, aktualisieren, entfernen, vollständig löschen). Diese Operationen werden nicht umgehend ausgeführt, sondern in eine Aufgabenliste aufgenommen. Ein einzelner Klick auf eine Schaltfläche bestätigt die Operationen, die dann in einem Rutsch ausgeführt werden.
ja_jp: <command>synaptic</command> は Debian 用のグラフィカルパッケージマネージャで、GTK+/GNOME を使った綺麗で効率的なグラフィカルインターフェースです。数多くのすぐに使えるフィルタのお陰で、新しく利用可能になったパッケージ、インストール済みパッケージ、アップグレード可能なパッケージ、時代遅れのパッケージなどを素早く確認できます。リストをすべて閲覧して、パッケージに対して行われる操作 (インストール、アップグレード、削除、完全消去) を選択できます; これらの操作はすぐに実行されるのではなく、まずは操作リストに追加されます。ボタンを一度クリックするだけで、操作の正当性が検証され、操作は一度に実行されます。
pl_pl: <command>synaptic</command> jest graficznym menedżerem pakietów dla Debiana, który posiada wydajny i prosty interfejs graficzny bazujący na GTK+/GNOME. Posiada wbudowane filtry pozwalające na szybki dostęp do nowych pakietów, zainstalowanych pakietów, pakietów do uaktualnienia, przestarzałych pakietów, itd. Po przejrzeniu tych list można wybrać operacje do wykonania na pakietach (instalacja, uaktualnienie, usunięcie, wyczyszczenie); operacje te nie są wykonywane natychmiast, ale dodawane do listy zadań. Pojedyncze naciśnięcie przycisku sprawdza listę operacji, które są następnie wykonane za jednym razem.
pt_br: <command>synaptic</command> é um gerenciador de pacotes gráfico para o Debian que possui uma interface gráfica limpa e eficiente baseada em GTK+/GNOME. Seus muitos filtros prontos para uso permitem o acesso rápido a novos pacotes disponibilizados, pacotes instalados, pacotes atualizáveis, pacotes obsoletos e muito mais. Se você navegar através destas listas, você poderá selecionar as operacões a serem feitas nos pacotes (instalar, atualizar, remover, expurgar); estas operações não são realizadas imediatamente, mas postas em uma lista de tarefas. Um único clique de um botão então valida as operações, que são então realizadas todas juntas.
