Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: Directories with a <filename>.d</filename> suffix are used more and more often. Each directory represents a configuration file which is split over multiple files. In this sense, all of the files in <filename>/etc/apt/apt.conf.d/</filename> are instructions for the configuration of APT. APT includes them in alphabetical order, so that the last ones can modify a configuration element defined in one of the first ones.
de_de: Verzeichnisse mit angehängtem <filename>.d</filename> werden immer häufiger benutzt. Jedes Verzeichnis steht für eine Konfigurationsdatei, die auf mehrere Dateien aufgeteilt ist. In diesem Sinne sind alle Dateien in <filename>/etc/apt/apt.conf.d</filename> Anweisungen für die Konfiguration von APT. APT bezieht sie in alphabetischer Reihenfolge ein, so dass Anweisungen aus den weiter hinten stehenden Dateien bereits zuvor definierte Konfigurationselemente verändern können.
ja_jp: 名前に <filename>.d</filename> サフィックスが付けられたディレクトリは頻繁に使われます。それぞれのディレクトリは複数ファイルに渡って分割された設定ファイルを表しています。この意味において、<filename>/etc/apt/apt.conf.d/</filename> 内のすべてのファイルには APT に対する設定が含まれています。APT はこれらをアルファベット順に読み込みます。つまり、読み込まれる順番が遅いファイルの設定が早いファイルの設定を上書きするという事です。
pl_pl: Katalogi zakończone przyrostkiem <filename>.d</filename> są coraz częściej stosowane. Każdy katalog zawiera ustawienia konfiguracyjne podzielone pomiędzy wiele plików. W związku z tym wszystkie pliki w katalogu <filename>/etc/apt/apt.conf.d/</filename> to instrukcje konfiguracji APTa. APT uwzględnia je w kolejności alfabetycznej, tak więc ostatnie z nich mogą modyfikować element konfiguracyjny zdefiniowany w jednym z pierwszych.
pt_br: Directórios com um sufixo <filename>.d</filename> estão sendo cada vez mais usados. Cada diretório representa um arquivo de configuração que é separado em múltiplos arquivos. Neste sentido, todos os arquivos em <filename>/etc/apt/apt.conf.d/</filename> são instruções para a configuração do APT. APT inclui eles em ordem alfabética, assim os últimos podem altera um elemento de configuração definido em um dos primeiros.

source: This structure brings some flexibility to the machine administrator and to the package maintainers. Indeed, the administrator can easily modify the configuration of the software by adding a ready-made file in the directory in question without having to change an existing file. Package maintainers use the same approach when they need to adapt the configuration of another software to ensure that it perfectly co-exists with theirs. The Debian policy explicitly forbids modifying configuration files of other packages — only users are allowed to do this. Remember that during a package upgrade, the user gets to choose the version of the configuration file that should be kept when a modification has been detected. Any external modification of the file would trigger that request, which would disturb the administrator, who is sure not to have changed anything.
ja_jp: この体制により、マシンの管理者とパッケージメンテナは設定にいくつかの自由度を持つ事が可能です。実際、管理者はソフトウェアの設定を、出来合いのファイルをこのディレクトリに追加することによって、既存のファイルを編集せずに、簡単に修正できます。パッケージメンテナはこれと同じやり方で、自分のパッケージと上手に共存させながら、他のソフトウェアの設定を変更します。他のパッケージが提供する設定ファイルを変更することは Debian ポリシーによって禁止されています - 変更できるのはユーザだけです。パッケージのアップグレード中に設定ファイルの変更が検出されたら、ユーザは設定ファイルのどのバージョンを保存するか聞かれる事を忘れないでください。外部から設定ファイルが変更されれば必ず聞かれます。これは何も変えたくない管理者にとって煩わしいでしょう。
pl_pl: Taka struktura zapewnia pewną elastyczność administratorowi maszyny oraz zarządcom pakietów. Rzeczywiście, administrator może z łatwością zmienić konfigurację oprogramowania dodając w tym katalogu przygotowany wcześniej plik, bez konieczności modyfikacji istniejących. Zarządcy pakietów używają tego samego podejścia kiedy muszą dopasować konfigurację innego oprogramowania, aby zapewnić ich bezproblemowe współistnienie. Polityka Debiana wyraźnie zakazuje modyfikacji plików konfiguracyjnych innych pakietów — tylko użytkownik ma takie prawo. Przypomnijmy, że podczas uaktualnienia pakietu użytkownik otrzymuje wybór, którą wersję pliku konfiguracyjnego należy zatrzymać w przypadku wykrycia zmian. Wszelkie zewnętrzne zmiany w pliku uruchomiłyby takie zapytanie, które zastanowiłoby administratora przekonanego o tym, że nic nie zmieniał.

source: Without a <filename>.d</filename> directory, it is impossible for an external package to change the settings of a program without modifying its configuration file. Instead it must invite the user to do it himself and lists the operations to be done in the file <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename>.
de_de: Ohne ein <filename>.d</filename>-Verzeichnis ist es einem fremden Paket unmöglich, die Einstellungen eines Programms zu verändern, ohne dessen Konfigurationsdatei zu verändern. Stattdessen muss es den Benutzer in der Datei <filename>/usr/share/doc/<replaceable>paket</replaceable>/README.Debian</filename> auffordern, dies selbst zu tun und die dazu nötigen Schritte auflisten.
ja_jp: <filename>.d</filename> ディレクトリがない場合、設定ファイルを提供するパッケージ以外が、その設定ファイルを書き換えずにプログラムの設定を変更するのは不可能です。その代わり、ユーザに自分で設定ファイルを書き換えるよう案内し、そのやり方を <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename> ファイルに記載しなければいけません。
pl_pl: Bez katalogu <filename>.d</filename>, zewnętrzne pakiety nie mają możliwości zmiany ustawień programu bez modyfikacji jego pliku konfiguracyjnego. W takim przypadku musi poprosić użytkownika o zrobienie tego samemu i wylistować możliwe instrukcje w pliku <filename>/usr/share/doc/<replaceable>pakiet</replaceable>/README.Debian</filename>.
pt_br: Sem um diretório <filename>.d</filename>, é impossível para um pacote externo mudar as configurações de um programa sem modificar seu arquivo de configuração. Ao invés disto, ele deve pedir para o usuário fazer isto ele próprio e listar as operações a serem feitas no arquivo <filename>/usr/share/doc/<replaceable>pacote</replaceable>/README.Debian</filename>.

source: Depending on the application, the <filename>.d</filename> directory is used directly or managed by an external script which will concatenate all the files to create the configuration file itself. It is important to execute the script after any change in that directory so that the most recent modifications are taken into account. In the same way, it is important not to work directly in the configuration file created automatically, since everything would be lost at the next execution of the script. The chosen method (<filename>.d</filename> directory used directly or a file generated from that directory) is usually dictated by implementation constraints, but in both cases the gains in terms of configuration flexibility more than make up for the small complications that they entail. The Exim 4 mail server is an example of the generated file method: it can be configured through several files (<filename>/etc/exim4/conf.d/*</filename>) which are concatenated into <filename>/var/lib/exim4/config.autogenerated</filename> by the <command>update-exim4.conf</command> command.
ja_jp: アプリケーションに依存しますが、<filename>.d</filename> ディレクトリは直接またはすべてのファイルを連結して設定ファイルを作成する外部スクリプトを介して使われます。最新の変更を反映させるため、ディレクトリ内のファイルを変更した後にスクリプトを実行する事が重要です。同様に、自動的に生成された設定ファイルを直接編集しない事が重要です。なぜなら、スクリプトを実行すれば生成された設定ファイルに行ったすべての変更が失われるからです。どちらの方法をとるか (<filename>.d</filename> ディレクトリを直接使うかディレクトリからファイルを生成するか) は通常実装に依存します。しかし、どちらの場合でも設定の柔軟性が増えるのに対して、設定の複雑さは少ししか増加しません。Exim 4 メールサーバはファイルを生成する方針をとるアプリケーションの例です: ファイル (<filename>/etc/exim4/conf.d/*</filename>) に設定を書き込み、<command>update-exim4.conf</command> コマンドがこれらを連結して <filename>/var/lib/exim4/config.autogenerated</filename> を生成します。
pl_pl: W zależności od aplikacji katalog <filename>.d</filename> jest używany bezpośrednio lub zarządzany przez zewnętrzy skrypt, który scali wszystkie pliki w celu stworzenia końcowej konfiguracji. Ważne jest, aby uruchamiać ten skrypt po każdej zmianie w tym katalogu tak, aby najnowsze zmiany były brane pod uwagę. Tak samo ważne jest, aby nie pracować bezpośrednio z plikiem utworzonym automatycznie, ponieważ wszystkie zmiany zostaną utracone po ponownym uruchomieniu skryptu. Wybrana metoda (katalog <filename>.d</filename> używany bezpośrednio lub plik utworzony na jego podstawie) jest zazwyczaj podyktowana przez ograniczenia implementacyjne, ale w obu przypadkach zyski z elastyczności konfiguracji przeważają nad komplikacjami związanymi z jej obsługą. Serwer poczty Exim 4 jest przykładem metody tworzenia pliku: może być skonfigurowany przez kilka plików (<filename>/etc/exim4/conf.d/*</filename>), które są scalone w <filename>/var/lib/exim4/config.autogenerated</filename> przy użyciu komendy <command>update-exim4.conf</command>.

source: Managing Package Priorities
de_de: Paketprioritäten verwalten
ja_jp: パッケージ優先度の管理
pl_pl: Zarządzanie Priorytetami Pakietów
pt_br: Gerenciar prioridades de pacote

source: One of the most important aspects in the configuration of APT is the management of the priorities associated with each package source. For instance, you might want to extend one distribution with one or two newer packages from <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> or <emphasis role="distribution">Experimental</emphasis>. It is possible to assign a priority to each available package (the same package can have several priorities depending on its version or the distribution providing it). These priorities will influence APT's behavior: for each package, it will always select the version with the highest priority (except if this version is older than the installed one and if its priority is less than 1000).
de_de: Einer der wichtigsten Aspekte bei der Konfiguration von APT ist die Verwaltung der Prioritäten, die jeder Paketquelle zugeordnet sind. Möchten Sie zum Beispiel eine stabile Distribution durch ein oder zwei neuere Pakete aus <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> oder <emphasis role="distribution">Experimental</emphasis> erweitern? Es ist möglich, jedem verfügbaren Paket eine Priorität zuzuweisen (dasselbe Paket kann mehrere Prioritäten haben, abhängig von seiner Version oder der Distribution, in der es vorkommt). Diese Prioritäten beeinflussen APTs Verhalten: Für jedes Paket wird die Version mit der höchsten Priorität ausgewählt (außer wenn diese Version älter ist, als die installierte und wenn ihre Priorität geringer als 1000 ist).
ja_jp: APT の設定で最も重要な側面の 1 つに各パッケージソースに対する優先度の管理があります。例えば、<emphasis role="distribution">テスト版</emphasis>、<emphasis role="distribution">不安定版</emphasis>、<emphasis role="distribution">実験版</emphasis>から入手できる新しいパッケージを 1 つか 2 つあるディストリビューションにインストールしたいと思うかもしれません。利用可能なパッケージに対して優先度を割り当てる事が可能です (同じパッケージに対してバージョンやそれを提供しているディストリビューションに依存する異なる優先度を設定する事も可能です)。優先度の設定は APT の挙動に影響を与えます: 各パッケージについて、APT は常に最も優先度の高いバージョンをインストールします (例外は、最も優先度の高いバージョンがインストール済みのバージョンよりも古い場合か 1000 より低い優先順位を持っている場合です)。
pl_pl: Jednym z najważniejszych aspektów w konfiguracji APTa jest zarządzanie priorytetami związanymi z każdym ze źródeł pakietów. Przykładowo, chciałbyś rozszerzyć dystrybucję o jeden lub dwa nowsze pakiety z <emphasis role="distribution">Testowego</emphasis>, <emphasis role="distribution">Niestabilnego</emphasis> lub <emphasis role="distribution">Eksperymentalnego</emphasis>. Możliwe jest przypisanie priorytetu do każdego dostępnego pakietu (ten sam pakiet może mieć wiele priorytetów, zależnie od jego wersji lub dystrybucji, z której pochodzi). Priorytety wpływają bowiem na zachowanie APTa: dla każdego pakietu zawsze zostanie wybrana wersja z najwyższym priorytetem (z wyjątkiem przypadku, gdy jego wersja jest starsza niż zainstalowana i jego priorytet jest mniejszy niż 1000).
pt_br: Um dos mais importantes aspectos na configuração do APT é o gerenciamento de prioridades associadas com cadafonte de pacote ("package source"). Por Exemplo, você pode querer extender uma distribuição com um ou dois pacotes mais novos da <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> ou <emphasis role="distribution">Experimental</emphasis>. É possível atribuir uma prioridade a cada pacote disponível (o mesmo pacote pode ter várias prioridades dependendo da sua versão ou da distribuição que o disponibiliza). Estas prioridades vão influenciar o comportamento do APT: para cada pacote, ele vai sempre selecionar a versão com a prioridade mais alta (exceto se esta versão é mais velha que a instalada e se sua prioridade for menor que 1000).

source: <primary>package</primary><secondary>priority</secondary>
de_de: <primary>Paket</primary><secondary>Priorität</secondary>
ja_jp: <primary>パッケージ</primary><secondary>優先度</secondary>
pt_br: <primary>pacote</primary><secondary>prioridade</secondary>

source: <primary>priority</primary><secondary>package priority</secondary>
ja_jp: <primary>優先度</primary><secondary>パッケージ優先度</secondary>

source: <primary>APT</primary><secondary>preferences</secondary>
de_de: <primary>APT</primary><secondary>Voreinstellungen</secondary>
ja_jp: <primary>APT</primary><secondary>設定</secondary>
pt_br: <primary>APT</primary><secondary>preferências</secondary>

source: APT defines several default priorities. Each installed package version has a priority of 100. A non-installed version has a priority of 500 by default, but it can jump to 990 if it is part of the target release (defined with the <literal>-t</literal> command-line option or the <literal>APT::Default-Release</literal> configuration directive).
ja_jp: APT はいくつかのデフォルト優先度を定義しています。インストール済みパッケージのバージョンは優先度 100 です。インストールされていないパッケージのバージョンはデフォルトで優先度 500 ですが、ターゲットリリース (<literal>-t</literal> コマンドラインオプションか <literal>APT::Default-Release</literal> の設定ディレクティブによって定義します) に含まれるバージョンの場合、優先度 990 になります。
pl_pl: APT definiuje kilka domyślnych priorytetów. Każda zainstalowana wersja pakietu ma priorytet 100. Niezainstalowana wersja pakietu ma domyślnie priorytet 500, ale może zostać podniesiony do 990 jeżeli jest częścią wydania docelowego (zdefiniowanego opcją <literal>-t</literal> lub instrukcja konfiguracyjną <literal>APT::Default-Release</literal>).

source: You can modify the priorities by adding entries in the <filename>/etc/apt/preferences</filename> file with the names of the affected packages, their version, their origin and their new priority.
ja_jp: 優先度を変更するには、<filename>/etc/apt/preferences</filename> ファイルに、影響を受けるパッケージの名前、バージョン、パッケージの提供者、新しい優先度を指定するエントリを追加してください。
pl_pl: Można zmodyfikować priorytety dodając w pliku <filename>/etc/apt/preferences</filename> wpisy z nazwami danych pakietów, ich wersją, źródłem i nowym priorytetem.

source: APT will never install an older version of a package (that is, a package whose version number is lower than the one of the currently installed package) except if its priority is higher than 1000. APT will always install the highest priority package which follows this constraint. If two packages have the same priority, APT installs the newest one (whose version number is the highest). If two packages of same version have the same priority but differ in their content, APT installs the version that is not installed (this rule has been created to cover the case of a package update without the increment of the revision number, which is usually required).
de_de: APT installiert keine ältere Version eines Pakets (das heißt, ein Paket, dessen Versionsnummer niedriger ist als die des gegenwärtig installierten Paketes), außer wenn deren Priorität höher als 1000 ist. APT installiert immer das Paket mit der höchsten Priorität, das dieser Bedingung entspricht. Falls zwei Pakete dieselbe Priorität haben, installiert APT das neuere (das, mit der höheren Versionsnummer). Falls zwei Pakete mit der derselben Version und derselben Priorität, unterschiedlichen Inhalt haben, installiert APT die Version, die nicht installiert ist. (Diese Regel wurde entworfen, um den Fall einer Paket-Aktualisierung ohne die eigentlich nötige Erhöhung der Revisionsnummer abzudecken.)
ja_jp: APT は優先度が 1000 より高い場合を除いて、パッケージの古いバージョン (言い換えれば、現在インストールされているバージョンよりバージョン番号が低いパッケージ) をインストールしません。APT は常にこの制限に基づいて最も高い優先度のパッケージをインストールします。2 つのバージョンが同じ優先度の場合、APT は最新の (バージョン番号が最も高い) バージョンをインストールします。バージョンと優先度が同じで、パッケージの内容が異なる場合、APT はインストールされていないバージョンをインストールします (このルールはあるパッケージがリビジョン番号を変化させずに更新された場合に対応させるために作られました。通常は増加させなければいけません)。
pl_pl: APT nigdy nie zainstaluje starej wersji pakietu (tzn. takiej, której numer wersji jest mniejszy niż aktualnie zainstalowany w systemie) z wyjątkiem przypadku kiedy jego priorytet jest wyższy niż 1000. APT zawsze zainstaluje pakiet o najwyższym priorytecie, który spełnia powyższy warunek. Jeżeli dwa pakiety maja taki sam priorytet, APT zainstaluje nowszy (ten, którego numer wersji jest wyższy). Jeżeli dwa pakiety tej samej wersji mają taki sam priorytet, ale różnią się zawartością, APT zainstaluje wersję, która nie jest jeszcze zainstalowana (ta zasada została stworzona dla pakietów, które zostały zaktualizowane bez zmieniania numeru wersji, który jest zazwyczaj wymagany).
pt_br: O APT nunca vai instalar uma versão mais antiga de um pacote (quer dizer, um pacote cujo número de versão é menor que o que está atualmente instalado) exceto se sua prioridade for maior que 1000. O APT vai sempre instalar o pacote de prioridade mais alta que satisfizer esta restrição. Se dois pacotes têm a mesma prioridade, o APT instala o mais novo (o que tiver o maior número de versão). Se dois pacotes da mesma versão tiverem a mesma prioridade mas conteúdos diferentes, o APT instala a versão que não estiver instalada (esta regra foi criada para o caso onde uma atualização de pacote que não incrementa o número de revisão, que é normalmente necessário).

source: In more concrete terms, a package whose priority is less than 0 will never be installed. A package with a priority ranging between 0 and 100 will only be installed if no other version of the package is already installed. With a priority between 100 and 500, the package will only be installed if there is no other newer version installed or available in another distribution. A package of priority between 501 and 990 will only be installed if there is no newer version installed or available in the target distribution. With a priority between 990 and 1000, the package will be installed except if the installed version is newer. A priority greater than 1000 will always lead to the installation of the package even if it forces APT to downgrade to an older version.
ja_jp: より具体的に言えば、優先度が 0 より低いパッケージは決してインストールされません。0 から 100 までの優先度を持つパッケージは、パッケージの他のバージョンがインストール済みでない場合にだけ、インストールされます。100 から 500 までの優先度を持つパッケージは、インストール済みのバージョンに新しいものが存在しないか、他のディストリビューションに利用可能なバージョンが存在する場合にだけ、インストールされます。501 から 990 までの優先度を持つパッケージは、インストール済みのバージョンに新しいものが存在しないか、ターゲットディストリビューションに利用可能なバージョンが存在する場合にだけ、インストールされます。990 から 1000 までの優先度を持つパッケージは、インストール済みバージョンが古い場合に、インストールされます。1000 より大きい優先度を持つパッケージは、古いバージョンにダウングレードすることになったとしても、常にインストールされます。
pl_pl: Mówiąc bardziej konkretnie, pakiet, którego priorytet jest mniejszy niż 0 nigdy nie zostanie zainstalowany. Pakiet o priorytecie pomiędzy 0 i 100 zostanie zainstalowany tylko wtedy, kiedy żadna wersja tego pakietu nie jest aktualnie zainstalowana. Posiadając priorytet pomiędzy 100 i 500, pakiet zostanie zainstalowany pod warunkiem, że jego nowsza wersja nie jest zainstalowana lub nie ma jej w innej dystrybucji. Pakiet o priorytecie pomiędzy 500 i 990 zostanie zainstalowany pod warunkiem, że jego nowsza wersja nie jest zainstalowana lub nie ma jej w docelowej dystrybucji. Posiadając priorytet pomiędzy 990 i 1000, pakiet zostanie zainstalowany, z wyjątkiem przypadku, kiedy zainstalowana jest jego nowsza wersja. Priorytet większy niż 1000 zawsze spowoduje zainstalowanie pakietu, nawet jeżeli wymusza to zejście do jego starszej wersji.

source: When APT checks <filename>/etc/apt/preferences</filename>, it first takes into account the most specific entries (often those specifying the concerned package), then the more generic ones (including for example all the packages of a distribution). If several generic entries exist, the first match is used. The available selection criteria include the package's name and the source providing it. Every package source is identified by the information contained in a <filename>Release</filename> file that APT downloads together with the <filename>Packages</filename> files. It specifies the origin (usually “Debian” for the packages of official mirrors, but it can also be a person's or an organization's name for third-parties repositories). It also gives the name of the distribution (usually <emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> or <emphasis role="distribution">Experimental</emphasis> for the standard distributions provided by Debian) together with its version (for example 5.0 for Debian <emphasis role="distribution">Lenny</emphasis>). Let's have a look at its syntax through some realistic case studies of this mechanism.
ja_jp: APT が <filename>/etc/apt/preferences</filename> の設定を評価する際、最初に具体的なエントリ (該当するパッケージに関連するエントリ)、その後に一般的なエントリ (例えばあるディストリビューションのすべてのパッケージを含めたものなど) を評価します。一般的なエントリが複数存在する場合、最初にマッチしたものを使います。利用可能な選択基準には、パッケージの名前とパッケージを配布しているパッケージソースが含まれます。各パッケージソースは APT が <filename>Packages</filename> と一緒にダウンロードする <filename>Release</filename> ファイルに含まれる情報によって区別されます。このファイルは提供者 (公式ミラーのパッケージの場合、通常「Debian」ですが、人名やサードパーティリポジトリの組織名になる場合もあります) を規定しています。また、このファイルはディストリビューションの名前 (Debian の提供する標準的ディストリビューションの場合、通常 <emphasis role="distribution">安定版</emphasis>、<emphasis role="distribution">テスト版</emphasis>、<emphasis role="distribution">不安定版</emphasis>、<emphasis role="distribution">実験版</emphasis>) とバージョン (例えば Debian <emphasis role="distribution">Lenny</emphasis> なら 5.0) を規定しています。このメカニズムの実際のケーススタディを通じて、構文を見てみましょう。
pl_pl: Kiedy APT sprawdza plik <filename>/etc/apt/preferences</filename> najpierw bierze pod uwagę najbardziej szczegółowe wpisy (zazwyczaj opisujące konkretne pakiety), następnie te ogólne (przykładowo: zawierające wszystkie pakiety danej dystrybucji). Jeżeli istnieje kilka ogólnych wpisów, dopasowywany jest pierwszy z nich. Dostępne kryteria wyboru zawierają nazwę pakietu i źródło jego pochodzenia. Każde źródło pakietu jest identyfikowane za pomocą informacji zawartej w pliku <filename>Release</filename>, który jest pobierany przez APTa z plikami <filename>Packages</filename>. Opisuje ona pochodzenie (zazwyczaj "Debian", dla pakietów z oficjalnego serwera lustrzanego, ale może być to również imię osoby lub nazwa organizacji w przypadku innych repozytoriów). Zawiera też nazwę dystrybucji (zazwyczaj <emphasis role="distribution">Stabilny</emphasis>, <emphasis role="distribution">Testowy</emphasis>, <emphasis role="distribution">Niestabilny</emphasis> lub <emphasis role="distribution">Eksperymentalny</emphasis> w przypadku standardowych dystrybucji dostarczanych przez Debiana) oraz jej wersję (na przykład 5.0 dla Debiana <emphasis role="distribution">Lenny</emphasis>). Przyjrzyjmy się zatem nieco bliżej samej składni na przykładzie realistycznego studium przypadku tego mechanizmu.

source: <emphasis>SPECIFIC CASE</emphasis> Priority of <emphasis role="distribution">experimental</emphasis>
de_de: <emphasis>SPEZIFISCHER FALL</emphasis> Priorität von <emphasis role="distribution">experimental</emphasis>
ja_jp: <emphasis>SPECIFIC CASE</emphasis> <emphasis role="distribution">実験版</emphasis> の優先度
pl_pl: <emphasis>SZCZEGÓLNY PRZYPADEK</emphasis> Priorytet <emphasis role="distribution">eksperymentalnego</emphasis>
pt_br: <emphasis>CASO ESPECÍFICO</emphasis> Prioridade do <emphasis role="distribution">experimental</emphasis>
