Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: Release notes are available online: the release notes for the current stable release have a dedicated URL, while older release notes can be found with their codenames: <ulink type="block" url="http://www.debian.org/releases/stable/releasenotes" /> <ulink type="block" url="http://www.debian.org/releases/squeeze/releasenotes" />
ja_jp: リリースノートはオンライン上で利用可能です: 現在の安定版に対するリリースノートには専用の URL が割り当てられ、古いリリースに対するリリースノートにはコードネームを含んだ URL が割り当てられています: <ulink type="block" url="http://www.debian.org/releases/stable/releasenotes" /> <ulink type="block" url="http://www.debian.org/releases/squeeze/releasenotes" />
pl_pl: Informacje o wydaniu są dostępne online: informacje o aktualnym wydaniu posiadają osobny adres URL, podczas gdy informacje o starszych wydaniach można znaleźć według ich nazwy kodowej: <ulink type="block" url="http://www.debian.org/releases/stable/releasenotes" /> <ulink type="block" url="http://www.debian.org/releases/squeeze/releasenotes" />

source: In this section, we will focus on upgrading a <emphasis role="distribution">Squeeze</emphasis> system to <emphasis role="distribution">Wheezy</emphasis>. This is a major operation on a system; as such, it is never 100% risk-free, and should not be attempted before all important data has been backed up.
ja_jp: この節では、特に <emphasis role="distribution">Squeeze</emphasis> システムを <emphasis role="distribution">Wheezy</emphasis> にアップグレードする場合について解説します。システムのアップグレードはシステムに甚大な変更を加えます; このため、危険が全く無いわけではありません、すべての重要なデータをバックアップする前にアップグレードを実行するべきではありません。
pl_pl: W tej sekcji zostanie położony nacisk na uaktualnienie z systemu <emphasis role="distribution">Squeeze</emphasis> do <emphasis role="distribution">Wheezy</emphasis>. W związku z tym, że jest to znacząca zmiana systemu, nigdy nie jest w 100% wolna od ryzyka i nie powinna być podejmowana bez uprzedniego wykonania kopii zapasowej wszystkich ważnych danych.

source: Another good habit which makes the upgrade easier (and shorter) is to tidy your installed packages and keep only the ones that are really needed. Helpful tools to do that include <command>aptitude</command>, <command>deborphan</command> and <command>debfoster</command> (see <xref linkend="sect.automatic-tracking" />). For example, you can use the following command, and then use <command>aptitude</command>'s interactive mode to double check and fine-tune the scheduled removals:
ja_jp: アップグレードを簡単に (短く) 実行するために身に付けるべき良い癖の 1 つに、インストール済みパッケージを整理整頓し、本当に必要なものだけを残す事があります。これを行う便利なツールが <command>aptitude</command>、<command>deborphan</command>、<command>debfoster</command> (<xref linkend="sect.automatic-tracking" />参照) です。例えば以下のコマンドを実行した後、<command>aptitude</command> の対話型モードで削除予定としてマークされたパッケージの再確認と微調整を行う事ができます:
pl_pl: Kolejnym dobrym zwyczajem ułatwiającym uaktualnienie (i skracającym je) jest porządkowanie zainstalowanych pakietów i zachowywanie tylko tych, które są naprawdę wymagane. Pomocnymi narzędziami do tego celu mogą być <command>aptitude</command>, <command>deborphan</command> i <command>debfoster</command> (spójrz na fiszkę <xref linkend="sect.automatic-tracking" />). Na przykład można użyć jednej ze wspomnianych komend, a następnie użyć trybu interaktywnego <command>aptitude</command> w celu sprawdzenia i dopracowania zaplanowanych usunięć:

source: Now for the upgrading itself. First, you need to change the <filename>/etc/apt/sources.list</filename> file to tell APT to get its packages from <emphasis role="distribution">Wheezy</emphasis> instead of <emphasis role="distribution">Squeeze</emphasis>. If the file only contains references to <emphasis role="distribution">Stable</emphasis> rather than explicit codenames, the change isn't even required, since <emphasis role="distribution">Stable</emphasis> always refers to the latest released version of Debian. In both cases, the database of available packages must be refreshed (with the <command>apt-get update</command> command or the refresh button in <command>synaptic</command>).
ja_jp: さて次に、システムをアップグレードします。最初に <filename>/etc/apt/sources.list</filename> ファイルを変更して、APT にパッケージの取得先を <emphasis role="distribution">Squeeze</emphasis> から <emphasis role="distribution">Wheezy</emphasis> に変更するよう伝えます。このファイル中でコードネームではなく<emphasis role="distribution">安定版</emphasis>へのリファレンスを指定している場合、この変更は必要ありません。なぜなら、<emphasis role="distribution">安定版</emphasis>は常に Debian の最新リリース版を指しているからです。どちらの場合でも、利用可能なパッケージのデータベースを更新シてください (<command>apt-get update</command> コマンドを実行するか <command>synaptic</command> の更新ボタンを押してください)。
pl_pl: Przechodząc do samego uaktualnienia. Najpierw należy zmienić plik <filename>/etc/apt/sources.list</filename>, aby APT wiedział, że musi pobierać pakiety dla <emphasis role="distribution">Wheezy</emphasis> zamiast <emphasis role="distribution">Squeeze</emphasis>. Jeżeli plik zawiera tylko odwołania do <emphasis role="distribution">Stabilnego</emphasis> zamiast bezpośrednich nazw kodowych, to zmiana nie jest nawet wymagana, ponieważ <emphasis role="distribution">Stabilny</emphasis> zawsze odnosi się do najnowszej wydanej wersji Debiana. W obu przypadkach baza dostępnych pakietów musi zostać odświeżona (za pomocą komendy <command>apt-get update</command> lub przycisku odświeżania w <command>synaptic</command>).

source: Once these new package sources are registered, you should first do a minimal upgrade with <command>apt-get upgrade</command>. By doing the upgrade in two steps, we ease the job of the package management tools and often ensure that we have the latest versions of those, which might have accumulated bugfixes and improvements required to complete the full distribution upgrade.
ja_jp: 一度新しいパッケージソースが登録されたら、あなたは最初に <command>apt-get upgrade</command> を使う最小アップグレードを実行するべきです。アップグレードを 2 段階に分けて行うことにより、パッケージ管理ツールの仕事を軽減し、パッケージ管理ツールが最新のバージョンになっている事が保証されます。パッケージ管理ツールには、バグ修正が溜まっているかもしれませんし、ディストリビューション全体のアップグレードを完了させるために必要な改善が含まれているかもしれません。
pl_pl: Kiedy już nowe źródła pakietów zostaną zarejestrowane, należy najpierw wykonać minimalne uaktualnienie za pomocą <command>apt-get upgrade</command>. Wykonywanie uaktualnienia w dwóch krokach ułatwia pracę narzędziom zarządzającym pakietami i często zapewnia, że używane są ich najnowsze wersje, mogące posiadać poprawki błędów i ulepszenia wymagane do wykonania pełnego uaktualnienia dystrybucji.

source: Once this first upgrade is done, it is time to handle the upgrade itself, either with <command>apt-get dist-upgrade</command>, <command>aptitude</command>, or <command>synaptic</command>. You should carefully check the suggested actions before applying them: you might want to add suggested packages or deselect packages which are only recommended and known not to be useful. In any case, the front-end should come up with a scenario ending in a coherent and up-to-date <emphasis role="distribution">Wheezy</emphasis> system. Then, all you need is to do is wait while the required packages are downloaded, answer the Debconf questions and possibly those about locally modified configuration files, and sit back while APT does its magic.
ja_jp: 最小アップグレードが終了したら、<command>apt-get dist-upgrade</command>、<command>aptitude</command>、<command>synaptic</command>のうちどれか 1 つを使って、ディストリビューション全体をアップグレードします。提案された動作を適用する前に注意深く確認するべきです: 提案パッケージを追加したい場合や、推奨されたけれども使いにくいと知っているパッケージを除外したい場合があるかもしれません。いかなる場合でもフロントエンドは、一貫性が保たれて最新の <emphasis role="distribution">Wheezy</emphasis> システムになるような、解決策を用意します。管理者に要求されるのは、パッケージがダウンロードされるまで待って、Debconf とマシンに合わせて変更された設定ファイルの保存可否に関する質問に答え、APT が仕事を終えるまで見ているだけです。
pl_pl: Po wykonaniu pierwszego uaktualnienia nadchodzi czas na zrobienie właściwego uaktualnienia za pomocą <command>apt-get dist-upgrade</command>, <command>aptitude</command>, lub <command>synaptic</command>. Należy przy tym starannie sprawdzić sugerowane akcje przed ich zastosowaniem: może być pożądane dodanie sugerowanych pakietów lub odznaczenie pakietów, które są tylko rekomendowane, ale nie będą używane. W każdym razie użycie interfejsu powinno zakończyć się otrzymaniem spójnego i aktualnego systemu <emphasis role="distribution">Wheezy</emphasis>. Następnie jedyne co trzeba zrobić, to poczekać, aż zostaną pobrane wymagane pakiety, odpowiedzieć na pytania Debconfa oraz te dotyczące modyfikowanych lokalnie plików konfiguracyjnych, a potem usiąść wygodnie, podczas gdy APT będzie czynił swoją magię.

source: Handling Problems after an Upgrade
de_de: Problembehandlung nach einer Aktualisierung
ja_jp: アップグレードの後から問題を取り扱う
pl_pl: Obsługa Problemów po Uaktualnieniu
pt_br: Lidando com Problemas após uma Atualização

source: In spite of the Debian maintainers' best efforts, a major system upgrade isn't always as smooth as you could wish. New software versions may be incompatible with previous ones (for instance, their default behavior or their data format may have changed). Also, some bugs may slip through the cracks despite the testing phase which always precedes a Debian release.
de_de: Trotz der Anstrengungen der Debian-Betreuer verläuft eine größere Systemaktualisierung nicht immer so problemlos, wie man es sich wünschen würde. Neue Softwareversionen könnten inkompatibel zu ihren Vorgängern sein (beispielsweise, weil sich Standardverhaltensweisen oder Datenformate geändert haben). Auch könnten sich Fehler durch die, jeder Debian Veröffentlichung vorangehende, Testphase hindurch gemogelt haben.
ja_jp: Debian メンテナの最大限の努力にも関わらず、システムのメジャー更新は常に望んだ通り順調に進むわけではありません。新しいソフトウェアバージョンは古いものと互換性が無いかもしれません (例えば、デフォルト動作やデータフォーマットが変わっているかもしれません)。また、幾つかのバグは Debian リリースに先んじるテスト段階を経たにもかかわらず見過ごされているかもしれません。
pl_pl: Wbrew największym wysiłkom opiekunów Debiana, uaktualnienie nie zawsze jest tak bezproblemowe jak można by sobie życzyć. Nowe wersje oprogramowania mogą być niekompatybilne z poprzednimi (na przykład mogło się zmienić ich domyślne zachowanie lub format danych). Pomimo fazy testowania, poprzedzającej każde wydanie Debiana, mogły również przemknąć się jakieś błędy.
pt_br: Apesar dos esforços dos mantenedores Debian, uma atualização geral do sistema não é sempre tão suave quando você gostaria. Novas versões de software podem ser incompatíveis com versões anteriores (por exemplo, seu comportamento padrão ou seu formato de dados pode ter mudado). Além disso, alguns bugs podem passam despercebidos apesar da fase de testes pela qual o lançamento do Debian sempre passa.

source: To anticipate some of these problems, you can install the <emphasis role="pkg">apt-listchanges</emphasis> package, which displays information about possible problems at the beginning of a package upgrade. This information is compiled by the package maintainers and put in <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian</filename> files for the benefit of users. Reading these files (possibly through <emphasis role="pkg">apt-listchanges</emphasis>) should help you avoid bad surprises.
de_de: Um solche Probleme vorwegzunehmen, können Sie das Paket <emphasis role="pkg">apt-listchanges</emphasis> installieren, welches Informationen über mögliche Probleme zu Beginn jeder Paketaktualisierung einblendet. Diese Informationen werden von den Paketbetreuern zusammen- und in <filename>/usr/share/doc/<replaceable>Paket</replaceable>/NEWS.Debian</filename> Dateien zum Nutzen der Anwender bereitgestellt. Das Lesen dieser Dateien (möglicherweise mittels <emphasis role="pkg">apt-listchanges</emphasis>) sollte helfen, Sie vor bösen Überraschungen zu bewahren.
ja_jp: 幾つかの問題を未然に防ぐために、<emphasis role="pkg">apt-listchanges</emphasis> パッケージをインストールする事が可能です。<emphasis role="pkg">apt-listchanges</emphasis>は、あるパッケージのアップグレード作業の最初に、このパッケージをアップグレードすることで生じる可能性のある問題の情報を表示します。この情報はパッケージメンテナがまとめたもので、ユーザが確認できるように <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian</filename> ファイルに含まれています。これらのファイルを (場合によっては <emphasis role="pkg">apt-listchanges</emphasis> を通じて) 読めば、予期しない驚きを避ける事が可能です。
pl_pl: W celu przewidzenia niektórych problemów można zainstalować pakiet <emphasis role="pkg">apt-listchanges</emphasis>, który wyświetla informacje o możliwych problemach na początku procesu uaktualnienia pakietu. Informacja ta jest opracowana przez opiekunów pakietu i umieszczona w plikach <filename>/usr/share/doc/<replaceable>pakiet</replaceable>/NEWS.Debian</filename> dla pożytku użytkowników. Czytanie tych plików (prawdopodobnie używając <emphasis role="pkg">apt-listchanges</emphasis>) powinno pomóc w uniknięciu niemiłych niespodzianek.
pt_br: Para antecipar alguns destes problemas, você pode instalar o pacote <emphasis role="pkg">apt-listchanges</emphasis>, que mostra informações sobre possíveis problemas no início de uma atualização de pacotes. Esta informação é compilada pelos mantenedores de pacote e colocada em arquivos <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian</filename> para os usuários usarem. A leitura destes arquivos (possivelmente através do <emphasis role="pkg">apt-listchanges</emphasis>) pode evitar surpresas desagradáveis.

source: You might sometimes find that the new version of a software doesn't work at all. This generally happens if the application isn't particularly popular and hasn't been tested enough; a last-minute update can also introduce regressions which are only found after the stable release. In both cases, the first thing to do is to have a look at the bug tracking system at <literal>http://bugs.debian.org/<replaceable>package</replaceable></literal>, and check whether the problem has already been reported. If it hasn't, you should report it yourself with <command>reportbug</command>. If it is already known, the bug report and the associated messages are usually an excellent source of information related to the bug:
de_de: Manchmal werden Sie feststellen, dass die neue Version einer Software überhaupt nicht funktioniert. Das passiert allgemein bei Applikationen, die nicht besonders populär und deshalb nicht ausgiebig genug getestet sind. Eine Aktualisierung in letzter Minute kann zu Regressionsfehlern führen, die erst nach der Veröffentlichung erkannt werden. In beiden Fällen ist der erste Schritt, einen Blick in die Fehlerdatenbank unter <literal>http://bugs.debian.org/<replaceable>Paket</replaceable></literal> zu werfen, um zu prüfen, ob das Problem bereits gemeldet wurde. Falls nicht, sollten Sie es mittels <command>reportbug</command> melden. Falls das Problem bereits bekannt ist, ist der Fehlerbericht in Verbindung mit den verknüpften Meldungen üblicherweise eine exzellente Informationsquelle zu dem Fehler:
ja_jp: あるソフトウェアの新しいバージョンが全く動かないことに気付く事があるかもしれません。これは通常、そのアプリケーションがそれほど人気ではない場合や十分にテストされていない場合に起こります; リリース直前の更新によって、それ迄に存在しなかった不具合を混入する事があり、この不具合は安定版がリリースされた後に見つかります。どちらの場合でも、まず最初にやることはバグ追跡システム <literal>http://bugs.debian.org/<replaceable>package</replaceable></literal> でこの問題が既に報告されているか確認する事です。まだ報告されていなければ、<command>reportbug</command> を使って自分で報告するべきです。既に報告されていれば、バグレポートと関連メッセージは通常バグに関連する情報の素晴らしいソースです:
pl_pl: Niekiedy nowa wersja oprogramowania wcale nie działa. Zdarza się to w przypadku, gdy aplikacja nie jest szczególnie popularna i nie była dostatecznie przetestowana; aktualizacja wykonana w ostatniej chwili również mogła wnieść regresje, które odkryto dopiero po wydaniu. W obu przypadkach pierwszym krokiem jest spojrzenie w system śledzenia błędów na <literal>http://bugs.debian.org/<replaceable>pakiet</replaceable></literal> i sprawdzenie, czy dany problem został już zgłoszony. Jeżeli nie, to należy go zgłosić za pomocą <command>reportbug</command>. Natomiast jeżeli jest już znany, jego zgłoszenie i powiązane wiadomości są zazwyczaj doskonałym źródłem informacji dotyczących błędu:
pt_br: Ás vezes você descobre que uma nova versão de um software não funciona de jeito nenhum. Isto geralmente acontece se a aplicação não é muito popular e não foi testada o suficiente; uma atualização que acabou de acontecer também pode introduzir regressões que são encontradas apenas no lançamento estável ("stable"). Em ambos os casos, a primeira coisa a fazer é olhar o sistema de rastreamento de bugs em <literal>http://bugs.debian.org/<replaceable>package</replaceable></literal>, e verificar se o problema já foi relatado. Se não tiver sido, você mesmo pode relatá-lo com o <command>reportbug</command>. Se ele já é conhecido, o bug report e as mensagens associadas a ele normalmente são uma excelente fonte de informações relativas ao bug:

source: sometimes a patch already exists, and it is available on the bug report; you can then recompile a fixed version of the broken package locally (see <xref linkend="sect.rebuilding-package" />);
de_de: manchmal existiert bereits ein Patch und ist im Fehlerbericht verfügbar. Sie können dann die korrigierte Version des defekten Pakets lokal übersetzen (siehe <xref linkend="sect.rebuilding-package" />);
ja_jp: パッチが既に存在し、バグレポートからそれを入手する事ができる事があります; 壊れたパッケージの修正されたバージョンを再コンパイルする事が可能です (<xref linkend="sect.rebuilding-package" /> をご覧ください);
pl_pl: czasami istnieje już łatka i jest dostępna w zgłoszeniu błędu; można wtedy lokalnie przekompilować naprawioną wersję zepsutego pakietu (spójrz na fiszkę <xref linkend="sect.rebuilding-package" />);
pt_br: algumas vezes um patch já existe, e está disponível no bug report; você pode recompilar uma versão consertada de um pacote quebrado localmente (see <xref linkend="sect.rebuilding-package" />);

source: in other cases, users may have found a workaround for the problem and shared their insights about it in their replies to the report;
de_de: in anderen Fällen könnten andere Anwender bereits eine Übergangslösung für das Problem gefunden und ihre Erkenntnisse in den Antworten zum Fehlerbericht geteilt haben;
ja_jp: 他の場合、ユーザは問題に対する次善策を見つけ、報告に対する返信から問題の本質を理解できるかもしれません。
pl_pl: w innych przypadkach, użytkownicy znajdują obejścia problemu i dzielą się swoimi spostrzeżeniami w odpowiedziach pod zgłoszeniem;
pt_br: Em outros casos, os usuários podem encontrar uma gambiarra para o problema e compartilhar suas ideias nas respostas do bug report;

source: in yet other cases, a fixed package may have already been prepared and made public by the maintainer.
de_de: und in wieder anderen Fällen könnte der Paketbetreuer bereits ein korrigiertes Paket gebaut und veröffentlicht haben.
ja_jp: また別の場合、メンテナが修正されたパッケージを用意し、既に公開しているかもしれません。
pl_pl: w jeszcze innych przypadkach, naprawiona wersja pakietu mogła zostać już przygotowana i udostępniona przez jego opiekuna.
pt_br: em outros casos, um pacote consertado já pode ter sido preparado e publicado pelo mantenedor.

source: Depending on the severity of the bug, a new version of the package may be prepared specifically for a new revision of the stable release. When this happens, the fixed package is made available in the <literal>proposed-updates</literal> section of the Debian mirrors (see <xref linkend="sect.proposed-updates" />). The corresponding entry can then be temporarily added to the <filename>sources.list</filename> file, and updated packages can be installed with <command>apt-get</command> or <command>aptitude</command>.
ja_jp: 重大なバグの場合、パッケージの新しいバージョンが安定版リリースに対する新しい改訂版として用意されているかもしれません。この場合、修正されたパッケージは Debian ミラーの <literal>proposed-updates</literal> セクションから提供されます (<xref linkend="sect.proposed-updates" />参照)。対応するエントリを一時的に <filename>sources.list</filename> に追加して、更新されたパッケージを <command>apt-get</command> や <command>aptitude</command> からインストールできます。
pl_pl: W zależności od dotkliwości błędu, nowa wersja pakietu mogła zostać przygotowana specjalnie dla nowej rewizji wydania stabilnego. W takim przypadku naprawiony pakiet jest udostępniany w sekcji <literal>proposed-updates</literal> na serwerach lustrzanych Debiana (spójrz na fiszkę <xref linkend="sect.proposed-updates" />). Odpowiedni wpis można tymczasowo dodać do pliku <filename>sources.list</filename> i zainstalować zaktualizowane pakiety za pomocą <command>apt-get</command> lub <command>aptitude</command>.

source: Sometimes the fixed package isn't available in this section yet because it is pending a validation by the Stable Release Managers. You can verify if that's the case on their web page. Packages listed there aren't available yet, but at least you know that the publication process is ongoing. <ulink type="block" url="http://release.debian.org/proposed-updates/stable.html" />
de_de: Manchmal ist das korrigierte Paket nicht in diesem Bereich verfügbar, weil es noch von den Stable Release Managern geprüft werden muss. Sie können auf deren Webseite prüfen, ob dies der Fall ist. Dort aufgeführte Pakete sind noch nicht verfügbar, aber wenigstens wissen Sie, dass der Veröffentlichungsprozess läuft. <ulink type="block" url="http://release.debian.org/proposed-updates/stable.html" />
ja_jp: 修正されたパッケージがまだ <literal>proposed-updates</literal> セクションから提供されていない事があります。これは、安定版リリースマネージャによる妥当性の確認が終わっていないからです。パッケージが公開待ち状態にあるかをウェブページから確認できます。このウェブページに載せられたパッケージはまだ利用可能ではありませんが、少なくと公開待ち状態であるか否かを確認できます。<ulink type="block" url="http://release.debian.org/proposed-updates/stable.html" />
pl_pl: Czasami naprawiony pakiet nie jest jeszcze dostępny w tej sekcji, ponieważ czeka na zatwierdzenie przez Menedzerów Stabilnego Wydania (Stable Release Managers). Można to sprawdzić na ich stronie internetowej. Pakiety na znajdującej się tam liście nie sa jeszcze dostępne, ale przynajmniej wiadomo, że trwa proces ich publikacji. <ulink type="block" url="http://release.debian.org/proposed-updates/stable.html" />
pt_br: Por vezes, o pacote consertado não fica disponível nesta seção por faltar a validação de alguma pendência dos Stable Release Managers. Você pode verificar se este é o caso na página deles. Pacotes listados lá ainda não foram disponibilizados, mas pelo menos você saberá que o processo de publicação está andando. <ulink type="block" url="http://release.debian.org/proposed-updates/stable.html" />

source: Keeping a System Up to Date
de_de: Ein System aktuell halten
ja_jp: システムを最新の状態に保つ
pl_pl: Utrzymywanie Aktualności Systemu
pt_br: Mantendo um Sistema Atualizado
