Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: There are good reasons to include all those repositories, even though a single one should be enough. <emphasis role="distribution">Testing</emphasis> users will appreciate the possibility to cherry-pick a fixed package from <emphasis role="distribution">Unstable</emphasis> when the version in <emphasis role="distribution">Testing</emphasis> is affected by an annoying bug. On the opposite, <emphasis role="distribution">Unstable</emphasis> users bitten by unexpected regressions have the possibility to downgrade packages to their (supposedly working) <emphasis role="distribution">Testing</emphasis> version.
ja_jp: 1 つでも十分なのに、すべてのリポジトリを含めるのには正当な理由があります。<emphasis role="distribution">テスト版</emphasis>ユーザは、あるパッケージの<emphasis role="distribution">テスト版</emphasis>に含まれるバージョンが厄介なバグの影響を受けている場合、<emphasis role="distribution">不安定版</emphasis>に含まれる修正されたバージョンを使えると良いと考えるでしょう。逆に、予期しない不具合に悩まされ続けている<emphasis role="distribution">不安定版</emphasis>のユーザは、パッケージを (おそらく動く) <emphasis role="distribution">テスト版</emphasis>に含まれるバージョンにダウングレードできます。
pl_pl: Istnieją uzasadnione przyczyny, aby załączyć wszystkie te repozytoria, mimo że jedno powinno wystarczyć. Użytkownicy <emphasis role="distribution">Testowego</emphasis> docenią możliwość wybrania naprawionych pakietów z <emphasis role="distribution">Niestabilnego</emphasis> kiedy wersja w <emphasis role="distribution">Testowym</emphasis> jest obarczona denerwującym błędem. Z drugiej strony, użytkownicy <emphasis role="distribution">Niestabilnego</emphasis> nadgryzieni przez niespodziewane regresje mają możliwość pobrania starszych pakietów dla (rzekomo działającej) wersji <emphasis role="distribution">Testowej</emphasis>.

source: The inclusion of <emphasis role="distribution">Stable</emphasis> is more debatable but it often gives access to some packages which have been removed from the development versions. It also ensures that you get the latest updates for packages which have not been modified since the last stable release.
ja_jp: ここに<emphasis role="distribution">安定版</emphasis>が含まれている点については異論があるかもしれませんが、こうすることで開発版から削除されたパッケージを入手可能になります。また、最新安定版リリース以降に変更されたパッケージの最新更新を手に入れる事も保証されます。
pl_pl: Załączenie <emphasis role="distribution">Stabilnego</emphasis> jest bardziej dyskusyjne, ale zazwyczaj daje dostęp to pakietów, które zostały usunięte z wersji deweloperskich. Zapewnia również dostęp do najnowszych aktualizacji pakietów, które nie zostały zmodyfikowane od ostatniego stabilnego wydania.

source: The <emphasis role="distribution">Experimental</emphasis> Repository
de_de: Das Paketdepot <emphasis role="distribution">Experimental</emphasis>
ja_jp: <emphasis role="distribution">実験版</emphasis>リポジトリ
pl_pl: Repozytorium <emphasis role="distribution">Eksperymentalnego</emphasis>
pt_br: O <emphasis role="distribution">repositório</emphasis> experimental

source: <primary><emphasis role="distribution">Experimental</emphasis></primary>
ja_jp: <primary><emphasis role="distribution">実験版</emphasis></primary>

source: The archive of <emphasis role="distribution">Experimental</emphasis> packages is present on all Debian mirrors, and contains packages which are not in the <emphasis role="distribution">Unstable</emphasis> version yet because of their substandard quality — they are often software development versions or pre-versions (alpha, beta, release candidate…). A package can also be sent there after undergoing subsequent changes which can generate problems. The maintainer then tries to uncover them thanks to advanced users who can manage important issues. After this first stage, the package is moved into <emphasis role="distribution">Unstable</emphasis>, where it reaches a much larger audience and where it will be tested in much more detail.
de_de: Das Archiv von Paketen in <emphasis role="distribution">Experimental</emphasis> ist auf allen Debian-Spiegelservern vorhanden und enthält Pakete, die aufgrund ihrer nicht den Standards entsprechenden Qualität noch nicht in <emphasis role="distribution">Unstable</emphasis> sind – oft sind es Entwicklerversionen oder Vorab-Versionen (Alpha, Beta, Veröffentlichungskandidat…). Ein Paket kann auch dorthin verschoben werden, wenn Änderungen Probleme verursachen können. Der Paketbetreuer versucht diese Probleme dann mit der Hilfe erfahrener Benutzter, die mit problembehafteter Software umgehen können, aufzuspüren. Nach dieser ersten Stufe wird das Paket nach <emphasis role="distribution">Unstable</emphasis> verschoben, wo es ein viel größeres Publikum erreicht und dadurch viel gründlicher getestet wird.
ja_jp: <emphasis role="distribution">テスト版</emphasis>パッケージはすべての Debian ミラーに存在し、品質基準を満たしていないためにまだ<emphasis role="distribution">不安定版</emphasis>に収録されていないパッケージを含んでいます - このようなパッケージはソフトウェアの開発版バージョンか先行バージョン (アルファ、ベータ、リリース候補…) である事が多いです。メンテナは、重要な問題に対処する能力を持つ先進的なユーザに向けて、パッケージを公開しようとします。この最初のステージの後、パッケージは<emphasis role="distribution">不安定版</emphasis>に移動されます。ここで、パッケージはより多くのユーザに配布され、より詳細にテストされます。
pl_pl: Archiwum pakietów <emphasis role="distribution">Eksperymentalnych</emphasis> jest dostępne na każdym serwerze lustrzanym Debiana i zawiera pakiety, które jeszcze nie są w wersji <emphasis role="distribution">Niestabilnej</emphasis> z powodu na ich niską jakość — jest to zazwyczaj oprogramowanie w wersji deweloperskiej lub wstępnej (alfa, beta, kandydat do wydania…). Pakiet może być tam również wysłany po przejściu pewnych zmian, które mogą spowodować problemy. Wtedy zarządca stara się je odkryć korzystając z pomocy zaawansowanych użytkowników, którzy dają sobie radę z trudnymi zadaniami. Po tym etapie pakiet jest przeniesiony do <emphasis role="distribution">Niestabilnego</emphasis>, gdzie dociera do znacznie szerszego grona odbiorców i będzie dużo skrupulatniej przetestowany.
pt_br: O arquivamento dos pacotes <emphasis role="distribution">Experimental</emphasis> existe em todos os espelhos Debian, e contém pacotes que não estão na versão <emphasis role="distribution">Unstable</emphasis> "yet because" de sua baixa qualidade — eles são às vezes versões em desenvolvimento ou pré-versões (alfa, beta, candidatos a lançamento…). Um pacote pode também ser enviado para lá depois de mudanças que possam gerar problemas. O mantenedor então tenta "uncover them" com a ajuda de usuários avançados que possam lidar com questões importantes. Depois deste primeiro estágio, o pacote é movido para a <emphasis role="distribution">Unstable</emphasis>, onde ele alcança uma audiência muito maior e onde ele será testado em detalhes.

source: <emphasis role="distribution">Experimental</emphasis> is generally used by users who do not mind breaking their system and then repairing it. This distribution gives the possibility to import a package which a user wants to try or use as the need arises. That is exactly how Debian approaches it, since adding it in APT's <filename>sources.list</filename> file does not lead to the systematic use of its packages. The line to be added is:
de_de: Generell wird <emphasis role="distribution">Experimental</emphasis> von Benutzern genutzt, denen es nichts ausmacht, wenn ihr System beschädigt wird und sie es reparieren müssen. Diese Distribution ermöglicht es, ein Paket einzubinden, das ein Benutzer ausprobieren möchte oder weil er es benötigt. Genau das ist die Vorgehensweise von Debian, da das Hinzufügen dieser in APTs <filename>sources.list</filename>-Datei nicht dazu führt, dass diese Pakete systematisch benutzt werden. Die hinzuzufügende Zeile ist:
ja_jp: <emphasis role="distribution">実験版</emphasis>を使うのは通常、システムを破壊したり修復する事を気にしないユーザです。このディストリビューションでは、ユーザは必要に応じてが試してみたいか使ってみたいと思ったパッケージを取り込む事がきます。これはまさに Debian が<emphasis role="distribution">実験版</emphasis>を使う時の方法です。なぜなら、<emphasis role="distribution">実験版</emphasis>を APT の <filename>sources.list</filename> ファイルに追加することは、パッケージの体系的な利用に結び付かないからです。<emphasis role="distribution">実験版</emphasis>を追加するには以下のようにします:
pl_pl: <emphasis role="distribution">Eksperymentalny</emphasis> jest używany głównie przez użytkowników, którym nie przeszkadza ciągłe psucie i naprawianie ich systemu. Taki podział pozwala w razie potrzeby na zaimportowanie pakietu, którego użytkownik chciałby wypróbować lub używać. Jest to również standardowe podejściem Debiana z nim związane, ponieważ dodanie go w pliku APTa <filename>sources.list</filename> nie powoduje systematycznego korzystania z jego pakietów. Linia, którą należy dodać to:
pt_br: A <emphasis role="distribution">Experimental</emphasis> é geralmente usada por usuário que não se importam em quebrar o seu sistema e ter que consertá-lo. Esta distribuição dá a possibilidade de importar um pacote que o usuário queira testar ou usar quando surge uma necessidade. Esta é exatamente a abordagem do Debian, já que adicionar a Experimental ao arquivo <filename>sources.list</filename> do APT não leva ao uso sistemático destes pacotes. A linha a ser adicionada é:

source: Non-Official Resources: <literal>apt-get.org</literal> and <literal>mentors.debian.net</literal>
de_de: Inoffizielle Resourcen: <literal>apt-get.org</literal> und <literal>mentors.debian.net</literal>
ja_jp: 非公式リソース: <literal>apt-get.org</literal> と <literal>mentors.debian.net</literal>
pl_pl: Nieoficjalne zasoby: <literal>apt-get.org</literal> i <literal>mentors.debian.net</literal>
pt_br: Recursos não oficial: <literal>apt-get.org</literal> e <literal>mentors.debian.net</literal>

source: There are numerous non-official sources of Debian packages set up by advanced users who have recompiled some software, by programmers who make their creation available to all, and even by Debian developers who offer pre-versions of their package online. A web site was set up to find these alternative sources more easily. It contains an impressive amount of Debian package sources which can immediately be integrated into <filename>sources.list</filename> files. However, be careful not to add random packages. Each source is designed for a particular version of Debian (the one used to compile the packages in question); each user should maintain a certain coherence in what they choose to install. <ulink type="block" url="http://www.apt-get.org/" />
de_de: Es gibt zahlreiche inoffizielle Quellen von Debian-Paketen, aufgesetzt von fortgeschrittenen Benutzern, die Software neu kompiliert haben, von Programmierern, die ihre Werke allen verfügbar machen wollen und sogar von Debian-Entwicklern, die Vorab-Versionen ihrer Pakete online anbieten. Um diese alternativen Quellen einfacher zu finden, wurde eine Website eingerichtet. Sie enthält eine beeindruckende Anzahl von Debian-Paketquellen, die direkt in <filename>sources.list</filename>-Dateien integriert werden können. Aber hüten Sie sich davor, willkürlich Pakete hinzuzufügen: Jede Quelle wurde für eine bestimmte Debian-Version entworfen (die, die benutzt wurde, um die entsprechenden Pakete zu kompilieren); jeder Benutzer sollte darauf achten, die Stimmigkeit zwischen seinem System und dem, was er zur Installation auswählt, zu wahren. <ulink type="block" url="http://www.apt-get.org/" />
ja_jp: Debian パッケージの非公式ソースはたくさんあります。非公式ソースにパッケージを提供しているのは、ソフトウェアを再コンパイルした先進的ユーザ、つまり自分の創作物を誰でも利用可能な状態にするプログラマや自分のパッケージの先行バージョンをオンラインで提供する Debian 開発者です。非公式ソースをより簡単に発見するためのウェブサイトがあります。このウェブサイトには、大量の Debian パッケージソースが含まれ、それらは即座に <filename>sources.list</filename> ファイルに統合できます。しかしながら、当てずっぽうにパッケージソースを追加しないように気を付けてください。それぞれのソースは Debian の特定のバージョン (パッケージのコンパイルを実行したバージョン) 用に設計されいてます; 各ユーザは、追加するパッケージソースが設計されたバージョンが自分が使っているバージョンと一致している事を確認するべきです。<ulink type="block" url="http://www.apt-get.org/" />
pl_pl: Istnieje wiele nieoficjalnych źródeł pakietów Debiana założonych przez zaawansowanych użytkowników, którzy przekompilowali pewne oprogramowanie, przez programistów, którzy udostępniają publicznie swoje dzieła, a nawet przez deweloperów Debiana, którzy oferują dostęp do wczesnych wersji swoich pakietów. Aby łatwiej znajdywać te alternatywne źródła została założona strona internetowa. Zawiera ona znaczna ilość źródeł pakietów Debiana, które mogą być natychmiast włączone do plików <filename>sources.list</filename>. Jednakże należy uważać, aby nie dodawać losowych pakietów. Każde źródło jest bowiem zaprojektowane dla konkretnej wersji Debiana (dla tej, której użyto do kompilacji danego pakietu); każdy użytkownik powinien zachować pewną zgodność odnośnie tego, co wybiera do instalacji. <ulink type="block" url="http://www.apt-get.org/" />
pt_br: Existem várias fontes não-oficiais de pacotes Debian configuradas por usuários avançados que recompilaram algum software, por programadores que tornam seus produtos disponíveis para todos, e até mesmo por desenvolvedores Debian que oferecem pré-versões de seus pacotes on-line. Um sítio web foi configurado para facilitar a busca destas fontes alternativas. Ele contém uma impressionante quantidade de fontes de pacotes Debian que podem ser imediatamente integrados nos arquivos <filename>sources.list</filename>. Entretanto, seja cauteloso para não adicionar pacotes aleatórios. Cada fonte é feita para uma versão particular do Debian (aquela usada para compilar os pacotes em questão); cada usuário deve manter uma certa coerência no que ele escolhe instalar. <ulink type="block" url="http://www.apt-get.org/" />

source: The <literal>mentors.debian.net</literal> site is also interesting, since it gathers source packages created by candidates to the status of official Debian developer or by volunteers who wish to create Debian packages without going through that process of integration. These packages are made available without any guarantee regarding their quality; make sure that you check their origin and integrity and then test them before you consider using them in production.
ja_jp: <literal>mentors.debian.net</literal> サイトもまた興味深いです。なぜならここには、パッケージの統合過程を経ずに、公式 Debian 開発者の候補者や Debian パッケージを作りたいと望むボランティアが作成したソースパッケージをアップロードできるからです。これらのパッケージは、品質保証の無いまま、利用可能になっています; このため、起源と整合性を必ず確認し、稼働中のシステムでパッケージを使う前にパッケージを必ずテストしてください。
pl_pl: Strona <literal>mentors.debian.net</literal> jest również interesująca, ponieważ zbiera pakiety źródłowe stworzone przez kandydatów do statusu oficjalnego dewelopera Debiana lub przez wolontariuszy, którzy chcą tworzyć pakiety dla Debiana bez przechodzenia przez ten proces integracji. Te pakiety są udostępniane bez żadnej gwarancji odnośnie ich jakości; należy sprawdzać ich pochodzenie i spójność, a także przetestować przed rozważaniem wprowadzenia ich do użytku.

source: <emphasis>COMMUNITY</emphasis> The <literal>debian.net</literal> sites
de_de: <emphasis>GEMEINSCHAFT</emphasis> Die <literal>debian.net</literal> Sites
ja_jp: <emphasis>COMMUNITY</emphasis> <literal>debian.net</literal> サイト
pl_pl: <emphasis>SPOŁECZNOŚĆ</emphasis> Strony <literal>debian.net</literal>
pt_br: <emphasis>COMUNIDADE</emphasis> Os sítios <literal>debian.net</literal>

source: The <emphasis>debian.net</emphasis> domain is not an official resource of the Debian project. Each Debian developer may use that domain name for their own use. These websites can contain unofficial services (sometimes personal sites) hosted on a machine which does not belong to the project and set up by Debian developers, or even prototypes about to be moved on to <emphasis>debian.org</emphasis>. Two reasons can explain why some of these prototypes remain on <emphasis>debian.net</emphasis>: either no one has made the necessary effort to transform it into an official service (hosted on the <emphasis>debian.org</emphasis> domain, and with a certain guarantee of maintenance), or the service is too controversial to be officialized.
de_de: Die Domain <emphasis>debian.net</emphasis> ist kein offizieller Bestandteil des Debian-Projekts. Jeder Debian-Entwickler kann diesen Domainnamen für den Eigengebrauch nutzen. Diese (Unter-)Websites können inoffizielle Dienste enthalten (manchmal persönliche Seiten), die auf Servern beherbergt sind, die nicht zum Projekt gehören und von Debian-Entwicklern aufgesetzt wurden. Oder sogar Prototypen, die irgendwann nach <emphasis>debian.org</emphasis> umziehen sollen. Es gibt zwei Gründe, warum diese Prototypen unter <emphasis>debian.net</emphasis> bleiben: Entweder hat niemand die nötige Anstrengung unternommen, sie in einen offiziellen Dienst zu überführen (beherbergt unter der Domain <emphasis>debian.org</emphasis> und mit sichergestellter Wartung), oder der Dienst ist zu umstritten, um offiziell zu werden.
ja_jp: <emphasis>debian.net</emphasis> ドメインは Debian プロジェクトの公式ではありません。それぞれの Debian 開発者は自分用にこのドメイン名を使うかもしれません。これらのウェブサイトには、Debian プロジェクトに所属せず、Debian 開発者が設けたマシンでホストされている (個人サイト) 非公式サービスや今まさに <emphasis>debian.org</emphasis> に移動されようとしている試作品が含まれています。これらの試作品が <emphasis>debian.net</emphasis> に残されている理由は 2 つあります: 誰もそのサービスを公式化する (<emphasis>debian.org</emphasis> ドメインでホストして、メンテナンスを保証する) のにに変換するのに必要な作業を行わなかったか、そのサービスを公式化するのはあまりに議論の余地がありすぎるかのどちらかです。
pl_pl: Domena <emphasis>debian.net</emphasis> nie jest oficjalnym zasobem projektu Debian. Każdy deweloper Debiana może używać nazwy tej domeny dla własnego użytku. Te strony internetowe mogą zawierać nieoficjalne serwisy (czasami osobiste strony) założone przez deweloperów Debiana, hostowane na sprzęcie, który nie należy do projektu lub nawet prototypy do przeniesienia na <emphasis>debian.org</emphasis>. Istnieją dwa powody, które wyjaśniają dlaczego te prototypy pozostają na <emphasis>debian.net</emphasis>: albo nikt nie podjął się wysiłku przekształcenia go w oficjalny serwis (hostowany w domenie <emphasis>debian.org</emphasis> i z odpowiednią gwarancją zarządzania), albo serwis jest zbyt kontrowersyjny, aby uznać go za oficjalny.
pt_br: O domínio <emphasis>debian.net</emphasis> não é um recurso oficial do projeto Debian. Cada desenvolvedor Debian pode usar este domínio para seu próprio uso. Estes sítios podem conter serviços não-oficiais (algumas vezes sítios pessoais) hospedados numa máquina que não pertence ao projeto e que foram configurados por desenvolvedores Debian, ou podem conter protótipos prestes a irem para o <emphasis>debian.org</emphasis>. Duas razões podem explicar por que alguns destes protótipos permanecem no <emphasis>debian.net</emphasis>: ou por que ninguém fez o esforço necessário para transformar a coisa num serviço oficial (hospedado no domínio <emphasis>debian.org</emphasis>, e com uma certa garantia de manutenção), ou o serviço é muito controverso para ser oficializado.

source: Installing a package means giving root rights to its creator, because they decide on the contents of the initialization scripts which are run under that identity. Official Debian packages are created by volunteers who have been co-opted and reviewed and who can seal their packages so that their origin and integrity can be checked.
de_de: Ein Paket zu installieren bedeutet, dessen Urheber Root-Rechte zu gewähren, da dieser über den Inhalt der Einrichtungsskripte entscheidet, die unter der Paket-Identität ausgeführt werden. Offizielle Debian-Pakete werden von Freiwilligen erstellt, die ausgewählt und überprüft wurden, und die ihre Pakete signieren können, so dass deren Herkunft und Integrität überprüft werden kann.
ja_jp: あるパッケージをインストールすることは、パッケージの作者に root 権を与える事を意味しています。なぜなら、パッケージ作者は root 権で実行される初期化スクリプトの内容を決定するからです。公式 Debian パッケージは、パッケージの起源と整合性が確認できるように、選出され審査を受けたボランティアとパッケージの内容の責任を請け負う事ができるボランティアによって作成されます。
pl_pl: Instalowanie pakietu oznacza przyznanie uprawnień root jego twórcy, ponieważ to on decyduje o zawartości skryptów inicjalizacyjnych, które są uruchamiane pod tą tożsamością. Oficjalne pakiety Debiana są tworzone przez wolontariuszy, z którymi współpracowano i zostali zweryfikowani oraz potrafią zabezpieczyć swój pakiet w taki sposób, aby było możliwe sprawdzenie jego pochodzenia i spójności.
pt_br: Instalar um pacote significa dar permissões de root para seu criador, por que o criador decide o que fica nos scripts de inicialização que rodam com a identidade do root. Pacotes Debian oficiais são criados por voluntários que cooperam e revisam e que marcam seus pacotes de forma que a origem e integridade deles possam ser verificada.

source: In general, be wary of a package whose origin you don't know and which isn't hosted on one of the official Debian servers: evaluate the degree to which you can trust the creator, and check the integrity of the package. <ulink type="block" url="http://mentors.debian.net/" />
de_de: Seien Sie generell misstrauisch bei einem Paket, dessen Herkunft Sie nicht kennen und das nicht auf einem der offiziellen Debian-Servern beherbergt ist: Erwägen Sie in welchem Maß Sie dem Ersteller vertrauen können, und überprüfen Sie die Integrität des Pakets. <ulink type="block" url="http://mentors.debian.net/" />
ja_jp: 一般に、出自不明で公式 Debian サーバの 1 つでホストされていないパッケージには警戒してください: 作者の信頼度を評価し、パッケージの整合性を確認してください。<ulink type="block" url="http://mentors.debian.net/" />
pl_pl: Generalnie należy być ostrożnym w stosunku do pakietów, których pochodzenie jest niewiadome oraz nie są hostowane na jednym z oficjalnych serwerów Debiana: należy ocenic stopień zaufania do jego twórcy i sprawdzić spójność pakietu. <ulink type="block" url="http://mentors.debian.net/" />
pt_br: Em geral, fique alerta com pacotes cuja origem você não conhece e que não são hospedados em um dos servidores Debian oficiais: avalie o grau em que você confia no criador, e verifique a integridade do pacote. <ulink type="block" url="http://mentors.debian.net/" />

source: <emphasis>GOING FURTHER</emphasis> Old package versions: <literal>snapshot.debian.org</literal>
de_de: <emphasis>WEITERE SCHRITTE</emphasis> Alte Paketversionen: <literal>snapshot.debian.org</literal>
ja_jp: <emphasis>GOING FURTHER</emphasis> 古いパッケージバージョン: <literal>snapshot.debian.org</literal>
pl_pl: <emphasis>IDĄĆ DALEJ</emphasis> Stare wersje pakietów: <literal>snapshot.debian.org</literal>
pt_br: <emphasis>INDO ALÉM</emphasis> versões de pacotes antigas: <literal>snapshot.debian.org</literal>

source: A new service (introduced in April 2010) can be used to “go backwards in time” and to find an old version of a package. It can be used for example to identify which version of a package introduced a regression, and more concretely, to come back to the former version while waiting for the regression fix.
de_de: Ein neuer Dienst (eingeführt im April 2010) kann genutzt werden, um „in der Zeit zurück“ zu gehen und eine alte Version eines Pakets zu finden. Mit ihm lässt sich beispielsweise herausfinden, mit welcher Version eines Paketes ein (nach einer Aktualisierung/einem Patch neu aufgetretenes) Fehlverhalten eingeführt wurde, und konkreter, um zu der vorhergehenden Version zurück zu gehen, während man auf die Behebung wartet.
ja_jp: 新しいサービス (2010 年 4 月に登場) により、「時間を逆行」したり、パッケージの古いバージョンを見つける事が可能になりました。このサービスは、例えばパッケージのどのバージョンで不具合が生じたかを特定するために、より正確に言えば、不具合が修正されるまでの間古いバージョンに戻るために、使えます。
pl_pl: Nowy serwis (wprowadzony w kwietniu 2010) może być użyty do "podróży w czasie" i odnalezienia starej wersji pakietu. Może być przykładowo użyty, aby zidentyfikować która wersja pakietu wprowadziła regresję, a co bardziej znaczące, pozwala wrócić do poprzedniej wersji czekając na naprawienie regresji.
pt_br: Um novo serviço (introduzido em abril de 2010) pode ser usado para "voltar no tempo" e encontrar uma versão antiga de um pacote. Ele pode ser usado por exemplo para identificar que versão de um pacote introduziu uma regrassão, e mais concretamente, para voltar à versão anterior enquanto espera que a regressão seja corrigida.

source: Caching Proxy for Debian Packages
ja_jp: Debian パッケージのキャッシュプロキシ
pl_pl: Buforujący Pośrednik dla Pakietów Debiana

source: <primary>proxy cache</primary>
ja_jp: <primary>プロキシキャッシュ</primary>

source: <primary>cache, proxy</primary>
ja_jp: <primary>キャッシュ、プロキシ</primary>
