Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: As we have already mentioned (see sidebar <xref linkend="cadre.questions-conffiles" />), <command>dpkg</command> can be instructed not to ask for confirmation when replacing a configuration file (with the <literal>--force-confdef --force-confold</literal> options). Interactions can, however, have three other sources: some come from APT itself, some are handled by <command>debconf</command>, and some happen on the command line due to package configuration scripts.
de_de: Wie bereits erwähnt (siehe Seitenleiste <xref linkend="cadre.questions-conffiles" />), kann <command>dpkg</command> angewiesen werden, keine Bestätigung vor dem Ersetzen einer Konfigurationsdatei einzuholen (mittels der <literal>--force-confdef --force-confold</literal> Option). Indes können Interaktionen drei andere Ursachen haben: Einige kommen von APT selbst, andere handhabt <command>debconf</command> und wieder andere kommen von der Befehlszeile ausgelöst durch Paket-Konfigurationsskripte.
pt_br: Como já mencionamos (veja a barra lateral <xref linkend="cadre.questions-conffiles" />), o <command>dpkg</command> pode ser instruído a não pedir confirmação quando for substituir um arquivo de configuração (com as opções <literal>--force-confdef --force-confold</literal>). Interações podem, entretanto, vir de outras origens: algumas vêm do próprio APT, algumas são manipuladas pelo <command>debconf</command> e algumas acontecem na linha de comando devido a scripts de configuração do pacote.

source: In practice, the servers running <emphasis role="distribution">Squeeze</emphasis> are configured with the “miracle combination” above, and are kept up to date automatically. Only the most critical servers (the firewalls, for instances) are set up with <command>apticron</command>, so that upgrades always happen under the supervision of an administrator.
de_de: Im Betrieb sind Server, auf denen <emphasis role="distribution">Squeeze</emphasis> läuft, mit der "Wunderkombination" konfiguriert und werden automatisch aktuell gehalten. Nur die kritischsten Server (die Firewalls zum Beispiel) sind mit <command>apticron</command> konfiguriert, so dass Aktualisierungen nur unter Aufsicht der Administratoren durchgeführt werden.
pt_br: Na prática, os servidores rodando <emphasis role="distribution">Squeeze</emphasis> são configurados com a “combinação milagrosa” acima, e são mantidos atualizados automaticamente. Apenas os servidores mais críticos (firewalls, por exemplo) são configurados com <command>apticron</command>, de forma que atualizações sempre aconteçam sob a supervisão de um administrador.

source: The office workstations in the administrative services also run <emphasis role="distribution">Squeeze</emphasis>, but they are configured with the <command>update-notifier</command>/<command>update-manager</command> combination, so that users trigger the upgrades themselves. The rationale for this decision is that if upgrades happen without an explicit action, the behavior of the computer might change unexpectedly, which could cause confusion for the main users.
de_de: Auf den Arbeitsplatzrechnern in der Verwaltung läuft ebenfalls <emphasis role="distribution">Squeeze</emphasis>, allerdings sind sie mit der <command>update-notifier</command>/<command>update-manager</command> Kombination konfiguriert, so dass die Anwender die Aktualisierungen selbst durchführen können. Der Grund dafür ist, dass wenn Aktualisierungen unbemerkt durchgeführt werden, sich das Verhalten des Computers plötzlich und unerwartet ändern kann, was die Anwender verwirren könnte.
pt_br: As estações de escritório para serviços administrativos também rodam <emphasis role="distribution">Squeeze</emphasis>, mas elas são configuradas com a combinação <command>update-notifier</command>/<command>update-manager</command>, de forma que os usuários possam disparar as atualizações por si sós. A razão para esta decisão é que se atualizações acontecem sem alguém disparar, o comportamento do computador pode mudar inesperadamente, o que pode gerar confusão nos principais usuários.

source: A slightly more successful searching pattern is a plain-text search in package names, but it remains very limited. You can generally find results by searching package descriptions: since each package has a more or less detailed description in addition to its package name, a keyword search in these descriptions will often be useful. <command>apt-cache</command> is the tool of choice for this kind of search; for instance, <command>apt-cache search video</command> will return a list of all packages whose name or description contains the keyword “video”.
de_de: Eine etwas erfolgreicheres Suchschema ist die Volltextsuche über die Paketnamen, wenn auch immer noch stark beschränkt. Im Allgemeinen lassen sich Resultate durch die Suche in den Paketbeschreibungen erzielen: Da jedes Paket über eine mehr oder weniger detailierte Beschreibung verfügt, wird eine Schlagwortsuche in diesen Beschreibungen oftmals erfolgreich sein. <command>apt-cache</command> ist das Mittel der Wahl für diese Art der Suche; beispielsweise liefert <command>apt-cache search video</command> eine Liste aller Pakete deren Name oder Beschreibung das Schlagwort "video" enthält.
pt_br: Um padrão de busca um pouco mais bem-sucedido é uma busca simples e nomes de pacotes, as isto ainda é bem limitado. Você pode geralmente encontrar resultados buscando nas descrições de pacotes: como cada pacote tem uma descrição mais ou menos detalhada além do nome do pacote, uma busca por palavra-chave nestas descrições frequentemente será útil. <command>apt-cache</command> é a ferramenta para este tipo de busca; por exemplo, <command>apt-cache search video</command> retornará uma lista de todos os pacotes que tenham a palavra-chave "video" no nome ou na descrição.

source: <computeroutput>$ </computeroutput><userinput>aptitude search kino~dvideo~mpaul</userinput> <computeroutput>p kino - Non-linear editor for Digital Video data $ </computeroutput><userinput>aptitude show kino</userinput> <computeroutput>Package: kino State: not installed Version: 1.3.4-1+b1 Priority: extra Section: video Maintainer: Paul Brossier &lt;piem@debian.org&gt; Uncompressed Size: 9519k Depends: libasound2 (&gt; 1.0.18), libatk1.0-0 (&gt;= 1.20.0), libavc1394-0 (&gt;= 0.5.3), libavcodec52 (&gt;= 4:0.5+svn20090706-3) | libavcodec-extra-52 (&gt;= 4:0.5+svn20090706-3), libavformat52 […] Recommends: ffmpeg, gawk | mawk, curl Suggests: udev | hotplug, vorbis-tools, sox, mjpegtools, lame, ffmpeg2theora Conflicts: kino-dvtitler, kino-timfx, kinoplus Replaces: kino-dvtitler, kino-timfx, kinoplus Provides: kino-dvtitler, kino-timfx, kinoplus Description: Non-linear editor for Digital Video data Kino allows you to record, create, edit, and play movies recorded with DV camcorders. This program uses many keyboard commands for fast navigating and editing inside the movie. The kino-timfx, kino-dvtitler and kinoplus sets of plugins, formerly distributed as separate packages, are now provided with Kino. Homepage: http://www.kinodv.org/ Tags: hardware::camera, implemented-in::c, implemented-in::c++, interface::x11, role::program, scope::application, suite::gnome, uitoolkit::gtk, use::editing, works-with::video, x11::application</computeroutput>
pt_br: <computeroutput>$ </computeroutput><userinput>aptitude search kino~dvideo~mpaul</userinput> <computeroutput>p kino - Editor não linear para dados de Digital Video $ </computeroutput><userinput>aptitude show kino</userinput> <computeroutput>Pacote: kino Estado: não instalado Versão: 1.3.4-1+b1 Prioridade: extra Seção: video Mantenedor: Paul Brossier &lt;piem@debian.org&gt; Tamanho Descompactado: 9.519 k Depende de: libasound2 (&gt; 1.0.18), libatk1.0-0 (&gt;= 1.20.0), libavc1394-0 (&gt;= 0.5.3), libavcodec52 (&gt;= 4:0.5+svn20090706-3) | libavcodec-extra-52 (&gt;= 4:0.5+svn20090706-3), libavformat52 […] Recomenda: ffmpeg, gawk | mawk, curl Sugere: udev | hotplug, vorbis-tools, sox, mjpegtools, lame, ffmpeg2theora Conflita com: kino-dvtitler, kino-timfx, kinoplus Substitui: kino-dvtitler, kino-timfx, kinoplus Fornece: kino-dvtitler, kino-timfx, kinoplus Descrição: Editor não linear para dados de Digital Video Kino permite-lhe gravar, criar, editar, e reproduzir filmes gravados com cameras de filmar DV. Este programa usa muitos comandos do teclado para rápida navegação e edição no interior do filme. Os conjuntos de plugins kino-timfx, kino-dvtitler e kinoplus, anteriormente distribuídos em pacotes separados, são agora disponibilizados com o Kino. Página web: http://www.kinodv.org/ Tags: hardware::camera, implemented-in::c, implemented-in::c++, interface::x11, role::program, scope::application, suite::gnome, uitoolkit::gtk, use::editing, works-with::video, x11::application</computeroutput>

source: Browsing this classification can help you to search for a package which corresponds to known needs; even if it returns a (moderate) number of hits, the rest of the search can be done manually. To do that, you can use the <literal>~G</literal> search pattern in <command>aptitude</command>, but it is probably easier to simply navigate the site where tags are managed: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" /> Selecting the <literal>works-with::video</literal> and <literal>use::editing</literal> tags yields a handful of packages, including the <emphasis role="pkg">kino</emphasis> and <emphasis role="pkg">pitivi</emphasis> video editors. This system of classification is bound to be used more and more as time goes on, and package managers will gradually provide efficient search interfaces based on it. <indexterm><primary><emphasis role="pkg">debtags</emphasis></primary></indexterm> <indexterm><primary>tag</primary></indexterm>
de_de: Das Durchsuchen der Gliederung kann bei der Suche nach dem Paket, das bekannten Anforderungen entspricht, helfen. Selbst wenn sie eine moderate Anzahl an Treffern liefert, kann der Rest der Suche manuell fortgesetzt werden. Dazu können Sie das <literal>~G</literal> Suchmuster in <command>aptitude</command> nutzen. Es ist aber wahrscheinlich einfacher, zu der Site zu navigieren, wo die Markierungen verwaltet werden: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" /> Die Auswahl der <literal>works-with::video</literal> und <literal>use::editing</literal> Markierungen liefert eine Handvoll von Paketen, darunter die <emphasis role="pkg">kino</emphasis> und <emphasis role="pkg">pitivi</emphasis> Videoeditoren. Dieses Gliederungssystem wächst mit der Zeit und die Paketverwalter werden zunehmend darauf basierende Suchoberflächen bereitstellen. <indexterm><primary><emphasis role="pkg">debtags</emphasis></primary></indexterm> <indexterm><primary>Markierung</primary></indexterm>
pt_br: Navegar nesta classificação pode ajudar você a buscar um pacote que corresponda a necessidades conhecidas; mesmo se ele retornar uma quantidade (moderada) de hits, o restante da busca pode ser feita manualmente. Para fazer isto, você pode usar o padrão de busca <literal>~G</literal> no <command>aptitude</command>, mas é provavelmente mais fácil simplesmente navegar no site onde as etiquetas são geridas: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" /> Selecionando as etiquetas <literal>works-with::video</literal> e <literal>use::editing</literal> leva a vários pacotes úteis, inclusive os editores de vídeo <emphasis role="pkg">kino</emphasis> e <emphasis role="pkg">pitivi</emphasis>. Este sistema de classificação será usado cada vez mais com o passar do tempo, e os gestores de pacotes vão gradualmente fornecer interfaces de busca eficientes baseadas nele. <indexterm><primary><emphasis role="pkg">debtags</emphasis></primary></indexterm> <indexterm><primary>tag</primary></indexterm>

source: when a tag-based search is needed, a good tool is <command>packagesearch</command>, a graphical interface dedicated to searching available packages along several criteria (including the names of the files that they contain);
de_de: wenn eine Markierungs-basierte Suche nötig ist, ist <command>packagesearch</command> ein gutes Werkzeug: eine grafische Oberfläche zur Suche verfügbarer Pakete neben verschiedenen anderen Kriterien (inklusive der Namen der enthaltenen Dateien);
pt_br: Quando uma busca por etiquetas é necessária, uma boa ferramenta é o <command>packagesearch</command>, uma interface gráfica dedicada a buscar pacotes disponíveis através de vários critérios (inclusive os nomes dos arquivos que eles contém);

source: <primary><emphasis role="pkg">packagesearch</emphasis></primary>
de_de: <primary><emphasis role="pkg">Paketsuche</emphasis></primary>
