Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: Unsurprisingly, the <literal>backports.debian.org</literal> server hosts “package backports”. The term refers to a package of some recent software which has been recompiled for an older distribution, generally for <emphasis role="distribution">Stable</emphasis>. When the distribution becomes a little dated, numerous software projects have released new versions that are not integrated into the current <emphasis role="distribution">Stable</emphasis> (which is only modified to address the most critical problems, such as security problems). Since the <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> distributions can be more risky, some volunteers sometimes offer recompilations of recent software applications for <emphasis role="distribution">Stable</emphasis>, which has the advantage to limit potential instability to a small number of chosen packages. <ulink type="block" url="http://backports.debian.org/" />
de_de: Wenig überraschend beherbergt der Server <literal>backports.debian.org</literal> „Paket-Rückportierungen“. Der Begriff bezeichnet ein Paket einer neueren Software-Version, die für eine ältere Distribution neu kompiliert wurde, generell für <emphasis role="distribution">Stable</emphasis>. Wenn eine Distribution älter wird, haben viele Software-Projekte bereits neuere Versionen veröffentlicht, die nicht in das gegenwärtige <emphasis role="distribution">Stable</emphasis> integriert werden (welches nur verändert wird, um die allerkritischsten Probleme, wie Sicherheitslücken, zu behandeln). Weil die Distributionen <emphasis role="distribution">Testing</emphasis> und <emphasis role="distribution">Unstable</emphasis> risikobehaftet sein können, bieten einige Freiwillige manchmal Rekompilierungen neuerer Software-Anwendungen für <emphasis role="distribution">Stable</emphasis> an, was den Vorteil hat, mögliche Instabilitäten auf eine kleine Anzahl ausgewählter Pakete zu begrenzen. <ulink type="block" url="http://backports.debian.org/" />
pt_br: Obviamente, o servidor <literal>backports.debian.org</literal> hospeda “ backports de pacotes”. O termo se refere a um pacote de algum software recente que foi recompilado para uma distribuição antiga, geralmente para a <emphasis role="distribution">Stable</emphasis>. Quando a distribuição começa a envelhecer, vários projetos de software lançam novas versões que não são integradas na <emphasis role="distribution">Stable</emphasis> atual (que é modificada apenas para resolver os problemas mais críticos, como problemas de segunrança). Como as distribuições <emphasis role="distribution">Testing</emphasis> e <emphasis role="distribution">Unstable</emphasis> podem ser mais arriscadas, alguns voluntários oferencem recompilações de software recente para a <emphasis role="distribution">Stable</emphasis>, que tem a vantagem de limitar instabilidade potencial a um pequeno número de pacotes escolhidos. <ulink type="block" url="http://backports.debian.org/" />

source: The <filename>sources.list</filename> entry for backports targeting the <emphasis role="distribution">Squeeze</emphasis> distribution is the following:
de_de: Der <filename>sources.list</filename>-Eintrag für Rückportierungen, welche die Distribution <emphasis role="distribution">Squeeze</emphasis> als Ziel haben, ist folgendermaßen:
pt_br: A entrada para o backports no <filename>sources.list</filename> voltada para a distribuição <emphasis role="distribution">Squeeze</emphasis> é a seguinte:

source: The <literal>mentors.debian.net</literal> site is also interesting, since it gathers packages created by candidates to the status of official Debian developer or by volunteers who wish to create Debian packages without going through that process of integration. These packages are made available without any guarantee regarding their quality; make sure that you check their origin and integrity and then test them before you consider using them in production.
de_de: Die Adresse <literal>mentors.debian.net</literal> ist auch interessant, weil sie Pakete zweier Entwicklergruppen sammelt: Die von Kanditaten für den Status eines offiziellen Debian-Entwicklers und die von Freiwilligen, die Debian-Pakete erstellen wollen, ohne durch den Integrationsprozess zu gehen. Diese Pakete werden ohne jegliche Garantie hinsichtlich ihrer Qualität zur Verfügung gestellt; achten Sie darauf, die Herkunft und Integrität zu prüfen und sie dann zu testen, bevor Sie erwägen, sie produktiv einzusetzen.
pt_br: O sítio <literal>mentors.debian.net</literal> também é interessante, já que ele "gather" pacotes criados por candidatos ao status de desenvolvedor Debian oficial ou por voluntários que desejam criar pacotes Debian sem passar pelo processo de integração. Estes pacotes são disponibilizados sem qualquer garantia de qualidade; certifique-se de verificar a origem e a integridade e fazer testes antes de usar em produção.

source: APT is a vast project, whose original plans included a graphical interface. It is based on a library which contains the core application, and <command>apt-get</command> is the first interface — command-line based — which was developed within the project.
de_de: APT ist ein gewaltiges Projekt, dessen ursprünglicher Entwurf eine graphische Schnittstelle vorsah. Es basiert auf einer Bibliothek, die die Kernanwendung enthält und <command>apt-get</command> war die erste Schnittstelle – befehlszeilenbasiert – die innerhalb des Projekts entwickelt wurde.
pt_br: APT é um projeto amplo, cujos planos originais incluem uma interface gráfica. Ele é baseado numa biblioteca que contém as aplicações principais, e o <command>apt-get</command> é a primeira interface — em linha de comando — que foi desenvolvida dentro do projeto.

source: Numerous other graphical interfaces then appeared as external projects: <command>synaptic</command>, <command>aptitude</command> (which includes both a text mode interface and a graphical one — even if not complete yet), <command>wajig</command>, etc. The most recommended interface, <command>aptitude</command>, is the one used during the installation of Debian. Since its command-line syntax is very similar to <command>apt-get</command>'s, we will be focusing on <command>aptitude</command> in the examples given in this section. When there are major differences between <command>aptitude</command> and <command>apt-get</command>, these differences will be detailed.
de_de: Eine Vielzahl anderer graphischer Schnittstelle erschienen im Anschluss als externe Projekte: <command>synaptic</command>, <command>aptitude</command> (das sowohl eine Schnittstelle im Textmodus wie eine graphische – wenn auch noch unvollständig – beinhaltet), <command>wajig</command>, usw. Die meistempfohlene Schnittstelle, <command>aptitude</command>, ist diejenige, die während der Debian-Installation verwendet wird. Weil ihre Befehlszeilen-Syntax der von <command>apt-get</command> sehr ähnlich ist, fokussieren wir uns bei den in diesem Abschnitt präsentierten Beispielen auf <command>aptitude</command>. Wenn es größere Unterschiede zwischen <command>aptitude</command> und <command>apt-get</command> gibt, werden diese Unterschiede im Detail erläutert.
pt_br: Várias outras interfaces gráficas apareceram como projetos externos: <command>synaptic</command>, <command>aptitude</command> (que tem uma interface modo texto e uma gráfica — que ainda não está completa), <command>wajig</command>, etc. A interface mais recomendada, <command>aptitude</command>, é a usada durante a instalação do Debian. Como a sua sintaxe de linha de comando é muito similar à do <command>apt-get</command>, vamos focar no <command>aptitude</command> nos exemplos dados nesta seção. Quando existirem diferenças substanciais entre o <command>aptitude</command> e o <command>apt-get</command>, estas diferenças serão detalhadas.

source: For any work with APT, the list of available packages needs to be updated; this can be done simply through <command>aptitude update</command>. Depending on the speed of your connection, the operation can take a while since it involves downloading a certain number of <filename>Packages.(gz|bz2)</filename> files (or even <filename>Sources.(gz|bz2)</filename>), which have gradually become bigger and bigger as Debian has developed (more than 8 MB for the largest <filename>Packages.gz</filename> — from the <literal>main</literal> section). Of course, installing from a CD-ROM set does not require any downloading — in this case, the operation is very fast.
de_de: Bei jeder Verwendung von APT muss die Liste der verfügbaren Pakete aktualisiert werden; dies kann mit einem einfachen <command>aptitude update</command> erledigt werden. Abhängig von der Geschwindigkeit Ihrer Internetverbindung kann diese Operation eine Weile dauern, da dies bedeutet, eine gewisse Zahl von <filename>Packages.(gz|bz2)</filename> oder <filename>Sources.(gz|bz2)</filename> Dateien herunterzuladen, die mit der Entwicklung von Debian nach und nach größer und größer wurden (mehr als 8MB für die größte <filename>Packages.gz</filename> – aus dem Abschnitt <literal>main</literal>). Selbstverständlich erfordert die Installation von einem CD-ROM Satz keinerlei Herunterladen – in diesem Fall ist die Operation sehr schnell.
pt_br: Para qualquer trabalho com o APT, a lista de pacotes precisa ser atualizada; isto pode ser feito simplesmente com <command>aptitude update</command>. Dependendo da velocidade de sua conexão, a operação pode demorar um pouco, pois ela baixa alguns arquivos <filename>Packages.(gz|bz2)</filename> (ou até mesmo arquivos <filename>Sources.(gz|bz2)</filename>), que estão se tornando maiores à medida em que o Debian vai se tornando maior (mais que 8 MB para os últimos <filename>Packages.gz</filename> — da seção <literal>main</literal>). Obviamente, instalar de um conjunto de CD-ROMs não baixa nada — neste caso, a operação é bastante rápida.

source: <primary>installation</primary><secondary>of packages</secondary>
de_de: <primary>Installation</primary><secondary>von Paketen</secondary>
pt_br: <primary>instalação</primary><secondary>de pacotes</secondary>

source: With APT, packages can be added or removed from the system, respectively with <command>aptitude install <replaceable>package</replaceable></command> and <command>aptitude remove <replaceable>package</replaceable></command>. In both cases, APT will automatically install the necessary dependencies or delete the packages which depend on the package that is being removed. The <command>aptitude purge <replaceable>package</replaceable></command> or <command>apt-get purge <replaceable>package</replaceable></command> commands involve a complete uninstallation — the configuration files are also deleted.
de_de: Mit APT können Pakete dem System hinzugefügt oder entfernt werden, genauer mit <command>aptitude install <replaceable>Paket</replaceable></command> und <command>aptitude remove <replaceable>Paket</replaceable></command>. In beiden Fällen installiert APT automatisch die nötigen Abhängigkeiten oder löscht die Pakete, die von dem zu entfernenden Paket abhängen. Mit den Befehlen <command>aptitude purge <replaceable>Paket</replaceable></command> oder <command>apt-get purge <replaceable>Paket</replaceable></command> ist eine vollständige Deinstallation verbunden – auch die Konfigurationsdateien werden gelöscht.
pt_br: Com o APT, os pacotes podem ser adicionados ou removidos do sistema, respectivamente com <command>aptitude install <replaceable>pacote</replaceable></command> e <command>aptitude remove <replaceable>pacote</replaceable></command>. Em ambos os casos, o APT vai instalar automaticamente as dependências necessárias ou apagar os pacotes que dependem do pacote que está para ser removido. Os comandos <command>aptitude purge <replaceable>pacote</replaceable></command> ou <command>apt-get purge <replaceable>pacote</replaceable></command> envolvem uma desinstalação completa — os arquivos de configuração também são apagados.

source: The first command registers the list of packages you wish to install, then the <command>apt-get</command> invocation executes the required operations! <command>aptitude</command> does not have this command.
de_de: Der erste Befehl wählt die zu installierenden Pakete aus. Danach führt der Aufruf von <command>apt-get</command> die Operation aus. <command>aptitude</command> hat diese Möglichkeit nicht.
pt_br: O primeiro comando registra a lista de pacotes que você gostaria de instalar, e a chamada ao <command>apt-get</command> executa as operações necessárias! O <command>aptitude</command> não tem este comando.

source: It is possible to ask <command>aptitude</command> (or <command>apt-get</command>) to install certain packages and remove others on the same command line by adding a suffix. With an <command>aptitude install</command> command, add “<literal>-</literal>” to the names of the packages you wish to remove. With an <command>aptitude remove</command> command, add “<literal>+</literal>” to the names of the packages you wish to install.
de_de: Es ist möglich, mit derselben Befehlszeile <command>aptitude</command> (oder <command>apt-get</command>) anzuweisen, gewisse Pakete zu installieren und andere Pakete zu entfernen, indem ein Vorzeichen angefügt wird. Hängen Sie beim Befehl <command>aptitude install</command> „<literal>-</literal>“ den Namen der Pakete, die Sie entfernen wollen, an. Beim Befehl <command>aptitude remove</command> hängen Sie den Namen der Pakete, die Sie installieren wollen, ein „<literal>+</literal> an.
pt_br: É possível pedir ao <command>aptitude</command> (ou <command>apt-get</command>) para instalar certos pacotes e remover outros na mesma linha de comando ao adicionar um sufixo. Com um comando <command>aptitude install</command>, adicione “<literal>-</literal>” a todos os nomes de pacotes que você precisa remover. Com um comando <command>aptitude remove</command>, adicione “<literal>+</literal>” para os nomes dos pacotes que você precisa instalar.

source: If the file <filename>sources.list</filename> mentions several distributions, it is possible to give the version of the package to install. A specific version number can be requested with <command>aptitude install <replaceable>package</replaceable>=<replaceable>version</replaceable></command>, but indicating its distribution of origin (<emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>) — with <command>aptitude install <replaceable>package</replaceable>/<replaceable>distribution</replaceable></command> — is usually preferred. With this command, it is possible to go back to an older version of a package (if for instance you know that it works well), provided that it is still available in one of the sources referenced by the <filename>sources.list</filename> file. Otherwise the <literal>snapshot.debian.org</literal> archive can come to the rescue (see sidebar <xref linkend="cadre.snapshot.debian.org" />).
de_de: Falls die Datei <filename>sources.list</filename> mehrere Distributionen enthält, ist es möglich, die Version des zu installierenden Pakets anzugeben. Eine bestimmte Versionsnummer kann mit <command>aptitude install <replaceable>paket</replaceable>=<replaceable>version</replaceable></command> angefordert werden, aber die Angabe ihrer Urspungsdistribution (<emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis> oder <emphasis role="distribution">Unstable</emphasis>) – mit <command>aptitude install <replaceable>paket</replaceable>/<replaceable>distribution</replaceable></command> – wird für gewöhnlich bevorzugt. Mit diesem Befehl ist es möglich, zu einer älteren Paketversion zurückzukehren (falls Sie zum Beispiel wissen, dass sie gut funktioniert), vorausgesetzt sie ist noch in einer der von der Datei <filename>sources.list</filename> genannten Quellen verfügbar. Ansonsten kann das Archiv <literal>snapshot.debian.org</literal> zu Hilfe kommen (siehe die Seitenleiste <xref linkend="cadre.snapshot.debian.org" />).
pt_br: Se o arquivo <filename>sources.list</filename> menciona muitas distribuições, é possível passar a versão do pacote a instalar. Um número de versão específico pode ser pedido com <command>aptitude install <replaceable>pacote</replaceable>=<replaceable>versão</replaceable></command>, mas indicar sua destribuição de origem (<emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis> ou <emphasis role="distribution">Unstable</emphasis>) — com o <command>aptitude install <replaceable>pacote</replaceable>/<replaceable>distribuição</replaceable></command> — é normalmente preferido. Com este comando, é possível voltar a uma versão antiga do pacote (se por exemplo você sabe que isto vai funcionar bem), desde que ela ainda esteja disponível em alguma das fontes referenciadas pelo arquivo <filename>sources.list</filename>. Por outro lado, o arquivamento <literal>snapshot.debian.org</literal> pode vir ao seu socorro (veja a barra lateral <xref linkend="cadre.snapshot.debian.org" />).

source: APT keeps a copy of each downloaded <filename>.deb</filename> file in the directory <filename>/var/cache/apt/archives/</filename>. In case of frequent updates, this directory can quickly take a lot of disk space with several versions of each package; you should regularly sort through them. Two commands can be used: <command>aptitude clean</command> entirely empties the directory; <command>aptitude autoclean</command> only removes packages which cannot be downloaded (because they have disappeared from the Debian mirror) and are therefore clearly useless (the configuration parameter <literal>APT::Clean-Installed</literal> can prevent the removal of <filename>.deb</filename> files that are currently installed).
de_de: APT behält eine Kopie jeder heruntergeladenen <filename>.deb</filename>-Datei im Verzeichnis <filename>/var/cache/apt/archives</filename>. Im Falle häufiger Aktualisierungen kann dieses Verzeichnis schnell eine Menge Festplattenspeicherplatz durch verschiedene Paketversionen einnehmen; Sie sollten das Verzeichnis regelmäßig aufräumen. Zwei Befehle können verwendet werden: <command>aptitude clean</command> leert das Verzeichnis vollständig; <command>aptitude autoclean</command> entfernt nur die Pakete, die nicht mehr heruntergeladen werden können (weil sie vom Debian-Spiegelserver verschwunden sind) und deshalb eindeutig nutzlos sind (der Konfigurationsparameter <literal>APT::Clean-Installed</literal> kann das Entfernen von <filename>.deb</filename>-Dateien verhindern, die gegenwärtig installiert sind).
pt_br: APT mantém uma cópia de cada arquivo <filename>.deb</filename> baixado no diretório <filename>/var/cache/apt/archives/</filename>. Caso haja atualizações frequentes, este diretório pode rapidamente ocupar um grande espaço em disco com várias versões de cada pacote; você deve regularmente passear por eles. Dois comandos podem ser usados: <command>aptitude clean</command> limpa completamente o diretório; <command>aptitude autoclean</command> limpa apenas pacotes que não podem ser mais baixados (por terem sumido dos espelhos Debian) e são agora claramente inúteis(o parâmetro de configuração <literal>APT::Clean-Installed</literal> evita a remoção de arquivos <filename>.deb</filename> que estão atualmente instalados).

source: <primary>upgrade</primary><secondary>of the system</secondary>
de_de: <primary>Aktualisierung</primary><secondary>des Systems</secondary>
pt_br: <primary>atualização</primary><secondary>do sistema</secondary>

source: Regular upgrades are recommended, because they include the latest security updates. To upgrade, use <command>aptitude safe-upgrade</command> or <command>apt-get upgrade</command> (of course after <command>aptitude update</command>). This command looks for installed packages which can be upgraded without removing any packages. In other words, the goal is to ensure the least intrusive upgrade possible. <command>apt-get</command> is slightly more demanding than <command>aptitude</command> because it will refuse to install packages which were not installed beforehand.
de_de: Regelmäßige Aktualisierungen werden empfohlen, weil sie die neuesten Sicherheitsupdates beinhalten. Zum Aktualisieren benutzen Sie <command>aptitude safe-upgrade</command> oder <command>apt-get upgrade</command> (natürlich nach <command>aptitude update</command>). Dieser Befehl sucht nach Paketen, die aktualisiert werden können, ohne andere Pakete zu entfernen. Mit anderen Worten: Das Ziel ist es, eine minimal invasive Aktualisierung sicher zu stellen. <command>apt-get</command> ist ein wenig anspruchsvoller, weil es sich weigert, Pakete zu installieren, die zuvor nicht installiert waren.
pt_br: atualizações ("upgrades") regulares são recomendados, pois eles incluem as últimas atualizações de segurança. Para atualizar, use <command>aptitude safe-upgrade</command> ou <command>apt-get upgrade</command> (claro que depois de um <command>aptitude update</command>). Este comando busca pacotes instalados que possam ser atualizados sem remover nenhum pacote. Em outras palavras, o objetivo é garantir uma atualização o menos invasiva possível. <command>apt-get</command> é um pouco mais pesado que <command>aptitude</command> por que ele vai se recusar a instalar pacotes que não estavam instalados antes.

source: As we explained earlier, the aim of the <command>aptitude update</command> command is to download for each package source the corresponding <filename>Packages</filename> (or <filename>Sources</filename>) file. However, even after a <command>bzip2</command> compression, these files can remain rather large (the <filename>Packages.bz2</filename> for the <foreignphrase>main</foreignphrase> section of <emphasis role="distribution">Squeeze</emphasis> takes more than 8 MB). If you wish to upgrade regularly, these downloads can take up a lot of time.
de_de: Wie weiter oben erklärt, ist das Ziel von <command>aptitude update</command>, von jeder Paketquelle die jeweilige <filename>Packages</filename>- (oder <filename>Sources-</filename>-) Datei herunter zu laden. Allerdings können diese Dateien selbst nach dem Komprimieren mit <command>bzip2</command> recht groß bleiben (die <filename>Packages.bz2</filename> für den Abschnitt <foreignphrase>main</foreignphrase> von <emphasis role="distribution">Squeeze</emphasis> ist größer als 8 MB). Falls Sie regelmäßig aktualisieren wollen, kann das Herunterladen viel Zeit in Anspruch nehmen.
pt_br: Como já explicado, o objetivo do comando <command>aptitude update</command> é baixar para cada fonte de pacotes o arquivo <filename>Packages</filename> (ou <filename>Sources</filename>) correspondente. Entretanto, mesmo depois de uma compressão com <command>bzip2</command>, estes arquivos podem ficar muito grandes (o <filename>Packages.bz2</filename> da seção <foreignphrase>main</foreignphrase> da <emphasis role="distribution">Squeeze</emphasis> ocupa mais de 8 MB). Se você quiser atualizar com frequencia, o download pode tomar muito tempo.
