Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: Repositories for <emphasis role="distribution">Stable</emphasis> Users
ja_jp: <emphasis role="distribution">安定版</emphasis> ユーザ用リポジトリ
pl_pl: Repozytoria dla <emphasis role="distribution">Stabilnych</emphasis> Użytkowników

source: Here is a standard <filename>sources.list</filename> for a system running the <emphasis role="distribution">Stable</emphasis> version of Debian:
ja_jp: 下に示すのは、Debian の<emphasis role="distribution">安定版</emphasis>を動かしているシステムで標準的な <filename>sources.list</filename> です:
pl_pl: Poniżej jest standardowy plik <filename>sources.list</filename> dla systemu działającego pod kontrolą <emphasis role="distribution">Stabilnej</emphasis> wersji Debiana:

source: <filename>/etc/apt/sources.list</filename> file for users of Debian Stable
ja_jp: Debian 安定版ユーザ向けの <filename>/etc/apt/sources.list</filename> ファイル
pl_pl: plik <filename>/etc/apt/sources.list</filename> dla użytkowników Stabilnego Debiana

source: This file lists all sources of packages associated with the <emphasis role="distribution">Wheezy</emphasis> version of Debian (the current <emphasis role="distribution">Stable</emphasis> as of this writing). We opted to name “wheezy” explicitly instead of using the corresponding “stable“ alias (<literal>stable</literal>, <literal>stable-updates</literal>, <literal>stable-backports</literal>) because we don't want to have the underlying distribution changed outside of our control when the next stable release comes out.
ja_jp: このファイルは Debian <emphasis role="distribution">Wheezy</emphasis> (これを書いている時点の <emphasis role="distribution">安定版</emphasis>) に関連するパッケージの全ソースをリストしています。ここでディストリビューション名に「wheezy」を使い、対応する「stable」(<literal>stable</literal>、<literal>stable-updates</literal>、<literal>stable-backports</literal>) という別名を使わなかった理由は、新しい安定版が公開されたことで自動的にディストリビューションのバージョンが変わるのを望まないからです。
pl_pl: Ten plik zawiera listę wszystkich pakietów związanych z wersją Debian <emphasis role="distribution">Wheezy</emphasis> (aktualna <emphasis role="distribution">Stabilna</emphasis> w czasie pisania tego tekstu). Zdecydowaliśmy używać wprost nazwy "wheezy" zamiast odpowiadającego pseudonimu "stabilny" (<literal>stable</literal>, <literal>stable-updates</literal>, <literal>stable-backports</literal>), ponieważ nie chcemy, aby omawiana dystrybucja zmieniła się bez naszej wiedzy, kiedy pojawi się nowe stabilne wydanie.

source: This software tests the download speed from several Debian mirrors and generates a <filename>sources.list</filename> file which points to the fastest mirror.
de_de: Dieses Programm testet die Downloadgeschwindigkeit von mehreren Debian-Spiegelservern und erzeugt eine <filename>sources.list</filename> Datei, die auf den schnellsten Spiegelserver zeigt.
ja_jp: このソフトウェアはいくつかの Debian ミラーのダウンロード速度をテストして、最も高速なミラーを使うように <filename>sources.list</filename> を生成します。
pl_pl: To oprogramowanie testuje prędkość pobierania z kilku serwerów lustrzanych Debiana i tworzy plik <filename>sources.list</filename>, który wskazuje na najszybszy z nich.
pt_br: Este software teste a velocidade de download para vários espelhos Debian e gera um arquivo <filename>sources.list</filename> que aponta para o espelho mais rápido.

source: The mirror selected during installation is generally suitable since its selection is based on the country. However, if the download is a little slow, or after a move, you can try running the application available in the <emphasis role="pkg">apt-spy</emphasis> package.
de_de: Normalerweise ist der während der Installation ausgewählte Spiegelserver geeignet, da er sich im gleichen Land befindet. Sollte jedoch das Herunterladen zu langsam sein, oder die Entfernung zum Server nach einem Umzug zu groß geworden sein, können Sie versuchen, die Anwendung aus dem Paket <emphasis role="pkg">apt-spy</emphasis> auszuführen.
ja_jp: 一般に、インストール中に選ばれたミラーは、国に基づいて選ばれているため、適切なものです。しかしながら、もしダウンロードが遅かったり引っ越しした場合は、<emphasis role="pkg">apt-spy</emphasis> パッケージから利用できるこのアプリケーションを試しに実行してみる事も可能です。
pl_pl: Serwer lustrzany wybrany podczas instalacji jest zazwyczaj właściwy, ponieważ jego wybór bazuje na lokalizacji. Jednakże, jeżeli prędkość pobierania jest trochę powolna lub po przeprowadzce, możesz testowo uruchomić aplikację z pakietu <emphasis role="pkg">apt-spy</emphasis>.
pt_br: O espelho selecionado durante a instalação é geralmente adequado já que sua seleção é baseada no país. Entretanto, se o download é lento, ou você se mudou, você pode rodar a aplicação disponível no pacote <emphasis role="pkg">apt-spy</emphasis>.

source: Most packages will come from the “base repository” which contains all packages but is seldom updated (about once every 2 months for a “point release”). The other repositories are partial (they do not contain all packages) and can host updates (packages with newer version) that APT might install. The following sections will explain the purpose and the rules governing each of those repositories.
ja_jp: ほとんどのパッケージは「ベースリポジトリ」から取得されます。「ベースリポジトリ」にはすべてのパッケージが収録されていますが、めったに更新されません (約 2 ヶ月に 1 度の「ポイントリリース」で更新されます)。他のリポジトリには、一部のパッケージしか収録されていません (すべてパッケージが収録されているわけではありません) が、APT がインストールする更新 (パッケージの新しいバージョン) が収録されています。以下の節ではこの目的と、それぞれのリポジトリを支配しているルールについて説明します。
pl_pl: Większość pakietów będzie pochodzić z "repozytorium bazowego", które zawiera wszystkie pakiety, ale jest rzadko aktualizowane (około raz na 2 miesiące w "wydaniu kropkowym"). Inne repozytoria są częściowe (nie zawierają wszystkich pakietów) i mogą zawierać aktualizacje (pakiety w nowszej wersji) do zainstalowania przez APTa. Kolejne sekcje wyjaśnią powody istnienia i prawa rządzące każdym z tych repozytoriów.

source: Note that when the desired version of a package is available on several repositories, the first one listed in the <filename>sources.list</filename> file will be used. For this reason, non-official sources are usually added at the end of the file.
ja_jp: あるパッケージの希望したバージョンが複数のリポジトリから取得できる場合、<filename>sources.list</filename> ファイルにリストされた最初のリポジトリから取得されることに注意してください。この理由から、非公式ソースは通常最後に追加されます。
pl_pl: Zauważ, że jeżeli pożądana wersja pakietu jest dostępna w kilku repozytoriach, to zostanie użyte pierwsze z nich występujące w pliku <filename>sources.list</filename>. Z tego powodu nieoficjalne źródła zazwyczaj są dodawane na końcu pliku.

source: As a side note, most of what this section says about <emphasis role="distribution">Stable</emphasis> applies equally well to <emphasis role="distribution">Oldstable</emphasis> since the latter is just an older <emphasis role="distribution">Stable</emphasis> that is maintained in parallel.
ja_jp: ちなみに、この節で<emphasis role="distribution">安定版</emphasis>に関して述べていることのほとんどは<emphasis role="distribution">旧安定版</emphasis>に関しても同じ事が言えます。なぜなら、<emphasis role="distribution">旧安定版</emphasis>とは並行して保守されている古い<emphasis role="distribution">安定版</emphasis>に過ぎないからです。
pl_pl: Tak na marginesie, większość wiadomości z tej sekcji na temat wydania <emphasis role="distribution">Stabilnego</emphasis> równie dobrze stosuje się do <emphasis role="distribution">Oldstable</emphasis>, ponieważ to tylko starsza wersja <emphasis role="distribution">Stabilnego</emphasis>, która jest utrzymywana równolegle.

source: Security Updates
ja_jp: セキュリティ更新
pl_pl: Aktualizacje bezpieczeństwa

source: <primary>security updates</primary>
ja_jp: <primary>セキュリティ更新</primary>

source: <primary>updates</primary><secondary>security updates</secondary>
ja_jp: <primary>更新</primary><secondary>セキュリティ更新</secondary>

source: The security updates are not hosted on the usual network of Debian mirrors but on <literal>security.debian.org</literal> (on a small set of machines maintained by the <link linkend="dsa-team">Debian System Administrators</link>). This archive contains security updates (prepared by the Debian Security Team and/or by package maintainers) for the <emphasis role="distribution">Stable</emphasis> distribution.
ja_jp: セキュリティ更新は Debian ミラーの通常のネットワーク上ではなく、<literal>security.debian.org</literal> (<link linkend="dsa-team">Debian システム管理者</link> が管理する少数のマシン) でホストされています。このアーカイブには、<emphasis role="distribution">安定版</emphasis>ディストリビューション用の (Debian セキュリティチームまたはパッケージメンテナが用意した) セキュリティ更新が含まれています。
pl_pl: Aktualizacje bezpieczeństwa nie są hostowane w zwyczajnej sieci serwerów lustrzanych Debiana, ale na <literal>security.debian.org</literal> (na małym zbiorze maszyn zarządzanych przez <link linkend="dsa-team">Debian System Administrators</link>). To archiwum zawiera aktualizacje bezpieczeństwa (przygotowane przez Debian Security Team i/lub przez zarządców pakietów) dla <emphasis role="distribution">Stabilnej</emphasis> dystrybucji.

source: The server can also host security updates for <emphasis role="distribution">Testing</emphasis> but this doesn't happen very often since those updates tend to reach <emphasis role="distribution">Testing</emphasis> via the regular flow of updates coming from <emphasis role="distribution">Unstable</emphasis>.
ja_jp: このサーバは<emphasis role="distribution">テスト版</emphasis>用のセキュリティ更新もホストしていますが、実際にこれがホストされることはめったにありません。なぜなら、<emphasis role="distribution">テスト版</emphasis> 対するセキュリティ更新は<emphasis role="distribution">不安定版</emphasis>対する通常の更新手順を通じて行われる事が多いからです。
pl_pl: Serwer może również hostować aktualizacje bezpieczeństwa dla <emphasis role="distribution">Testowego</emphasis>, ale nie zdarza się to zbyt często, ponieważ te aktualizacje docierają do <emphasis role="distribution">Testowego</emphasis> normalnym kanałem aktualizacji pochodzącym od <emphasis role="distribution">Niestabilnego</emphasis>.

source: Stable Updates
ja_jp: 安定版更新
pl_pl: Stabilne aktualizacje

source: <primary>stable updates</primary>
ja_jp: <primary>安定版更新</primary>

source: <primary>updates</primary><secondary>stable updates</secondary>
ja_jp: <primary>更新</primary><secondary>安定版更新</secondary>

source: Stable updates are not security sensitive but are deemed important enough to be pushed to users before the next stable point release.
ja_jp: 安定版更新はセキュリティに影響を及ぼすものではありませんが、その重要性は次の安定版ポイントリリースよりも前にユーザに提供するに値するとみなされます。
pl_pl: Stabilne aktualizacje nie są wrażliwe ze względów bezpieczeństwa, ale uważane za wystarczająco ważne, aby udostępnić je użytkownikom przez kolejnym stabilnym wydaniem kropkowym.

source: This repository will typically contain fixes for critical bugs which could not be fixed before release or which have been introduced by subsequent updates. Depending on the urgency, it can also contain updates for packages that have to evolve over time… like <emphasis role="pkg">spamassassin</emphasis>'s spam detection rules, <emphasis role="pkg">clamav</emphasis>'s virus database, or the daylight-saving rules of all timezones (<emphasis role="pkg">tzdata</emphasis>).
ja_jp: このリポジトリには通常、リリースの前に修正できなかったり、後続の更新によって生まれた、重要なバグの修正が含まれています。緊急度に応じて、時間と共に進化させる必要のあるパッケージの更新… 例えば <emphasis role="pkg">spamassassin</emphasis> のスパム検出ルール、<emphasis role="pkg">clamav</emphasis> のウィルスデータベース、すべてのタイムゾーンの夏時間ルール (<emphasis role="pkg">tzdata</emphasis>) など、を含める事が可能です。
pl_pl: To repozytorium będzie zwykle zawierać poprawki błędów dla krytycznych błędów, które nie mogły być naprawione przed wydaniem lub pojawiły się pomiędzy kolejnymi aktualizacjami. Zależnie od pilności, może zawierać również aktualizacje dla pakietów, które muszą ewoluować z czasem... jak zasady wykrywania spamu <emphasis role="pkg">spamassassin</emphasis>, baza wirusów <emphasis role="pkg">clamav</emphasis> lub czas letni dla wszystkich stref czasowych (<emphasis role="pkg">tzdata</emphasis>).

source: In practice, this repository is a subset of the <literal>proposed-updates</literal> repository, carefully selected by the Stable Release Managers.
ja_jp: 実際のところ、このリポジトリは内容を <literal>proposed-updates</literal> リポジトリからの一部抜粋したもので、安定版リリースマネージャが内容を注意深く選んでいます。
pl_pl: W praktyce, to repozytorium jest podzbiorem repozytorium <literal>proposed-updates</literal>, starannie wybranym przez Stable Release Managers.

source: Proposed Updates
ja_jp: 提案された更新
pl_pl: Proponowane Aktualizacje

source: Once published, the <emphasis role="distribution">Stable</emphasis> distribution is only updated about once every 2 months. The <literal>proposed-updates</literal> repository is where the expected updates are prepared (under the supervision of the Stable Release Managers).
ja_jp: 一旦公開されたら、 <emphasis role="distribution">安定版</emphasis> ディストリビューションが更新される頻度は約 2 ヶ月に 1 回だけです。<literal>proposed-updates</literal> リポジトリは (安定版リリースマネージャの指揮の下で) 予定された更新を準備する場所です。
pl_pl: Po opublikowaniu, <emphasis role="distribution">Stabilna</emphasis> dystrybucja jest aktualizowana tylko raz na 2 miesiące. Repozytorium <literal>proposed-updates</literal> jest miejscem, gdzie są przygotowywane spodziewane aktualizacje (pod nadzorem Stable Release Managers).

source: The security and stable updates documented in the former sections are always included in this repository, but there is more too, because package maintainers also have the opportunity to fix important bugs that do not deserve an immediate release.
ja_jp: 前の節で説明したセキュリティ更新と安定版更新は、常に <literal>proposed-updates</literal> リポジトリに加えられますが、更新は他にもあります。なぜなら、パッケージメンテナは素早くリリースする事もないけれど重要と思われるバグを修正する機会があるからです。
pl_pl: Aktualizacje bezpieczeństwa i stabilne opisane w poprzedniej sekcji są zawsze zawarte w tym repozytorium, ale jest też więcej, ponieważ zarządcy pakietów maja również okazję naprawienia ważnych błędów, które nie wymagają natychmiastowego wydania.

source: Anyone can use this repository to test those updates before their official publication. The extract below uses the <literal>wheezy-proposed-updates</literal> alias which is both more explicit and more consistent since <literal>squeeze-proposed-updates</literal> also exists (for the <emphasis role="distribution">Oldstable</emphasis> updates):
ja_jp: 誰でも、正式公開前に更新をテストするために、<literal>proposed-updates</literal> リポジトリを使う事が可能です。以下で引用した例は <literal>wheezy-proposed-updates</literal> 別名を使っています。このような、より明白でより一貫性のある別名を使っている理由は、(<emphasis role="distribution">旧安定版</emphasis> 用の) <literal>squeeze-proposed-updates</literal> 別名が存在するからです。
pl_pl: Każdy może używać tego repozytorium do testowania tych aktualizacji przed ich oficjalną publikacją. Wypis poniżej używa pseudonimu <literal>wheezy-proposed-updates</literal>, który jest zarówno bardziej wyraźny i spójny, ponieważ istnieje również <literal>squeeze-proposed-updates</literal> (dla aktualizacji <emphasis role="distribution">Oldstable</emphasis>):

source: Stable Backports
ja_jp: 安定版バックポート
pl_pl: Stabilne Wsteczne Łatki

source: <primary>backport</primary>
de_de: <primary>Rückportierung (Backport)</primary>
ja_jp: <primary>バックポート</primary>

source: <primary>updates</primary><secondary>backports</secondary>
ja_jp: <primary>安定版</primary><secondary>バックポート</secondary>

source: The <literal>stable-backports</literal> repository hosts “package backports”. The term refers to a package of some recent software which has been recompiled for an older distribution, generally for <emphasis role="distribution">Stable</emphasis>.
ja_jp: <literal>stable-backports</literal> リポジトリは「パッケージのバックポート」をホストしています。この用語は、古いディストリビューション用に、通常は<emphasis role="distribution">安定版</emphasis>用に、再コンパイルした最新ソフトウェアのパッケージを指す言葉です。
pl_pl: Repozytorium <literal>stable-backports</literal> hostuje "wsteczne łatki pakietów". Termin ten odnosi się do pakietu nowego oprogramowania, które zostało przekompilowane dla starszej dystrybucji, ogólnie dla <emphasis role="distribution">Stabilnej</emphasis>.

source: When the distribution becomes a little dated, numerous software projects have released new versions that are not integrated into the current <emphasis role="distribution">Stable</emphasis> (which is only modified to address the most critical problems, such as security problems). Since the <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> distributions can be more risky, package maintainers sometimes offer recompilations of recent software applications for <emphasis role="distribution">Stable</emphasis>, which has the advantage to limit potential instability to a small number of chosen packages. <ulink type="block" url="http://backports.debian.org" />
ja_jp: ディストリビューションがほんの少し時代遅れになっただけで、多くのソフトウェアプロジェクトが新バージョンをリリースしますが、新バージョンは現在の<emphasis role="distribution">安定版</emphasis>に取り込まれません (このディストリビューションは最も重要な問題、例えばセキュリティ問題など、の修正しか取り込みません)。<emphasis role="distribution">テスト版</emphasis>と<emphasis role="distribution">不安定版</emphasis>ディストリビューションはより危険性が高いので、パッケージメンテナはしばしば<emphasis role="distribution">安定版</emphasis>向けに最新のソフトウェアアプリケーションを再コンパイルして提供する事があります。これは潜在的不安定性を少数の選ばれたパッケージだけに制限できるという利点があります。<ulink type="block" url="http://backports.debian.org" />
pl_pl: Kiedy dystrybucja staje się trochę podstarzała, wiele projektów związanych z oprogramowaniem wydało nowe wersje, które nie są włączone do aktualnej <emphasis role="distribution">Stabilnej</emphasis> (która jest modyfikowana wyłącznie w celu naprawienia krytycznych problemów, na przykład z bezpieczeństwem). Ponieważ <emphasis role="distribution">Testowa</emphasis> i <emphasis role="distribution">Niestabilna</emphasis> mogą być bardziej ryzykowne, zarządcy pakietów oferują czasem przekompilowane wersje nowych aplikacji dla <emphasis role="distribution">Stabilnej</emphasis>, która ma tą zaletę, że ogranicza potencjalną niestabilność do małej liczby wybranych pakietów. <ulink type="block" url="http://backports.debian.org" />

source: The <literal>stable-backports</literal> repository is now available on the usual Debian mirrors. But backports for <emphasis role="distribution">Squeeze</emphasis> are still hosted on a dedicated server (<literal>backports.debian.org</literal>), and requires the following <filename>sources.list</filename> entry:
ja_jp: 今や、<literal>stable-backports</literal> リポジトリは普通の Debian ミラーから利用可能です。しかし <emphasis role="distribution">Squeeze</emphasis> 用のバックポートはまだ専用サーバ (<literal>backports.debian.org</literal>) でホストされており、以下の <filename>sources.list</filename> エントリが必要です:
pl_pl: Repozytorium <literal>stable-backports</literal> jest teraz dostępne na normalnych serwerach lustrzanych Debiana. Ale wsteczne łatki do <emphasis role="distribution">Squeeze</emphasis> są nadal hostowane na dedykowanym serwerze (<literal>backports.debian.org</literal>) i wymagają następującego wpisu w <filename>sources.list</filename>:

source: Backports from <literal>stable-backports</literal> are always created from packages available in <emphasis role="distribution">Testing</emphasis>. This ensures that all installed backports will be upgradable to the corresponding stable version once the next stable release of Debian is available.
ja_jp: <literal>stable-backports</literal> に収録されているバックポートは常に<emphasis role="distribution">テスト版</emphasis>で利用可能なパッケージから作成されます。これは、次の Debian 安定版リリースが利用可能になったら、すべてのインストール済みバックポートは対応する安定版にアップグレード可能である、という事を保証します。
pl_pl: Wsteczne łatki z <literal>stable-backports</literal> są zawsze tworzone z pakietów dostępnych w <emphasis role="distribution">Testowym</emphasis>. To zapewnia, że wszystkie zainstalowane wsteczne łatki będzie można zaktualizować do odpowiedniej stabilnej wersji, kiedy będzie dostępne następne stabilne wydanie Debiana.

source: Even though this repository provides newer versions of packages, APT will not install them unless you give explicit instructions to do so (or unless you have already done so with a former version of the given backport):
ja_jp: このリポジトリはパッケージの新しいバージョンを提供しますが、APT は明確な指示を出さない限り (または以前同じバックポートの古いバージョンをインストールしていない限り) バックポートパッケージをインストールしません:
pl_pl: Mimo, że to repozytorium dostarcza nowsze wersje pakietów, APT nie zainstaluje ich do czasu, aż nie wydasz do tego bezpośrednich instrukcji (lub jeżeli już tego nie zrobiłeś z wcześniejszą wersją danej wstecznej łatki):

source: Repositories for <emphasis role="distribution">Testing</emphasis>/<emphasis role="distribution">Unstable</emphasis> Users
ja_jp: <emphasis role="distribution">テスト版</emphasis>/<emphasis role="distribution">不安定版</emphasis>ユーザ向けリポジトリ
pl_pl: Repozytoria dla użytkowników <emphasis role="distribution">Testowej</emphasis>/<emphasis role="distribution">Niestabilnej</emphasis>

source: Here is a standard <filename>sources.list</filename> for a system running the <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> version of Debian:
ja_jp: 下に示すのは、Debian の<emphasis role="distribution">テスト版</emphasis>や<emphasis role="distribution">不安定版</emphasis>を動かしているシステムで標準的な <filename>sources.list</filename> です:
pl_pl: Poniżej jest standardowy plik <filename>sources.list</filename> dla systemu działającego pod kontrolą <emphasis role="distribution">Testowej</emphasis> lub <emphasis role="distribution">Niestabilnej</emphasis> wersji Debiana:

source: <filename>/etc/apt/sources.list</filename> file for users of Debian <emphasis role="distribution">Testing</emphasis>/<emphasis role="distribution">Unstable</emphasis>
ja_jp: Debian <emphasis role="distribution">テスト版</emphasis>/<emphasis role="distribution">不安定版</emphasis>ユーザ向けの <filename>/etc/apt/sources.list</filename> ファイル
pl_pl: plik <filename>/etc/apt/sources.list</filename> dla użytkowników <emphasis role="distribution">Testowego</emphasis>/<emphasis role="distribution">Niestabilnego</emphasis> Debiana

source: With this <filename>sources.list</filename> file APT will install packages from <emphasis role="distribution">Unstable</emphasis>. If that is not desired, use the <literal>APT::Default-Release</literal> setting (see <xref linkend="sect.apt-upgrade" />) to instruct APT to pick packages from another distribution (most likely <emphasis role="distribution">Testing</emphasis> in this case).
ja_jp: この <filename>sources.list</filename> ファイルを使う場合、APT は<emphasis role="distribution">不安定版</emphasis>からパッケージをインストールします。これを望まない場合、<literal>APT::Default-Release</literal> 設定を使って (<xref linkend="sect.apt-upgrade" /> をご覧ください) APT に他のディストリビューションから (この場合<emphasis role="distribution">テスト版</emphasis>から) パッケージを取得するよう伝えます。
pl_pl: Używając tego pliku <filename>sources.list</filename> APT będzie instalował pakiety z wersji <emphasis role="distribution">Niestabilnej</emphasis>. Jeżeli nie jest to pożądane, należy użyć ustawienia <literal>APT::Default-Release</literal> (patrz <xref linkend="sect.apt-upgrade" />), które poinstruuje APTa, aby wybierał pakiety z innej dystrybucji (w tym przypadku najprawdopodobniej <emphasis role="distribution">Testowej</emphasis>).
