Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: To reconfigure <command>debconf</command>, use the <command>dpkg-reconfigure</command> tool from the <emphasis role="pkg">debconf</emphasis> package; the relevant command is <command>dpkg-reconfigure debconf</command>. Note that the configured values can be temporarily overridden with environment variables when needed (for instance, <varname>DEBIAN_FRONTEND</varname> controls the interface, as documented in the <citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry> manual page).
de_de: Um <command>debconf</command> umzukonfigurieren, nutzen Sie das Werkzeug <command>dpkg-reconfigure</command> aus dem Paket <emphasis role="pkg">debconf</emphasis>; das passende Kommando ist <command>dpkg-reconfigure debconf</command>. Beachten Sie, dass Werte aus der Konfigurationsdatei bei Bedarf mit Umgebungsvariablen temporär übersteuert werden können (beispielsweise steuert <varname>DEBIAN_FRONTEND</varname> die Schnittstelle, wie auf der <citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry> Handbuchseite beschrieben).
ja_jp: <command>debconf</command> を再設定するには、<emphasis role="pkg">debconf</emphasis> パッケージから提供される <command>dpkg-reconfigure</command> ツールを使ってください; これを実行するコマンドは <command>dpkg-reconfigure debconf</command> です。ここで設定した値は、必要ならば環境変数を使って一時的に上書きする事ができる点に注意してください。(例えば、<varname>DEBIAN_FRONTEND</varname> 環境変数は、<citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry> マニュアルページで説明されている通り、インターフェースを制御します)。
pl_pl: W celu zmiany konfiguracji <command>debconf</command> należy użyć narzędzia <command>dpkg-reconfigure</command> z pakietu <emphasis role="pkg">debconf</emphasis>; omawianą komendą jest <command>dpkg-reconfigure debconf</command>. Warto zauważyć, że w razie potrzeby wartości konfiguracyjne mogą być tymczasowo nadpisane zmiennymi środowiskowymi (przykładowo <varname>DEBIAN_FRONTEND</varname> kontroluje interfejs, co zostało opisane na stronach pomocy <citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry>).
pt_br: Para reconfigurar o <command>debconf</command>, use a ferramenta <command>dpkg-reconfigure</command> do pacote <emphasis role="pkg">debconf</emphasis>; o comando relevante é o <command>dpkg-reconfigure debconf</command>. Note que os valores configurados podem ser temporariamente sobreescritos com variáveis de ambiente quando necessário (por exemplo, <varname>DEBIAN_FRONTEND</varname> controla a interface, como documentado na página de manual <citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry>).

source: Handling Command Line Interactions
de_de: Interaktiver Umgang mit der Kommandozeile
ja_jp: コマンドラインインターフェースの取り扱い
pl_pl: Obsługa Interakcji Linii Komend
pt_br: Lidando com Interações Via Linha de Comando

source: The last source of interactions, and the hardest to get rid of, is the configuration scripts run by <command>dpkg</command>. There is unfortunately no standard solution, and no answer is overwhelmingly better than another.
de_de: Die letzte Interaktionsquelle, die am schwersten los zu werdende, sind die von <command>dpkg</command> ausgeführten Konfigurationsskripte. Unglücklicherweise gibt es dafür keine Standardlösung.
ja_jp: ユーザに入力を要求する最後の要素は、<command>dpkg</command> が実行する設定スクリプトで、これは克服する事が最も難しいものです。これに対する標準的な解決策はありませんし、無回答以外に良い解決策はありません。
pl_pl: Ostatnim źródłem interakcji, najtrudniejszym do ominięcia, są skrypty konfiguracyjne uruchamiane przez <command>dpkg</command>. Niestety nie mają one standardowego rozwiązania, a żadna odpowiedź nie jest znacząco lepsza niż inne.
pt_br: A última fonte de interações, e a mais difícil de esconder, são os scripts de configuração executados pelo <command>dpkg</command>. infelizmente não existe solução padrão, e nenhuma resposta é substancialmente melhor que outra.

source: The common approach is to suppress the standard input by redirecting the empty content of <filename>/dev/null</filename> into it with <command><replaceable>command</replaceable> &lt;/dev/null</command>, or to feed it with an endless stream of newlines. None of these methods are 100 % reliable, but they generally lead to the default answers being used, since most scripts consider a lack of reply as an acceptance of the default value.
de_de: Die gebräuchlichste Vorgehensweise ist, den leeren Inhalt von <filename>/dev/null</filename> mit <command><replaceable>Befehl</replaceable> &lt;/dev/null</command> auf die Standardeingabe umzuleiten oder einen endlosen Strom von Zeilenvorschüben zu zu führen. Keine dieser Methoden ist 100% sicher, aber üblicherweise sorgen sie dafür, dass die Standardantworten gewählt werden, da die meisten Skripte eine ausbleibende Antwort als Anerkennen der Standardantwort interpretieren.
ja_jp: 一般的な解決策は、<command><replaceable>command</replaceable> &lt;/dev/null</command> のように標準入力を <filename>/dev/null</filename> の空内容にリダイレクトすることで標準入力を抑制するか、プログラムに改行文字を送り続けるかです。どちらの策も完全に信頼できるわけではありませんが、通常はデフォルト回答が使われることになります。なぜなら、多くのスクリプトでは、応答の無い場合はデフォルト回答を選択したことになるからです。
pl_pl: Najczęstszym podejściem jest tłumienie standardowego wejścia przez przekierowanie do niego pustej zawartości <filename>/dev/null</filename> za pomocą <command><replaceable>komenda</replaceable> &lt;/dev/null</command>, albo podanie niekończącego się strumienia nowych linii. Żadna z tych metod nie jest w 100% niezawodna, ale zazwyczaj prowadzą do użycia domyślnych odpowiedzi, ponieważ większość skryptów uważa brak odpowiedzi jako akceptację domyślnej wartości.
pt_br: A abordagem normal é suprimir a entrada padrão redirecionando o conteúdo vazio de <filename>/dev/null</filename> nela com <command><replaceable>comando</replaceable> &lt;/dev/null</command>, ou alimentá-la com um fluxo infinito de newlines. Nenhum destes métodos é 100% confiável, mas eles em geral levam a respostas padrão sendo preenchidas, uma vez que a maioria dos scripts consideram a ausência de resposta comouma aceitação do valor padrão.

source: The Miracle Combination
de_de: Die Wunderkombination
ja_jp: 奇跡の組み合わせ
pl_pl: Cudowne Połączenie
pt_br: A Combinação Miraculosa

source: By combining the previous elements, it is possible to design a small but rather reliable script which can handle automatic upgrades.
de_de: Indem die vorangegangenen Elemente miteinander kombiniert werden, ist es möglich, ein kleines aber ziemlich zuverlässiges Skript zu entwerfen, das automatische Aktualisierungen durchführt.
ja_jp: 上記の説明を組み合わせれば、小規模で比較的信頼できるスクリプトを設計する事が可能です。これで自動アップグレードが可能になります。
pl_pl: Poprzez połączenie wcześniej wspomnianych elementów możliwe jest zaprojektowanie małego, dosyć niezawodnego skryptu do wykonywania automatycznych uaktualnień.
pt_br: Combinando os elementos anteriores, é possível projetar um scrips pequeno mas muito confiável que possa manipular atualizações automáticas.

source: Non-interactive upgrade script
de_de: Automatisches Aktualisierungs-Skript
ja_jp: 非対話型のアップグレードスクリプト
pl_pl: Skrypt uaktualniający bez interakcji
pt_br: Roteiro de atualização não interativa

source: <emphasis>IN PRACTICE</emphasis> The Falcot Corp case
de_de: <emphasis>IN DER PRAXIS</emphasis> Der Fall Falcot Corp
ja_jp: <emphasis>IN PRACTICE</emphasis> Falcot Corp の場合
pl_pl: <emphasis>W PRAKTYCE</emphasis> Przypadek Falcot Corp
pt_br: <emphasis>NÁ PRÁTICA</emphasis> O caso Falcot Corp

source: Falcot computers are a heterogeneous system, with machines having various functions. Administrators will therefore pick the most relevant solution for each computer.
de_de: Die Rechner von Falcot haben vielfältige Aufgaben und bilden ein heterogenes System. Aus diesem Grund wählen die Administratoren die am besten geeignete Lösung für jeden Rechner.
ja_jp: Falcot のコンピュータは様々な機種が混在するシステムで、それぞれのマシンが異なる機能を持っています。そのため、管理者はそれぞれのコンピュータに対して最も適切な解決策を選択できます。
pl_pl: Komputery w Falcot składają się na zróżnicowany system, zawierający maszyny przeznaczone do różnych zadań. Z tego powodu dla każdego komputera administratorzy muszą wybrać najbardziej odpowiednie rozwiązanie.
pt_br: Os computadores da Falcot formam um sistema heterogêneo, com máquinas tendo muitas funções. Os administradores vão portanto pegar a solução mais relevante para cada computador.

source: In practice, the servers running <emphasis role="distribution">Wheezy</emphasis> are configured with the “miracle combination” above, and are kept up to date automatically. Only the most critical servers (the firewalls, for instances) are set up with <command>apticron</command>, so that upgrades always happen under the supervision of an administrator.
ja_jp: 実際のところ、<emphasis role="distribution">Wheezy</emphasis> が動いているサーバでは上に挙げた「奇跡の組み合わせ」を設定して、システムを自動的に最新の状態に保っています。最も重要なサーバ (例えばファイヤーウォール) では <command>apticron</command> を設定しています。そうすればアップグレードは管理者の監視の下で実行されるからです。
pl_pl: W praktyce, serwery działające pod kontrolą <emphasis role="distribution">Wheezy</emphasis> są skonfigurowane opisanym wyżej "cudownym połączeniem", dzięki czemu automatycznie zachowują aktualność. Jedynie najbardziej krytyczne serwery (na przykład zapory sieciowe) używają <command>apticron</command>, po to żeby uaktualnienia zawsze przebiegały pod nadzorem administratorów.

source: The office workstations in the administrative services also run <emphasis role="distribution">Wheezy</emphasis>, but they are equipped with <emphasis role="pkg">gnome-packagekit</emphasis>, so that users trigger the upgrades themselves. The rationale for this decision is that if upgrades happen without an explicit action, the behavior of the computer might change unexpectedly, which could cause confusion for the main users.
ja_jp: 管理部局で使われるオフィスワークステーションでは <emphasis role="distribution">Wheezy</emphasis> が動いていますが、<emphasis role="pkg">gnome-packagekit</emphasis> を備えています。そうすればユーザが自分でアップグレードを動作させる事ができるからです。このように設定した根拠は、明確な指示無しにアップグレードが実行された場合、コンピュータの挙動が突然変わってしまうかもしれないからです。こうなると主たるユーザは混乱するでしょう。
pl_pl: Biurowe stacje robocze w dziale administracji również działają pod kontrolą <emphasis role="distribution">Wheezy</emphasis>, ale są wyposażone w <emphasis role="pkg">gnome-packagekit</emphasis>, żeby użytkownicy mogli sami wykowywać uaktualnienia. Powodem tej decyzji jest fakt, że jeżeli uaktualnienia uruchamiają się bez ostrzeżenia, to zachowanie komputera może się niespodziewanie zmienić, co zakłóca pracę najważniejszych użytkowników.

source: In the lab, the few computers using <emphasis role="distribution">Testing</emphasis> — to take advantage of the latest software versions — are not upgraded automatically either. Administrators only configure APT to prepare the upgrades but not enact them; when they decide to upgrade (manually), the tedious parts of refreshing package lists and downloading packages will be avoided, and administrators can focus on the really useful part.
de_de: Die Rechner, die im Labor unter <emphasis role="distribution">Testing</emphasis> laufen – um von den neusten Programmversionen zu profitieren – , werden nicht automatisch aktualisiert. Die Administratoren konfigurieren APT, die Aktualisierungen vorzubereiten aber nicht durchzuführen. Wenn sich sich entschließen (manuell) zu aktualsieren, ist der lästige Teil des Paketlisteaktualisierens und Herunterladens der Pakete bereits erledigt und die Administratoren können sich auf das Wesentliche konzentrieren.
ja_jp: 研究所では - 最新のソフトウェアバージョンを駆使するために - <emphasis role="distribution">テスト版</emphasis>を使っている少しのコンピュータは自動的にアップグレードされません。管理者は APT を設定してアップグレードを準備するだけで、アップグレードを適用しません; 管理者が (手作業で) アップグレードする際には、パッケージリストの更新とパッケージのダウンロードという退屈な作業が終わっている状態であり、本当に必要なところだけに集中できます。
pl_pl: W laboratorium, kilka komputerów używających <emphasis role="distribution">Testowego</emphasis> — w celu wykorzystania najnowszych wersji oprogramowania — również nie jest uaktualnianych automatycznie. Administratorzy jedynie konfigurują APTa do przygotowania uaktualnienia, ale bez instalacji; kiedy już zdecydują o uaktualnieniu (ręcznym), uciążliwa część odświeżania list pakietów i pobierania pakietów zostanie pominięta, a administratorzy mogą w pełni skupić się na produktywnym działaniu.
pt_br: No laboratório, os poucos computadores que usam <emphasis role="distribution">Testing</emphasis> — para usufruir das últimas atualizações de software — também não são atualizados automaticamente. Os administradores configuraram o APT apenas para preparar as atualizações mas não para as ativarem; quando eles decidem atualizar (manualmente), a parte chata de renovar a lista de pacotes e baixar os pacotes é evitada, e os administradores podem focar na parte realmente útil.

source: Searching for Packages
de_de: Pakete suchen
ja_jp: パッケージの検索
pl_pl: Wyszukiwanie Pakietów
pt_br: Buscando por Pacotes

source: With the large and ever-growing amount of software in Debian, there emerges a paradox: Debian usually has a tool for most tasks, but that tool can be very difficult to find amongst the myriad other packages. The lack of appropriate ways to search for (and to find) the right tool has long been a problem. Fortunately, this problem has almost entirely been solved.
de_de: Mit der großen und immer weiter wachsenden Menge von Software in Debian entsteht ein Paradoxon: Debian hat normalerweise ein Werkzeug für fast jede Aufgabe, aber es kann sehr schwer sein, es unter der Unzahl anderer Pakete zu finden. Der Mangel an geeigneten Wegen das richtige Werkzeug zu suchen (und zu finden) war lange Zeit ein Problem. Glücklicherweise ist dieses Problem mittlerweile fast vollständig gelöst.
ja_jp: Debian に含まれるソフトウェアの数は多くさらに増加し続けている事が原因でパラドックスが生じます: Debian には通常ほとんどの作業に適したツールが用意されていますが、無数のパッケージからその作業に適したツールを見つける事がとても難しくなります。適切なツールを検索する (発見する) ための良い方法が無い点は長い間問題とされていました。幸いなことに、この問題はほぼ解決されています。
pl_pl: W ogromnej, ciągle rosnącej bazie oprogramowania dla Debiana powstaje pewien paradoks: Debian zazwyczaj ma narzędzie do wykonywania większości zadań, ale to narzędzie może być bardzo trudne do znalezienia pośród niezliczonej liczby innych pakietów. Przez długi czas brak odpowiednich sposobów wyszukiwania (i znajdowania) właściwego narzędzia był problemem. Na szczęście ten problem został niemal w całości rozwiązany.
pt_br: Com a grande e crescente quantidade de software no Debian, surge um paradoxo: o Debian normalmente tem uma ferramenta para a maioria das tarefas, mas pode ser muito difícil de achá-la na multidão de outros pacotes. A ausência de formas apropriadas de buscar (e encontrar) a ferramenta certa é um problema de longa data. Felizmente, este problema foi quase completamente resolvido.

source: The most trivial search possible is looking up an exact package name. If <command>apt-cache show <replaceable>package</replaceable></command> returns a result, then the package exists. Unfortunately, this requires knowing or even guessing the package name, which isn't always possible.
de_de: Die einfachst mögliche Suche ist die nach einem exakten Paketnamen. Wenn <command>apt-cache show <replaceable>Paket</replaceable></command> ein Ergebnis zurückliefert, existiert das Paket. Unglücklicherweise erfordert die, den Paketnamen zu wissen oder zumindest zu erraten, was nicht immer möglich ist.
ja_jp: 最も普通な検索方法の候補は正確なパッケージ名を調べる事です。<command>apt-cache show <replaceable>package</replaceable></command> で結果が返されたら、パッケージが存在するという事です。不幸なことにこの方法では、パッケージ名を知っているか推測する必要があり、それは常に可能とは限りません。
pl_pl: Najprostszym możliwym sposobem jest wyszukiwanie dokładnej nazwy pakietu. Jeżeli <command>apt-cache show <replaceable>pakiet</replaceable></command> zwraca wynik, to dany pakiet istnieje. Niestety wymaga to znajomości lub nawet zgadywania nazwy pakietu, co nie zawsze jest możliwe.
pt_br: A busca mais trivial possível é procurar pelo nome exato de um pacote. Se <command>apt-cache show <replaceable>pacote</replaceable></command> retorna um resultado, então o pacote existe. Infelizmente, para isto é necessário saber ou chutar o nome do pacote, o que nem sempre é possível.

source: <emphasis>TIP</emphasis> Package naming conventions
de_de: <emphasis>TIPP</emphasis> Namenskonventionen für Pakete
ja_jp: <emphasis>TIP</emphasis> パッケージ命名規則
pl_pl: <emphasis>WSKAZÓWKA</emphasis> Konwencje nazewnictwa pakietów
pt_br: <emphasis>DICA</emphasis> Convenções de nomes de pacote

source: Some categories of packages are named according to a conventional naming scheme; knowing the scheme can sometimes allow you to guess exact package names. For instance, for Perl modules, the convention says that a module called <literal>XML::Handler::Composer</literal> upstream should be packaged as <emphasis role="pkg">libxml-handler-composer-perl</emphasis>. The library enabling the use of the <command>gconf</command> system from Python is packaged as <emphasis role="pkg">python-gconf</emphasis>. It is unfortunately not possible to define a fully general naming scheme for all packages, even though package maintainers usually try to follow the choice of the upstream developers.
de_de: In einigen Kategorien folgen Paketnamen festgelegten Namensschemen, diese Schemen zu kennen erlaubt es oft, den exakten Paketnamen zu erahnen. Beispielsweise besagt die Namenskonvention für Perl Module, dass ein Modul namens <literal>XML::Handler::Composer</literal> als <emphasis role="pkg">libxml-handler-composer-perl</emphasis> paketiert werden sollte. Die Bibliothek, die Python die Nutzung des <command>gconf</command> Systems ermöglicht, ist als <emphasis role="pkg">python-gconf</emphasis> paketiert. Leider ist es nicht möglich, ein einheitliches Namensschema für alle Pakete festzulegen, obwohl die Paketbetreuer normalerweise der Wahl der vorgelagerten Entwickler folgen.
ja_jp: 幾つかのカテゴリに含まれるパッケージは従来続けられている命名規則に基いて命名されます; この規則を知っておけば、正確なパッケージ名を推測できる場合があります。例えば、Perl モジュールに関して、規約では <literal>XML::Handler::Composer</literal> と呼ばれるモジュールは <emphasis role="pkg">libxml-handler-composer-perl</emphasis> のようにパッケージ化されるべきであると定められています。Python から <command>gconf</command> システムを扱うためのライブラリは <emphasis role="pkg">python-gconf</emphasis> としてパッケージ化されています。不幸なことに、たとえパッケージメンテナが通常は上流開発者の選択に従おうとするとしても、すべてのパッケージに対する完全に一般的な命名規則を定義することは不可能です。
pl_pl: Niektóre kategorie pakietów są nazywane według konwencjonalnego schematu nazewnictwa; znajomość tego schematu pozwala czasami zgadnąć dokładne nazwy pakietów. Na przykład dla modułów Perla konwencja mówi, że moduł nazwany <literal>XML::Handler::Composer</literal> powinien być spakowany jako <emphasis role="pkg">libxml-handler-composer-perl</emphasis>. Biblioteka umożliwiająca używanie systemu <command>gconf</command> z poziomu Pythona jest spakowana jako <emphasis role="pkg">python-gconf</emphasis>. Niestety niemożliwe jest sformułowanie w pełni ogólnego schematu nazewnictwa pakietów, nawet jeżeli opiekunowie pakietów zazwyczaj starają się postępować zgodnie z wyborem deweloperów.
pt_br: Algumas categorias de pacotes são batizados de acordo com um esquema de nomenclatura convencional; saber o esquema às vezes ajuda a adivinhar o nome exato dos pacotes. Por exemplo, para módulos Perl, a convenção diz que um módulo chamado <literal>XML::Handler::Composer</literal> no desenvolvimento principal deve ser empacotado como <emphasis role="pkg">libxml-handler-composer-perl</emphasis>. A biblioteca que habilita o uso do sistema <command>gconf</command> pelo Python é empacotada como <emphasis role="pkg">python-gconf</emphasis>. Infelizmente não é possível definir um esquema de nomenclatura totalmente geral para todos os pacotes, mesmo que os mantenedores normalmente tentem seguir a escolha dos desenvolvedores principais.

source: A slightly more successful searching pattern is a plain-text search in package names, but it remains very limited. You can generally find results by searching package descriptions: since each package has a more or less detailed description in addition to its package name, a keyword search in these descriptions will often be useful. <command>apt-cache</command> and <command>axi-cache</command> are the tools of choice for this kind of search; for instance, <command>apt-cache search video</command> will return a list of all packages whose name or description contains the keyword “video”.
ja_jp: もう少し上手い検索パターンはパッケージ名の中をプレーンテキスト検索する事ですが、この方法も大きな制約を受けます。通常、パッケージ説明を検索すれば結果が見つかるでしょう: なぜなら、大体のパッケージはパッケージ名だけでなく詳しい説明文を備えているからです。パッケージ説明のキーワード検索はしばしば役に立ちます。<command>apt-cache</command> と <command>axi-cache</command> はパッケージ説明のキーワード検索を行う際に選ぶツールです; 例えば、<command>apt-cache search video</command> は「video」というキーワードがパッケージ説明に含まれるすべてのパッケージのリストを返します。
pl_pl: Nieco bardziej pomyślnym szablonem wyszukiwania jest przeszukiwanie zwykłego tekstu w nazwach pakietów, ale jest ono bardzo ograniczone. Często można znaleźć wyniki przeszukując opisy pakietów: poza nazwą każdy pakiet ma bowiem mniej lub bardziej szczegółowy opis, wyszukiwanie słów kluczowych w tych opisach zazwyczaj również będzie użyteczne. <command>apt-cache</command> oraz <command>axi-cache</command> są typowymi narzędziami do tego typu szukania; na przykład <command>apt-cache search video</command> zwróci listę wszystkich pakietów, których nazwy lub opisy zawierają słowo kluczowe "video".

source: For more complex searches, a more powerful tool such as <command>aptitude</command> is required. <command>aptitude</command> allows you to search according to a logical expression based on the package's meta-data fields. For instance, the following command searches for packages whose name contains <literal>kino</literal>, whose description contains <literal>video</literal> and whose maintainer's name contains <literal>paul</literal>:
de_de: Komplexere Suchen erfordern ein mächtigeres Werkzeug wie <command>aptitude</command>. <command>aptitude</command> erlaubt es Ihnen, nach logischen Ausdrücken, basierend auf den Metadatenfeldern der Pakete zu suchen. Beispielsweise sucht der folgende Befehl nach Paketen, deren Name <literal>kino</literal> enthält, deren Beschreibung <literal>video</literal> enthält und deren Betreuernamen <literal>paul</literal> enthält:
ja_jp: より複雑な検索を行うには、<command>aptitude</command> などのより強力なツールが必要です。<command>aptitude</command> を使うことで、パッケージのメタ情報フィールドを指定した論理演算表現を使って検索できます。例えば、以下のコマンドはパッケージ名に <literal>kino</literal> が含まれ、パッケージの説明文に<literal>ビデオ</literal>が含まれ、メンテナの名前に <literal>paul</literal> が含まれるパッケージを検索します。
pl_pl: Do bardziej złożonych wyszukiwań potrzebne jest potężniejsze narzędzie takie jak <command>aptitude</command>. <command>aptitude</command> pozwala na wyszukiwanie według wyrażeń logicznych bazujących na polach metadanych pakietu. Na przykład następująca komenda wyszukuje pakiety, których nazwy zawierają <literal>kino</literal>, opisy zawierają <literal>video</literal>, a imię opiekuna zawiera <literal>paul</literal>:
pt_br: Para buscas mais complexas, uma ferramenta mais poderosa como o <command>aptitude</command> é necessária. <command>aptitude</command> pode fazer uma busca de acordo com expressões lógicas baseadas em campos de metadados dos pacotes. Por exemplo, o seguinte comando busca por pacotes cujo nome contenha <literal>kino</literal>, cuja descrição contenha <literal>video</literal> e cujo nome do mantenedor contenha <literal>paul</literal>:
