Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: The Debian distribution is dynamic and changes continually. Most of the changes are in the <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> versions, but even <emphasis role="distribution">Stable</emphasis> is updated from time to time, mostly for security-related fixes. Whatever version of Debian a system runs, it is generally a good idea to keep it up to date, so that you can get the benefit of recent evolutions and bug fixes.
de_de: Die Debian Veröffentlichung ist dynamisch ständigen Änderungen unterworfen. Die meisten Änderungen werden in den <emphasis role="distribution">Testing</emphasis> und <emphasis role="distribution">Unstable</emphasis> Versionen vorgenommen, aber selbst <emphasis role="distribution">Stable</emphasis> wird ab und an aktualisiert, hauptsächlich handelt es sich dabei um sicherheitsrelevante Korrekturen. Egal, welche Debian-Version auf dem System läuft, es ist immer ratsam sie aktuell zu halten, um von den letzten Enwicklungen und Korrekturen zu profitieren.
ja_jp: Debian ディストリビューションは活動的で、絶えず変化しています。変更は<emphasis role="distribution">テスト版</emphasis>と<emphasis role="distribution">不安定版</emphasis>バージョンに対するものが多いですが、<emphasis role="distribution">安定版</emphasis>も多くの場合セキュリティ関連の修正によって時々更新されます。システムでどんな Debian のバージョンを使っていたとしても、システムを最新の状態に保つのが通常得策です。そうすれば、最新の進化とバグ修正の恩恵を受ける事が可能です。
pl_pl: Debian jest dynamiczną dystrybucją, która nieustannie się zmienia. Większość zmian zawiera się w <emphasis role="distribution">Testowym</emphasis> i <emphasis role="distribution">Niestabilnym</emphasis>, ale nawet <emphasis role="distribution">Stabilny</emphasis> jest od czasu do czasu aktualizowany, głównie w związku z poprawkami bezpieczeństwa. Niezależnie od wersji Debiana, pod którą działa system, przyjętą regułą jest utrzymywanie go w stanie zaktualizowanym tak, aby czerpać korzyści z najnowszych zmian i poprawek błędów.
pt_br: A distribuição Debian é dinâmica e muda continuamente. A maioria das mudanças ficam nas versões <emphasis role="distribution">Testing</emphasis> e <emphasis role="distribution">Unstable</emphasis>, mas mesmo a <emphasis role="distribution">Stable</emphasis> é atualizada de tempos em tempos, geralmente por algo relativo a segurança. Qualquer que seja a versão do Debian que o sistema rodar, é geralmente uma boa ideia mantê-la atualizada, de forma que você possa se beneficiar das recentes evoluções e consertos de bug.

source: While it is of course possible to periodically run a tool to check for available updates and run the upgrades, such a repetitive task is tedious, especially when it needs to be performed on several machines. Fortunately, like many repetitive tasks, it can be partly automated, and a set of tools have already been developed to that effect.
de_de: Natürlich ist es möglich, regelmäßig ein Programm auszuführen, das nach verfügbaren Aktualisierungen sucht und diese installiert. Allerdings ist eine solch wiederkehrende Aufgabe mühsam, speziell dann, wenn sie auf vielen Maschinen ausgeführt werden muss. Glücklicherweise lassen sich solch lästige Aufgaben teilweise automatisieren, eine Reihe von Werkzeugen dazu wurde bereits entwickelt.
ja_jp: 利用可能な更新を確認するために日常的にツールを実行することはもちろん可能ですが、特に複数のマシンでこれを行う必要がある場合、このような反復作業は面白くありません。幸いなことに、多くの反復作業と同様この作業もある程度自動化が可能で、効果的な一連のツールが開発されています。
pl_pl: Biorąc pod uwagę, że możliwe jest okresowe uruchamianie narzędzi do sprawdzania dostępnych aktualizacji i przeprowadzania uaktualnienia, takie powtarzalne zadanie jest uciążliwe, zwłaszcza w przypadku, gdy należy je wykonać na kilku maszynach. Na szczęście, podobnie do innych powtarzalnych zadań, może być częściowo zautomatyzowane, a w tym celu stworzono odpowiedni zestaw narzędzi.
pt_br: Mesmo que seja obviamente possível executar periodicamente uma ferramenta para verificar por atualizações disponíveis e executar as atualizações, tal tarefa repetitiva é tediosa, especialmente quando for feita em várias máquinas. Felizmente, assim como muitas tarefas repetitivas, ela pode ser parcialmente automatizada, e um conjunto de ferramentas já foi desenvolvido para isto.

source: The first of these tools is <command>apticron</command>, in the package of the same name. Its main effect is to run a script daily (via <command>cron</command>). The script updates the list of available packages, and, if some installed packages are not in the latest available version, it sends an email with a list of these packages along with the changes that have been made in the new versions. Obviously, this package mostly targets users of Debian <emphasis role="distribution">Stable</emphasis>, since the daily emails would be very long for the faster paced versions of Debian. When updates are available, <command>apticron</command> automatically downloads them. It does not install them — the administrator will still do it — but having the packages already downloaded and available locally (in APT's cache) makes the job faster.
ja_jp: 更新作業の自動化を担うツールの 1 つ目は <command>apticron</command> で、同名のパッケージに含まれます。主たる挙動は (<command>cron</command> を使って) 毎日スクリプトを実行する事です。スクリプトは利用可能なパッケージのリストを更新し、インストール済みパッケージが入手できる最新バージョンと異なる場合、そのようなパッケージのリストと新しいバージョンにおける修正点をメールで送信します。明らかにこの挙動は、Debian <emphasis role="distribution">安定版</emphasis>のユーザを対象にしています。なぜなら、より頻繁にパッケージが更新される Debian の他のディストリビューションでは毎日のメールがとても長くなるからです。更新が利用可能になったら、<command>apticron</command> は自動的にそれらをダウンロードします。<command>apticron</command> はインストール作業を行いません - 管理者がインストールします - が、パッケージをダウンロードして手元 (APT のキャッシュ) に保存しておくことで、管理者は作業を迅速に行う事が可能です。
pl_pl: Pierwszym ze wspomnianych narzędzi jest <command>apticron</command>, z pakietu o tej samej nazwie. Jego głównym działaniem jest codzienne uruchamianie skryptu (poprzez <command>cron</command>). Skrypt ten aktualizuje listę dostępnych pakietów i jeżeli któreś z zainstalowanych pakietów nie są w najnowszej wersji, wysyła wiadomość e-mail z listą tych pakietów oraz zmianami wprowadzonymi w ich nowych wersjach. Oczywiście pakiet ten jest kierowany głównie do użytkowników Debiana <emphasis role="distribution">Stabilnego</emphasis>, ponieważ dla szybciej postępujących wersji Debiana codzienne e-maile byłyby bardzo długie. Kiedy sa dostępne aktualizacje, <command>apticron</command> pobiera je automatycznie. Nie instaluje ich — zadanie to nadal pozostaje dla administratora — ale posiadanie pobranych pakietów dostępnych lokalnie (w pamięci podręcznej APTa) przyspiesza pracę.

source: Administrators in charge of several computers will no doubt appreciate being informed of pending upgrades, but the upgrades themselves are still as tedious as they used to be, which is where the <filename>/etc/cron.daily/apt</filename> script (in the <emphasis role="pkg">apt</emphasis> package) comes in handy. This script is also run daily (and non-interactively) by <command>cron</command>. To control its behavior, use APT configuration variables (which are therefore stored in a file under <filename>/etc/apt/apt.conf.d/</filename>). The main variables are:
ja_jp: コンピュータを複数担当する管理者が、保留中のアップグレードを通知されることの重要性を理解しているのは間違いありませんが、システムのアップグレードは相変わらずまだ退屈なものです。この状況では <filename>/etc/cron.daily/apt</filename> スクリプト (<emphasis role="pkg">apt</emphasis> パッケージに含まれる) が役に立ちます。このスクリプトは <command>cron</command> によって毎日 (非対話的に) 実行されます。スクリプトの挙動を制御するために、APT 設定変数を使います (このため変数は <filename>/etc/apt/apt.conf.d/</filename> に含まれるファイル内にします)。以下に主な変数を示します:
pl_pl: Administratorzy mający pod opieką kilka komputerów z pewnością docenią informacje o oczekujących uaktualnieniach, ale same uaktualnienia nadal są tak samo uciążliwe, jak były wcześniej, dlatego z pomocą przychodzi skrypt <filename>/etc/cron.daily/apt</filename> (z pakietu <emphasis role="pkg">apt</emphasis>). Skrypt ten również uruchamiany jest codziennie (bez trybu interaktywnego) przez <command>cron</command>. W celu kontroli jego zachowania można użyć zmiennych konfiguracyjnych APTa (zapisanych w pliku, w katalogu <filename>/etc/apt/apt.conf.d/</filename>). Głównymi zmiennymi są:

source: This option allows you to specify the frequency (in days) at which the package lists are refreshed. <command>apticron</command> users can do without this variable, since <command>apticron</command> already does this task.
de_de: Diese Option erlaubt es Ihnen, die Frequenz (in Tagen) festzulegen mit der die Paketlisten aktualisiert werden. Anwender von <command>apticron</command> benötigen diese Variable nicht, da <command>apticron</command> diese Aufgabe selbst übernimmt.
ja_jp: このオプションを使えば、パッケージリストを更新する頻度 (日単位) を設定する事が可能です。<command>apticron</command> ユーザならこの変数を設定しなくても大丈夫です。なぜなら <command>apticron</command> が設定するからです。
pl_pl: Ta opcja pozwala ustawić częstotliwość (w dniach) odświeżania listy pakietów. Użytkownicy <command>apticron</command> mogą pominąć tą zmienną, ponieważ <command>apticron</command> sam ustawia to zadanie.
pt_br: Esta opção especifica a frequência (em dias) na qual a lista de pacotes é atualizada. Usuários do <command>apticron</command> podem seguir sem esta variável, já que o <command>apticron</command> já faz esta tarefa.

source: Again, this option indicates a frequency (in days), this time for the downloading of the actual packages. Again, <command>apticron</command> users won't need it.
de_de: Auch diese Option legt die Frequenz (in Tagen) fest, diesmal für das Herunterladen der Pakete. Und wieder benötigen Anwender von <command>apticron</command> sie nicht.
ja_jp: このオプションを使えば、パッケージをダウンロードする頻度 (日単位) を設定する事が可能です。<command>apticron</command> ユーザはこの変数を設定する必要はありません。
pl_pl: Podobnie, ta opcja wskazuje częstotliwość (w dniach), ale tym razem pobierania pakietów. Znowu, użytkownicy <command>apticron</command> nie będą jej potrzebować.
pt_br: De novo, esta opção indica uma frequência (em dias), agora para o download dos pacotes em si. Novamente, os usuários do <command>apticron</command> não precisam disto.

source: This option covers a feature that <command>apticron</command> doesn't have. It controls how often obsolete packages (those not referenced by any distribution anymore) are removed from the APT cache. This keeps the APT cache at a reasonable size and means that you don't need to worry about that task.
ja_jp: このオプションは <command>apticron</command> が備えていない機能を担うものです。これはどの程度の頻度で時代遅れのパッケージ (他のどのディストリビューションからも参照されていないパッケージ)を APT キャッシュから削除するかを制御します。APT キャッシュを合理的なサイズに保ち、この作業について心配する必要がなくなります。
pl_pl: Ta opcja udostępnia funkcję, której nie ma <command>apticron</command>. Kontroluje, jak często przestarzałe pakiety (te, do których nie odwołuje się już żadna dystrybucja) są usuwane z pamięci podręcznej APTa. Pozwala to utrzymać rozsądny rozmiar pamięci podręcznej APTa, dzięki czemu nie trzeba się już przejmować ręcznym wykonywaniem tego zadania.

source: When this option is enabled, the daily script will execute <command>unattended-upgrade</command> (from the <emphasis role="pkg">unattended-upgrades</emphasis> package) which — as its name suggest — can automatize the upgrade process for some packages (by default it only takes care of security updates, but this can be customized in <filename>/etc/apt/apt.conf.d/50unattended-upgrades</filename>). Note that this option can be set with the help of debconf by running <command>dpkg-reconfigure -plow unattended-upgrades</command>.
ja_jp: このオプションが有効化されると、毎日のスクリプトで <command>unattended-upgrade</command> (<emphasis role="pkg">unattended-upgrades</emphasis> パッケージの提供する) が実行さるようになります。これは - その名前が示す通り - 幾つかのパッケージのアップグレード作業を自動化します (デフォルトでは、セキュリティ更新だけを処理しますが <filename>/etc/apt/apt.conf.d/50unattended-upgrades</filename> で挙動をカスタマイズできます)。このオプションを設定するには <command>dpkg-reconfigure -plow unattended-upgrades</command> を実行して debconf の助けを借りることに注意してください。
pl_pl: Kiedy włączona jest ta opcja, codzienny skrypt będzie uruchamiał <command>unattended-upgrade</command> (z pakietu <emphasis role="pkg">unattended-upgrades</emphasis>), który — jak sama nazwa wskazuje — może zautomatyzować uaktualnianie niektórych pakietów (domyślnie zajmuje się tylko aktualizacjami bezpieczeństwa, ale można to dostosować w <filename>/etc/apt/apt.conf.d/50unattended-upgrades</filename>). Należy zauważyć, ze ta opcja może być ustawiona przy pomocy debconfa po uruchomieniu <command>dpkg-reconfigure -plow unattended-upgrades</command>.

source: Other options can allow you to control the cache cleaning behavior with more precision. They are not listed here, but they are described in the <filename>/etc/cron.daily/apt</filename> script.
de_de: Andere Optionen gestatten es Ihnen, das Aufräumen des Zwischenspeichers gezielter zu steuern. Diese Optionen werden hier nicht aufgeführt, werden aber im Skript <filename>/etc/cron.daily/apt</filename> beschrieben.
ja_jp: これ以外のオプションを使うことで、更に精密なキャッシュ消去挙動を制御できます。それらのオプションをここに載せることはしませんが、詳しい説明は <filename>/etc/cron.daily/apt</filename> スクリプトを参照してください。
pl_pl: Inne opcje pozwalają bardziej precyzyjnie kontrolować czyszczenie pamięci podręcznej. Chociaż nie są tutaj wymienione, to są opisane w skrypcie <filename>/etc/cron.daily/apt</filename>.
pt_br: Outras opções podem deixar você controlar o comportamento de limpeza de cache com mais presicão. Elas não são listadas aqui, mas são descritas no script <filename>/etc/cron.daily/apt</filename>.

source: These tools work very well for servers, but desktop users generally prefer a more interactive system. That is why the “Graphical desktop environment” task installs <emphasis role="pkg">gnome-packagekit</emphasis>. It provides an icon in the notification area of desktop environments when updates are available; clicking on this icon then runs <command>gpk-update-viewer</command>, a simplified interface to perform updates. You can browse through available updates, read the short description of the relevant packages and the corresponding <filename>changelog</filename> entries, and select whether to apply the update or not on a case-by-case basis.
ja_jp: サーバではこれらのツールがとても上手く動きますが、通常デスクトップユーザはより対話型なシステムを好みます。このため「グラフィカルデスクトップ環境」タスクは <emphasis role="pkg">gnome-packagekit</emphasis> をインストールします。このパッケージは、更新が利用可能になった時、デスクトップ環境の通知エリアにアイコンを表示します; 表示されたアイコンをクリックすると <command>gpk-update-viewer</command> が実行されます。これは更新を実行する簡易化されたインターフェースです。利用可能な更新を閲覧したり、関連するパッケージと対応する <filename>changelog</filename> エントリの短い説明を読んだり、個々の場合に応じてその更新を適用するか否かを選択したりする事ができます。
pl_pl: Wspomniane narzędzia sprawdzają się bardzo dobrze w przypadku serwerów, ale użytkownicy domowi częściej wybierają bardziej interaktywny system. Z tego powodu zadanie "Graphical desktop environment" instaluje <emphasis role="pkg">gnome-packagekit</emphasis>. Pokazuje on ikonę, w obszarze powiadomień środowisk graficznych, kiedy są dostępne aktualizacje; kliknięcie tej ikony uruchamia <command>gpk-update-viewer</command>, uproszczony interfejs do wykonywania aktualizacji. Można przeglądać dostępne aktualizacje, czytać krótkie opisy powiązanych pakietów i odpowiadające wpisy <filename>changelog</filename>, a następnie po kolei zaznaczać, czy zastosować aktualizację, czy nie.

source: Upgrading with <command>gpk-update-viewer</command>
ja_jp: <command>gpk-update-viewer</command> を使ったアップグレード
pl_pl: Uaktualnianie z użyciem <command>gpk-update-viewer</command>

source: Automatic Upgrades
de_de: Automatische Aktualisierungen
ja_jp: 自動アップグレード
pl_pl: Automatyczne Uaktualnienia
pt_br: Atualizações Automáticas

source: <primary>upgrade</primary><secondary>automatic system upgrade</secondary>
ja_jp: <primary>アップグレード</primary><secondary>自動的なシステムアップグレード</secondary>

source: <primary>automatic upgrade</primary>
ja_jp: <primary>自動アップグレード</primary>

source: Since Falcot Corp has many computers but only limited manpower, its administrators try to make upgrades as automatic as possible. The programs in charge of these processes must therefore run with no human intervention.
de_de: Da Falcot Corp über viele Rechner aber nur über wenig IT-Personal verfügt, versuchen die Administratoren alles so weit wie möglich zu automatisieren. Die für diese Prozesse verantwortlichen Programme müssen deshalb ohne Benutzereingriffe ablaufen.
ja_jp: Falcot Corp は多くのコンピュータを持っており、人手が足りないので、管理者は可能な限り自動でアップグレードするように努力します。アップグレード作業を担当するプログラムは人間の介在が無くても実行されなければいけません。
pl_pl: W związku z tym, że Falcot Corp posiada wiele komputerów, ale ograniczoną siłę roboczą, jego administratorzy starają się jak najbardziej zautomatyzować proces uaktualniania. Dlatego programy zarządzające tym procesem powinny działać bez interwencji człowieka.
pt_br: Como a Falcot Corp tem muitos computadores mas pouca mão de obra, seus administradores tentam tornar as atualizações o mais automáticas possível. Os programas encarregados destes processos devem portanto rodar sem intervenção humana.

source: Configuring <command>dpkg</command>
de_de: <command>dpkg</command> konfigurieren
ja_jp: <command>dpkg</command> の設定
pl_pl: Konfigurowanie <command>dpkg</command>
pt_br: Configurando <command>dpkg</command>

source: As we have already mentioned (see sidebar <xref linkend="sidebar.questions-conffiles" />), <command>dpkg</command> can be instructed not to ask for confirmation when replacing a configuration file (with the <literal>--force-confdef --force-confold</literal> options). Interactions can, however, have three other sources: some come from APT itself, some are handled by <command>debconf</command>, and some happen on the command line due to package configuration scripts.
ja_jp: 既に言及したとおり (傍注<xref linkend="sidebar.questions-conffiles" />参照)、<command>dpkg</command> を設定ファイルの交換時に確認を行わないように設定できます (<literal>--force-confdef --force-confold</literal> オプションを使います)。しかしながら、人間が入力する必要が生じる状況は 3 つ考えられます: APT 自身への入力、<command>debconf</command> が出す入力、パッケージ設定スクリプトのせいでコマンドラインから行われる入力です。
pl_pl: Jak już zostało wspomniane (spójrz na fiszkę <xref linkend="sidebar.questions-conffiles" />), <command>dpkg</command> może zostać poinstruowany, aby pytać o potwierdzenie w przypadku zastępowania plików konfiguracyjnych (z opcjami <literal>--force-confdef --force-confold</literal>). Jednakże interakcje mogą mieć trzy inne źródła: jedne pochodzą z samego APTa, inne są obsługiwane przez <command>debconf</command>, a niektóre występują w linii komend w powiązaniu do skryptów konfiguracyjnych pakietu.

source: Configuring APT
de_de: APT konfigurieren
ja_jp: APT の設定
pl_pl: Konfigurowanie APTa
pt_br: Configurando APT

source: The case of APT is simple: the <literal>-y</literal> option (or <literal>--assume-yes</literal>) tells APT to consider the answer to all its questions to be “yes”.
de_de: Im Falle von APT ist es einfach: die <literal>-y</literal> Option (oder <literal>--assume-yes</literal>) weist APT an, "yes" als Antwort auf alle Rückfragen anzunehmen.
ja_jp: APT の場合は簡単です: <literal>-y</literal> オプション (または <literal>--assume-yes</literal>) を使えば、APT の出すすべての質問に「yes」と答えたことになります。
pl_pl: W przypadku APTa sprawa jest prosta: opcja <literal>-y</literal> (lub <literal>--assume-yes</literal>) mówi programowi, aby na wszystkie odpowiedzi odpowiadał "tak".
pt_br: No caso do APT é simples: a opção <literal>-y</literal> (ou <literal>--assume-yes</literal>) diz ao APT para considerar a resposta a todas as perguntas como sendo “sim”.

source: Configuring <command>debconf</command>
de_de: <command>debconf</command> konfigurieren
ja_jp: <command>debconf</command> の設定
pl_pl: Konfigurowanie <command>debconf</command>
pt_br: Configurando <command>debconf</command>

source: The case of <command>debconf</command> deserves more details. This program was, from its inception, designed to control the relevance and volume of questions displayed to the user, as well as the way they are shown. That is why its configuration requests a minimal priority for questions; only questions above the minimal priority are displayed. <command>debconf</command> assumes the default answer (defined by the package maintainer) for questions which it decided to skip.
de_de: Für <command>debconf</command> Bedarf es mehr Details. Das Programm war von Beginn an ausgelegt, die Relevanz und die Menge der Rückfragen an den Anwender sowie die Art, wie sie ihm präsentiert werden, zu kontrollieren. Aus diesem Grund fordert seine Konfiguration minimale Priorität für Rückfragen, nur Fragen oberhalb der minimalen Priorität werden eingeblendet. Für Rückfragen, die übersprungen werden, nimmt <command>debconf</command> die (vom Paketbetreuer festgelegte) Standardantwort an.
ja_jp: <command>debconf</command> の場合はより詳細に説明が必要です。設計当初から、このプログラムは関連性とユーザに表示される大量の質問および質問の表示方法を制御するように設計されました。そのため、debconf は質問に最小の優先度を設定するよう要求します; 最小の優先度を超える優先度を設定された質問だけが表示されます。<command>debconf</command> はユーザが回答しなかった質問は、(パッケージメンテナが定義した) デフォルトと同じように回答されたと仮定します。
pl_pl: Omówienie przypadku <command>debconf</command> zasługuje na więcej uwagi. Od początku istnienia tego programu, był on projektowany do kontroli trafności i ilości pytań wyświetlanych użytkownikowi oraz sposobu w jaki są pokazywane. Z tego powodu jego konfiguracja wymaga nadania minimalnego priorytetu dla pytań; tylko pytania powyżej minimalnego priorytetu są wyświetlane. <command>debconf</command> zakłada domyślną odpowiedź (zdefiniowaną przez opiekuna pakietu) dla pytań, które zdecydował pominąć.
pt_br: o caso do <command>debconf</command> merece mais detalhes. Este programa foi, desde sua concepção, projetado para controlar a relevância e a quantidade das perguntas mostradas ao usuário, assim como a forma como são exibidas. É por isto que sua configuração requer uma prioridade mínima para perguntas; apenas perguntas acima da prioridade mínima são exibidas. O <command>debconf</command> supõe a resposta padrão (definida pelo mantenedor do pacote) para perguntas que ele decidiu pular.

source: The other relevant configuration element is the interface used by the front-end. If you choose <literal>noninteractive</literal> out of the choices, all user interaction is disabled. If a package tries to display an informative note, it will be sent to the administrator by email.
de_de: Das andere relevante Konfigurationselement ist die von der Benutzeroberfläche genutzte Schnittstelle. Wenn Sie <literal>noninteractive</literal> auswählen, wird jede Benutzerinteraktion unterbunden. Versucht ein Paket, eine Information einzublenden, wird diese per E-Mail an den Administrator gesendet.
ja_jp: 他の関連設定項目はフロントエンドが使うインターフェースです。中でも <literal>noninteractive</literal> を選んだら、ユーザからの入力は完全に使用不能にされます。パッケージが有益な注意を表示しようとした場合、管理者にメールで通知されます。
pl_pl: Kolejnym znaczącym elementem konfiguracji jest sposób komunikacji używany przez interfejs. Jeżeli zostanie wybrany <literal>noninteractive</literal>, to wszystkie interakcje z użytkownikiem zostaną wyłączone. W przypadku, gdy pakiet będzie próbował wyświetlić informację, zostanie ona wysłana do administratora w wiadomości e-mail.
pt_br: O outro elemento de configuração relevante é a interface usada pelo front-end. Se você escolher <literal>noninteractive</literal>, toda interface de usuário será desabilitada. Se um pacote tenta exibir uma nota informativa, ele vai ser enviado ao administrador via email.
