Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: A <filename>.gz</filename> extension refers to a file compressed with the <command>gzip</command> utility. <command>gzip</command> is the fast and efficient traditional Unix utility to compress files. Newer tools achieve better rates of compression but require more calculation time to compress a file. Among them, and by order of appearance, there are <command>bzip2</command> (generating files with a <filename>.bz2</filename> extension), <command>lzma</command> (generating <filename>.lzma</filename> files) and <command>xz</command> (generating <filename>.xz</filename> files).
de_de: Die Endung <filename>.gz</filename> kennzeichnet eine Datei, die mit dem Dienstprogramm <command>gzip</command> komprimiert wurde. <command>gzip</command> ist ein schnelles und effizientes traditionelles Unix-Dienstprogramm zum Komprimieren von Dateien. Neuere Werkzeuge erreichen bessere Komprimierungsraten, benötigen aber mehr Rechenzeit, um eine Datei zu komprimieren. In der Reihenfolge ihres Auftretens gibt es hierbei <command>bzip2</command> (erzeugt Dateien mit der Endung <filename>.bz2 </filename>) <command>lzma</command> (erzeugt <filename>.lzma</filename> Dateien) und <command>xz</command> (erzeugt <filename>.xz</filename> Dateien).
pt_br: Uma extensão <filename>.gz</filename> se refere a um arquivo comprimido com o utilitário <command>gzip</command>. <command>gzip</command> é o utilitário tradicional do Unix rápido e eficiente para comprimir arquivos. Ferramentas mais novas conseguem taxas de compressão melhores mas precisam de mais tempo de cálculo para comprimir um arquivo. Entre elas e por ordem de surgimento, estão <command>bzip2</command> (gerando arquivos com a extensão <filename>.bz2</filename>), <command>lzma</command> (gerando arquivos <filename>.lzma</filename>) e <command>xz</command> (gerando arquivos <filename>.xz</filename>).

source: <primary>source of packages</primary>
de_de: <primary>Paketquelle</primary>
pt_br: <primary>origem dos pacotes</primary>

source: The second field gives the base URL of the source (combined with the filenames present in the <filename>Packages.gz</filename> files, it must give a full and valid URL): this can consist in a Debian mirror or in any other package archive set up by a third party. The URL can start with <literal>file://</literal> to indicate a local source installed in the system's file hierarchy, with <literal>http://</literal> to indicate a source accessible from a web server, or with <literal>ftp://</literal> for a source available on an FTP server. The URL can also start with <literal>cdrom://</literal> for CD-ROM based installations, although this is less frequent, since network-based installation methods are more and more common.
de_de: Das zweite Feld gibt den Basis-URL der Quelle an (kombiniert mit den Dateinamen in den Dateien namens <filename>Packages.gz</filename> müssen sich vollständige und gültige URLs ergeben): Diese Quelle kann aus einem Debian-Spiegelserver bestehen oder einer Paketsammlung, die von dritter Seite aufgesetzt wurde. Der URL kann mit <literal>file://</literal> beginnen, um eine Quelle anzugeben, die sich im lokalen Verzeichnisbaum des Systems befindet, mit <literal>http://</literal>, um eine Quelle anzugeben, die auf einem Webserver zugreifbar ist, oder mit <literal>ftp://</literal> für eine auf einem FTP-Server verfügbare Quelle. Der URL kann auch mit <literal>cdrom://</literal> beginnen, bei einer CD-ROM-basierten Installation, allerdings wird dies seltener, da netzbasierte Installationsmethoden mehr und mehr die Regel werden.
pt_br: O segundo campo dá a URL base da origem (combinado com os nomes de arquivo presentes nos arquivos <filename>Packages.gz</filename>, deve dar uma URL completa e válida): isto pode consistir no mirror Debian ou em qualquer outro archive de pacote configurado por terceiros. A URL pode começar com <literal>file://</literal> para indicar uma origem local instalada na hierarquia de arquivos do sistema, com <literal>http://</literal> para indicar uma origem acessível via um servidor web, ou com <literal>ftp://</literal> para uma origem disponível num servidor FTP. A URL pode começar com <literal>cdrom://</literal> para instalações baseadas em CD-ROM, embora isto seja menos frequente, já que métodos baseados em rede estão cada vez mas comuns.

source: The syntax of the last field depends on whether the source corresponds to a Debian mirror or not. In the case of a Debian mirror, name the chosen distribution (<literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal> or their current code names — see the list in sidebar <xref linkend="cadre.bruce-perens" />), then the sections to enable (chosen between <literal>main</literal>, <literal>contrib</literal>, and <literal>non-free</literal>). In all other cases, simply indicate the subdirectory of the desired source (this is often a simple “<filename>./</filename>” which refers to the absence of a subdirectory — the packages are then directly at the specified URL).
de_de: Die Syntax des letzten Feldes hängt davon ab, ob die Quelle zu einem Debian-Spiegelserver gehört oder nicht. Im Falle eines Debian-Spiegels wird die gewählte Distribution benannt (<literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal> oder ihre aktuellen Codenamen – siehe die Liste in der Seitenleiste <xref linkend="cadre.bruce-perens" />), dann die zu aktivierenden Abschnitte (Auswahl zwischen den Bereichen <literal>main</literal>, <literal>contrib</literal> und <literal>non-free</literal>. In allen anderen Fällen wird einfach das Unterverzeichnis der gewünschten Quelle angegeben (dies ist oft ein einfaches „<filename>./</filename>“, welches das Fehlen eines Unterverzeichnisses kennzeichnet – dann liegen die Pakete direkt am angegebenen URL).
pt_br: A sintaxe do último campo depende da origem corresponder a um espelho Debian ou não. No caso de ser um espelho Debian, coloque o nome da distribuição escolhida (<literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal> ou seus codinomes atuais — veja a lista na barra lateral <xref linkend="cadre.bruce-perens" />), então as seções para habilitar (escolhidas entre <literal>main</literal>, <literal>contrib</literal> e <literal>non-free</literal>). Em todos ou outros casos, simplesmente indicar o subdiretório da origem desejada (Geralmente é um simples “<filename>./</filename>” que se refere à ausência de um subdiretório — os pacotes ficam então diretamente na URL especificada).

source: <emphasis>VOCABULARY</emphasis> The <foreignphrase>main</foreignphrase>, <foreignphrase>contrib</foreignphrase> and <foreignphrase>non-free</foreignphrase> archives
de_de: <emphasis>WÖRTERVERZEICHNIS</emphasis> Die <foreignphrase>main</foreignphrase>, <foreignphrase>contrib</foreignphrase> und <foreignphrase>non-free</foreignphrase> Archive
pt_br: <emphasis>VOCABULÁrio</emphasis> Os arquivos <foreignphrase>main</foreignphrase>, <foreignphrase>contrib</foreignphrase> e <foreignphrase>non-free</foreignphrase>

source: <primary>section</primary><secondary><foreignphrase>main</foreignphrase></secondary>
de_de: <primary>Bereich</primary><secondary><foreignphrase>main</foreignphrase></secondary>
pt_br: <primary>seção</primary><secondary><foreignphrase>main</foreignphrase></secondary>

source: <primary><foreignphrase>main</foreignphrase>, section</primary>
de_de: <primary><foreignphrase>main</foreignphrase>, Bereich</primary>
pt_br: <primary><foreignphrase>main</foreignphrase>, seção</primary>

source: <primary>section</primary><secondary><foreignphrase>contrib</foreignphrase></secondary>
de_de: <primary>Bereich</primary><secondary><foreignphrase>contrib</foreignphrase></secondary>
pt_br: <primary>seção</primary><secondary><foreignphrase>contrib</foreignphrase></secondary>

source: <primary><foreignphrase>contrib</foreignphrase>, section</primary>
de_de: <primary><foreignphrase>contrib</foreignphrase>, Bereich</primary>
pt_br: <primary><foreignphrase>contrib</foreignphrase>, seção</primary>

source: <primary>section</primary><secondary><foreignphrase>non-free</foreignphrase></secondary>
de_de: <primary>Bereich</primary><secondary><foreignphrase>non-free</foreignphrase></secondary>
pt_br: <primary>seção</primary><secondary><foreignphrase>non-free</foreignphrase></secondary>

source: <primary><foreignphrase>non-free</foreignphrase>, section</primary>
de_de: <primary><foreignphrase>non-free</foreignphrase>, Bereich</primary>
pt_br: <primary><foreignphrase>non-free</foreignphrase>, seção</primary>

source: Debian uses three sections to differentiate packages according to the licenses chosen by the authors of each work. <foreignphrase>Main</foreignphrase> (the main archive) gathers all packages which fully comply with the Debian Free Software Guidelines.
de_de: Das Debian-Archiv ist in drei Bereiche unterteilt. Die Unterscheidung basiert auf der vom Autor für sein Werk gewählten Lizenz. <foreignphrase>Main</foreignphrase> (das Main-Archiv) enthält alle Pakete, die den Anforderungen der Debian-Richtlinien für Freie Software vollständig genügen.
pt_br: O Debian utiliza três seções para diferenciar os pacotes de acordo com o tipo de licença escolhida pelos autores de cada trabalho. <foreignphrase>Main</foreignphrase> (o arquivo principal) contém todos os pacotes que estão completamente de acordo com o Debian Free Software Guilines.

source: The <foreignphrase>non-free</foreignphrase> archive is different because it contains software which does not (entirely) conform to these principles but which can nevertheless be distributed without restrictions. This archive, which is not officially part of Debian, is a service for users who could need some of those programs — however Debian always recommends giving priority to free software. The existence of this section represents a considerable problem for Richard M. Stallman and keeps the Free Software Foundation from recommending Debian to users.
de_de: Das <foreignphrase>non-free</foreignphrase> Archiv ist anders, da es Software umfasst, die diesen Richtlinien (nicht vollständig) entspricht, aber trotzdem ohne Einschränkungen verteilt werden darf. Dieses Archiv ist kein offizieller Bestandteil von Debian sondern ein Service für Anwender, die einige dieser Programme brauchen – allerdings empfiehlt Debian, freier Software immer den Vorzug zu geben. Die Existenz dieses Bereiches stellt ein beträchtliches Problem für Richard M. Stallman dar und hält die Free Software Foundation davon ab, Debian zu empfehlen.
pt_br: O arquivo <foreignphrase>non-free</foreignphrase> é diferente porque contém programas os quais não estão (completamente) confirmo estes princípios mas os quais que mesmo assim podem ser distribuídos sem restrições. Este arquivo, o qual não é parte oficial do Debian, é um serviço para os usuários que poderiam precisar de alguns desses programas - entretanto o Debian sempre recomenda dar prioridade as programas livres. A existência dessa seção representa um problemas considerável para Richard M. Stallman e mantém a Free Software Foundation de recomendar o Debian para os usuários.

source: <foreignphrase>Contrib</foreignphrase> (contributions) is a stock of open source software which cannot function without some non-free elements. These elements can be software from the <foreignphrase>non-free</foreignphrase> section, or non-free files such as game ROMs, BIOS of consoles, etc. <foreignphrase>Contrib</foreignphrase> also includes free software whose compilation requires proprietary elements. This was initially the case for the OpenOffice.org office suite, which used to require a proprietary Java environment.
de_de: <foreignphrase>Contrib</foreignphrase> (contributions) ist eine Sammlung von quelloffener Software, die für ihre Funktion auf nicht-freie Elemente angewiesen ist. Dabei kann es sich um Software aus dem <foreignphrase>non-free</foreignphrase> Bereich handeln, oder um nicht-freie Daten wie Spiele-ROMs, BIOS von Spielkonsolen usw. <foreignphrase>Contrib</foreignphrase> enthält auch freie Software, die proprietäre Bestandteile zur Übersetzung benötigt. Dies war anfänglich bei der OpenOffice.org Büro-Suite der Fall, die eine proprietäre Java Umgebung benötigte.
pt_br: <foreignphrase>Contrib</foreignphrase> (contribuições) é um estoque de programas de código aberto que não podem funcionar sem um elemento não livre. Estes elementos podem ser programas da seção <foreignphrase>non-free</foreignphrase>, ou arquivos não livres como as ROMs de jogos, BIOS de consoles, etc. <foreignphrase>Contrib</foreignphrase> também incluí programas livres que a compilação necessita de elementos proprietários. Este foi inicialmente o caso da suíte de escritório OpenOffice.org, o qual necessitava um ambiente java proprietário.

source: Generally, the contents of a standard <filename>sources.list</filename> file can be the following:
de_de: Im Allgemeinen kann der Inhalt einer standardmäßigen <filename>sources.list</filename>-Datei Folgendes sein:
pt_br: Geralmente, o conteúdo padrão do arquivo <filename>sources.list</filename> pode ser o seguinte:

source: <filename>/etc/apt/sources.list</filename> file
de_de: <filename>/etc/apt/sources.list</filename> Datei
pt_br: <filename>/etc/apt/sources.list</filename> arquivo

source: # Security updates deb http://security.debian.org/ stable/updates main contrib non-free deb-src http://security.debian.org/ stable/updates main contrib non-free # Debian mirror deb http://ftp.debian.org/debian stable main contrib non-free deb-src http://ftp.debian.org/debian stable main contrib non-free
pt_br: # Atualizações de Segurança deb http://security.debian.org/ stable/updates main contrib non-free deb-src http://security.debian.org/ stable/updates main contrib non-free # Espelho Debian deb http://ftp.debian.org/debian stable main contrib non-free deb-src http://ftp.debian.org/debian stable main contrib non-free

source: This file lists all sources of packages associated with the stable version of Debian. If you would like to use <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>, you will of course have to add (or replace them with) the appropriate lines. When the desired version of a package is available on several mirrors, the first one listed in the <filename>sources.list</filename> file will be used. For this reason, non-official sources are usually added at the end of the file.
de_de: Diese Datei listet alle Paketquellen, die zur stabilen Debian-Version gehören. Falls Sie <emphasis role="distribution">Testing</emphasis> oder <emphasis role="distribution">Unstable</emphasis> verwenden möchten, müssen Sie natürlich die passenden Zeilen hinzufügen (oder die bestehenden ersetzen). Wenn die gewünschte Version eines Paketes in mehreren Paketquellen verfügbar ist, wird die Quelle benutzt, die als erstes in der Datei <filename>sources.list</filename> aufgeführt ist. Aus diesem Grunde werden inoffizielle Quellen für gewöhnlich am Ende der Datei hinzugefügt.
pt_br: Este arquivo lista todas as fontes de pacotes associadas com a versão estável do Debian. Se você gosta de usar a <emphasis role="distribution">Testing</emphasis> ou a <emphasis role="distribution">Unstable</emphasis>, você terá, obviamente, que adicionar (ou substituir) as linhas apropriadas. Quando a versão desejada de um pacote estiver disponível em vários espelhos, o primeiro listado no arquivo <filename>sources.list</filename> será usado. Por isto, fontes de pacotes não oficiais são normalmente adicionadas no final do arquivo.

source: If many package sources are referenced, it can be useful to split them in multiple files. Each part is then stored in <filename>/etc/apt/sources.list.d/<replaceable>filename</replaceable>.list</filename> (see sidebar <xref linkend="cadre-repertoire.d" />).
de_de: Falls viele Paketquellen benannt werden, kann es nützlich sein, diese in mehrere Dateien aufzuteilen. Jeder Teil wird dann in <filename>/etc/apt/sources.list.d/<replaceable>Dateiname</replaceable>.list</filename> gespeichert (siehe die Seitenleiste <xref linkend="cadre-repertoire.d" />).
pt_br: Se muitas fontes de pacotes são referenciadas, pode ser útil separá-las em múltiplos arquivos. Cada parte é então guardada em <filename>/etc/apt/sources.list.d/<replaceable>nome-de-arquivo</replaceable>.list</filename> (veja a barra lateral <xref linkend="cadre-repertoire.d" />).

source: The <filename>sources.list</filename> file contains several other entry types: some describe the Debian CD-ROMs you have. Contrary to other entries, a CD-ROM is not always available since it has to be inserted into the drive and since only one disc can be read at a time — consequently, these sources are managed in a slightly different way. These entries need to be added with the <command>apt-cdrom</command> program, usually executed with the <literal>add</literal> parameter. The latter will then request the disc to be inserted in the drive and will browse its contents looking for <filename>Packages</filename> files. It will use these files to update its database of available packages (this is usually done by the <command>aptitude update</command> command). From then on, APT can require the disc to be inserted if it needs one of its packages.
de_de: Die Datei <filename>sources.list</filename> enthält verschiedene andere Eintragstypen: Einige beschreiben Ihre Debian-CD-ROMs. Im Gegensatz zu anderen Einträgen ist eine CD-ROM nicht immer verfügbar, da sie im Laufwerk eingelegt sein muss. Außerdem kann immer nur eine CD-ROM zum gleichen Zeitpunkt gelesen werden – demzufolge werden diese Quellen ein kleines bisschen anders gehandhabt. Diese Einträge müssen mit dem Programm <command>apt-cdrom</command> hinzugefügt werden, üblicherweise ausgeführt mit dem Parameter <literal>add</literal>. Letzterer fordert Sie dann auf, die CD-ROM in das Laufwerk einzulegen, um dann deren Inhalt nach <filename>Packages</filename>-Dateien zu durchsuchen. DasProgramm nutzt diese Dateien, um die Datenbank verfügbarer Pakete zu aktualisieren (dies geschieht für gewöhnlich mit dem Befehl <command>aptitude update</command>). Von diesem Moment an kann APT auffordern, die CD-ROM einzulegen, falls es eines ihrer Pakete benötigt.
pt_br: O arquivo <filename>sources.list</filename> contém vários outros tipos de entradas: alguns descrevem os CD-ROMs do Debian que você tem. Ao contrário de outras entradas, um CD-ROM não está sempre disponível já que ele tem que ser inserido no drive e só pode ser lido um disco por vez — consequentemente, estas fontes são geridas de uma forma levemente diferente. Estas entradas precisam ser adicionadas com o programa <command>apt-cdrom</command>, normalmente executado com o parâmetro <literal>add</literal>. Este então vai precisar que o disco seja inserido no drive e vai navegar pelo disco em busca de arquivos <filename>Packages</filename>. Ele vai utilizar estes arquivos para atualizar seu banco de dados de arquivos disponíveis (isto é normalmente feito pelo comando <command>aptitude update</command>). A partir daí, o APT pode pedir que o disco seja inserido se ele precisar de um de seus pacotes.

source: Other Available Official Repositories
de_de: Sonstige verfügbare offizielle Depots
pt_br: Outros repositórios Oficiais Disponíveis

source: <emphasis role="distribution">Stable</emphasis> Updates
de_de: <emphasis role="distribution">Stable</emphasis> Aktualisierungen
pt_br: atualizações da <emphasis role="distribution">Stable</emphasis>

source: Once published, the <emphasis role="distribution">Stable</emphasis> distribution is only updated about once every 2 months in order to integrate the security updates published on <literal>security.debian.org</literal>.
de_de: Einmal veröffentlicht, wird die Distribution <emphasis role="distribution">Stable</emphasis> nur noch etwa alle 2 Monate aktualisiert, um die auf <literal>security.debian.org</literal> veröffentlichten Sicherheitsaktualisierungen zu integrieren.
pt_br: Depois de publicada, a distribuição <emphasis role="distribution">Stable</emphasis> é atualizada em aproximadamente de dois em dois meses para integrar as atualizações de segurança publicadas no <literal>security.debian.org</literal>.

source: This minor release can also include updates for packages that have to evolve over time... like <emphasis role="pkg">spamassassin</emphasis>'s spam detection rules, <emphasis role="pkg">clamav</emphasis>'s virus database, or the daylight-saving rules of all timezones (<emphasis role="pkg">tzdata</emphasis>).
de_de: Diese Zwischenaktualisierung kann auch Aktualisierungen für Pakete einbeziehen, die sich mit der Zeit weiterentwickeln, wie die Spam-Erkennungsregeln von <emphasis role="pkg">spamassassin</emphasis>, die Viren-Datenbank von <emphasis role="pkg">clamav</emphasis> oder die Sommerzeit-Regelungen aller Zeitzonen (<emphasis role="pkg">tzdata</emphasis>).
pt_br: Este lançamento menor também pode incluir atualizações de pacotes que evoluíram ao longo do tempo... como as regras de detecção de spam do <emphasis role="pkg">spamassassin</emphasis>, o banco de dados de vírus do <emphasis role="pkg">clamav</emphasis> ou as regras de horário de verão de todos os fusos horários do (<emphasis role="pkg">tzdata</emphasis>).

source: All those updates are prepared in a repository known as <literal>proposed-updates</literal>. Anyone can use this repository to test those updates before their official publication. The extract below uses the <literal>squeeze-proposed-updates</literal> alias which is both more explicit and more consistent since <literal>lenny-proposed-updates</literal> also exists (for the <emphasis role="distribution">Oldstable</emphasis> updates):
de_de: All diese Aktualisierungen werden in einem Repository vorbereitet, das als <literal>proposed-updates</literal> bekannt ist. Jeder kann dieses Repository benutzen, um diese Aktualisierungen vor ihrer offiziellen Veröffentlichung zu testen. Der Auszug unten benutzt den Alias <literal>squeeze-proposed-updates</literal>, der sowohl deutlicher als auch konsistenter ist, da auch ein <literal>lenny-proposed-updates</literal> (für die Aktualisierungen für <emphasis role="distribution">Oldstable</emphasis>) existiert:
pt_br: Todas estas atualizações são preparadas num repositório conhecido como <literal>proposed-updates</literal>. Qualquer um pode usar este repositório para testar estas atualizações antes de sua publicação oficial. O trecho abaixo usa o alias <literal>squeeze-proposed-updates</literal> que tanto é mais explícito quanto mais consistente, uma vez que o <literal>lenny-proposed-updates</literal> também existe (para as atualizações do <emphasis role="distribution">Oldstable</emphasis>):

source: Once ready, the most important updates — those which cannot wait for the next minor Debian release — are published in the <literal>stable-updates</literal> repository (which most systems are expected to use):
de_de: Einmal fertiggestellt, werden die wichtigsten Aktualisierungen – die, die nicht auf die nächste Zwischenveröffentlichung von Debian warten können – in dem Repository <literal>stable-updates</literal> veröffentlicht (welches die meisten Systeme benutzen sollten):
pt_br: Depois de prontas, as atualizações mais importantes — aquelas que não podem esperar para o próximo pequeno lançamento do Debian — são publicadas no repositório <literal>stable-updates</literal> (que espera-se que a maioria dos sistemas usem):

source: The Backports From <literal>backports.debian.org</literal>
de_de: Die Rückportierungen von <literal>backports.debian.org</literal>
pt_br: Os retroportes ("Backports") de <literal>backports.debian.org</literal>
