Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: $ <userinput>aptitude search kino~dvideo~mpaul</userinput> p kino - Non-linear editor for Digital Video data $ <userinput>aptitude show kino</userinput> Package: kino State: not installed Version: 1.3.4-1.3 Priority: extra Section: video Maintainer: Paul Brossier &lt;piem@debian.org&gt; Architecture: amd64 Uncompressed Size: 7936 k Depends: libasound2 (&gt; 1.0.24.1), libatk1.0-0 (&gt;= 1.12.4), libavc1394-0 (&gt;= 0.5.3), libavcodec53 (&gt;= 4:0.8~beta1~) | libavcodec-extra-53 (&gt;= 4:0.8~beta1~), libavformat53 […] Recommends: ffmpeg, curl Suggests: udev | hotplug, vorbis-tools, sox, mjpegtools, lame, ffmpeg2theora Conflicts: kino-dvtitler, kino-timfx, kinoplus Replaces: kino-dvtitler, kino-timfx, kinoplus Provides: kino-dvtitler, kino-timfx, kinoplus Description: Non-linear editor for Digital Video data Kino allows you to record, create, edit, and play movies recorded with DV camcorders. This program uses many keyboard commands for fast navigating and editing inside the movie. The kino-timfx, kino-dvtitler and kinoplus sets of plugins, formerly distributed as separate packages, are now provided with Kino. Homepage: http://www.kinodv.org/ Tags: hardware::camera, implemented-in::c, implemented-in::c++, interface::x11, role::program, scope::application, suite::gnome, uitoolkit::gtk, use::editing, works-with::video, x11::application
ja_jp: $ <userinput>aptitude search kino~dビデオ~mpaul</userinput> p kino - デジタルビデオデータ用ノンリニア編集ツール $ <userinput>aptitude show kino</userinput> パッケージ: kino 状態: インストールされていません バージョン: 1.3.4-1.3 優先度: 特別 セクション: video メンテナ: Paul Brossier &lt;piem@debian.org&gt; アーキテクチャ: amd64 展開サイズ: 7,936 k 依存: libasound2 (&gt; 1.0.24.1), libatk1.0-0 (&gt;= 1.12.4), libavc1394-0 (&gt;= 0.5.3), libavcodec53 (&gt;= 4:0.8~beta1~) | libavcodec-extra-53 (&gt;= 4:0.8~beta1~), libavformat53 […] 推奨: ffmpeg, curl 提案: udev | hotplug, vorbis-tools, sox, mjpegtools, lame, ffmpeg2theora 競合: kino-dvtitler, kino-timfx, kinoplus 置換: kino-dvtitler, kino-timfx, kinoplus 提供: kino-dvtitler, kino-timfx, kinoplus 説明: デジタルビデオデータ用ノンリニア編集ツール Kino で、DV カメラで録画された動画を記録、作成、編集、再生できるようになり ます。このプログラムには多くのキーボードコマンドがあり、動画内を高速に移動 し編集できます。 プラグイン集 kino-timfx, kino-dvtitler, kinoplus は、以前は個別のパッケージ として配布していましたが、現在は Kino に同梱しています。 ホームページ: http://www.kinodv.org/ タグ: hardware::camera, implemented-in::c, implemented-in::c++, interface::x11, role::program, scope::application, suite::gnome, uitoolkit::gtk, use::editing, works-with::video, x11::application
pl_pl: $ <userinput>aptitude search kino~dvideo~mpaul</userinput> p kino - Nieliniowy edytor danych Digital Video $ <userinput>aptitude show kino</userinput> Pakiet: kino Stan: niezainstalowany Wersja: 1.3.4-1.3 Priorytet: dodatkowy Sekcja: video Opiekun: Paul Brossier &lt;piem@debian.org&gt; Architektura: amd64 Rozmiar rozpakowanego: 7936 k Wymaga: libasound2 (&gt; 1.0.24.1), libatk1.0-0 (&gt;= 1.12.4), libavc1394-0 (&gt;= 0.5.3), libavcodec53 (&gt;= 4:0.8~beta1~) | libavcodec-extra-53 (&gt;= 4:0.8~beta1~), libavformat53 […] Poleca: ffmpeg, curl Sugeruje: udev | hotplug, vorbis-tools, sox, mjpegtools, lame, ffmpeg2theora W konflikcie z: kino-dvtitler, kino-timfx, kinoplus Zastępuje: kino-dvtitler, kino-timfx, kinoplus Udostępnia: kino-dvtitler, kino-timfx, kinoplus Opis: Nieliniowy edytor danych Digital Video Kino pozwala zapisywać, tworzyć, edytować i odtwarzać filmy zapisywane przy pomocy kamkorderów DV. Program używa wielu skrótów klawiszowych ułatwiających szybką nawigację i edycję filmów. kino-timfx, kino-dvtitler oraz zbiór wtyczek kinoplus, dystrybuowane dawniej jako oddzielne pakiety są teraz dostarczane razem z Kino. Strona internetowa: http://www.kinodv.org/ Znaczniki: hardware::camera, implemented-in::c, implemented-in::c++, interface::x11, role::program, scope::application, suite::gnome, uitoolkit::gtk, use::editing, works-with::video, x11::application

source: The search only returns one package, <emphasis role="pkg">kino</emphasis>, which satisfies all three criteria.
de_de: Die Suche liefert nur ein Ergebnis, <emphasis role="pkg">kino</emphasis>, auf das alle drei Kriterien zutreffen.
ja_jp: この検索は、3 つの基準すべてを満足するパッケージ、<emphasis role="pkg">kino</emphasis>、を 1 つだけ返します。
pl_pl: Wspomniane wyszukiwanie zwraca jeden pakiet, <emphasis role="pkg">kino</emphasis>, który spełnia wszystkie trzy kryteria.
pt_br: A busca retorna apenas um pacote, <emphasis role="pkg">kino</emphasis>, que satisfaz os três critérios.

source: Even these multi-criteria searches are rather unwieldy, which explains why they are not used as much as they could. A new tagging system has therefore been developed, and it provides a new approach to searching. Packages are given tags that provide a thematical classification along several strands, known as a “facet-based classification”. In the case of <emphasis role="pkg">kino</emphasis> above, the package's tags indicate that Kino is a Gnome-based software that works on video data and whose main purpose is editing.
de_de: Selbst die Mehrfachkriterien Suchen sind unhandlich, was erklärt, warum sie seltener genutzt werden, als sie eigentlich genutzt werden könnten. Aus diesem Grund wurde ein neues Markierungssystem entwickelt, das einen neuen Suchansatz zur Verfügung stellt. Pakete erhalten Markierungen aus einer thematischen Gliederung über verschiedene Anwendungsbereiche, bekannt als "Facettenklassifikation". Im Falle von <emphasis role="pkg">kino</emphasis> wie oben, besagen die Markierungen, dass Kino eine Gnome-basierte Software ist, die Videodaten verarbeitet und deren Hauptzweck die Bearbeitung ist.
ja_jp: このように条件が複数の検索はちょっと扱いにくい事が理由で、これはあまり使われません。そんなわけで、新しいタグ付けシステムが開発され、このシステムによって新しい検索方法が提供されました。パッケージには、「ファセット分類」として知られている様々な側面に従ってテーマ別に分類された、タグが付けられています。上に挙げた <emphasis role="pkg">kino</emphasis> の場合、パッケージのタグによれば、Kino は Gnome ベースのソフトウェアで、動画データの処理に有用であり、主用途は編集である事がわかります。
pl_pl: Niemniej jednak wyszukiwania zawierające wiele kryteriów są dość niewygodne, co tłumaczy fakt dlaczego nie są tak często używane. Niejako w odpowiedzi został stworzony nowy system znakowania, który dostarcza nowy sposób wyszukiwania. Pakietom przypisane są znaczniki o charakterze tematycznym oraz inne powiązania, znane jako "klasyfikacja fasetowa". W przypadku powyższego <emphasis role="pkg">kino</emphasis>, znaczniki pakietu wskazują, że Kino jest oprogramowaniem bazującym na Gnome, pracuje z danymi wideo, a jego głównym celem jest montaż.
pt_br: Mesmo estas buscas multi-critério são bastante "desajeitadas", o que explica por que elas não são usadas tanto quanto poderiam. Um novo sistema de etiquetas foi portanto desenvolvido, e fornece uma nova abordagem de busca. Pacotes recebem etiquetas que fornecem classificação temática através de vários pontos de vista, conhecidos como uma "classificação baseada em facetas" ("facet-based classification"). No caso do <emphasis role="pkg">kino</emphasis> acima, as etiquetas do pacote indicam que o Kino é um software baseado em gnome que trabalha com dados de vídeo e tem como função principal edição.

source: Browsing this classification can help you to search for a package which corresponds to known needs; even if it returns a (moderate) number of hits, the rest of the search can be done manually. To do that, you can use the <literal>~G</literal> search pattern in <command>aptitude</command>, but it is probably easier to simply navigate the site where tags are managed: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" />
ja_jp: この分類は既知の必要性に関連するパッケージを検索するのに便利です; たとえ大量の (少しの) パッケージがヒットした場合でも、残りの検索は手作業でできます。これを行うには <command>aptitude</command> で <literal>~G</literal> 検索パターンを使いますが、タグを管理しているサイトを見て回るほうがおそらく簡単です: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" />
pl_pl: Przeglądanie taj klasyfikacji może pomóc w znalezieniu pakietu, który spełnia wymagane potrzeby; nawet jeżeli zwróci (znaczną) ilość wyników, pozostała część wyszukiwania może być wykonana ręcznie. W tym celu można użyć wzorca wyszukiwania <literal>~G</literal> w <command>aptitude</command>, ale prawdopodobnie łatwiej jest przejrzeć stronę, na której odbywa się zarządzanie znacznikami: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" />

source: <primary>tag</primary>
ja_jp: <primary>タグ</primary>

source: Selecting the <literal>works-with::video</literal> and <literal>use::editing</literal> tags yields a handful of packages, including the <emphasis role="pkg">kino</emphasis> and <emphasis role="pkg">pitivi</emphasis> video editors. This system of classification is bound to be used more and more as time goes on, and package managers will gradually provide efficient search interfaces based on it.
ja_jp: <literal>works-with::video</literal> と <literal>use::editing</literal> タグを選ぶと、<emphasis role="pkg">kino</emphasis> と <emphasis role="pkg">pitivi</emphasis> 動画編集ソフトを含む、一握りのパッケージがヒットします。分類分けのシステムは時間が経てば経つ程使われる運命にあり、パッケージマネージャはこれに基づく効率的な検索インターフェースを少しづつ提供するでしょう。
pl_pl: Wybranie znaczników <literal>works-with::video</literal> i <literal>use::editing</literal> zwraca ledwie kilka pakietów, włączając w to edytory wideo <emphasis role="pkg">kino</emphasis> i <emphasis role="pkg">pitivi</emphasis>. Ta klasyfikacja z upływem czasu ma być coraz częściej stosowana, a zarządcy pakietów będą dostarczać bazujące na niej, efektywne interfejsy wyszukiwania.

source: To sum up, the best tool for the job depends on the complexity of the search that you wish to do:
de_de: Zusammenfassend wird das geeignetste Werkzeug für die Aufgabe durch die Komplexität der durchzuführenden Suche bestimmt:
ja_jp: 要約すると、検索したい内容の複雑さに依存して、最良の検索ツールも変わりうるという事です:
pl_pl: Podsumowując, najlepsze narzędzie do wykonania zadania zależy od stopnia komplikacji danego wyszukiwania:
pt_br: Para sumarizar, a melhor ferramenta para o trabalho depende da complexidade da busca que você deseja fazer:

source: <command>apt-cache</command> only allows searching in package names and descriptions, which is very convenient when looking for a particular package that matches a few target keywords;
de_de: <command>apt-cache</command> sucht nur in Paketnamen und Beschreibungen, was sehr bequem ist, wenn Sie nach bestimmten Paketen suchen, auf die wenige Schlagworte passen;
ja_jp: パッケージ名とパッケージ説明だけを検索し、数個のキーワードにマッチする特定のパッケージを探す場合、<command>apt-cache</command> がとても便利です;
pl_pl: <command>apt-cache</command> pozwala tylko na wyszukiwanie w nazwach pakietów i ich opisach, co jest bardzo wygodne w przypadku szukania konkretnego pakietu, do którego pasuje kilka słów kluczowych;
pt_br: Com o <command>apt-cache</command> só se pode fazer busca em nomes e descrições de pacotes, que é bastante conveniente quando se busca por um pacote em particular que casa com algumas palavras-chave;

source: when the search criteria also include relationships between packages or other meta-data such as the name of the maintainer, <command>synaptic</command> will be more useful;
de_de: wenn die Suche ebenfalls Beziehungen zwischen Paketen und andere Metadaten wie den Betreuernamen umfasst, wird <command>synaptic</command> nützlicher sein;
ja_jp: 検索条件にパッケージ間の関連性や例えばメンテナの名前などのメタ情報を含めたい場合には、<command>synaptic</command> が便利でしょう;
pl_pl: kiedy kryteria wyszukiwania obejmują również powiązania pomiędzy pakietami lub inne metadane takie jak imię opiekuna, <command>synaptic</command> będzie bardziej użyteczny;
pt_br: Quando o critério de busca também inclui relações entre pacotes ou outros meta-pacotes como o nome do mantenedor, o <command>synaptic</command> será mais útil;

source: when a tag-based search is needed, a good tool is <command>packagesearch</command>, a graphical interface dedicated to searching available packages along several criteria (including the names of the files that they contain). For usage on the command-line, <command>axi-cache</command> will fit the bill.
ja_jp: タグベースの検索が必要な場合、<command>packagesearch</command> は良いツールです。これは複数の条件 (パッケージに含まれるファイルの名前も含みます) に基いて利用可能なパッケージを検索する専用のグラフィカルインターフェースです。コマンドラインで使う場合は、<command>axi-cache</command> がぴったりでしょう。
pl_pl: kiedy potrzebne jest wyszukiwanie oparte o znaczniki, dobrym narzędziem jest <command>packagesearch</command>, interfejs graficzny przeznaczony do przeszukiwania dostępnych pakietów według kilku kryteriów (włączając nazwy plików, które zawierają). W przypadku użycia linii komend najlepiej będzie pasował <command>axi-cache</command>.

source: finally, when the searches involve complex expressions with logic operations, the tool of choice will be <command>aptitude</command>'s search pattern syntax, which is quite powerful despite being somewhat obscure; it works in both the command-line and the interactive modes.
de_de: schlussendlich, wenn die Suche komplexe Ausdrücke mit logischen Operatoren erfordert, wird <command>aptitude</command> mit seiner etwas obskuren aber mächtigen Suchmuster-Syntax das Mittel der Wahl sein; es funktioniert auf der Kommandozeile ebenso wie im interaktiven Modus.
ja_jp: 最後に、論理演算を組み合わせた複雑な表現で検索したい場合、<command>aptitude</command> の検索パターン構文を使うことになるでしょう。これはいささか分かりにくいですが非常に協力です; これはコマンドラインと対話型モードの両方で使えます。
pl_pl: wreszcie, kiedy wyszukiwanie obejmuje wyrażenia złożone z operacjami logicznymi, najlepszym wyborem będzie <command>aptitude</command> i jego wzorce wyszukiwania, które są potężnym narzędziem, choć nie zawsze jasnym w użyciu; działa zarówno w trybie linii komend i interaktywnym.
pt_br: finalmente, quando a busca envolve expressões complexas com operações lógicas, a melhor ferramenta é a sintaxe de padrões de busca do <command>aptitude</command>, que é bastante poderosa apesar de um pouco obscura; e funciona tanto no modo de linha de comando quanto no modo interativo.

source: <primary><filename>Packages.gz</filename></primary>
pl_pl: <primary><filename>Pakiety.gz</filename></primary>

source: # Security updates deb http://security.debian.org/ wheezy/updates main contrib non-free deb-src http://security.debian.org/ wheezy/updates main contrib non-free ## Debian mirror # Base repository deb http://ftp.debian.org/debian wheezy main contrib non-free deb-src http://ftp.debian.org/debian wheezy main contrib non-free # Stable updates deb http://ftp.debian.org/debian wheezy-updates main contrib non-free deb-src http://ftp.debian.org/debian wheezy-updates main contrib non-free # Stable backports deb http://ftp.debian.org/debian wheezy-backports main contrib non-free deb-src http://ftp.debian.org/debian wheezy-backports main contrib non-free
pl_pl: # Aktualizacje bezpieczeństwa deb http://security.debian.org/ wheezy/updates main contrib non-free deb-src http://security.debian.org/ wheezy/updates main contrib non-free ## Serwer lustrzany Debiana # Repozytorium bazowe deb http://ftp.debian.org/debian wheezy main contrib non-free deb-src http://ftp.debian.org/debian wheezy main contrib non-free # Stabilne aktualizacje deb http://ftp.debian.org/debian wheezy-updates main contrib non-free deb-src http://ftp.debian.org/debian wheezy-updates main contrib non-free # Stabilne wsteczne łatki deb http://ftp.debian.org/debian wheezy-backports main contrib non-free deb-src http://ftp.debian.org/debian wheezy-backports main contrib non-free

source: <emphasis>QUICK LOOK</emphasis> <command>apt-spy</command>
de_de: <emphasis>KURZER BLICK</emphasis> <command>apt-spy</command>
pl_pl: <emphasis>RZUT OKIEM</emphasis> <command>apt-spy</command>
pt_br: <emphasis>OLHADA RÁPIDA</emphasis> <command>apt-spy</command>

source: # Unstable deb http://ftp.debian.org/debian unstable main contrib non-free deb-src http://ftp.debian.org/debian unstable main contrib non-free # Testing deb http://ftp.debian.org/debian testing main contrib non-free deb-src http://ftp.debian.org/debian testing main contrib non-free # Stable deb http://ftp.debian.org/debian stable main contrib non-free deb-src http://ftp.debian.org/debian stable main contrib non-free # Security updates deb http://security.debian.org/ stable/updates main contrib non-free deb http://security.debian.org/ testing/updates main contrib non-free deb-src http://security.debian.org/ stable/updates main contrib non-free deb-src http://security.debian.org/ testing/updates main contrib non-free
pl_pl: # Niestabilny deb http://ftp.debian.org/debian unstable main contrib non-free deb-src http://ftp.debian.org/debian unstable main contrib non-free # Testowy deb http://ftp.debian.org/debian testing main contrib non-free deb-src http://ftp.debian.org/debian testing main contrib non-free # Stabilny deb http://ftp.debian.org/debian stable main contrib non-free deb-src http://ftp.debian.org/debian stable main contrib non-free # Aktualizacje bezpieczeństwa deb http://security.debian.org/ stable/updates main contrib non-free deb http://security.debian.org/ testing/updates main contrib non-free deb-src http://security.debian.org/ stable/updates main contrib non-free deb-src http://security.debian.org/ testing/updates main contrib non-free

source: # &lt;name&gt; &lt;repository-base-url&gt; debian http://ftp.debian.org/debian security http://security.debian.org
pl_pl: # &lt;nazwa&gt; &lt;adres-bazowy-repozytorium&gt; debian http://ftp.debian.org/debian security http://security.debian.org

source: # Sample sources.list pointing to a local approx server deb http://apt.falcot.com:9999/security wheezy/updates main contrib non-free deb http://apt.falcot.com:9999/debian wheezy main contrib non-free
pl_pl: # Przykładowy plik sources.list wskazujący lokalny serwer approx deb http://apt.falcot.com:9999/security wheezy/updates main contrib non-free deb http://apt.falcot.com:9999/debian wheezy main contrib non-free

source: ## Update dpkg's database of known packages # <userinput>avail=`mktemp`</userinput> # <userinput>apt-cache dumpavail &gt; "$avail"</userinput> # <userinput>dpkg --merge-avail "$avail"</userinput> # <userinput>rm -f "$avail"</userinput> ## Update dpkg's selections # <userinput>dpkg --set-selections &lt; pkg-list</userinput> ## Ask apt-get to install the selected packages # <userinput>apt-get dselect-upgrade</userinput>
pl_pl: ## Aktualizacja bazy danych znanych pakietów programu dpkg # <userinput>avail=`mktemp`</userinput> # <userinput>apt-cache dumpavail &gt; "$avail"</userinput> # <userinput>dpkg --merge-avail "$avail"</userinput> # <userinput>rm -f "$avail"</userinput> ## Aktualizacja zaznaczeń programu dpkg # <userinput>dpkg --set-selections &lt; pkg-list</userinput> ## Instalacja wybranych pakietów przy użyciu apt-get # <userinput>apt-get dselect-upgrade</userinput>

source: # <userinput>apt-get install <replaceable>package1</replaceable> <replaceable>package2-</replaceable></userinput> [...] # <userinput>apt-get remove <replaceable>package1+</replaceable> <replaceable>package2</replaceable></userinput> [...]
pl_pl: # <userinput>apt-get install <replaceable>pakiet1</replaceable> <replaceable>pakiet2-</replaceable></userinput> [...] # <userinput>apt-get remove <replaceable>pakiet1+</replaceable> <replaceable>pakiet2</replaceable></userinput> [...]

source: Explanation: The package xserver-xorg-video-intel provided Explanation: in experimental can be used safely Package: xserver-xorg-video-intel Pin: release a=experimental Pin-Priority: 500
pl_pl: Explanation: Pakiet xserver-xorg-video-intel dostarczony Explanation: w eksparymentalnym może być bezpiecznie używany Package: xserver-xorg-video-intel Pin: release a=experimental Pin-Priority: 500

source: <emphasis>TIP</emphasis> <command>apt-cache policy</command>
de_de: <emphasis>TIPP</emphasis> <command>apt-cache policy</command>
pl_pl: <emphasis>WSKAZÓWKA</emphasis> <command>apt-cache policy</command>
pt_br: <emphasis>DICA</emphasis> <command>apt-cache policy</command>

source: <emphasis>ALTERNATIVE</emphasis> <command>axi-cache</command>
pl_pl: <emphasis>ALTERNATYWA</emphasis> <command>axi-cache</command>

source: <emphasis>DOCUMENTATION</emphasis> <command>aptitude</command>
de_de: <emphasis>DOKUMENTATION</emphasis> <command>aptitude</command>
pl_pl: <emphasis>DOKUMENTACJA</emphasis> <command>aptitude</command>
pt_br: <emphasis>DOCUMENTAÇÃO</emphasis> <command>aptitude</command>

source: What makes Debian so popular with administrators is how easily software can be installed and how easily the whole system can be updated. This unique advantage is largely due to the <emphasis>APT</emphasis> program, the features of which Falcot Corp administrators studied with enthusiasm.
de_de: Das Debian bei Administratoren so beliebt ist, liegt an der Einfachheit mit der das ganze System installiert und aktuell gehalten werden kann. Dieser einzigartige Vorteil rührt weitestgehend vom Programm <emphasis>APT</emphasis>, dessen Funktionen sich die Administratoren von Falcot Corp mit Begeisterung angeeignet haben.
pt_br: O que faz o Debian tão popular entre os administradores é a facilidade para instalar um programa e atualizar o sistema inteiro. Esta única vantagem é em grande parte devida ao programa <emphasis>APT</emphasis>, cuja características os administradores da Falcot Corp estudaram com entusiasmo.

source: APT needs to be given a “list of package sources”: the file <filename>/etc/apt/sources.list</filename> will list the different repositories (or “sources”) that publish Debian packages. APT will then import the list of packages published by each of these sources. This operation is achieved by downloading <filename>Packages.gz</filename> or <filename>Packages.bz2</filename> files (in case of a source of binary packages) and <filename>Sources.gz</filename> or <filename>Sources.bz2</filename> files (in case of a source of source packages) and by analyzing their contents. When an old copy of these files is already present, APT can update it by only downloading the differences (see sidebar <xref linkend="encadre.apt-pdiff" />).
de_de: APT benötigt eine "Liste der Paketquellen": Die Datei <filename>/etc/apt/sources.list</filename> enthält eine Liste der verschiedenen Depots (oder "Quellen"), die Debian Pakete zur Verfügung stellen. APT importiert dann von jeder Quelle die Liste der dort verfügbaren Pakete. Dazu lädt APT von jeder Quelle die Dateien <filename>Packages.gz</filename> oder <filename>Packages.bz2</filename> (falls es sich um Binärpakete handelt) und <filename>Sources.gz</filename> oder <filename>Sources.bz2</filename> (falls es sich um Quelltextpakete handelt) herunter und analysiert deren Inhalt. Falls bereits ältere Versionen dieser Dateien gespeichert wurden, kann APT diese aktualisieren, indem es nur die geänderten Teile herunterlädt (siehe die Seitenleiste <xref linkend="encadre.apt-pdiff" />).
pt_br: O APT precisa que lhe seja dada uma “lista de fontes de pacotes”: o arquivo <filename>/etc/apt/sources.list</filename> listará os diferentes repositórios (ou "fontes") que publicam pacotes Debian. O APT irá então importar a lista de pacotes publicados por cada uma destas fontes. Isto é feito baixando o arquivo <filename>Packages.gz</filename> ou o <filename>Packages.bz2</filename> (no caso de uma fonte de pacotes binários) e o arquivo <filename>Sources.gz</filename> ou <filename>Sources.bz2</filename> (no caso de uma fontes de pacotes código-fonte) e analizando seus conteúdos. Quando uma cópia antiga destes arquivos já estiver presente, o APT poderá atualizar ela baixando apenas diferenças (veja a barra lateral <xref linkend="encadre.apt-pdiff" />).
