Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: A “new feature” (available since <emphasis role="distribution">Etch</emphasis>) is that APT can now download the changes since the previous update, as opposed to the entire file. To achieve this, official Debian mirrors distribute different files which list the differences between one version of the <filename>Packages</filename> file and the following version. They are generated at each update of the archives and a history of one week is kept. Each of these “diff” files only takes a few dozen kilobytes for <emphasis role="distribution">Unstable</emphasis>, so that the amount of data downloaded by a weekly <command>aptitude update</command> is often divided by 10. For distributions like <emphasis role="distribution">Stable</emphasis> and <emphasis role="distribution">Testing</emphasis>, which change less, the gain is even more noticeable.
de_de: Eine „neue Fähigkeit“ von APT (verfügbar seit <emphasis role="distribution">Etch</emphasis>) ist, nur die Änderungen seit der vorigen Aktualisierung herunter laden zu können. Um dies zu erreichen, verteilen offizielle Spiegelserver von Debian verschiedene Dateien, die die Unterschiede zwischen einer Version der <filename>Packages</filename>-Datei und der folgenden Version auflisten. Sie werden bei jeder Aktualisierung der Archive erzeugt, und ein Verlauf von einer Woche wird vorgehalten. Jede dieser „Diff“-Dateien für <emphasis role="distribution">Unstable</emphasis> ist nur ein paar Dutzend Kilobytes groß, sodass die Datenmenge eines wöchentlichen <command>aptitude update</command> oft nur ein Zehntel der Gesamtdateigröße beträgt. Für Distributionen wie <emphasis role="distribution">Stable</emphasis> und <emphasis role="distribution">Testing</emphasis> mit weniger Änderungen ist der Gewinn noch deutlicher spürbar.
pt_br: Uma “nova funcionalidade” (disponível desde o <emphasis role="distribution">Etch</emphasis>) é que o APT pode agora baixar as mudanças desde o update anterior, ao invés de todo o arquivo. para isto, os espelhos oficiais do Debian distribuem arquivos diferentes que listas as diferenças entre uma versão do arquivos <filename>Packages</filename> e a versão seguinte. Eles são gerados em cada atualização dos arquivamentos e um histórico de uma semana é guardadao. Cada um destes arquvios de "diff" apenas ocupam uns poucos kilobytes para a <emphasis role="distribution">Unstable</emphasis>, de forma que a quatidade de dados baixados por um <command>aptitude update</command> semanal é às vezes dividida por 10. Para distribuições como a <emphasis role="distribution">Stable</emphasis> e a <emphasis role="distribution">Testing</emphasis>, que mudam menos, o ganho é ainda mais visível.

source: However, it can sometimes be of interest to force the download of the entire <filename>Packages.bz2</filename> file, especially when the last upgrade is very old and when the mechanism of incremental differences would not contribute much. This can also be interesting when network access is very fast but when the processor of the machine to upgrade is rather slow, since the time saved on the download is more than lost when the computer calculates the new versions of these files (starting with the older versions and applying the downloaded differences). To do that, you can use the configuration parameter <literal>Acquire::Pdiffs</literal> and set it to <literal>false</literal>.
de_de: Manchmal jedoch kann es wünschenswert sein, das Herunterladen der gesamten <filename>Packages.bz2</filename>-Datei zu erzwingen, besonders wenn die letzte Aktualisierung lange zurück liegt oder die Gesamtgröße der inkrementellen Differenz-Dateien nur wenig geringer ist. Dies kann auch interessant sein, wenn der Netzwerkzugriff sehr schnell aber der Prozessor der zu aktualisierenden Maschine ziemlich langsam ist, weil das Herunterladen schneller geht, als wiederholt die neue Version dieser Dateien zu berechnen (immer wieder die Unterschiede der jeweils ältesten Differenz-Datei auf die Paketliste anzuwenden). Dazu setzen Sie den Konfigurationsparameter <literal>Acquire::Pdiff</literal> verwenden auf <literal>false</literal>.
pt_br: Entretanto, algumas vezes é interessante forçar o download do arquivo <filename>Packages.bz2</filename> todo, especialmente quando a última atualização é muito antiga e o mecanismo de diferenças incremental não vai ajudar muito. Isto també pode ser interessante quando o acesso à rede é muito rápido mas o processador da máquina que vai atualizar nem tanto, pois o tempo economizado para o download é maior que o perdido para juntar as versões dos arquivos (iniciando com a versão antiga e aplicando as diferenças baixadas). Para fazer isto, você pode usar o parâmetro de configuração <literal>Acquire::Pdiffs</literal> e configurar ele para <literal>false</literal>.

source: <command>aptitude</command> will generally select the most recent version number (except for <emphasis role="distribution">Experimental</emphasis> packages, which are ignored by default whatever their version number). If you specified <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> in your <filename>sources.list</filename>, <command>aptitude safe-upgrade</command> will switch most of your <emphasis role="distribution">Stable</emphasis> system to <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>, which might not be what you intended.
de_de: <command>aptitude</command> wählt grundsätzlich die neueste Versionsnummer aus (außer bei Paketen aus <emphasis role="distribution">Experimental</emphasis>, die standardmäßig ignoriert werden, unabhängig von ihrer Versionsnummer). Falls Sie in Ihrer <filename>sources.list</filename> <emphasis role="distribution">Testing</emphasis> oder <emphasis role="distribution">Unstable</emphasis> angegeben haben, wird <command>aptitude safe-upgrade</command> den größten Teil Ihres <emphasis role="distribution">Stable</emphasis>-Systems auf <emphasis role="distribution">Testing</emphasis> oder <emphasis role="distribution">Unstable</emphasis> umstellen, was möglicherweise nicht Ihre Absicht war.
pt_br: <command>aptitude</command> vai geralmente selecionar o número de versão mais recente (exceto para pacotes da <emphasis role="distribution">Experimental</emphasis>, que são normalmente ignorados independente do número de versão). Se você especificar a <emphasis role="distribution">Testing</emphasis> ou a <emphasis role="distribution">Unstable</emphasis> em seu <filename>sources.list</filename>, <command>aptitude safe-upgrade</command> vai trocar a maioria do seu sistema <emphasis role="distribution">Stable</emphasis> para <emphasis role="distribution">Testing</emphasis> ou <emphasis role="distribution">Unstable</emphasis>, que pode não ser o que você deseja.

source: To tell <command>aptitude</command> to use a specific distribution when searching for upgraded packages, you need to use the option <literal>-t</literal> or <literal>--target-release</literal>, followed by the name of the distribution you want (for example: <command>aptitude -t stable safe-upgrade</command>). To avoid specifying this option every time you use <command>aptitude</command>, you can add <literal>APT::Default-Release "stable";</literal> in the file <filename>/etc/apt/apt.conf.d/local</filename>.
de_de: Um <command>aptitude</command> in einer bestimmten Distribution nach aktualisierten Paketen suchen zu lassen, benutzen Sie die Option <literal>-t</literal> oder <literal>--target-release</literal> gefolgt vom Namen der gewünschten Distribution (zum Beispiel: <command>aptitude -t stable safe-upgrade</command>). Um das Angeben dieser Option bei jedem Aufruf von <command>aptitude</command> zu vermeiden, können Sie <literal>APT::Default-Release "stable";</literal> der Datei <filename>/etc/apt/apt.conf.d/local</filename> hinzufügen.
pt_br: Para dizer ao <command>aptitude</command> para usar uma distribuição específica quando buscando por pacotes para atualizar, você precisa usar a opção <literal>-t</literal> ou <literal>--target-release</literal>, seguida do nome da distribuição que você quer (por exemplo: <command>aptitude -t stable safe-upgrade</command>). para evitar ficar usando esta opção toda vez que usa o <command>aptitude</command>, você pode adicionar a linha <literal>APT::Default-Release "stable";</literal> no arquivo <filename>/etc/apt/apt.conf.d/local</filename>.

source: For more important upgrades, such as the change from one major Debian version to the next, you need to use <command>aptitude full-upgrade</command> (the option used to be named <literal>dist-upgrade</literal>, for “distribution upgrade”). With this instruction, <command>aptitude</command> will complete the upgrade even if it has to remove some obsolete packages or install new dependencies. This is also the command used by users who work daily with the Debian <emphasis role="distribution">Unstable</emphasis> release and follow its evolution day by day. It is so simple that it hardly needs explanation: APT's reputation is based on this great functionality.
de_de: Für wichtigere Aktualisierungen, wie den Übergang von einer Debian-Hauptversion zur nächsten, müssen Sie <command>aptitude full-upgrade</command> benutzen (die Option hieß früher <literal>dist-upgrade</literal> für „Distributions-Upgrade“). Mit dieser Anweisung vollzieht <command>aptitude</command> die Aktualisierung selbst dann, wenn es einige veraltete Pakete entfernen oder neue Abhängigkeiten installieren muss. Dies ist ebenso der Befehl, den Benutzer verwenden, die täglich mit Debians <emphasis role="distribution">Unstable</emphasis>-Veröffentlichung arbeiten und deren Entwicklung tagtäglich verfolgen. Es ist so einfach, dass es kaum einer Erklärung bedarf: APTs Ansehen begründet sich in seiner großartigen Funktionalität.
pt_br: para upgrades mais importantes, como mudar de uma versão principal do Debian para a seguinte, você precisa usar <command>aptitude full-upgrade</command> (esta opção costumava ser chamada <literal>dist-upgrade</literal>, de “distribution upgrade”). Com esta instrução, <command>aptitude</command> vai completar o upgrade mesmo se ele tiver que remover alguns pacotes obsoletos ou instalar novas dependências. Este também é o comando usado pelos usuários que trabalham diariamente com a versão Debian <emphasis role="distribution">Unstable</emphasis> e seguem sua evolução dia após dia. É tão simples que dispensa explicações: a reputação do APT é baseada nesta fantástica funcionalidade.

source: <command>aptitude dist-upgrade</command> is still available as a synonym for <command>aptitude full-upgrade</command>; <command>apt-get</command> only recognizes the former.
de_de: <command>aptitude dist-upgrade</command> ist immer noch als Synonym für <command>aptitude full-upgrade</command> verfügbar; <command>apt-get</command> kennt nur das erstere.
pt_br: <command>aptitude dist-upgrade</command> ainda está disponível como um sinônimo de <command>aptitude full-upgrade</command>; <command>apt-get</command> só reconhece a forma antiga.

source: If the Web can only be accessed through a proxy, add a line like <literal>Acquire::http::proxy "http://<replaceable>yourproxy</replaceable>:3128"</literal>. For an FTP proxy, write <literal>Acquire::ftp::proxy "ftp://<replaceable>yourproxy</replaceable>"</literal>. To discover more configuration options, read the <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page with the command <command>man apt.conf</command> (for details on manual pages, see next chapter).
de_de: Falls auf das Web nur über einen Web-Proxy zugegriffen werden kann, fügen Sie eine Zeile wie <literal>Acquire::http::proxy "http://<replaceable>IhrProxy</replaceable>:3128"</literal> hinzu. Für einen FTP-Proxy schreiben Sie <literal>Acquire::ftp::proxy "ftp://<replaceable>IhrProxy</replaceable>"</literal>. Um mehr über die Konfigurationsoptionen heraus zu finden, lesen Sie die Handbuchseite <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> mit dem Befehl <command>man apt.conf</command> (für Einzelheiten zu Handbuchseiten siehe nächstes Kapitel).
pt_br: Se a rede só puder ser acessada através de um proxy, adicione uma linha como <literal>Acquire::http::proxy "http://<replaceable>seu-proxy</replaceable>:3128"</literal>. Para um proxy FTP, escreva <literal>Acquire::ftp::proxy "ftp://<replaceable>seu-proxy</replaceable>"</literal>. Para descobrir mais opções de configuração, leia a página de manual do <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> com o comando <command>man apt.conf</command> (para detalhes sobre páginas de manual, leia o próximo capítulo).

source: This structure brings some flexibility to the machine administrator and to the package maintainers. Indeed, the administrator can easily modify the configuration of the software by adding a ready-made file in the directory in question without having to change an existing file. Package maintainers use the same approach when they need to adapt the configuration of another software to ensure that it perfectly co-exists with theirs. However, the Debian policy explicitly forbids modifying configuration files of other packages — only users are allowed to do this. Remember that during a package upgrade, the user gets to choose the version of the configuration file that should be kept when a modification has been detected. Any external modification of the file would trigger that request, which would disturb the administrator, who is sure not to have changed anything.
de_de: Diese Struktur gibt dem Administrator der Maschine und den Paket-Betreuern einiges an Flexibilität. Tatsächlich kann der Administrator die Konfiguration der Software verändern, indem er dem fraglichen Verzeichnis eine ein gebrauchsfertige Datei hinzufügt, ohne eine bestehende Datei verändern zu müssen. Paket-Betreuer nutzen denselben Ansatz, wenn sie die Konfiguration einer anderen Software anpassen müssen, um sicher zu stellen, dass beide Konfigurationen friedlich koexistieren können. Die Debian-Richtlinien (policy) verbieten jedoch ausdrücklich das Verändern von Konfigurationsdateien anderer Pakete, nur den Anwendern wird dieses gestattet. Erinnern Sie sich, dass während einer Paketaktualisierung der Benutzer eine Auswahlmöglichkeit erhält, welche Version der Konfigurationsdatei benutzt werden soll, falls eine lokale Veränderung erkannt wird. Jede fremde Änderung würde eine solche Abfrage auslösen, zur Verwirrung des Administrators, der sich sicher ist, nichts verändert zu haben.
pt_br: Esta estrutura trás alguma flexibilidade ao administrador da máquina e aos mantenedores de pacotes. Na verdade, o administrador pode modificar facilmente a configuração do software ao adicionar um arquivo pronto para usar no diretório em questão sem ter que alterar um arquivo existente. mantenedores de pacotes usam a mesma abordagem quando precisam adaptar a configuração de outro software para garantir que ele coexista perfeitamente com o seu. Entretanto, a política Debian explicitamente proíbe a modificação de arquivos de configuração de outros pacotes — apenas usuários tem autorização para isto. Lembre que durante uma atualização de pacote, o usuário escolhe a versão do arquivo de configuração que deve ser mantida quando uma modificação é detectada. Qualquer modificação externa do arquivo irá ativar este requisito, que irá perturbar o administrador, que está certo de não haver mudado nada.

source: Depending on the application, the <filename>.d</filename> directory is used directly or managed by an external script which will concatenate all the files to create the configuration file itself. It is important to execute the script after any change in that directory so that the most recent modifications are taken into account. In the same way, it is important not to work directly in the configuration file created automatically, since everything would be lost at the next execution of the script. Choosing one method (<filename>.d</filename> directory used directly or a file generated from that directory) is usually imposed by implementation constraints, but in both cases the gains in terms of configuration flexibility more than make up for the small complications that they entail. The Exim 4 mail server is an example of the generated file method: it can be configured through several files (<filename>/etc/exim4/conf.d/*</filename>) which are concatenated into <filename>/var/lib/exim4/config.autogenerated</filename> by the <command>update-exim4.conf</command> command.
de_de: Abhängig von der Anwendung wird das <filename>.d</filename>-Verzeichnis direkt benutzt oder von einem externen Skript verwaltet, welches alle Dateien zu der eigentlichen Konfigurationsdatei zusammenfügt. Wichtig ist, dieses Skript nach jeder Änderung in dem Verzeichnis auszuführen, so dass die jüngsten Änderungen angewendet werden. Ebenso wichtig ist es, die automatisch erzeugte Konfigurationsdatei nicht direkt zu bearbeiten, weil alle manuellen Änderungen bei der nächsten Ausführung des Skripts verloren gehen. Die Wahl der Methode (das <filename>.d</filename>-Verzeichnis direkt zu nutzen oder eine aus dem Verzeichnis generierte Datei) erfolgt üblicherweise abhängig von den Rahmenbedingungen bei der Entwicklung, in beiden Fällen aber macht der Gewinn an Konfigurationsflexibilität die kleinen Komplikationen, die sie mit sich bringen, mehr als wett. Der Mailserver Exim4 ist ein Beispiel für die Methode der generierten Datei: Er kann durch mehrere Dateien (<filename>/etc/exim4/conf.d/*</filename>) konfiguriert werden, die vom Befehl <command>update-exim4.conf</command> zu <filename>/var/lib/exim4/config.autogenerated</filename> verknüpft werden.
pt_br: Dependendo da aplicação, o diretório <filename>.d</filename> é usado diretamente ou gerenciado por um script externo que vai concatenar todos os arquivos para criar um outro arquivo de configuração. É importante executar o script depois de qualquer mudança neste diretório, para que as modificações mais recentes sejam aplicadas. Da mesma forma, é importante não trabalhar diretamente no arquivo de configuração criado automaticamente, já que toda alteração será perdida na próxima execução do script. Escolher um método (diretório <filename>.d</filename> usado diretamente ou arquivo gerado a partir do diretório) é normalmente imposto por restrições de implementação, mas em ambos os casos os ganhos em termos de flexibilidade de configuração superam as pequenas complicações que são trazidas. O servidor de email Exim 4 é um exemplo do métido de arquivo gerado: ele pode ser configurado através de vŕios arquivos (<filename>/etc/exim4/conf.d/*</filename>) que são concatenados em <filename>/var/lib/exim4/config.autogenerated</filename> pelo comando <command>update-exim4.conf</command>.

source: <primary><filename>preferences</filename></primary>
pt_br: <primary><filename>preferências</filename></primary>

source: APT defines several default priorities. Each installed package version has a priority of 100. A non-installed version has a priority of 500 by default, but it can jump to 990 if it is part of the target release (defined with the <literal>-t</literal> command-line option or the <literal>APT::Target-Release</literal> configuration directive).
de_de: APT definiert verschiedene Standard-Prioritäten. Jede installierte Paketversion hat die Priorität 100. Eine nicht installierte Version erhält standardmäßig die Priorität 500, diese kann aber auf 990 angehoben werden, falls sie Teil der Ziel-Veröffentlichung ist (diese wird durch die Befehlszeilenoption <literal>-t</literal> oder die Konfigurationsanweisung <literal>APT::Target-Release</literal> festgelegt).
pt_br: O APT define várias prioridades padrão. Cada versão de pacote instalada tem a prioridade 100. uma versão não instalada tem a prioridade 500 por padrão, mas pode pular para 990 se for parte da "target release" (definida com a opção de linha de comando <literal>-t</literal> ou a diretiva de configuração <literal>APT::Target-Release</literal>).

source: You can modify the priorities by adding entries in the file <filename>/etc/apt/preferences</filename> with the names of the affected packages, their version, their origin and their new priority.
de_de: Sie können die Prioritäten ändern, indem Sie der Datei <filename>/etc/apt/preferences</filename> Einträge mit den Namen der betroffenen Pakete, ihrer Version und Herkunft, sowie ihrer neuen Priorität hinzufügen.
pt_br: Você pode modificar as prioridades adicionando entradas no arquivo <filename>/etc/apt/preferences</filename> com os nomes dos pacotes afetados, sua versão, sua origem e sua nova prioridade.

source: In more concrete terms, a package whose priority is less than 0 will never be installed. A package with a priority ranging between 0 and 100 will only be installed if no other version of the package is already installed. With a priority between 100 and 500, the package will only be installed if there is no other newer version installed or available in another distribution. A package of priority between 500 and 990 will only be installed if there is no newer version installed or available in the target distribution. With a priority between 990 and 1000, the package will be installed except if the installed version is newer. A priority greater than 1000 will always lead to the installation of the package even if it forces APT to downgrade to an older version.
de_de: Konkret wird ein Paket mit einer Priorität kleiner als 0 niemals installiert. Ein Paket mit einer Priorität zwischen 0 und 100 wird nur dann installiert, wenn keine andere Version des Pakets bereits installiert ist. Bei einer Priorität zwischen 100 und 500 wird das Paket nur dann installiert, wenn keine neuere Version installiert oder in einer anderen Distribution verfügbar ist. Zwischen einer Priorität von 500 und 990 wird ein Paket nur dann installiert, wenn keine neuere Version installiert oder in der Zieldistribution verfügbar ist. Liegt die Priorität zwischen 990 und 1000 wird das Paket nur dann installiert, wenn keine neuere Version installiert ist. Mit einer Priorität größer 1000 wird das Paket in jedem Fall installiert, selbst wenn dies APT zu einem Downgrade auf eine ältere Version zwingt.
pt_br: Em termos mai concretos, umpacote cuja prioridade é menor que 0 nunca vai ser instalado. Um pacote com a prioridade entre 0 100 só vai ser instalado se nenhuma outra versão do pacote estiver instalada. Com uma prioridade entre 100 e 500, o pacote só será instalado se não houver uma versão mais nova instalada ou disponível em outra distribuição. Um pacote de prioridade entre 500 e 990 só será instalado se não houver uma versão mais nova instalada oudisponível numa "target distribution". Com uma prioridade entre 990 e 1000, o pacote será instalado a menos que a versão instalada seja mais nova. Uma prioridade maior que 1000 vai sempre levar à instalação do pacote, mesmo se ela forçar o APT a fazer downgrade para uma versão mais antiga.
