Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: <command>axi-cache search <replaceable>term</replaceable></command>, on the other hand, provides better results, sorted by relevancy. It uses the <emphasis>Xapian</emphasis> search engine and is part of the <emphasis role="pkg">apt-xapian-index</emphasis> package whichs indexes all package information (and more, like the <filename>.desktop</filename> files from all Debian packages). It knows about tags (see sidebar <xref linkend="sidebar.debtags" />) and returns results in a matter of milliseconds.
ja_jp: 一方、<command>axi-cache search <replaceable>term</replaceable></command> は関連度順により良い結果を提供します。このコマンドは <emphasis>Xapian</emphasis> 検索エンジンを使い、全パッケージの情報 (とすべての Debian パッケージから提供される <filename>.desktop</filename> ファイル) をインデックス化している <emphasis role="pkg">apt-xapian-index</emphasis> パッケージの一部です。これはタグ (傍注<xref linkend="sidebar.debtags" />参照) に関しても知っており、わずか数ミリ秒で結果を返す。
pl_pl: Z drugiej strony <command>axi-cache search <replaceable>określenie</replaceable></command> dostarcza lepsze wyniki, posortowane względem trafności. Używa silnika wyszukiwania <emphasis>Xapian</emphasis> i jest częścią pakietu <emphasis role="pkg">apt-xapian-index</emphasis>, który indeksuje wszystkie informacje pakietu (i nawet więcej, jak pliki <filename>.desktop</filename> ze wszystkich pakietów Debiana). Rozróżnia także znaczniki (spójrz na fiszkę <xref linkend="sidebar.debtags" />) i zwraca wyniki w ciągu milisekund.

source: Some features are more rarely used. For instance, <command>apt-cache policy</command> displays the priorities of package sources as well as those of individual packages. Another example is <command>apt-cache dumpavail</command> which displays the headers of all available versions of all packages. <command>apt-cache pkgnames</command> displays the list of all the packages which appear at least once in the cache.
ja_jp: あまり使われない機能もあります。例えば、<command>apt-cache policy</command> はパッケージソースの優先度や、それぞれのパッケージの優先度を表示します。もう一つの例は <command>apt-cache dumpavail</command> で、これは全パッケージの利用可能なバージョンのヘッダを表示します。<command>apt-cache pkgnames</command> は少なくとも 1 回キャッシュされた全パッケージのリストを表示します。
pl_pl: Niektóre funkcje są rzadziej używane. Na przykład <command>apt-cache policy</command> wyświetla zarówno priorytety źródeł pakietów i pojedynczych pakietów. Kolejnym przykładem jest <command>apt-cache dumpavail</command>, która wyświetla nagłówki wszystkich dostępnych wersji wszystkich pakietów. <command>apt-cache pkgnames</command> wyświetla listę wszystkich pakietów, które choć raz pojawiają się w pamięci podręcznej.

source: Frontends: <command>aptitude</command>, <command>synaptic</command>
de_de: Benutzeroberflächen: <command>aptitude</command>, <command>synaptic</command>
ja_jp: フロントエンド: <command>aptitude</command>、<command>synaptic</command>
pl_pl: Interfejsy: <command>aptitude</command>, <command>synaptic</command>
pt_br: Interfaces: <command>aptitude</command>, <command>synaptic</command>

source: <primary>APT</primary><secondary>interfaces</secondary>
de_de: <primary>APT</primary><secondary>Schnittstellen</secondary>
ja_jp: <primary>APT</primary><secondary>インターフェース</secondary>

source: APT is a C++ program whose code mainly resides in the <command>libapt-pkg</command> shared library. Using a shared library facilitates the creation of user interfaces (front-ends), since the code contained in the library can easily be reused. Historically, <command>apt-get</command> was only designed as a test front-end for <command>libapt-pkg</command> but its success tends to obscure this fact.
de_de: APT ist ein C++ Programm, dessen Programmcode hauptsächlich in der Laufzeit-Bibliothek <command>libapt-pkg</command> enthalten ist. Die Nutzung einer Laufzeit-Bibliothek vereinfacht die Schaffung von Benutzerschnittstellen (Oberflächen), da der in der Bibliothek enthaltene Code einfach wiederverwendet werden kann. Historisch betrachtet war <command>apt-get</command> nur als Test-Benutzerschnittstelle für <command>libapt-pkg</command> gedacht, aber der Erfolg neigt dazu, diese Tatsache zu verschleiern.
ja_jp: APT は C++ プログラムで、<command>libapt-pkg</command> 共有ライブラリがその機能の多くを担っています。共有ライブラリを使うとユーザインターフェース (フロントエンド) の作成が楽になります。なぜなら、ライブラリに含まれるコードは簡単に再利用できるからです。歴史的に言って、<command>apt-get</command> は <command>libapt-pkg</command> のテスト用フロントエンドとして設計されましたが、成功を収めたためにその事実は曖昧にされがちです。
pl_pl: APT jest programem w języku C++, którego kod zawiera się głównie we współdzielonej bibliotece <command>libapt-pkg</command>. Używanie biblioteki współdzielonej ułatwia tworzenie interfejsów użytkownika, ponieważ jej kod jest łatwy do wykorzystania. Z historycznego punktu widzenia <command>apt-get</command> był zaprojektowany wyłącznie jako testowy interfejs dla <command>libapt-pkg</command>, ale jego sukces przyćmił ten fakt.
pt_br: APT é um programa C++ cujo código reside principalmente na biblioteca compartilhada <command>libapt-pkg</command>. Usar uma biblioteca compartilhada facilita a criação de interfaces de usuário (front-ends), já que o código contido na biblioteca pode facilmente ser reutilizado. Historicamente, <command>apt-get</command> foi projetado apenas como um front-end de teste para <command>libapt-pkg</command>, mas seu sucesso tende a obscurecer esse fato.

source: <command>aptitude</command> is an interactive program that can be used in semi-graphical mode on the console. You can browse the list of installed and available packages, look up all the available information, and select packages to install or remove. The program is designed specifically to be used by administrators, so that its default behaviors are much more intelligent than <command>apt-get</command>'s, and its interface much easier to understand.
de_de: <command>aptitude</command> ist ein interaktives Programm, das im Pseudo-Grafikmodus der Console benutzt werden kann. Sie können durch eine Liste der installierten und der verfügbaren Pakete blättern, die verfügbaren Informationen einsehen und Pakete zur Installation oder Deinstallation auswählen. Das Programm wurde für die Nutzung durch Administratoren entworfen, so dass die Standardverhaltensweisen intelligenter als die von <command>apt-get</command> sind und die Oberfläche einfacher zu verstehen ist.
ja_jp: <command>aptitude</command> は対話型プログラムで、コンソールの準グラフィカルモードで使う事が可能です。このプログラムを使うと、インストール済みや利用可能なパッケージのリストを閲覧したり、すべての利用可能な情報を調べたり、インストールや削除するパッケージを選択できます。このプログラムは、特に管理者が使うように設計されました。そのため、デフォルトの挙動は <command>apt-get</command> よりもずっと合理的で、インターフェースもより理解しやすいです。
pl_pl: <command>aptitude</command> jest interaktywnym programem, który może być używany w semigraficznym trybie konsolowym. Pozwala na przeglądanie listy zainstalowanych pakietów, wyszukiwanie wszystkich dostępnych informacji i wybieranie pakietów do instalacji lub usunięcia. Został on zaprojektowany szczególnie z myślą o administratorach, dlatego jego zachowanie jest dużo bardziej inteligentne w porównaniu do <command>apt-get</command>, a jego interfejs łatwiejszy w zrozumieniu.
pt_br: <command>aptitude</command> é um programa interativo que pode ser usado em modo semi-gráfico no console. Você pode navegar a lista de pacotes disponíveis e instalados, buscar em todas as informações disponíveis e selecionar pacotes para instalar ou remover. O programa é projetado especificamente para ser usado pelos administradores, de forma que seu comportamento padrão seja muito mais inteligente que o do <command>apt-get</command> e sua interface muito mais fácil de entender.

source: The <command>aptitude</command> package manager
de_de: Das <command>aptitude</command> Paketverwaltungsprogramm
ja_jp: <command>aptitude</command> パッケージマネージャ
pl_pl: Menedżer pakietów <command>aptitude</command>
pt_br: O gerenciador de pacotes <command>aptitude</command>

source: When it starts, <command>aptitude</command> shows a list of packages sorted by state (installed, non-installed, or installed but not available on the mirrors — other sections display tasks, virtual packages, and new packages that appeared recently on mirrors). To facilitate thematic browsing, other views are available. In all cases, <command>aptitude</command> displays a list combining categories and packages on the screen. Categories are organized through a tree structure, whose branches can respectively be unfolded or closed with the <keycombo><keycap>Enter</keycap></keycombo>, <keycombo><keycap>[</keycap></keycombo> and <keycombo><keycap>]</keycap></keycombo> keys. <keycombo><keycap>+</keycap></keycombo> should be used to mark a package for installation, <keycombo><keycap>-</keycap></keycombo> to mark it for removal and <keycombo><keycap>_</keycap></keycombo> to purge it (note than these keys can also be used for categories, in which case the corresponding actions will be applied to all the packages of the category). <keycombo><keycap>u</keycap></keycombo> updates the lists of available packages and <keycombo action="simul"><keycap>Shift</keycap><keycap>u</keycap></keycombo> prepares a global system upgrade. <keycombo><keycap>g</keycap></keycombo> switches to a summary view of the requested changes (and typing <keycombo><keycap>g</keycap></keycombo> again will apply the changes), and <keycombo><keycap>q</keycap></keycombo> quits the current view. If you are in the initial view, this will effectively close <command>aptitude</command>.
de_de: Nach dem Start zeigt <command>aptitude</command> eine Paketliste, sortiert nach Status (installiert, nicht installiert, installiert aber nicht auf den Spiegelservern verfügbar, andere Anzeigeoptionen, virtuelle Pakete und neue Pakete, die kürzlich auf den Spiegelservern entdeckt wurden). Sie können verschiedene Ansichten nutzen, um die Liste thematisch zu durchsuchen. In jedem Fall zeigt <command>aptitude</command> eine Liste, die Kategorien und Pakete kombiniert. Kategorien sind in einer Baumstruktur organisiert, deren Äste mit den Tastenkombinationen <keycombo><keycap>Eingabe</keycap></keycombo>, <keycombo><keycap>[</keycap></keycombo> und <keycombo><keycap>]</keycap></keycombo> auf- und zugeklappt werden können. <keycombo><keycap>+</keycap></keycombo> wählt ein Paket zur Installation aus, <keycombo><keycap>-</keycap></keycombo> wählt es zum Entfernen aus und <keycombo><keycap>_</keycap></keycombo> zum vollständigen Löschen (Hinweis: Diese Tastenkombinationen können auch auf Kategorien angewendet werden, wobei die jeweilige Aktion dann auf alle Pakete der Kategorie angewendet wird). <keycombo><keycap>u</keycap></keycombo> aktualisiert die Liste der verfügbaren Pakete und <keycombo action="simul"><keycap>Shift</keycap><keycap>u</keycap></keycombo> bereitet eine globale Systemaktualisierung vor. <keycombo><keycap>g</keycap></keycombo> wechselt in eine Übersicht der anstehenden Änderungen (ein weiterer Druck auf <keycombo><keycap>g</keycap></keycombo> führt die Änderungen durch) und <keycombo><keycap>q</keycap></keycombo> beendet die aktuelle Ansicht. Wenn Sie dies in der initialen Ansicht tun, beendet dies <command>aptitude</command>.
ja_jp: <command>aptitude</command> は起動すると、状態 (インストール済み、未インストール、インストール済みだがミラーから利用不可 - 他のセクションでタスク、仮想パッケージ、最近ミラーに登場した新しいパッケージを表示します。) ごとに分類したパッケージのリストを表示します。テーマ別のパッケージリストを簡便に閲覧できるビューも用意されています。すべての場合について、<command>aptitude</command> はカテゴリとパッケージを併せたリストを画面に表示します。カテゴリは木構造を使って系統付けられ、木構造の枝は <keycombo><keycap>Enter</keycap></keycombo>、<keycombo><keycap>[</keycap></keycombo>、<keycombo><keycap>]</keycap></keycombo> キーで開けたり閉じたりする事ができます。<keycombo><keycap>+</keycap></keycombo> はインストールマーク、<keycombo><keycap>-</keycap></keycombo> は削除マーク、<keycombo><keycap>_</keycap></keycombo> は完全消去マークをパッケージに対して付加するのに使われます (これらのキーはカテゴリに対しても使えることに注意してください。この場合、カテゴリ内のすべてのパッケージに対して対応する操作を行います)。<keycombo><keycap>u</keycap></keycombo> は利用可能なパッケージのリストを更新、<keycombo action="simul"><keycap>Shift</keycap><keycap>u</keycap></keycombo> はグローバルシステムのアップグレードを準備します。<keycombo><keycap>g</keycap></keycombo> は要求された変更の要約ビューに切り替えます (再度 <keycombo><keycap>g</keycap></keycombo> を打てば変更を適用します)。<keycombo><keycap>q</keycap></keycombo> は現在のビューを終了します。最初のビューにいるなら、<command>aptitude</command> を閉じます。
pl_pl: Po uruchomieniu <command>aptitude</command> pokazuje listę pakietów posortowaną według stanu (zainstalowane, niezainstalowane lub zainstalowane, ale niedostępne na serwerach lustrzanych — inne sekcje wyświetlają zadania, wirtualne pakiety i nowe pakiety, które niedawno pojawiły się na serwerach lustrzanych). W celu ułatwienia przeglądania tematycznego dostępne są inne widoki. We wszystkich przypadkach <command>aptitude</command> wyświetla na ekranie listę łączącą kategorie i pakiety. Kategorie są zorganizowane w strukturę drzewa, którego gałęzie mogą być odpowiednio rozwijane i zamykane za pomocą klawiszy <keycombo><keycap>Enter</keycap></keycombo>, <keycombo><keycap>[</keycap></keycombo> i <keycombo><keycap>]</keycap></keycombo>. <keycombo><keycap>+</keycap></keycombo> jest używany do oznaczania pakietów do instalacji, <keycombo><keycap>-</keycap></keycombo> do usunięcia, a <keycombo><keycap>_</keycap></keycombo> do całkowitej likwidacji (zauważ, że można ich również używać w stosunku do kategorii, wtedy odpowiednie akcje zostaną zastosowane do wszystkich pakietów danej kategorii). <keycombo><keycap>u</keycap></keycombo> pozwala zaktualizować listę dostępnych pakietów, a <keycombo action="simul"><keycap>Shift</keycap><keycap>u</keycap></keycombo> przygotowuje całkowite uaktualnienie systemu. <keycombo><keycap>g</keycap></keycombo> przełącza do widoku podsumowania żądanych zmian (ponowne wpisanie <keycombo><keycap>g</keycap></keycombo> zatwierdza zmiany), a <keycombo><keycap>q</keycap></keycombo> zamyka aktualny widok. Użycie go w przypadku początkowego widoku spowoduje zamknięcie <command>aptitude</command>.
pt_br: Quando o <command>aptitude</command> começa, ele mostra uma lista de pacotes ordenada por estado (instalado, não-instalado ou instalado mas não disponível nos espelhos — outras seções mostram tarefas, pacotes virtuais e novos pacotes que apareceram recentemente nos espelhos). Para facilitar a navegação temática, outras visões estão disponíveis. Em todos os casos, o <command>aptitude</command> mostra uma lista combinando categorias e pacotes na tela. Categorias são organizadas através de uma estrutura de árvore, cujos ramos podem respectivamente ser expandidos ou fechados com as teclas <keycombo><keycap>Enter</keycap></keycombo>, <keycombo><keycap>[</keycap></keycombo> ou <keycombo><keycap>]</keycap></keycombo>. <keycombo><keycap>+</keycap></keycombo> marca um pacote para instalação, <keycombo><keycap>-</keycap></keycombo> marca para remoção e <keycombo><keycap>_</keycap></keycombo> para expurgo (observe que estas teclas também podem ser usadas para categorias, e neste caso as ações correspondentes serão para todos os pacotes da categoria). <keycombo><keycap>u</keycap></keycombo> atualiza (update) as listas de pacotes disponíveis e <keycombo action="simul"><keycap>Shift</keycap><keycap>u</keycap></keycombo> prepara uma atualização de sistema global. <keycombo><keycap>g</keycap></keycombo> alterna para uma visão resumida das mudanças necessárias (e digitar <keycombo><keycap>g</keycap></keycombo> de novo vai realizar as mudanças), e <keycombo><keycap>q</keycap></keycombo> (quit) sai da visão atual. Se você já está na visão inicial, isto fecha o <command>aptitude</command>.

source: This section does not cover the finer details of using <command>aptitude</command>, it rather focuses on giving you a survival kit to use it. <command>aptitude</command> is rather well documented and we advise you to use its complete manual available in the <emphasis role="pkg">aptitude-doc-en</emphasis> package. <ulink type="block" url="file:///usr/share/doc/aptitude/html/en/index.html" />
de_de: Dieser Abschnitt beschäftigt sich nicht mit den Feinheiten der Benutzung von <command>aptitude</command>, stattdessen liegt der Schwerpunkt darin, Ihnen ein "Überlebenspaket" für dessen Benutzung an die Hand zu geben. <command>aptitude</command> ist ziemlich umfassend dokumentiert, deswegen legen wir Ihnen die Nutzung des umfassenden Handbuches, verfügbar unter <emphasis role="pkg">aptitude-doc-en</emphasis> package. <ulink type="block" url="file:///usr/share/doc/aptitude/html/en/index.html" />, ans Herz (Anm. d. Übers.: Aktuell leider nicht auf Deutsch verfügbar).
ja_jp: この節では <command>aptitude</command> の使い方をより詳しく述べません。この節ではこのプログラムを活用して生き残るための知恵を与えることに注力します。<command>aptitude</command> の文書は比較的詳しく書かれており、<emphasis role="pkg">aptitude-doc-en</emphasis> パッケージから利用可能なプログラムの完全なマニュアルを使う事をお勧めします。<ulink type="block" url="file:///usr/share/doc/aptitude/html/en/index.html" />
pl_pl: Ta sekcja nie opisuje szczegółów użytkowania <command>aptitude</command>, ale raczej skupia się na dostarczeniu minimum do przetrwania. <command>aptitude</command> posiada dość dobrą dokumentację i zalecane jest używanie jego pełnego podręcznika dostępnego w pakiecie <emphasis role="pkg">aptitude-doc-en</emphasis>. <ulink type="block" url="file:///usr/share/doc/aptitude/html/en/index.html" />
pt_br: Esta seção não cobre os detalhes mais sutis do uso do <command>aptitude</command>, ao invés disto ela se concentra em dar-lhe um kit de sobrevivência para usá-lo. <command>aptitude</command> é bastante bem documentado e aconselhamos que você use seu manual completo disponível no pacote <emphasis role="pkg">aptitude-doc-en</emphasis>. <ulink type="block" url="file:///usr/share/doc/aptitude/html/en/index.html" />

source: To search for a package, you can type <keycombo><keycap>/</keycap></keycombo> followed by a search pattern. This pattern matches the name of the package, but can also be applied to the description (if preceded by <literal>~d</literal>), to the section (with <literal>~s</literal>) or to other characteristics detailed in the documentation. The same patterns can filter the list of displayed packages: type the <keycombo><keycap>l</keycap></keycombo> key (as in <foreignphrase>limit</foreignphrase>) and enter the pattern.
de_de: Um nach einem Paket zu suchen, tippen Sie <keycombo><keycap>/</keycap></keycombo>, gefolgt von einem Suchmuster. Dieses Muster wird mit den Paketnamen verglichen, kann aber auch auf die Beschreibung angewendet werden (durch ein vorangestelltes <literal>~d</literal>), auf den Bereich (durch ein vorangestelltes <literal>~s</literal>) oder auf ein anderes Kriterium, wie in der Dokumentation genauer beschrieben. Mit den gleichen Mustern können Sie die Liste der angezeigten Pakete filtern: Drücken Sie die <keycombo><keycap>l</keycap></keycombo>-Taste (wie in <foreignphrase>limit</foreignphrase>) und geben Sie das Muster ein.
ja_jp: パッケージを検索するには、<keycombo><keycap>/</keycap></keycombo> を押して、検索パターンを入力してください。このパターンはパッケージの名前にマッチしますが、(<literal>~d</literal>を先頭に付けた場合) 説明、(<literal>~s</literal>) セクション、その他の特性にもマッチします。これは文書中で詳しく説明されています。同じパターンを表示されたパッケージのリストから抽出するためにも使えます: <keycombo><keycap>l</keycap></keycombo> キーを押して (<foreignphrase>limit</foreignphrase> の意味) パターンを入力してください。
pl_pl: W celu wyszukania pakietu należy wpisać <keycombo><keycap>/</keycap></keycombo>, a następnie wyszukiwany wzorzec. Wzorzec zostanie dopasowany do nazwy pakietu, ale poprzedzając go <literal>~d</literal> zostanie zastosowany również do opisu, natomiast używając <literal>~s</literal> do sekcji, wyszukiwanie innych cech zostało szerzej opisane w dokumentacji. Te same wzorce mogą być też używane do filtrowania listy wyświetlanych pakietów: należy wprowadzić literę <keycombo><keycap>l</keycap></keycombo> (jako <foreignphrase>limit</foreignphrase>), a następnie szukany wzorzec.
pt_br: Para buscar por um pacote, você pode digitar <keycombo><keycap>/</keycap></keycombo> seguido pelo padrão de busca. Este padrão pode coincidir com o nome do pacote, mas também pode ser aplicado à descrição (se precedido por <literal>~d</literal>), à seção (com <literal>~s</literal>) ou a outras características detalhadas na documentação. Os mesmos padrões podem filtrar a lista de pacotes exibidos: digite a tecla <keycombo><keycap>l</keycap></keycombo> (de <foreignphrase>limit</foreignphrase>) e digite o padrão.

source: Managing the “automatic flag” of Debian packages (see <xref linkend="sect.automatic-tracking" />) is a breeze with <command>aptitude</command>. It is possible to browse the list of installed packages and mark packages as automatic with <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo> or to remove the mark with the <keycombo><keycap>m</keycap></keycombo> key. “Automatic packages” are tagged with an “A” in the list of packages. This feature also offers a simple way to visualize the packages in use on a machine, without all the libraries and dependencies that you don't really care about. The related pattern that can be used with <keycombo><keycap>l</keycap></keycombo> (to activate the filter mode) is <literal>~i!~M</literal>. It specifies that you only want to see installed packages (<literal>~i</literal>) not marked as automatic (<literal>!~M</literal>).
ja_jp: Debian パッケージの「自動フラグ」の管理 (<xref linkend="sect.automatic-tracking" />参照) は <command>aptitude</command> を使えば簡単にできます。インストール済みパッケージのリストを閲覧し、<keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo> キーでパッケージに自動マークを付けるかまたは <keycombo><keycap>m</keycap></keycombo> キーでそのマークを消すする事が可能です。「自動パッケージ」はパッケージリストでは「A」でタグ付けされています。この機能はまた、全く関心の無いライブラリと依存関係を除外して、マシンで利用されているパッケージを可視化する単純な方法を提供します。<keycombo><keycap>l</keycap></keycombo> (フィルタモードを有効化する) と一緒に使える関連パターンは <literal>~i!~M</literal> です。これは、インストール済みパッケージを (<literal>~i</literal>) 見たいけれど自動パッケージとしてマークされたパッケージを見たくない (<literal>!~M</literal>) という事を意味しています。
pl_pl: Zarządzanie "flagami automatyczności" pakietów Debiana (spójrz na fiszkę <xref linkend="sect.automatic-tracking" />) z użyciem <command>aptitude</command> jest błahostką. Podczas przeglądania listy zainstalowanych pakietów można je zaznaczyć jako automatyczne używając <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo> albo usunąć znacznik używając <keycombo><keycap>m</keycap></keycombo>. "Automatyczne pakiety" na liście pakietów posiadają etykietę "A". Dzięki temu można w łatwy sposób przeglądać używane pakiety, pomijając wszystkie biblioteki i zależności, które nie są przedmiotem zainteresowania. Wspomniany wzorzec, używany z <keycombo><keycap>l</keycap></keycombo> (w celu wejścia w tryb filtrowania) to <literal>~i!~M</literal>. Wyszczególnia on tylko zainstalowane pakiety (<literal>~i</literal>), które nie są zaznaczone jako automatyczne (<literal>!~M</literal>).

source: <emphasis>TOOL</emphasis> Using <command>aptitude</command> on the command-line interface
de_de: <emphasis>PROGRAMM</emphasis> <command>aptitude</command> auf der Befehlszeile nutzen
ja_jp: <emphasis>TOOL</emphasis> コマンドラインインターフェースで <command>aptitude</command> を使う
pl_pl: <emphasis>NARZĘDZIE</emphasis> Używanie <command>aptitude</command> w linii komend
pt_br: <emphasis>FERRAMENTA</emphasis> Usando <command>aptitude</command> na interface de linha de comando
