Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: Let's take the example of another package whose version 2 has been installed from <emphasis role="distribution">Testing</emphasis>. Version 1 is available in <emphasis role="distribution">Stable</emphasis> and version 3 in <emphasis role="distribution">Unstable</emphasis>. Version 1 (of priority 990 — thus lower than 1000) is discarded because it is lower than the installed version. This only leaves version 2 and 3, both of priority 500. Faced with this alternative, APT selects the newest version, the one from <emphasis role="distribution">Unstable</emphasis>.If you don't want a package installed from <emphasis role="distribution">Testing</emphasis> to migrate to <emphasis role="distribution">Unstable</emphasis>, you have to assign a priority lower than 500 (490 for example) to packages coming from <emphasis role="distribution">Unstable</emphasis>. You can modify <filename>/etc/apt/preferences</filename> to this effect:
de_de: Nehmen wir ein anderes Beispiel: Die Version 2 eines Pakets wurde aus <emphasis role="distribution">Testing</emphasis> installiert. Version 1 ist in <emphasis role="distribution">Stable</emphasis> verfügbar und Version 3 in <emphasis role="distribution">Unstable</emphasis>. Version 1 (mit der Priorität 990 – also niedriger als 1000) wird verworfen, da die Versionsnummer geringer als die der installierten Version ist. Bleiben nur Version 2 und 3, beide mit einer Priorität von 500. Mit dieser Alternative konfrontiert, wählt APT die neueste Version aus, die Version aus <emphasis role="distribution">Unstable</emphasis>. Wenn Sie nicht wollen, das ein installiertes Paket aus <emphasis role="distribution">Testing</emphasis> nach <emphasis role="distribution">Unstable</emphasis> migriert, müssen Sie Paketen aus <emphasis role="distribution">Unstable</emphasis> eine Priorität kleiner als 500 (490 zum Beispiel) zuweisen. Dazu können Sie <filename>/etc/apt/preferences</filename> anpassen:
ja_jp: <emphasis role="distribution">テスト版</emphasis>から提供されるバージョン 2 がインストール済みの場合について見てみましょう。<emphasis role="distribution">安定版</emphasis>から提供されるバージョン 1 と<emphasis role="distribution">不安定版</emphasis>から提供されるバージョン 3 が利用可能です。バージョン 1 (優先度は 1000 より低く 990) は、インストール済みバージョンよりもバージョンが低いため、無視されます。残るのはバージョン 2 か 3 ですが、両方の優先度は 500 です。優先度をが同じ場合、APT は最も新しいバージョン、<emphasis role="distribution">不安定版</emphasis>から提供されるバージョン、を選択します。<emphasis role="distribution">テスト版</emphasis>から提供されたインストール済みバージョンを<emphasis role="distribution">不安定版</emphasis>から提供されるバージョンに移行したくない場合、<emphasis role="distribution">不安定版</emphasis>から提供されるバージョンに 500 よりも低い優先度 (例えば 490 など) を割り当てないといけません。これを行うには、<filename>/etc/apt/preferences</filename> を以下のように修正してください:
pl_pl: Weźmy teraz przykład innego pakietu, który jest w wersji 2 i został zainstalowany z <emphasis role="distribution">Testowego</emphasis>. Wersja 1 jest dostępna w <emphasis role="distribution">Stabilnym</emphasis>, a wersja 3 w <emphasis role="distribution">Niestabilnym</emphasis>. Wersja 1 (mająca priorytet 990 — nadal mniejsza niż 1000) jest pominięta, ponieważ jest mniejsza niż aktualnie zainstalowana. W związku z tym zostają wersje 2 i 3, obie z priorytetem 500. Postawiony przed takim wyborem, APT wybierze nowszą wersję, tą z <emphasis role="distribution">Niestabilnego</emphasis>. Jeżeli nie jest pożądane, aby pakiet zainstalowany z <emphasis role="distribution">Testowego</emphasis> został przeniesiony do <emphasis role="distribution">Niestabilnego</emphasis>, należy przypisać priorytet niższy niż 500 (na przykład 490) pakietom pochodzącym z <emphasis role="distribution">Niestabilnego</emphasis>. W celu uzyskania tego efektu można zmodyfikować plik <filename>/etc/apt/preferences</filename>:
pt_br: Tomemos o exemplo de outro pacote cuja versão 2 foi instalada da <emphasis role="distribution">Testing</emphasis>. A versão 1 está disponível na <emphasis role="distribution">Stable</emphasis> e a versão 3 na <emphasis role="distribution">Unstable</emphasis>. A versão 1 (de prioridade 990 — logo, menor que 1000) é descartada pois é menor que a versão instalada. Sobram apenas as versões 2 e 3, ambas de prioridade 500. Perante esta alternativa, o APT seleciona a versão mais nova, aquela da <emphasis role="distribution">Unstable</emphasis>. Se você não quer que um pacote instalado da <emphasis role="distribution">Testing</emphasis> migre para a <emphasis role="distribution">Unstable</emphasis>, você terá que atribuir uma prioridade menor que 500 (490 por exemplo) para pacotes vindo da <emphasis role="distribution">Unstable</emphasis>. Você pode modificar o <filename>/etc/apt/preferences</filename> para obter este efeito:

source: Tracking Automatically Installed Packages
de_de: Automatisch installierte Pakete nachverfolgen
ja_jp: 自動的にインストールされたパッケージの追跡
pl_pl: Śledzenie Automatycznie Zainstalowanych Pakietów
pt_br: Rastreando Pacotes Instalados Automaticamente

source: One of the essential functionalities of <command>apt-get</command> (which was initially specific to <command>aptitude</command>) is the tracking of packages installed only through dependencies. These packages are called “automatic”, and often include libraries for instance.
ja_jp: <command>apt-get</command> の本質的な機能の 1 つに、依存関係によってのみインストールされたパッケージの追跡があります (当初これは <command>aptitude</command> に固有の機能でした)。これらのパッケージは「自動」と呼ばれ、例えばライブラリなどがその一例です。
pl_pl: Jedną z podstawowych funkcjonalności <command>apt-get</command> (początkowo jedynie w <command>aptitude</command>) jest śledzenie pakietów zainstalowanych tylko jako zależności. Te pakiety są nazywane "automatycznymi" i zawierają na przykład biblioteki.

source: With this information, when packages are removed, the package managers can compute a list of automatic packages that are no longer needed (because there's no “manually installed” packages depending on them). <command>apt-get autoremove</command> will get rid of those packages. <command>aptitude</command> does not have this command because it removes them automatically as soon as they are identified. Both programs include a clear message listing the affected packages.
ja_jp: あるパッケージを削除する際に、パッケージマネージャは、この追跡情報を元に、もはや不要になった自動パッケージ (「手作業でインストール」されていないパッケージ) を選び出す事ができる。不要になった自動パッケージを削除するには <command>apt-get autoremove</command> を使います。<command>aptitude</command> にはこのコマンドがありませんが、これは不要な自動パッケージは見つかり次第自動的に削除されるからです。どちらのプログラムでも、不要になったパッケージは分かりやすく表示されます。
pl_pl: Posiadając tą informację, po usunięciu pakietów, zarządcy pakietów mogą wyznaczyć listę automatycznych pakietów, które nie są już potrzebne (ponieważ nie ma już "ręcznie zainstalowanych" pakietów, które ich wymagają). <command>apt-get autoremove</command> służy do pozbycia się tych pakietów. <command>aptitude</command> nie posiada odpowiednika tej komendy, ponieważ usuwa je automatycznie jak tylko zostaną wykryte. Oba programy pokazują wiadomość z listą pakietów, których to dotyczy.

source: It is a good habit to mark as automatic any package that you don't need directly so that they are automatically removed when they aren't necessary anymore. <command>apt-mark auto <replaceable>package</replaceable></command> will mark the given package as automatic whereas <command>apt-mark manual <replaceable>package</replaceable></command> does the opposite. <command>aptitude markauto</command> and <command>aptitude unmarkauto</command> work in the same way although they offer more features for marking many packages at once (see <xref linkend="sect.aptitude" />). The console-based interactive interface of <command>aptitude</command> also makes it easy to review the “automatic flag” on many packages.
ja_jp: 直接的に使うわけではないパッケージを自動パッケージとしてマークするのは良い癖です。こうすれば、そのパッケージがいらなくなった時に自動的に削除されます。<command>apt-mark auto <replaceable>package</replaceable></command> はパッケージを自動パッケージとしてマークし、逆に <command>apt-mark manual <replaceable>package</replaceable></command> は手動パッケージとしてマークします。<command>aptitude markauto</command> と <command>aptitude unmarkauto</command> は同様に動きますが、多くのパッケージを同時にマークする機能を持っています (<xref linkend="sect.aptitude" />参照)。<command>aptitude</command> のコンソールベース対話型インターフェースを使うと、多くのパッケージの「自動パッケージフラグ」を容易に確認できます。
pl_pl: Dobrym nawykiem jest zaznaczanie jako automatycznych tych pakietów, które nie są bezpośrednio wymagane, dzięki czemu są one automatycznie usuwane w momencie, kiedy nie są już potrzebne. <command>apt-mark auto <replaceable>pakiet</replaceable></command> zaznaczy pakiet jako automatyczny, podczas gdy <command>apt-mark manual <replaceable>pakiet</replaceable></command> działa przeciwnie. <command>aptitude markauto</command> i <command>aptitude unmarkauto</command> działają w ten sam sposób, niemniej jednak oferują więcej możliwości zaznaczania wielu pakietów naraz (patrz <xref linkend="sect.aptitude" />). Interaktywny, konsolowy interfejs <command>aptitude</command> również pozwala na łatwy przegląd "flag automatyczności" wielu pakietów.

source: People might want to know why an automatically installed package is present on the system. To get this information from the command line, you can use <command>aptitude why <replaceable>package</replaceable></command> (<command>apt-get</command> has no similar feature):
ja_jp: 自動的にインストールされたパッケージがシステムに存在する理由を知りたい場合があるかもしれません。この情報をコマンドラインから得るには、<command>aptitude why <replaceable>package</replaceable></command> を使ってください (<command>apt-get</command> に同様の機能はありません):
pl_pl: Niektórzy mogą być ciekawi, dlaczego pewien automatycznie zainstalowany pakiet jest obecny w systemie. W celu uzyskania tej informacji w linii komend można użyć <command>aptitude why <replaceable>pakiet</replaceable></command> (<command>apt-get</command> nie posiada analogicznej opcji):

source: $ <userinput>aptitude why python-debian</userinput> i aptitude Recommends apt-xapian-index i A apt-xapian-index Depends python-debian (&gt;= 0.1.15)
ja_jp: $ <userinput>aptitude why python-debian</userinput> i aptitude 推奨 apt-xapian-index i A apt-xapian-index 依存 python-debian (&gt;= 0.1.15)
pl_pl: $ <userinput>aptitude why python-debian</userinput> i aptitude Poleca apt-xapian-index i A apt-xapian-index Wymaga python-debian (&gt;= 0.1.15)

source: <emphasis>ALTERNATIVE</emphasis> <command>deborphan</command> and <command>debfoster</command>
de_de: <emphasis>ALTERNATIVE</emphasis> <command>deborphan</command> und <command>debfoster</command>
ja_jp: <emphasis>ALTERNATIVE</emphasis> <command>deborphan</command> と <command>debfoster</command>
pl_pl: <emphasis>ALTERNATYWA</emphasis> <command>deborphan</command> i <command>debfoster</command>
pt_br: <emphasis>ALTERNATIVA</emphasis> <command>deborphan</command> e <command>debfoster</command>

source: In days where <command>apt-get</command> and <command>aptitude</command> were not able to track automatic packages, there were two utilities producing lists of unnecessary packages: <command>deborphan</command> and <command>debfoster</command>.
ja_jp: <command>apt-get</command> や <command>aptitude</command> にまだ自動パッケージを追跡する機能が無かった時代、不要なパッケージをリストアップするユーティリティが 2 つありました: <command>deborphan</command> と <command>debfoster</command> です。
pl_pl: W czasach, kiedy komendy <command>apt-get</command> i <command>aptitude</command> nie były w stanie śledzić automatycznych pakietów, istniały dwa narzędzia służące do tworzenia list niepotrzebnych pakietów: <command>deborphan</command> i <command>debfoster</command>.

source: <command>deborphan</command> is the most rudimentary of both. It simply scans the <literal>libs</literal> and <literal>oldlibs</literal> sections (in the absence of supplementary instructions) looking for the packages that are currently installed and that no other packages depends on. The resulting list can then serve as a basis to remove unneeded packages.
de_de: <command>deborphan</command> ist das rudimentärere von beiden. Es durchsucht die <literal>libs</literal> und <literal>oldlibs</literal> Bereiche (in Abwesenheit weiterer Anweisungen) nach Paketen, aktuell installiert sind aber von keinem anderen Paket benötigt werden. Die zurückgelieferte Liste kann dann als Basis für das Entfernen nicht benötigter Pakete dienen.
ja_jp: <command>deborphan</command> はもう一方と比べれば基礎的なツールです。これは単純に (他に指示の無い限り) <literal>libs</literal> と <literal>oldlibs</literal> セクションを調べ、現在インストール済みで他のパッケージから必要とされていないパッケージを探します。この結果は必要無いパッケージを削除するための手引になります。
pl_pl: <command>deborphan</command> jest najbardziej podstawowe. Zwyczajnie skanuje sekcje <literal>libs</literal> i <literal>oldlibs</literal> (z braku dopełniających instrukcji) szukając aktualnie zainstalowanych pakietów, od których nie są zależne inne pakiety. Stworzona w ten sposób lista może służyć jako punkt wyjścia do usunięcia niepotrzebnych pakietów.
pt_br: <command>deborphan</command> é o mais rudimentar dos dois. Ele simplesmente varre as seções <literal>libs</literal> e <literal>oldlibs</literal> (na ausência de instruções complementares) procurando por pacotes instalados dos quais ninguém depende. A lista resultante pode servir como uma base para remover pacotes desnecessários.

source: <command>debfoster</command> has a more elaborate approach, very similar to APT's one: it maintains a list of packages that have been explicitly installed, and remembers what packages are really required between each invocation. If new packages appear on the system and if <command>debfoster</command> doesn't know them as required packages, they will be shown on the screen together with a list of their dependencies. The program then offers a choice: remove the package (possibly together with those that depend on it), mark it as explicitly required, or ignore it temporarily.
ja_jp: <command>debfoster</command> は APT とよく似たより複雑なアプローチを取ります: このプログラムは明示的にインストールされたパッケージのリストを保存し、毎回起動される度に本当に必要なパッケージを記録します。<command>debfoster</command> が新しいパッケージをシステムに検出し、そのパッケージが必要か判らなかった場合、そのパッケージを依存関係のリストと一緒に画面に表示します。そして、選択肢を表示します: パッケージを削除する (そのパッケージが依存するパッケージも一緒に削除するかもしれません)、明示的に必要とマークする、一時的にこれを無視する。
pl_pl: <command>debfoster</command> stosuje bardziej złożone podejście, bardzo podobne do APTa: zarządza listą pakietów, które zostały bezpośrednio zainstalowane i zapamiętuje pakiety, które są naprawdę wymagane pomiędzy kolejnymi wywołaniami. Jeżeli w systemie pojawią się nowe pakiety i <command>debfoster</command> nie rozpozna ich jako wymagane pakiety, to zostaną wyświetlone na ekranie razem z listą ich zależności. W takiej sytuacji program oferuje wybór: usunięcie pakietu (prawdopodobnie razem z pakietem, który od niego zależy), oznaczenie go jako bezpośrednio wymagany lub tymczasowe zignorowanie.

source: The <command>apt-cache</command> Command
de_de: Der Befehl <command>apt-cache</command>
ja_jp: <command>apt-cache</command> コマンド
pl_pl: Komenda <command>apt-cache</command>
pt_br: O Comando <command>apt-cache</command>

source: <primary>APT</primary><secondary>package search</secondary>
de_de: <primary>APT</primary><secondary>Paketsuche</secondary>
ja_jp: <primary>APT</primary><secondary>パッケージ検索</secondary>
pt_br: <primary>APT</primary><secondary>buscador de pacotes</secondary>

source: <primary>APT</primary><secondary>header display</secondary>
de_de: <primary>APT</primary><secondary>Kopfzeilen anzeigen</secondary>
ja_jp: <primary>APT</primary><secondary>ヘッダ表示</secondary>
pt_br: <primary>APT</primary><secondary>exibição de cabeçalho</secondary>

source: <primary>search of packages</primary>
de_de: <primary>Pakete suchen</primary>
ja_jp: <primary>パッケージの検索</primary>
pt_br: <primary>busca de pacotes</primary>

source: <primary>package</primary><secondary>search</secondary>
de_de: <primary>Paket</primary><secondary>Suche</secondary>
ja_jp: <primary>パッケージ</primary><secondary>検索</secondary>
pt_br: <primary>pacote</primary><secondary>busca</secondary>

source: The <command>apt-cache</command> command can display much of the information stored in APT's internal database. This information is a sort of cache since it is gathered from the different sources listed in the <filename>sources.list</filename> file. This happens during the <command>apt-get update</command> operation.
ja_jp: <command>apt-cache</command> コマンドは APT の内部データベースに保存された情報の多くを表示できます。この情報は一種のキャッシュのようなもので、<filename>sources.list</filename> ファイル内の様々なソースから収集されます。収集は <command>apt-get update</command> の実行毎に行われます。
pl_pl: Komenda <command>apt-cache</command> posiada możliwość wyświetlenia wielu informacji z wewnętrznej bazy APTa. Informacje te są rodzajem pamięci podręcznej, ponieważ są zebrane z różnych źródeł zawartych w pliku <filename>sources.list</filename>. Operacja ta wykonywana jest podczas <command>apt-get update</command>.

source: <emphasis>VOCABULARY</emphasis> Cache
de_de: <emphasis>WÖRTERVERZEICHNIS</emphasis> Cache
ja_jp: <emphasis>VOCABULARY</emphasis> キャッシュ
pl_pl: <emphasis>SŁOWNIK</emphasis> Pamięć podręczna
pt_br: <emphasis>VOCABULÁRIO</emphasis> Cache

source: A cache is a temporary storage system used to speed up frequent data access when the usual access method is expensive (performance-wise). This concept can be applied in numerous situations and at different scales, from the core of microprocessors up to high-end storage systems.
de_de: Ein Cache (Zwischenspeicher) ist ein temporäres Speichersystem, das benutzt wird, um den Zugriff auf häufig genutzte Daten zu beschleunigen, wenn die üblichen Zugriffsmethoden sehr zeitaufwendig sind. Dieses Konzept kann auf vielfältige Situationen und in unterschiedlichen Dimensionen angewendet werden, vom Mikroprozessorkern bis zum High-End Speichersystem.
ja_jp: キャッシュとは (パフォーマンスの観点から) 通常のアクセス方法が高くつく場合に、頻繁なデータアクセスを高速化する目的で使われれる一時的な保存システムです。この概念は、数多くの状況と異なる規模に対して、例えばマイクロプロセッサのコアや高性能のストレージシステムにさえも、応用できます。
pl_pl: Pamięć podręczna jest rodzajem tymczasowego systemu magazynowania używanym w celu przyspieszenia dostępu do często używanych danych, podczas gdy zwykłe sposoby dostępu są kosztowne (wydajnościowo). Ten sposób może być stosowany w wielu sytuacjach i na różną skalę, od rdzeni mikroprocesorów do zaawansowanych systemów magazynowania.
pt_br: O cache é um sistema de armazenamento temporário usado para acelerar o acesso frequente de dados quando o método de acesso habitual é caro (em termos de performance). Este conceito pode ser aplicado em diversas situações e em diferentes escalas, desde o núcleo de microprocessadores até sistemas de armazenamento de alta qualidade.

source: In the case of APT, the reference <filename>Packages</filename> files are those located on Debian mirrors. That said, it would be very ineffective to go through the network for every search that we might want to do in the database of available packages. That is why APT stores a copy of those files (in <filename>/var/lib/apt/lists/</filename>) and searches are done within those local files. Similarly, <filename>/var/cache/apt/archives/</filename> contains a cache of already downloaded packages to avoid downloading them again if you need to reinstall them after a removal.
de_de: Im Falle von APT sind die Referenz-<filename>Packages</filename> Dateien diejenigen, die auf den Debian Spiegelservern liegen. Nichtsdestoweniger wäre es sehr uneffektiv, bei jeder Suche in der Datenbank verfügbarer Pakete über das Netzwerk zu gehen. Darum hält APT lokale Kopien dieser Dateien (in <filename>/var/lib/apt/lists/</filename>) vor, und führt eine Suche in diesen lokalen Dateien durch. Entsprechend enthält <filename>/var/cache/apt/archives/</filename> einen Zwischenspeicher von bereits heruntergeladenen Paketen, damit diese nicht noch einmal heruntergeladen werden müssen, falls sie nach einer Deinstallation erneut installiert werden sollen.
ja_jp: APT の場合、基準になる <filename>Packages</filename> ファイルは Debian ミラーから提供されます。ですから、利用可能なパッケージのデータベース内を検索する際に、毎回ネットワークを使うのはとても非効率的です。このため、APT は (<filename>/var/lib/apt/lists/</filename> に) データベースのコピーを保存し、このコピーを使って検索します。同様に、<filename>/var/cache/apt/archives/</filename> にはこれまでにダウンロードしたパッケージのキャッシュを保存しています。これは削除後の再インストール時に同じファイルをダウンロードするのを避けるためです。
pl_pl: W przypadku APTa, referencyjne pliki <filename>Packages</filename> to te znajdujące się na serwerach lustrzanych Debiana. W związku z tym byłoby bardzo nieefektywne, aby przy każdym wyszukiwaniu wykorzystywać sieć do przeszukiwania bazy danych dostępnych pakietów. Właśnie dlatego APT przechowuje kopię tych plików (w <filename>/var/lib/apt/lists/</filename>) i wyszukiwania są wykonywane na tych lokalnych plikach. Podobnie, <filename>/var/cache/apt/archives/</filename> zawiera pamięć podręczną już pobranych pakietów, aby uniknąć ich ponownego pobierania w celu reinstalacji po usunięciu.
pt_br: No caso do APT, os arquivos <filename>Packages</filename> de referência são localizados nos espelhos Debian. Ou seja, será bastante ineficaz passar pela rede a cada busca que quisermos fazer no banco de dados de pacotes disponíveis. É por isto que o APT armazena uma cópia destes arquivos (em <filename>/var/lib/apt/lists/</filename>) e buscas são feitas neles. Similarmente, <filename>/var/cache/apt/archives/</filename> contém um cache de pacotes já baixados para evitar baixá-los de novo se você precisar deles depois de uma remoção.

source: The <command>apt-cache</command> command can do keyword-based package searches with <command>apt-cache search <replaceable>keyword</replaceable></command>. It can also display the headers of the package's available versions with <command>apt-cache show <replaceable>package</replaceable></command>. This command provides the package's description, its dependencies, the name of its maintainer, etc. Note that <command>aptitude search</command> and <command>aptitude show</command> work in the same way.
ja_jp: <command>apt-cache</command> コマンドを <command>apt-cache search <replaceable>keyword</replaceable></command> のように使うことで、キーワードを元にパッケージを検索する事が可能です。さらに、<command>apt-cache show <replaceable>package</replaceable></command> のように使うことで、利用可能なバージョンのパッケージヘッダを表示する事も可能です。このコマンドで、パッケージの説明、依存関係、メンテナの名前などの情報が表示されます。また、<command>aptitude search</command> と <command>aptitude show</command> は同様の機能を持っている点に注意してください。
pl_pl: Komenda <command>apt-cache</command> potrafi wyszukiwać pakiety bazując na słowach kluczowych za pomocą <command>apt-cache search <replaceable>słowo_kluczowe</replaceable></command>. Może również wyświetlać nagłówki dostępnych pakietów za pomocą <command>apt-cache show <replaceable>pakiet</replaceable></command>. Komenda ta dostarcza opis pakietu, jego zależności, imię jego opiekuna, itd. Zauważ, że <command>aptitude search</command> i <command>aptitude show</command> działają w ten sam sposób.

source: <command>apt-cache search</command> is a very rudimentary tool, basically implementing <command>grep</command> on package's descriptions. It often returns too many results or none at all when you include too many keywords.
ja_jp: <command>apt-cache search</command> はとても基本的なツールで、簡単に言ってしまえばパッケージ説明の <command>grep</command> 実装です。その結果の数は通常多すぎるか、逆にキーワードが多すぎれば全く無いかのどちらかです。
pl_pl: <command>apt-cache search</command> jest bardzo prostym narzędziem, właściwie stosuje komendę <command>grep</command> dla opisu pakietu. Często zwraca zbyt wiele wyników albo wcale, jeżeli zostanie zawarte zbyt wiele słów kluczowych.
