Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: When an entire network of machines is configured to use the same remote server to download the same updated packages, any administrator knows that it would be beneficial to have an intermediate proxy acting as a network-local cache (see sidebar <xref linkend="sidebar.cache" />).
ja_jp: マシンのネットワーク全体で、同じ更新済みパッケージをダウンロードするために同じリモートサーバを使うよう設定されている場合、管理者はネットワークローカルキャッシュとして振る舞う中間プロキシを持つのは有益であると知っています (傍注<xref linkend="sidebar.cache" />参照)。
pl_pl: Kiedy cała sieć maszyn jest skonfigurowana, aby używać tego samego zdalnego serwera w celu pobierania tych samych zaktualizowanych pakiety, każdy administrator wie, że korzystnie byłoby mieć pośrednika działającego jako lokalna pamięć podręczna (spójrz na fiszkę <xref linkend="sidebar.cache" />).

source: You can configure APT to use a "standard" proxy (see <xref linkend="sect.apt-config" /> for the APT side, and <xref linkend="sect.http-ftp-proxy" /> for the proxy side), but the Debian ecosystem offers better options to solve this problem. The dedicated software presented in this section are smarter than a plain proxy cache because they can rely on the specific structure of APT repositories (for instance they know when individual files are obsolete or not, and thus adjust the time during which they are kept).
ja_jp: APT が「標準的な」プロキシを使うように設定する事も可能です (APT 側は <xref linkend="sect.apt-config" />、プロキシ側は <xref linkend="sect.http-ftp-proxy" /> を参照) が、Debian にはこの問題に対するより優れた選択肢が準備されています。この節で取り上げる専用ソフトウェアは単純なプロキシキャッシュよりも賢いです。なぜなら、このソフトウェアは APT リポジトリの特定の構造を頼りにする事ができるからです (例えば、個々のファイルが時代遅れになるタイミングがわかるので、ファイルを保存しておく時間を調整できます)。
pl_pl: Można skonfigurować APT, żeby używał "standardowego" pośrednika (spójrz na fiszkę <xref linkend="sect.apt-config" /> dotyczącą APTa i <xref linkend="sect.http-ftp-proxy" /> dotyczące pośrednika), ale ekosystem Debiana oferuje lepsze rozwiązania tego problemu. Przeznaczone do tego oprogramowanie, zaprezentowane w tej sekcji, jest lepsze od zwykłego pośrednika, ponieważ może używać specyficznej struktury repozytorium APTa (np.: wie, czy konkretne pliki są przestarzałe, czy nie i odpowiednio dopasowuje czas ich przetrzymywania).

source: <emphasis role="pkg">apt-cacher</emphasis> and <emphasis role="pkg">apt-cacher-ng</emphasis> work like usual proxy cache servers. APT's <filename>sources.list</filename> is left unchanged, but APT is configured to use them as proxy for outgoing requests.
ja_jp: <emphasis role="pkg">apt-cacher</emphasis> と <emphasis role="pkg">apt-cacher-ng</emphasis> は普通のプロキシキャッシュサーバのように振舞います。APT の <filename>sources.list</filename> を変える必要はありませんが、APT はそれらを外部リクエスト用のプロキシとして設定します。
pl_pl: <emphasis role="pkg">apt-cacher</emphasis> i <emphasis role="pkg">apt-cacher-ng</emphasis> działają jak zwykłe pośredniczące serwery buforowe. Plik <filename>sources.list</filename> nie jest zmieniany, ale APT jest skonfigurowany, aby używać ich jako pośredników dla wychodzących zapytań.

source: <emphasis role="pkg">approx</emphasis>, on the other hand, acts like an HTTP server that “mirrors” any number of remote repositories in its top-level URLs. The mapping between those top-level directories and the remote URLs of the repositories is stored in <filename>/etc/approx/approx.conf</filename>:
ja_jp: これに対して、<emphasis role="pkg">approx</emphasis> はトップレベル URL の下にある複数のリモートリポジトリを「ミラー」する HTTP サーバのように振舞います。トップレベルディレクトリとリモート URL の対応関係は <filename>/etc/approx/approx.conf</filename> に保存されています:
pl_pl: Z kolei <emphasis role="pkg">approx</emphasis> działa jako serwer HTTP odzwierciedlając dowolną liczbę zdalnych repozytoriów pod jego adresami URL najwyższego poziomu. Mapowanie pomiędzy tymi katalogami najwyższego poziomu, a zdalnymi URLami repozytoriów jest przechowywane w pliku <filename>/etc/approx/approx.conf</filename>:

source: <emphasis role="pkg">approx</emphasis> runs by default on port 9999 via inetd (see <xref linkend="sect.inetd" />) and requires the users to adjust their <filename>sources.list</filename> file to point to the approx server:
ja_jp: <emphasis role="pkg">approx</emphasis> のデフォルト設定では、inetd 経由で (<xref linkend="sect.inetd" />参照) 9999 番ポートを使います。ユーザは approx サーバを指すように <filename>sources.list</filename> ファイルを書き換えなければいけません。
pl_pl: <emphasis role="pkg">approx</emphasis> domyślnie działa na porcie 9999 przez inetd (spójrz na fiszkę <xref linkend="sect.inetd" />) i wymaga od użytkownika, aby dopasować plik <filename>sources.list</filename>, żeby wskazywał serwer approx:

source: <command>aptitude</command> and <command>apt-get</command> Commands
de_de: <command>aptitude</command> und <command>apt-get</command> Befehle
ja_jp: <command>aptitude</command> と <command>apt-get</command> コマンド
pl_pl: Komendy <command>aptitude</command> i <command>apt-get</command>
pt_br: Comandos <command>aptitude</command> e <command>apt-get</command>

source: APT is a vast project, whose original plans included a graphical interface. It is based on a library which contains the core application, and <command>apt-get</command> is the first front end — command-line based — which was developed within the project.
ja_jp: APT は巨大なプロジェクトで、当初の予定ではグラフィカルインターフェースを含んでいました。APT はライブラリに基づいており、ライブラリにはコアアプリケーションが含まれています。<command>apt-get</command> は最初のフロントエンド - コマンドラインベース - で、APT プロジェクト内で開発されました。
pl_pl: APT jest szeroko zakrojonym projektem, który w swoich planach zakładał interfejs graficzny. Bazuje na bibliotece, która zawiera rdzeń aplikacji, a <command>apt-get</command> jest pierwszym konsolowym front-endem stworzonym w ramach tego projektu.

source: Numerous other graphical interfaces then appeared as external projects: <command>synaptic</command>, <command>aptitude</command> (which includes both a text mode interface and a graphical one — even if not complete yet), <command>wajig</command>, etc. The most recommended interface, <command>apt-get</command>, is the one used during the installation of Debian, and the one that we will use in the examples given in this section. Note however that <command>aptitude</command>'s command-line syntax is very similar. When there are major differences between <command>apt-get</command> and <command>aptitude</command>, these differences will be detailed.
ja_jp: 外部プロジェクトから、数多くのグラフィカルインターフェースが生まれました: <command>synaptic</command>、<command>aptitude</command> (テキストとグラフィカルモードインターフェース - まだ完成していません- の両方を含んでいます)、<command>wajig</command> などです。最も推奨されるインターフェースは Debian のインストール中に使われる <command>apt-get</command> で、この節ではこれを例に使います。<command>aptitude</command> のコマンドライン構文はよく似ていることに注意してください。<command>apt-get</command> と <command>aptitude</command> に大きな違いがある場合は、違いを詳しく述べます。
pl_pl: Później pojawiło się wiele innych interfejsów graficznych tworzonych jako zewnętrzne projekty: <command>synaptic</command>, <command>aptitude</command> (który zawiera zarówno interfejs konsolowy i graficzny — nawet jeżeli jeszcze nie w pełni kompletny), <command>wajig</command>, etc. Najczęściej polecanym interfejsem, <command>apt-get</command>, jest ten używany podczas instalacji Debiana, który będzie również używany w przykładach poniższej sekcji. Zauważ jednak, że konsolowa składnia <command>aptitude</command> jest bardzo podobna. Miejsca, gdzie występują znaczące różnice pomiędzy <command>apt-get</command> i <command>aptitude</command>, zostaną szerzej opisane i wyjaśnione.

source: Initialization
de_de: Initialisierung
ja_jp: 初期設定
pl_pl: Inicjalizacja
pt_br: Initialização

source: For any work with APT, the list of available packages needs to be updated; this can be done simply through <command>apt-get update</command>. Depending on the speed of your connection, the operation can take a while since it involves downloading a certain number of <filename>Packages</filename>/<filename>Sources</filename>/<filename>Translation-<replaceable>language-code</replaceable></filename> files, which have gradually become bigger and bigger as Debian has developed (at least 10 MB of data for the <literal>main</literal> section). Of course, installing from a CD-ROM set does not require any downloading — in this case, the operation is very fast.
ja_jp: APT を使う作業では、事前に利用可能なパッケージのリストを更新しなければいけません; これを行うには <command>apt-get update</command> を使ってください。ネットワークのスピードに依存しますが、この操作には少し時間がかかります。なぜなら、<filename>Packages</filename>/<filename>Sources</filename>/<filename>Translation-<replaceable>language-code</replaceable></filename> などのファイルをダウンロードするからです。これらのファイルは Debian の開発が進むにつれて徐々に大きくなります (<literal>main</literal> セクションの場合、データのサイズは少なく見積もっても 10 MB です)。もちろん CD-ROM セットからインストールする場合はダウンロードに時間は必要ありません - この場合、操作はとても速くなります。
pl_pl: Do każdej pracy z APTem trzeba zaktualizować listę dostępnych pakietów; może to zrobić przez wpisanie <command>apt-get update</command>. Zależnie od dostępnej prędkości połączenia, operacja ta może chwilę zająć, ponieważ składa się na nią pobieranie pewnej liczby plików <filename>Packages</filename>/<filename>Sources</filename>/<filename>Tłumaczenie-<replaceable>kod-języka</replaceable></filename>, które stopniowo stawały się coraz większe razem z rozwojem Debiana (przynajmniej 10MB danych dla sekcji <literal>main</literal>). Oczywiście podczas instalacji z płyt CD-ROM nie jest wymagane żadne pobieranie — w takim przypadku ta operacja jest bardzo szybka.

source: Installing and Removing
de_de: Installieren und Entfernen
ja_jp: インストールと削除
pl_pl: Instalacja i Usuwanie
pt_br: Instalação e remoção

source: <primary>package</primary><secondary>installation</secondary>
de_de: <primary>Paket</primary><secondary>Installation</secondary>
ja_jp: <primary>パッケージ</primary><secondary>インストール</secondary>
pt_br: <primary>pacote</primary><secondary>instalação</secondary>

source: <primary>package</primary><secondary>removal</secondary>
de_de: <primary>Paket</primary><secondary>Entfernen</secondary>
ja_jp: <primary>パッケージ</primary><secondary>削除</secondary>
pt_br: <primary>pacote</primary><secondary>remoção</secondary>

source: <primary>installation</primary><secondary>package installation</secondary>
ja_jp: <primary>インストール</primary><secondary>パッケージのインストール</secondary>

source: <primary>removal of a package</primary>
de_de: <primary>Entfernen eines Pakets</primary>
ja_jp: <primary>パッケージを削除</primary>
pt_br: <primary>remoção de um pacote</primary>

source: With APT, packages can be added or removed from the system, respectively with <command>apt-get install <replaceable>package</replaceable></command> and <command>apt-get remove <replaceable>package</replaceable></command>. In both cases, APT will automatically install the necessary dependencies or delete the packages which depend on the package that is being removed. The <command>apt-get purge <replaceable>package</replaceable></command> command involves a complete uninstallation — the configuration files are also deleted.
ja_jp: APT を使うと、システムからパッケージを追加したり削除したりできます。それぞれの操作は <command>apt-get install <replaceable>package</replaceable></command> と <command>apt-get remove <replaceable>package</replaceable></command> のようにして行います。どちらの場合も APT は自動的に、追加するパッケージの動作に必要なパッケージをインストールし、削除するパッケージの動作に必要だったパッケージを削除します。<command>apt-get purge <replaceable>package</replaceable></command> コマンドを実行すれば完全にアンインストール、設定ファイルも削除、します。
pl_pl: Używając APTa pakiety mogą być dodawane i usuwane z systemu, odpowiednio za pomocą <command>apt-get install <replaceable>pakiet</replaceable></command> i <command>apt-get remove <replaceable>pakiet</replaceable></command>. W obu przypadkach APT automatycznie zainstaluje wymagane zależności lub usunie pakiety, które są zależne od usuwanego pakietu. Komenda <command>apt-get purge <replaceable>pakiet</replaceable></command> obejmuje kompletną deinstalację — usuwane są również pliki konfiguracyjne.

source: <emphasis>TIP</emphasis> Installing the same selection of packages several times
de_de: <emphasis>TIPP</emphasis> Die gleiche Paketauswahl mehrfach installieren
ja_jp: <emphasis>TIP</emphasis> パッケージを同じように選択してインストール
pl_pl: <emphasis>WSKAZÓWKA</emphasis> Instalowanie tego samego zestawu pakietów kilka razy
pt_br: <emphasis>DICA</emphasis> Instalando a mesma seleção de pacotes diversas vezes

source: It can be useful to systematically install the same list of packages on several computers. This can be done quite easily.
de_de: Manchmal ist es wünschenswert, die gleiche Paketauswahl auf mehreren Computern zu installieren. Das ist sehr einfach möglich.
ja_jp: 複数のコンピュータで同じパッケージ群を体系的にインストールするのは便利です。これは簡単にできます。
pl_pl: Może okazać się przydatne, aby systematycznie instalować tą samą listę pakietów na kilku komputerach. Można tego dokonać całkiem łatwo.
pt_br: Pode ser útil instalar sistematicamente a mesma lista de pacotes em vários computadores. Isso pode ser feito facilmente.

source: First, retrieve the list of packages installed on the computer which will serve as the “model” to copy.
de_de: Zuerst erzeugen Sie eine Liste der installierten Pakte auf dem Computer, der als "Kopiervorlage" dient.
ja_jp: 最初に、コンピュータにインストールされたパッケージのリストを取得します。これを「ひな形」とします。
pl_pl: Najpierw należy uzyskać listę pakietów zainstalowanych na komputerze służącym za "wzór" do skopiowania.
pt_br: Em primeiro lugar, recupere a lista de pacotes instalados no computador que servirá como o "modelo" para copiar.

source: The <filename>pkg-list</filename> file then contains the list of installed packages. Next, transfer the <filename>pkg-list</filename> file on the computers you want to update and use the following commands:
de_de: Die Datei <filename>pkg-list</filename> enthält die Liste der installierten Pakete. Als Nächstes übertragen Sie die Datei <filename>pkg-list</filename> auf die zu aktualisierenden Rechner und geben dort die folgenden Befehle ein:
ja_jp: <filename>pkg-list</filename> ファイルはインストールされたパッケージのリストです。次に、パッケージ群をインストールしたいコンピュータに <filename>pkg-list</filename> ファイルを移動し、以下のコマンドを実行します:
pl_pl: Po tej czynności plik <filename>pkg-list</filename> będzie zawierał listę zainstalowanych pakietów. Następnie należy przenieść plik <filename>pkg-list</filename> na komputery przeznaczone do aktualizacji i użyć następujące komendy:
pt_br: O arquivo <filename>pkg-list</filename> passa a conter a lista dos pacotes instalados. Em seguida, transfira o arquivo <filename>pkg-list</filename> para os computadores que você quer atualizar e use os seguintes comandos:

source: The first commands records the list of available packages in the dpkg database, then <command>dpkg --set-selections</command> restores the selection of packages that you wish to install, and the <command>apt-get</command> invocation executes the required operations! <command>aptitude</command> does not have this command.
ja_jp: 最初のコマンド群で dpkg データベースで利用可能なパッケージのリストを記録し、<command>dpkg --set-selections</command> でインストールしたいパッケージ群を選択し、<command>apt-get</command> でインストール作業を実行します。<command>aptitude</command> にこのコマンドはありません。
pl_pl: Pierwsza część komend zapisuje listę dostępnych pakietów w bazie danych dpkg, następnie <command>dpkg --set-selections</command> przywraca zaznaczenia pakietów do instalacji, a wywołanie <command>apt-get</command> wykonuje wymagane operacje! <command>aptitude</command> nie posiada tej komendy.

source: <emphasis>TIP</emphasis> Removing and installing at the same time
de_de: <emphasis>TIPP</emphasis> Gleichzeitig entfernen und installieren in einem Durchgang
ja_jp: <emphasis>TIP</emphasis> 同時に削除とインストールを行う
pl_pl: <emphasis>WSKAZÓWKA</emphasis> Usuwanie i instalacja w tym samym czasie
pt_br: <emphasis>DICA</emphasis> Removendo e instalando ao mesmo tempo

source: It is possible to ask <command>apt-get</command> (or <command>aptitude</command>) to install certain packages and remove others on the same command line by adding a suffix. With an <command>apt-get install</command> command, add “<literal>-</literal>” to the names of the packages you wish to remove. With an <command>apt-get remove</command> command, add “<literal>+</literal>” to the names of the packages you wish to install.
ja_jp: <command>apt-get</command> (または <command>aptitude</command>) を使ってパッケージのインストールと削除を同時に命令するには、パッケージ名の末尾にサフィックスを付け加えます。<command>apt-get install</command> コマンドで、パッケージ名の末尾に「<literal>-</literal>」をつけると、削除。<command>apt-get remove</command> コマンドで、パッケージ名の末尾に「<literal>+</literal>」をつけるとインストールになります。
pl_pl: Możliwe jest użycie <command>apt-get</command> (lub <command>aptitude</command>), aby jednocześnie zainstalować pewne pakiety i usunąć inne za pomocą jednej komendy, poprzez dodanie przyrostka. W komendzie <command>apt-get install</command> należy dodać “<literal>-</literal>” do nazwy pakietów przeznaczonych do usunięcia. W komendzie <command>apt-get remove</command> należy dodać “<literal>+</literal>” do nazwy pakietów do zainstalowania.

source: The next example shows two different ways to install <replaceable>package1</replaceable> and to remove <replaceable>package2</replaceable>.
de_de: Das nächste Bespiel zeigt zwei verschiedene Wege, <replaceable>Paket1</replaceable> zu installieren und <replaceable>Paket2</replaceable> zu entfernen.
ja_jp: 次の例は <replaceable>package1</replaceable> をインストール、<replaceable>package2</replaceable> を削除する 2 種類の方法です。
pl_pl: Następny przykład ukazuje dwa różne sposoby na zainstalowanie <replaceable>pakiet1</replaceable> i usunięcie <replaceable>pakiet2</replaceable>.
pt_br: O próximo exemplo mostra duas maneiras diferentes de instalar <replaceable>package1</replaceable> e remover <replaceable>package2</replaceable>.

source: This can also be used to exclude packages which would otherwise be installed, for example due to a <literal>Recommends</literal>. In general, the dependency solver will use that information as a hint to look for alternative solutions.
ja_jp: これは例えば <literal>Recommends</literal> に指定されているなどの原因でインストールされてしまうパッケージを除外するために使う事も可能です。一般に、依存関係ソルバは代替解決策を探すための手掛かりとしてこの情報を使います。
pl_pl: Tego sposobu można użyć do wykluczenia z instalacji pakietów, które w przeciwnym razie zostałyby zainstalowane, np. jako <literal>Rekomendowane</literal>. W ogólnym przypadku mechanizm rozwiązywania zależności użyje tej informacji jako wskazówki do wyszukania alternatywnych rozwiązań.

source: <emphasis>TIP</emphasis> <command>apt-get --reinstall</command> and <command>aptitude reinstall</command>
de_de: <emphasis>TIPP</emphasis> <command>apt-get --reinstall</command> und <command>aptitude reinstall</command>
ja_jp: <emphasis>TIP</emphasis> <command>apt-get --reinstall</command> と <command>aptitude reinstall</command>
pl_pl: <emphasis>WSKAZÓWKA</emphasis> <command>apt-get --reinstall</command> i <command>aptitude reinstall</command>
pt_br: <emphasis>DICA</emphasis> <command>apt-get --reinstall</command> e <command>aptitude reinstall</command>

source: <primary>reinstallation</primary>
ja_jp: <primary>再インストール</primary>
pt_br: <primary>reinstalação</primary>

source: The system can sometimes be damaged after the removal or modification of files in a package. The easiest way to retrieve these files is to reinstall the affected package. Unfortunately, the packaging system finds that the latter is already installed and politely refuses to reinstall it; to avoid this, use the <literal>--reinstall</literal> option of the <command>apt-get</command> command. The following command reinstalls <emphasis role="pkg">postfix</emphasis> even if it is already present:
de_de: Das Entfernen oder Verändern von Dateien aus einem Paket kann das System manchmal beschädigen. Die einfachste Art, diese Dateien wieder zu bekommen, ist, das betroffene Paket erneut zu installieren. Unglücklicherweise stellt das Paketierungssystem fest, dass das Paket bereits installiert ist, und weigert sich höflich, es erneut zu installieren; um dies zu vermeiden, benutzen Sie die Option <literal>--reinstall</literal> des Befehls <command>apt-get</command>. Der folgende Befehl installiert das Paket <emphasis role="pkg">postfix</emphasis> erneut, selbst falls es bereits vorhanden ist:
ja_jp: システムはパッケージ中のファイルが削除されたり変更されたりした後に被害を受ける場合があります。これらのファイルを再取得する最も簡単な方法は、影響を受けたパッケージを再インストールする事です。残念なことに、パッケージ化システムはパッケージが既にインストール済みで、再インストールできない事を丁寧に教えてくれます; これを避けるために、<command>apt-get</command> コマンドの <literal>--reinstall</literal> オプションを使います。以下は、既にインストール済みでも <emphasis role="pkg">postfix</emphasis> を再インストールするコマンドです:
pl_pl: Czasami system może zostać uszkodzony po usunięciu lub modyfikacji plików pakietu. Najłatwiejszym sposobem odzyskania tych plików jest reinstalacja danego pakietu. Niestety, system pakietowania informuje, że jest on już zainstalowany i grzecznie odmawia reinstalacji; aby tego uniknąć należy użyć opcji <literal>--reinstall</literal> dla komendy <command>apt-get</command>. Komenda przedstawiona poniżej reinstaluje <emphasis role="pkg">postfix</emphasis> nawet, jeżeli jest już obecny:
pt_br: O sistema pode, às vezes, ser danificado com a remoção ou modificação de arquivos num pacote. A forma mais fácil de recuperar estes arquivos é reinstalar o pacote afetado. Infelizmente, o sistema de empacotamento nota que o pacote está instalado e se recusa educadamente a reinstalá-lo; para evitar isto, use a opção <literal>--reinstall</literal> do comando <command>apt-get</command>. o comando abaixo reinstala o <emphasis role="pkg">postfix</emphasis> mesmo quando ele já está presente:

source: The <command>aptitude</command> command line is slightly different, but achieves the same result with <command>aptitude reinstall postfix</command>.
de_de: Die Syntax von <command>aptitude</command> ist ein wenig anders, erzielt aber dasselbe Ergebnis mit <command>aptitude reinstall postfix</command>.
ja_jp: <command>aptitude</command> のコマンドラインは少し違いますが、<command>aptitude reinstall postfix</command> で同じ結果を得られます。
pl_pl: Składnia komendy <command>aptitude</command> jest nieco inna, ale osiąga ten sam rezultat z pomocą <command>aptitude reinstall postfix</command>.
pt_br: O <command>aptitude</command> em linha de comando é ligeiramente diferente, mas atinge os mesmos resultados com <command>aptitude reinstall postfix</command>.

source: The problem does not arise with <command>dpkg</command>, but the administrator rarely uses it directly.
de_de: Das Problem tritt bei <command>dpkg</command> nicht auf, jedoch wird es selten direkt durch den Administrator genutzt.
ja_jp: この問題は <command>dpkg</command> を使えば起こりませんが、管理者がこのプログラムを直接使うことはまれです。
pl_pl: Problem ten nie występuje w przypadku <command>dpkg</command>, ale administrator rzadko korzysta z niej bezpośrednio.
pt_br: O problema não ocorre com o <command>dpkg</command>, mas o administrador raramente usa-o diretamente.

source: Be careful, using <command>apt-get --reinstall</command> to restore packages modified during an attack certainly cannot recover the system as it was. <xref linkend="sect.dealing-with-compromised-machine" /> details the necessary steps to take with a compromised system.
de_de: Seien Sie vorsichtig: Das Benutzen von <command>apt-get --reinstall</command> um Pakete wiederherzustellen, die während eines Angriffs verändert wurden, ist nicht ausreichend das System so wieder her zu stellen, wie es war. <xref linkend="sect.dealing-with-compromised-machine" /> beschreibt die bei einem gehackten zu unternehmenden Schritte im Detail.
ja_jp: 攻撃を受けている最中に、変更されたパッケージを修復するために <command>apt-get --reinstall</command> を使っても、確実にシステムを以前の状態に回復することはできないという点に気を付けてください。危険に晒されているシステムでこれを行う際に必要な手順の詳細は<xref linkend="sect.dealing-with-compromised-machine" />を参照してください。
pl_pl: Należy uważać, używanie <command>apt-get --reinstall</command> w celu przywrócenia pakietów zmodyfikowanych podczas ataku z pewnością nie przywróci systemu do poprzedniego stanu. <xref linkend="sect.dealing-with-compromised-machine" /> szczegółowo opisuje wymagane kroki postępowania w przypadku takiego incydentu.
pt_br: Seja cuidadoso, usando <command>apt-get --reinstall</command> para recuperar pacotes alterados durante um ataque com certeza não trazem o sistema ao que ele era. <xref linkend="sect.dealing-with-compromised-machine" /> detalha os passos necessários para lidar com um sistema comprometido.
