Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: <command>synaptic</command> package manager
de_de: <command>synaptic</command> Paketverwaltungsprogramm
ja_jp: <command>synaptic</command> パッケージマネージャ
pl_pl: Menedżer pakietów <command>synaptic</command>
pt_br: gerenciador de pacotes <command>synaptic</command>

source: Checking Package Authenticity
de_de: Die Echtheit eines Paketes prüfen
ja_jp: パッケージ信頼性の確認
pl_pl: Sprawdzanie Autentyczności Pakietów
pt_br: Verificando Autenticidade do Pacote

source: <primary>package</primary><secondary>authenticity check</secondary>
de_de: <primary>Paket</primary><secondary>Authentizitätsprüfung</secondary>
ja_jp: <primary>パッケージ</primary><secondary>信頼性確認</secondary>
pt_br: <primary>pacote</primary><secondary>verificação de autenticidade</secondary>

source: <primary>package</primary><secondary>seal</secondary>
de_de: <primary>Paket</primary><secondary>Siegel</secondary>
ja_jp: <primary>パッケージ</primary><secondary>封印</secondary>
pt_br: <primary>pacote</primary><secondary>lacre</secondary>

source: <primary>package</primary><secondary>signature</secondary>
ja_jp: <primary>パッケージ</primary><secondary>署名</secondary>

source: <primary>signature</primary><secondary>package signature</secondary>
ja_jp: <primary>署名</primary><secondary>パッケージ署名</secondary>

source: <primary>authentication</primary><secondary>package authentication</secondary>
ja_jp: <primary>信頼性</primary><secondary>パッケージ信頼性</secondary>

source: Security is very important for Falcot Corp administrators. Accordingly, they need to ensure that they only install packages which are guaranteed to come from Debian with no tampering on the way. A computer cracker could try to add malicious code to an otherwise legitimate package. Such a package, if installed, could do anything the cracker designed it to do, including for instance disclosing passwords or confidential information. To circumvent this risk, Debian provides a tamper-proof seal to guarantee — at install time — that a package really comes from its official maintainer and hasn't been modified by a third party.
de_de: Sicherheit ist für die Administratoren der Falcot Corp sehr wichtig. Dementsprechend müssen sie sicherstellen, dass sie ausschließlich Pakete installieren, die garantiert von Debian stammen und die unterwegs nicht verändert wurden. Ein Cracker könnte versuchen, Schadcode in ein ansonsten rechtmäßiges Paket einzuschleusen. Ein solches Paket, falls installiert, könnte alles tun, was der Cracker vorgesehen hat, einschließlich der Preisgabe von Passwörtern oder vertraulichen Informationen. Um dies zu verhindern, stellt Debian fälschungssichere Siegel bereit, die – zum Zeitpunkt der Installation – gewährleisten, dass ein Paket wirklich von seinem offiziellen Betreuer stammt und nicht durch einen Dritten verändert wurde.
ja_jp: Falcot Corp の管理者にとって、セキュリティはとても重要です。つまり管理者は、パッケージが途中で改竄されていないこと、確かに Debian から提供されている事を確認し、確認のとれたパッケージだけをインストールしなければいけません。コンピュータクラッカーは、他の合法的なパッケージに悪意あるコードを追加しようと試みます。そのようなパッケージがインストールされた場合、クラッカーが設計したことは何でも、例えばパスワードや機密情報の漏洩などでも、実行されます。この危険性を回避するために、Debian は不正加工を防ぐ封印を提供し、インストール時にそのパッケージが、公式メンテナから提供されたものと本当に同じこと、第三者によって変更されていないこと、を保証します。
pl_pl: Dla administratorów Falcot Corp bezpieczeństwo jest bardzo ważne. Zgodnie z tym założeniem, muszą być pewni, że instalują tylko pakiety, których pochodzenie od Debiana jest gwarantowane, które nie były zmieniane przez osoby trzecie. Włamywacz komputerowy mógłby bowiem próbować dodać szkodliwy kod do wiarygodnego pakietu. Po zainstalowaniu, taki pakiet mógłby robić cokolwiek, do czego włamywacz go zaprojektował, włączając w to na przykład kradzież haseł lub poufnych informacji. W celu przeciwdziałania takim zagrożeniom, Debian stosuje pieczęci zabezpieczające, aby zagwarantować — w czasie instalacji — że pakiet naprawdę pochodzi od jego opiekuna i nie był modyfikowany przez osoby trzecie.
pt_br: Segurança é muito importante para os administradores da Falcot Corp. E desta forma, eles precisam ter certeza que estão instalando pacotes que vem do Debian, sem interceptações no caminho. Um cracker de computador pode tentar adicionar código malicioso num pacote que de outra forma seria legítimo. Tal pacote, se instalado, poderia fazer qualquer coisa que o cracker o tivesse projetado para fazer, incluindo por exemplo revelar senhas e informações confidenciais. Para evitar este risco, o Debian fornece um selo de qualidade a prova de interceptações para garantir - no momento da instalação - que um pacote realmente vem de um mentenedor oficial e não foi modificado por um terceiro.

source: The seal works with a chain of cryptographical hashes and a signature. The signed file is the <filename>Release</filename> file, provided by the Debian mirrors. It contains a list of the <filename>Packages</filename> files (including their compressed forms, <filename>Packages.gz</filename> and <filename>Packages.bz2</filename>, and the incremental versions), along with their MD5, SHA1 and SHA256 hashes, which ensures that the files haven't been tampered with. These <filename>Packages</filename> files contain a list of the Debian packages available on the mirror, along with their hashes, which ensures in turn that the contents of the packages themselves haven't been altered either.
de_de: Das Siegel arbeitet mit einer Kette kryptografischer Hashfunktionen und Signaturen. Die signierte Datei ist die von den Debian-Spiegelservern bereitgestellte <filename>Release</filename>-Datei. Sie enthält eine Liste der <filename>Packages</filename>-Dateien (inklusiver der komprimierten Ausgaben <filename>Packages.gz</filename> und <filename>Packages.bz2</filename> und der inkrementellen Versionen) zusammen mit ihren MD5, SHA1 und SHA256 Hashes, mit denen sich sicherstellen lässt, dass die Dateien nicht verändert wurden. Diese <filename>Packages</filename>-Dateien enthalten eine Liste der auf dem Spiegelserver verfügbaren Pakete zusammen mit ihres Hashes, mit denen wiederum sichergestellt werden kann, dass auch die Pakete ihrerseits nicht verändert wurden.
ja_jp: この封印は一連の暗号学的ハッシュと署名を使って行われます。署名されたファイルは <filename>Release</filename> ファイルで、Debian ミラーから提供されます。このファイルには、<filename>Packages</filename> ファイル (<filename>Packages.gz</filename>、<filename>Packages.bz2</filename>、そして増分バージョンの圧縮形式など) のリストが改竄されていない事を保証するための MD5、SHA1、SHA256 ハッシュと一緒に含まれています。<filename>Packages</filename> ファイルには、ミラーで提供されている Debian パッケージのリストがパッケージの内容が変更されていない事を保証するハッシュと一緒に含まれています。
pl_pl: Wspomniana pieczęć składa się z łańcucha kryptograficznych funkcji skrótu i podpisu. Podpisanym plikiem jest plik <filename>Release</filename>, dostarczany przez serwery lustrzane Debiana. Zawiera on listę plików <filename>Packages</filename> (włączając ich skompresowane wersje, <filename>Packages.gz</filename> i <filename>Packages.bz2</filename> oraz wersje przyrostowe) razem z ich skrótami MD5, SHA1 i SHA256, które zapewniają, że pliki nie zostały zmodyfikowane. Pliki <filename>Packages</filename> zawierają listę pakietów Debiana dostępnych na serwerze lustrzanym razem z ich skrótami, które to z kolei zapewniają, że zawartość samych pakietów również nie była zmieniana.
pt_br: O selo funciona como uma cadeia de hashes criptográficos e uma assinatura. O arquivo assinado é o arquivo <filename>Release</filename> file, fornecido pelos espelhos Debian. Ele contém uma lista de arquivos <filename>Packages</filename> (incluindo suas formas compactadas, <filename>Packages.gz</filename> e <filename>Packages.bz2</filename>, e as versões incrementais), junto com suas hashes MD5, SHA1 e SHA256 que garantem que os arquivos não foram interceptados. Estes arquivos <filename>Packages</filename> contém uma lista de pacotes Debian disponíveis no espelho, junto com seus hashes, que garantem, por sua vez, que os conteúdos dos próprios pacotes também não foram alterados.

source: The trusted keys are managed with the <command>apt-key</command> command found in the <emphasis role="pkg">apt</emphasis> package. This program maintains a keyring of GnuPG public keys, which are used to verify signatures in the <filename>Release.gpg</filename> files available on the mirrors. It can be used to add new keys manually (when non-official mirrors are needed). Generally however, only the official Debian keys are needed. These keys are automatically kept up-to-date by the <emphasis role="pkg">debian-archive-keyring</emphasis> package (which puts the corresponding keyrings in <filename>/etc/apt/trusted.gpg.d</filename>). However, the first installation of this particular package requires caution: even if the package is signed like any other, the signature cannot be verified externally. Cautious administrators should therefore check the fingerprints of imported keys before trusting them to install new packages:
ja_jp: 信頼された鍵は <emphasis role="pkg">apt</emphasis> パッケージから提供される <command>apt-key</command> コマンドで管理されます。このプログラムは GnuPG 公開鍵の鍵束を保守し、この鍵束はミラーから提供される <filename>Release.gpg</filename> ファイルに含まれる署名を検証するために使われます。新しい鍵を手作業で追加する場合 (非公式ミラーでこれが必要な場合) にも使われます。しかしながら一般的に、公式の Debian 鍵以外は不要です。これらの鍵は <emphasis role="pkg">debian-archive-keyring</emphasis> パッケージによって自動的に最新の状態に維持されます (対応する鍵束を <filename>/etc/apt/trusted.gpg.d</filename> に格納します)。しかしながら、<emphasis role="pkg">debian-archive-keyring</emphasis> パッケージを初めてインストールする際には用心が必要です: たとえ <emphasis role="pkg">debian-archive-keyring</emphasis> パッケージが他のパッケージと同様に署名されていたとしても、その署名を外部から検証できません。そんなわけで、注意深い管理者なら、新しいパッケージをインストールするために取り込まれた鍵を信用する前にその鍵の指紋を確認するべきです:
pl_pl: Zarządzanie zaufanymi kluczami odbywa się przez użycie komendy <command>apt-key</command> z pakietu <emphasis role="pkg">apt</emphasis>. Program ten zarządza bazą kluczy publicznych GnuPG, które są używane do sprawdzania podpisów w plikach <filename>Release.gpg</filename> dostępnych na serwerach lustrzanych. Może zostać użyty do ręcznego dodania nowych kluczy (kiedy wymagane są nieoficjalne serwery lustrzane). Jednakże zazwyczaj wymagane są tylko oficjalne klucze Debiana. Wspomniane klucze są automatycznie aktualizowane przez pakiet <emphasis role="pkg">debian-archive-keyring</emphasis> (przechowuje on bazę kluczy w <filename>/etc/apt/trusted.gpg.d</filename>). Jednakże pierwsza instalacja tego pakietu wymaga zachowania ostrożności: nawet jeżeli pakiet jest podpisany tak jak pozostałe, jego podpis nie może być zweryfikowany zewnętrznie. Z tego powodu ostrożni administratorzy powinni sprawdzić skróty zaimportowanych kluczy przed zaufaniu im do instalacji nowych pakietów.

source: # <userinput>apt-key fingerprint</userinput> /etc/apt/trusted.gpg.d//debian-archive-squeeze-automatic.gpg ------------------------------------------------------------ pub 4096R/473041FA 2010-08-27 [expires: 2018-03-05] Key fingerprint = 9FED 2BCB DCD2 9CDF 7626 78CB AED4 B06F 4730 41FA uid Debian Archive Automatic Signing Key (6.0/squeeze) &lt;ftpmaster@debian.org&gt; /etc/apt/trusted.gpg.d//debian-archive-squeeze-stable.gpg --------------------------------------------------------- pub 4096R/B98321F9 2010-08-07 [expires: 2017-08-05] Key fingerprint = 0E4E DE2C 7F3E 1FC0 D033 800E 6448 1591 B983 21F9 uid Squeeze Stable Release Key &lt;debian-release@lists.debian.org&gt; /etc/apt/trusted.gpg.d//debian-archive-wheezy-automatic.gpg ----------------------------------------------------------- pub 4096R/46925553 2012-04-27 [expires: 2020-04-25] Key fingerprint = A1BD 8E9D 78F7 FE5C 3E65 D8AF 8B48 AD62 4692 5553 uid Debian Archive Automatic Signing Key (7.0/wheezy) &lt;ftpmaster@debian.org&gt; /etc/apt/trusted.gpg.d//debian-archive-wheezy-stable.gpg -------------------------------------------------------- pub 4096R/65FFB764 2012-05-08 [expires: 2019-05-07] Key fingerprint = ED6D 6527 1AAC F0FF 15D1 2303 6FB2 A1C2 65FF B764 uid Wheezy Stable Release Key &lt;debian-release@lists.debian.org&gt;
ja_jp: # <userinput>apt-key fingerprint</userinput> /etc/apt/trusted.gpg.d//debian-archive-squeeze-automatic.gpg ------------------------------------------------------------ pub 4096R/473041FA 2010-08-27 [満了: 2018-03-05] 指紋 = 9FED 2BCB DCD2 9CDF 7626 78CB AED4 B06F 4730 41FA uid Debian Archive Automatic Signing Key (6.0/squeeze) &lt;ftpmaster@debian.org&gt; /etc/apt/trusted.gpg.d//debian-archive-squeeze-stable.gpg --------------------------------------------------------- pub 4096R/B98321F9 2010-08-07 [満了: 2017-08-05] 指紋 = 0E4E DE2C 7F3E 1FC0 D033 800E 6448 1591 B983 21F9 uid Squeeze Stable Release Key &lt;debian-release@lists.debian.org&gt; /etc/apt/trusted.gpg.d//debian-archive-wheezy-automatic.gpg ----------------------------------------------------------- pub 4096R/46925553 2012-04-27 [満了: 2020-04-25] 指紋 = A1BD 8E9D 78F7 FE5C 3E65 D8AF 8B48 AD62 4692 5553 uid Debian Archive Automatic Signing Key (7.0/wheezy) &lt;ftpmaster@debian.org&gt; /etc/apt/trusted.gpg.d//debian-archive-wheezy-stable.gpg -------------------------------------------------------- pub 4096R/65FFB764 2012-05-08 [満了: 2019-05-07] 指紋 = ED6D 6527 1AAC F0FF 15D1 2303 6FB2 A1C2 65FF B764 uid Wheezy Stable Release Key &lt;debian-release@lists.debian.org&gt;

source: <emphasis>IN PRACTICE</emphasis> Adding trusted keys
de_de: <emphasis>IN DER PRAXIS</emphasis> Vertrauenswürdige Schlüssel hinzufügen
ja_jp: <emphasis>IN PRACTICE</emphasis> 信頼された鍵の追加
pl_pl: <emphasis>W PRAKTYCE</emphasis> Dodawanie zaufanych kluczy
pt_br: <emphasis>NA PRÁTICA</emphasis> Adicionando chaves confiáveis

source: <primary>trusted key</primary>
de_de: <primary>Vertrauenswürdiger Schlüssel</primary>
ja_jp: <primary>信頼された鍵</primary>
pt_br: <primary>chave confiável</primary>

source: <primary>key</primary><secondary>APT's authentication keys</secondary>
ja_jp: <primary>key</primary><secondary>APT の認証鍵</secondary>

source: When a third-party package source is added to the <filename>sources.list</filename> file, APT needs to be told to trust the corresponding GPG authentication key (otherwise it will keep complaining that it can't ensure the authenticity of the packages coming from that repository). The first step is of course to get the public key. More often than not, the key will be provided as a small text file, which we'll call <filename>key.asc</filename> in the following examples.
ja_jp: 第三者のパッケージソースを <filename>sources.list</filename> に追加したら、APT にパッケージソースに対応する GPG 認証鍵を信頼する事を伝える必要があります (そうでなければ、APT はそのパッケージソースから提供されるパッケージの信頼性を保証できないとエラーを出し続けます)。最初のステップはもちろん公開鍵を手に入れる事です。大抵の場合、公開鍵は小さなテキストファイルの形で配布されています。以降の例ではこの公開鍵を <filename>key.asc</filename> と呼びます。
pl_pl: Kiedy do pliku <filename>sources.list</filename> zostanie dodane źródło pakietów strony trzeciej, APT musi być poinstruowany, aby zaufać odpowiadającemu kluczowi uwierzytelniania GPG (w przeciwnym przypadku będzie narzekał, że nie może zapewnić uwierzytelnienia pakietów pochodzących z tego repozytorium). Pierwszym krokiem jest oczywiście pozyskanie klucza publicznego. Najczęściej klucz ten będzie dostarczony jako mały plik tekstowy, który w poniższym przykładzie został nazwany <filename>key.asc</filename>.

source: To add the key to the trusted keyring, the administrator can run <command>apt-key add &lt; key.asc</command>. Another way is to use the <command>synaptic</command> graphical interface: its “Authentication” tab in the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Repositories</guisubmenu></menuchoice> menu gives the possibility of importing a key from the <filename>key.asc</filename> file.
de_de: Um einen Schlüssel zum Schlüsselbund vertrauenswürdiger Schlüssel hinzuzufügen, kann der Administrator <command>apt-key add &lt; key.asc</command> ausführen. Ein anderer Weg ist, die grafische Benutzeroberfläche <command>synaptic</command> zu nutzen: Im Reiter "Authentifizierung" im <menuchoice><guimenu>Einstellungen</guimenu> <guisubmenu>Paketquellen</guisubmenu></menuchoice> Menü besteht die Möglichkeit, Schlüssel aus der <filename>key.asc</filename>-Datei zu importieren.
ja_jp: 信頼された鍵束に鍵を追加するために、管理者は <command>apt-key add &lt; key.asc</command> を実行します。また、<command>synaptic</command> グラフィカルインターフェースを利用する事も可能です: <menuchoice><guimenu>設定(S)</guimenu> <guisubmenu>リポジトリ(R)</guisubmenu></menuchoice> メニューの「認証」タブで <filename>key.asc</filename> から鍵を取り込みます。
pl_pl: W celu dodania klucza do bazy zaufanych kluczy, administrator może wykonać <command>apt-key add &lt; key.asc</command>. Innym sposobem jest użycie graficznego interfejsu <command>synaptic</command>: jego zakładka "Uwierzytelnianie" w menu <menuchoice><guimenu>Ustawienia</guimenu> <guisubmenu>Repozytoria</guisubmenu></menuchoice> daje możliwość zaimportowania klucza z pliku <filename>key.asc</filename>.
pt_br: Para adicionar a chave ao chaveiro confiável, o administrador pode executar <command>apt-key add &lt; key.asc</command>. Ou usar a interface gráfica <command>synaptic</command>: sua aba "Autenticação" no menu <menuchoice><guimenu>Configurações</guimenu> <guisubmenu>Repositórioos</guisubmenu></menuchoice> dá a possibilidade de importar uma chave do arquivo <filename>key.asc</filename>.

source: For people who would want a dedicated application and more details on the trusted keys, it is possible to use <command>gui-apt-key</command> (in the package of the same name), a small graphical user interface which manages the trusted keyring.
ja_jp: 専用のアプリケーションを使いたくなかったり、信頼された鍵の詳細を知りたい人は <command>gui-apt-key</command> (同名のパッケージに含まれます) を使う事も可能です。これは質素なユーザインタフェースで、信頼された鍵束を管理します。
pl_pl: Dla tych, którzy potrzebowaliby osobnej aplikacji i więcej szczegółów na temat zaufanych kluczy istnieje możliwość użycia <command>gui-apt-key</command> (z pakietu o tej samej nazwie), minimalistycznego graficznego interfejsu do zarządzania bazą zaufanych kluczy.

source: Once the appropriate keys are in the keyring, APT will check the signatures before any risky operation, so that front-ends will display a warning if asked to install a package whose authenticity can't be ascertained.
de_de: Sobald die richtigen Schlüssel im Schlüsselbund sind, prüft APT die Signaturen vor jeder riskanten Operation, damit Benutzeroberflächen eine Warnung einblenden können, falls bei der Installation eines Pakets die Authentizität nicht bestätigt werden kann.
ja_jp: 適切な鍵を鍵束の中に追加すれば、APT は危険性の高い操作の前に署名を確認します。こうすることで、信頼性が確定できないパッケージをインストールするよう要求された場合に、フロントエンドは警告を表示するようになります。
pl_pl: Kiedy już odpowiednie klucze znajdą się w bazie, APT będzie sprawdzał ich podpisy przed każdą ryzykowną operacją, dzięki temu interfejsy wyświetlą ostrzeżenie w przypadku gdy zażądano instalacji pakietu, którego wiarygodność nie może zostać ustalona.
pt_br: Uma vez que as chaves apropriadas estiverem no chaveiro, o APT vai verificar as assinaturas antes de operações arriscadas, e as interface vão exibir um aviso se tiverem que instalar um pacote cuja autenticidade não puder ser verificada.

source: Upgrading from One Stable Distribution to the Next
de_de: Von einer Stable Distribution auf die nächste aktualisieren
ja_jp: 安定版から次のディストリビューションへのアップグレード
pl_pl: Uaktualnienie z Jednej Stabilnej Dystrybucji do Następnej
pt_br: Atualizando de uma Versão Estável para a Próxima

source: One of the best-known features of Debian is its ability to upgrade an installed system from one stable release to the next: <foreignphrase>dist-upgrade</foreignphrase> — a well-known phrase — has largely contributed to the project's reputation. With a few precautions, upgrading a computer can take as little as a few minutes, or a few dozen minutes, depending on the download speed from the package repositories.
ja_jp: Debian の最もよく知られた特色の 1 つに、インストールされたシステムを安定版から次のリリースにアップグレードできる事が挙げられます: <foreignphrase>dist-upgrade</foreignphrase> - よく知られた語句 - はプロジェクトの評判に大きく寄与し続けています。幾つかの予防措置を伴いますが、コンピュータのアップグレードに必要な時間は、パッケージリポジトリからのダウンロード速度に依存して、わずか数分から数十分です。
pl_pl: Jedna z najbardziej rozpoznawalnych funkcji Debiana jest jego zdolność uaktualniania całego systemu z jednego stabilnego wydania do następnego: <foreignphrase>dist-upgrade</foreignphrase> — dobrze znana fraza — znacznie przyczyniła się do reputacji projektu. Przy zachowaniu odpowiedniej troski, uaktualnienie może zająć zaledwie kilka minut lub kilkanaście minut, zależnie od prędkości pobierania z repozytoriów pakietów.

source: Recommended Procedure
de_de: Empfohlene Vorgehensweise
ja_jp: 推奨手順
pl_pl: Zalecana Procedura
pt_br: Procedimento Recomendado

source: Since Debian has quite some time to evolve in-between stable releases, you should read the release notes before upgrading.
de_de: Da Debian einiges an Zeit zur Weiterentwicklung zwischen den Stable Veröffentlichungen hat, sollten Sie vor einer Aktualisierung die Veröffentlichungshinweise lesen.
ja_jp: Debian の安定版が進化してリリースされるまでにはかなり長い時間がかかるので、アップグレードの前にリリースノートを読むべきです。
pl_pl: W związku z tym, że Debian ma sporo czasu do ewolucji pomiędzy stabilnymi wydaniami, przed uaktualnieniem należy przeczytać informacje o wydaniu.
pt_br: Como o Debian tem bastante tempo para evoluir entre lançamentos da versão estável, você deve ler as notas de lançamento ("release notes") antes de atualizar.

source: <emphasis>BACK TO BASICS</emphasis> Release notes
de_de: <emphasis>ZURÜCK ZU DEN GRUNDLAGEN</emphasis> Veröffentlichungshinweise
ja_jp: <emphasis>BACK TO BASICS</emphasis> リリースノート
pl_pl: <emphasis>WRACAJĄC DO PODSTAW</emphasis> Informacje o wydaniu
pt_br: <emphasis>DE VOLTA AO BÁSICO</emphasis> Notas de lançamento

source: The release notes for an operating system (and, more generally, for any software) are a document giving an overview of the software, with some details concerning the particularities of one version. These documents are generally short compared to the complete documentation, and they usually list the features which have been introduced since the previous version. They also give details on upgrading procedures, warnings for users of previous versions, and sometimes errata.
de_de: Die Veröffentlichungshinweise für ein Betriebssystem (oder generell für jede Software) geben einen Überblick über die Software mit Details zu den Besonderheiten der Version. Im Vergleich mit der vollständigen Dokumentation sind diese Dokumente eher kurz und sie führen die seit der letzten Version neu hinzugekommenen Eigenschaften auf. Ebenfalls enthalten sie Einzelheiten zur Aktualisierungsvorgehensweise, Warnungen für Benutzer von vorigen Versionen und manchmal ein Fehlerverzeichnis.
ja_jp: オペレーティングシステムの (より一般的に言えば、ソフトウェアの) リリースノートはソフトウェアの概観と、あるバージョンに固有な点の詳細を説明する文書です。リリースノートは通常、完全な文書に比べて短く、前のバージョン以降導入された機能をリストアップしています。加えて、アップグレード手順の詳細、以前のバージョンのユーザに対する警告、そして時々正誤表を含んでいます。与える。
pl_pl: Informacje o wydaniu dotyczące systemu operacyjnego (oraz ogólnie oprogramowania) to dokument ukazujący przegląd oprogramowania, z uwzględnieniem szczegółów konkretnej wersji. Dokumenty te są zazwyczaj krótkie, w porównaniu do pełnej dokumentacji, oraz zawierają listę nowych funkcji wprowadzonych od czasu poprzedniej wersji. Często opisują też procedurę uaktualnienia, ostrzeżenia dla użytkowników poprzednich wersji, a czasami wykaz błędów.
pt_br: As notas de lançamento para um sistema operacional (e, mais geralmente, para qualquer software) são um documento que dá uma visão geral do software, com alguns detalhes a respeito das particularidades de uma determinada versão. Estes documentos são em geral curtos se comparados com a documentação completa, e eles normalmente listam as funcionalidades que foram incluídas da versão anterior para a atual. Eles também dão detalhes dos procedimentos de atualização, alertas para os usuários da versão anterior e algumas erratas.
