Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: If the file <filename>sources.list</filename> mentions several distributions, it is possible to give the version of the package to install. A specific version number can be requested with <command>apt-get install <replaceable>package</replaceable>=<replaceable>version</replaceable></command>, but indicating its distribution of origin (<emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>) — with <command>apt-get install <replaceable>package</replaceable>/<replaceable>distribution</replaceable></command> — is usually preferred. With this command, it is possible to go back to an older version of a package (if for instance you know that it works well), provided that it is still available in one of the sources referenced by the <filename>sources.list</filename> file. Otherwise the <literal>snapshot.debian.org</literal> archive can come to the rescue (see sidebar <xref linkend="sidebar.snapshot.debian.org" />).
ja_jp: <filename>sources.list</filename> が複数のディストリビューションを参照しているのなら、パッケージのバージョンを指定してインストールする事も可能です。特定のバージョンを指定するには、<command>apt-get install <replaceable>package</replaceable>=<replaceable>version</replaceable></command> を使いますが、<command>apt-get install <replaceable>package</replaceable>/<replaceable>distribution</replaceable></command> のようにして、ディストリビューション (<emphasis role="distribution">安定版</emphasis>、<emphasis role="distribution">テスト版</emphasis>、<emphasis role="distribution">不安定版</emphasis>) を指定するやり方のほうが通常好まれます。<filename>sources.list</filename> ファイルに書かれたどこかのソースから古いバージョンをまだ入手できるなら、このコマンドを使ってパッケージを古いバージョンに戻す事が可能です (例えば古いバージョンが上手く動作すると知っている場合など)。そうでないなら、<literal>snapshot.debian.org</literal> アーカイブを使ってください (傍注<xref linkend="sidebar.snapshot.debian.org" />参照)。
pl_pl: Jeżeli w pliku <filename>sources.list</filename> występuje kilka dystrybucji, możliwe jest wskazanie wersji pakietu do instalacji. Można zażądać konkretnej wersji używając <command>apt-get install <replaceable>pakiet</replaceable>=<replaceable>wersja</replaceable></command>, ale zazwyczaj preferowane jest wskazanie dystrybucji jego pochodzenia (<emphasis role="distribution">Stabilna</emphasis>, <emphasis role="distribution">Testowa</emphasis> lub <emphasis role="distribution">Niestabilna</emphasis>) — używając <command>apt-get install <replaceable>pakiet</replaceable>/<replaceable>dystrybucja</replaceable></command>. Za pomocą tej komendy możliwe jest wrócenie do starszej wersji pakietu (jeżeli wiadomo, że działa lepiej), pod warunkiem że jest ciągle dostępna w jednym ze źródeł wskazanych w pliku <filename>sources.list</filename>. W przeciwnym razie z odsieczą przychodzi archiwum <literal>snapshot.debian.org</literal> (spójrz na fiszkę <xref linkend="sidebar.snapshot.debian.org" />).

source: Installation of the <emphasis role="distribution">unstable</emphasis> version of <emphasis role="pkg">spamassassin</emphasis>
de_de: Installation der <emphasis role="distribution">unstable</emphasis> Version von <emphasis role="pkg">spamassassin</emphasis>
ja_jp: <emphasis role="pkg">spamassassin</emphasis> の<emphasis role="distribution">不安定版</emphasis>バージョンをインストール
pl_pl: Instalacja <emphasis role="distribution">niestabilnej</emphasis> wersji <emphasis role="pkg">spamassassin</emphasis>
pt_br: Instalação da versão <emphasis role="distribution">unstable</emphasis> do <emphasis role="pkg">spamassassin</emphasis>

source: <emphasis>GOING FURTHER</emphasis> The cache of <filename>.deb</filename> files
de_de: <emphasis>NÄCHSTE SCHRITTE</emphasis> Der Zwischenspeicher für <filename>.deb</filename> Dateien
ja_jp: <emphasis>GOING FURTHER</emphasis> <filename>.deb</filename> ファイルのキャッシュ
pl_pl: <emphasis>IDĄC DALEJ</emphasis> Mechanizm cache plików <filename>.deb</filename>
pt_br: <emphasis>APROFUNDANDO</emphasis> O cache dos arquivos <filename>.deb</filename>

source: APT keeps a copy of each downloaded <filename>.deb</filename> file in the directory <filename>/var/cache/apt/archives/</filename>. In case of frequent updates, this directory can quickly take a lot of disk space with several versions of each package; you should regularly sort through them. Two commands can be used: <command>apt-get clean</command> entirely empties the directory; <command>apt-get autoclean</command> only removes packages which cannot be downloaded (because they have disappeared from the Debian mirror) and are therefore clearly useless (the configuration parameter <literal>APT::Clean-Installed</literal> can prevent the removal of <filename>.deb</filename> files that are currently installed).
ja_jp: APT はダウンロード済み <filename>.deb</filename> ファイルのコピーを <filename>/var/cache/apt/archives/</filename> ディレクトリに保存します。頻繁に更新をする場合、パッケージの複数のバージョンが保存されるためこのディレクトリは多くのディスク領域を消費します; 日常的にこのディレクトリの内容を調べたほうがよいでしょう。2 つのコマンドが使えます: <command>apt-get clean</command> はこのディレクトリを完全に空にします; <command>apt-get autoclean</command> は (Debian ミラーから削除されたために) ダウンロードできない、明らかに無駄なパッケージだけを削除します (設定パラメータ <literal>APT::Clean-Installed</literal> を使って現在インストール済みパッケージの <filename>.deb</filename> は削除しないようにする事も可能です)。
pl_pl: APT przechowuje kopię każdego pobranego pliku <filename>.deb</filename> w katalogu <filename>/var/cache/apt/archives/</filename>. W przypadku częstych aktualizacji, ten katalog może zająć dużo miejsca na dysku, zawierając kilka wersji każdego pakietu; należy go regularnie porządkować. W tym celu można użyć dwóch komend: <command>apt-get clean</command> zupełnie czyści ten katalog; <command>apt-get autoclean</command> usuwa jedynie pakiety, których nie można już pobrać (ponieważ zniknęły w serwera lustrzanego Debiana) i są zwyczajnie bezużyteczne (parametr konfiguracyjny <literal>APT::Clean-Installed</literal> zapobiega usuwaniu plików <filename>.deb</filename>, które są aktualnie zainstalowane).

source: System Upgrade
de_de: Das System aktualisieren
ja_jp: システムのアップグレード
pl_pl: Uaktualnienie systemu
pt_br: Atualização do sistema

source: <primary>upgrade</primary><secondary>system upgrade</secondary>
ja_jp: <primary>アップグレード</primary><secondary>システムのアップグレード</secondary>

source: Regular upgrades are recommended, because they include the latest security updates. To upgrade, use <command>apt-get upgrade</command> or <command>aptitude safe-upgrade</command> (of course after <command>apt-get update</command>). This command looks for installed packages which can be upgraded without removing any packages. In other words, the goal is to ensure the least intrusive upgrade possible. <command>apt-get</command> is slightly more demanding than <command>aptitude</command> because it will refuse to install packages which were not installed beforehand.
ja_jp: 最新のセキュリティ更新を入手するために、定期的にアップグレードする事をお勧めします。アップグレードするには、(もちろん <command>apt-get update</command> を実行した後で) <command>apt-get upgrade</command> または <command>aptitude safe-upgrade</command> を実行してください。このコマンドは他のパッケージを削除せずにアップグレード可能なインストール済みパッケージを探します。言い換えれば、最低限可能なアップグレードを行います。<command>apt-get</command> のアップグレードパッケージの選択ルールは <command>aptitude</command> よりも少し条件が厳しいです。これは <command>apt-get</command> は既にインストール済みのパッケージだけをアップグレードするからです。
pl_pl: Zaleca się regularne uaktualnienia, ponieważ zawierają one najnowsze aktualizacje dotyczące bezpieczeństwa. W celu uaktualnienia należy użyć <command>apt-get upgrade</command> lub <command>aptitude safe-upgrade</command> (oczywiście po <command>apt-get update</command>). Ta komenda wyszukuje pakiety, które mogą zostać uaktualnione bez usuwania innych pakietów. Innymi słowy, celem jest zapewnienie jak najmniej inwazyjnego uaktualnienia. <command>apt-get</command> jest nieco bardziej restrykcyjny niż <command>aptitude</command>, ponieważ nie zezwoli na instalację pakietów, które nie były zainstalowane wcześniej.

source: <emphasis>TIP</emphasis> Incremental upgrade
de_de: <emphasis>TIPP</emphasis> Inkrementelle Aktualisierung
ja_jp: <emphasis>TIP</emphasis> 増分アップグレード
pl_pl: <emphasis>WSKAZÓWKA</emphasis> Uaktualnienie przyrostowe
pt_br: <emphasis>DICA</emphasis> Atualização incremental

source: As we explained earlier, the aim of the <command>apt-get update</command> command is to download for each package source the corresponding <filename>Packages</filename> (or <filename>Sources</filename>) file. However, even after a <command>bzip2</command> compression, these files can remain rather large (the <filename>Packages.bz2</filename> for the <foreignphrase>main</foreignphrase> section of <emphasis role="distribution">Wheezy</emphasis> takes more than 5 MB). If you wish to upgrade regularly, these downloads can take up a lot of time.
ja_jp: 先に説明したとおり、<command>apt-get update</command> コマンドは、複数のパッケージソースから適当な <filename>Packages</filename> (または <filename>Sources</filename>) ファイルをダウンロードします。しかしながら、これらのファイルのサイズは <command>bzip2</command> 圧縮してもまだ大きいです (<emphasis role="distribution">Wheezy</emphasis> の <foreignphrase>main</foreignphrase> セクションの <filename>Packages.bz2</filename> は 5 MB 以上です)。日常的にアップグレードしたい場合、ダウンロードに時間がかかるという事です。
pl_pl: Jak zostało wyjaśnione wcześniej, celem komendy <command>apt-get update</command> jest pobranie dla każdego źródła pakietów jego odpowiedniego pliku <filename>Packages</filename> (lub <filename>Sources</filename>). Jednakże nawet po kompresji <command>bzip2</command> te pliki mogą być dość duże (plik <filename>Packages.bz2</filename> dla sekcji <foreignphrase>main</foreignphrase> wydania <emphasis role="distribution">Wheezy</emphasis> zajmuje więcej niż 5 MB). Jeżeli chcesz regularnie wykonywać uaktualnienia, to pobieranie może zabierać dużo czasu.

source: To speed up the process APT can download “diff” files containing the changes since the previous update, as opposed to the entire file. To achieve this, official Debian mirrors distribute different files which list the differences between one version of the <filename>Packages</filename> file and the following version. They are generated at each update of the archives and a history of one week is kept. Each of these “diff” files only takes a few dozen kilobytes for <emphasis role="distribution">Unstable</emphasis>, so that the amount of data downloaded by a weekly <command>aptitude update</command> is often divided by 10. For distributions like <emphasis role="distribution">Stable</emphasis> and <emphasis role="distribution">Testing</emphasis>, which change less, the gain is even more noticeable.
ja_jp: APT は作業を高速に進めるために、ファイル全体をダウンロードするのではなく、前回の更新以降の変更を含む「差分」をダウンロードします。これを実現するために、公式の Debian ミラーはある時点の <filename>Packages</filename> ファイルとそれ以降の時点の差分を含むファイルを配布します。差分はアーカイブが更新されるたびに生成され、1 週間につき 1 つが残されます。それぞれの「差分」ファイルは<emphasis role="distribution">不安定版</emphasis>の場合でもたった数十キロバイトです。そうすれば毎週 <command>aptitude update</command> を実行する場合にダウンロードされるデータ量は通常 10 分の 1 です。より変更頻度が低い <emphasis role="distribution">安定版</emphasis>や<emphasis role="distribution">テスト版</emphasis>などのディストリビューションについては、その増加はより顕著です。
pl_pl: W celu przyspieszenia tego procesu APT może pobierać pliki "diff", zawierające zmiany od poprzedniej aktualizacji, zamiast całego pliku. Aby to osiągnąć, oficjalne serwery lustrzane Debiana rozprowadzają różne pliki zawierające listę różnic pomiędzy jedną wersją pliku <filename>Packages</filename> i jej następną wersją. Są one tworzone przy każdej aktualizacji archiwów i przetrzymywane do tygodnia wstecz. Każdy z plików "diff" zajmuje tylko kilka kilobajtów dla wersji <emphasis role="distribution">Niestabilnej</emphasis>, więc ilość danych pobieranych podczas cotygodniowego <command>aptitude update</command> jest zazwyczaj 10 razy mniejsza. Dla dystrybucji takich jak <emphasis role="distribution">Stabilny</emphasis> i <emphasis role="distribution">Testowy</emphasis>, które podlegają mniejszym zmianom, ten zysk jest nawet bardziej zauważalny.

source: However, it can sometimes be of interest to force the download of the entire <filename>Packages</filename> file, especially when the last upgrade is very old and when the mechanism of incremental differences would not contribute much. This can also be interesting when network access is very fast but when the processor of the machine to upgrade is rather slow, since the time saved on the download is more than lost when the computer calculates the new versions of these files (starting with the older versions and applying the downloaded differences). To do that, you can use the configuration parameter <literal>Acquire::Pdiffs</literal> and set it to <literal>false</literal>.
ja_jp: しかしながら、特に最後のアップグレードが長い時間が経っている場合や増分差分の効果が薄い場合、<filename>Packages</filename> ファイルの全体を強制的にダウンロードしたいと思うかもしれません。これはまた、ネットワークがとても高速でマシンの処理がかなり遅い場合に興味深いです。なぜなら、ダウンロードによって節約される時間の方がコンピュータがファイルの新しいバージョンを計算する時間 (古いバージョンにダウンロードされた差分を連結していく時間) のほうが長いからです。こうするには、設定パラメータ <literal>Acquire::Pdiffs</literal> を <literal>false</literal> に設定してください。
pl_pl: Jednakże czasami pobranie całego pliku <filename>Packages</filename> jest pożądane, zwłaszcza jeżeli ostatnie uaktualnienie było bardzo dawno temu i mechanizm przyrostów różnicowych niewiele by wniósł. Może być to również interesujące w przypadku posiadania bardzo szybkiego połączenia z siecią w połączeniu ze stosunkowo wolnym procesorem uaktualnianej maszyny, ponieważ więcej czasu będzie zaoszczędzone na pobieraniu w porównaniu z obliczaniem nowych wersji tych plików (zaczynając od starszych wersji i aplikując kolejne różnice). W tym celu należy użyć parametru konfiguracyjnego <literal>Acquire::Pdiffs</literal> ustawionego na <literal>false</literal>.

source: <command>apt-get</command> will generally select the most recent version number (except for packages from <emphasis role="distribution">Experimental</emphasis> and <emphasis role="distribution">stable-backports</emphasis>, which are ignored by default whatever their version number). If you specified <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> in your <filename>sources.list</filename>, <command>apt-get upgrade</command> will switch most of your <emphasis role="distribution">Stable</emphasis> system to <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>, which might not be what you intended.
ja_jp: 通常 <command>apt-get</command> は最新のバージョン (<emphasis role="distribution">実験版</emphasis> と <emphasis role="distribution">安定版バックポート</emphasis> のパッケージは除きます。これらは普通バージョン番号にかかわらず無視されます) を選択します。<filename>sources.list</filename> の中で<emphasis role="distribution">テスト版</emphasis>や<emphasis role="distribution">不安定版</emphasis>を指定した場合、<command>apt-get upgrade</command> は<emphasis role="distribution">安定版</emphasis>システムのほとんどを<emphasis role="distribution">テスト版</emphasis>や<emphasis role="distribution">不安定版</emphasis>に変更します。これはあなたが望んでいないことかもしれません。
pl_pl: <command>apt-get</command> zazwyczaj wybierze najnowszy numer wersji (z wyjątkiem pakietów z <emphasis role="distribution">Experymentalnego</emphasis> i <emphasis role="distribution">stable-backports</emphasis>, które są domyślnie ignorowane bez względu na numer wersji). Jeżeli plik <filename>sources.list</filename> zawiera wpisy dla <emphasis role="distribution">Testowego</emphasis> lub <emphasis role="distribution">Niestabilnego</emphasis>, to <command>apt-get upgrade</command> zamieni większość Twojego <emphasis role="distribution">Stabilnego</emphasis> systemu na <emphasis role="distribution">Testowego</emphasis> lub <emphasis role="distribution">Niestabilnego</emphasis>, co niekoniecznie było w zamyśle.

source: To tell <command>apt-get</command> to use a specific distribution when searching for upgraded packages, you need to use the <literal>-t</literal> or <literal>--target-release</literal> option, followed by the name of the distribution you want (for example: <command>apt-get -t stable upgrade</command>). To avoid specifying this option every time you use <command>apt-get</command>, you can add <literal>APT::Default-Release "stable";</literal> in the file <filename>/etc/apt/apt.conf.d/local</filename>.
ja_jp: <command>apt-get</command> がアップグレードされたパッケージを検索する際に特定のディストリビューションを検索させるには、ディストリビューションの名前を後ろにつけて <literal>-t</literal> または <literal>--target-release</literal> オプションを使ってください (例: <command>apt-get -t stable upgrade</command>)。<command>apt-get</command> を使う時に毎回このオプションを指定するのを避けるには、<filename>/etc/apt/apt.conf.d/local</filename> ファイルに <literal>APT::Default-Release "stable";</literal> を追加してください。
pl_pl: Aby wskazać, żeby <command>apt-get</command> używał konkretnej dystrybucji w czasie wyszukiwania zmodernizowanych pakietów, należy użyć opcji <literal>-t</literal> lub <literal>--target-release</literal>, po której wpisać nazwę danej dystrybucji (na przykład: <command>apt-get -t stable upgrade</command>). Aby oszczędzić sobie wpisywania tej opcji za każdym razem użycia <command>apt-get</command>, można dodać wpis <literal>APT::Default-Release "stable";</literal> w pliku <filename>/etc/apt/apt.conf.d/local</filename>.

source: For more important upgrades, such as the change from one major Debian version to the next, you need to use <command>apt-get dist-upgrade</command> (“distribution upgrade”). With this instruction, <command>apt-get</command> will complete the upgrade even if it has to remove some obsolete packages or install new dependencies. This is also the command used by users who work daily with the Debian <emphasis role="distribution">Unstable</emphasis> release and follow its evolution day by day. It is so simple that it hardly needs explanation: APT's reputation is based on this great functionality.
ja_jp: より重要なアップグレード、例えば Debian のメジャーバージョンから次バージョンに変更するなどの場合、<command>apt-get dist-upgrade</command> (「ディストリビューションアップグレード」) を使ってください。この命令で、アップグレード伴う新しい依存関係で時代遅れのパッケージを削除することになったとしても、<command>apt-get</command> はアップグレードを完了します。この命令はまた Debian <emphasis role="distribution">不安定版</emphasis> リリースを日常的に使い、毎日開発進化についていくユーザが使うコマンドです。これは説明がほとんど必要ないくらいとても単純です: APT の評判はこの偉大なる機能性が担っています。
pl_pl: W celu ważniejszych uaktualnień, takich jak zmiana na następną wersję Debiana, należy użyć <command>apt-get dist-upgrade</command> ("uaktualnienie dystrybucji"). Używając tej instrukcji <command>apt-get</command> dokona całkowitego uaktualnienia, nawet jeżeli będzie musiał usunąć przestarzałe pakiety lub zainstalować nowe zależności. Poza tym jest to komenda stosowana na co dzień przez użytkowników wydania Debiana <emphasis role="distribution">Niestabilnego</emphasis>, która podąża za jego ewolucją z dnia na dzień. To jest tak proste, że mówi samo za siebie: reputacja APTa została zbudowana na tej genialnej funkcjonalności.

source: <command>aptitude full-upgrade</command> is <command>aptitude</command>'s corresponding command although <command>dist-upgrade</command> is also recognized (but deprecated).
ja_jp: <command>aptitude full-upgrade</command> は <command>aptitude</command> で上の命令に対応するコマンドですが、<command>dist-upgrade</command> も認識されます (将来廃止予定です)。
pl_pl: <command>aptitude full-upgrade</command> jest odpowiednikiem dla <command>aptitude</command>, jednakże <command>dist-upgrade</command> jest również rozpoznawane (ale przestarzałe).

source: Configuration Options
de_de: Konfigurationsoptionen
ja_jp: 設定オプション
pl_pl: Opcje konfiguracyjne
pt_br: Opções de configuração

source: <primary>APT</primary><secondary>configuration</secondary>
de_de: <primary>APT</primary><secondary>Konfiguration</secondary>
ja_jp: <primary>APT</primary><secondary>設定</secondary>
pt_br: <primary>APT</primary><secondary>configuração</secondary>

source: Besides the configuration elements already mentioned, it is possible to configure certain aspects of APT by adding directives in a file of the <filename>/etc/apt/apt.conf.d/</filename> directory. Remember for instance that it is possible for APT to tell <command>dpkg</command> to ignore file conflict errors by specifying <literal>DPkg::Options { "--force-overwrite"; }</literal>.
de_de: Neben den bereits erwähnten Konfigurationselementen ist es möglich, bestimmte Verhaltensweisen von APT durch das Hinzufügen von Vorschriften in einer Datei im Verzeichnis <filename>/etc/apt/apt.conf.d/</filename> festzulegen. Erinnern Sie sich beispielsweise daran, dass es APT möglich ist, <command>dpkg</command> anzuweisen, durch Dateikonflikte hervorgerufene Fehler zu ignorieren, indem Sie <literal>DPkg::Options { "--force-overwrite"; }</literal> angeben.
ja_jp: 既に説明した設定項目に加えて、<filename>/etc/apt/apt.conf.d/</filename> ディレクトリにファイルを追加して APT の特定の機能を設定できます。例えば、APT に <command>dpkg</command> がファイルの衝突によるエラーを無視するよう設定するには、<literal>DPkg::Options { "--force-overwrite"; }</literal> を指定してください。
pl_pl: Poza wymienionymi wcześniej elementami konfiguracyjnymi, możliwa jest konfiguracja pewnych aspektów działania APTa poprzez dodanie instrukcji w pliku katalogu <filename>/etc/apt/apt.conf.d/</filename>. Przypomnijmy na przykład, że APT może poinstruować <command>dpkg</command>, aby ignorował błędy kolizji plików przez dodanie instrukcji <literal>DPkg::Options { "--force-overwrite"; }</literal>.
pt_br: Apesar dos elementos de configuração sá mencionados, é possível configurar certos aspectos do APT adicionando directivas num arquivo do diretório <filename>/etc/apt/apt.conf.d/</filename>. Lembre, por exemplo, que é possível para o APT pedir ao <command>dpkg</command> para ignorar erros de conflito em arquivos ao especificar <literal>DPkg::Options { "--force-overwrite"; }</literal>.

source: If the Web can only be accessed through a proxy, add a line like <literal>Acquire::http::proxy "http://<replaceable>yourproxy</replaceable>:3128"</literal>. For an FTP proxy, write <literal>Acquire::ftp::proxy "ftp://<replaceable>yourproxy</replaceable>"</literal>. To discover more configuration options, read the <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page with the <command>man apt.conf</command> command (for details on manual pages, see <xref linkend="sect.manual-pages" />).
ja_jp: プロキシを介さないとウェブにアクセスできないのなら、<literal>Acquire::http::proxy "http://<replaceable>yourproxy</replaceable>:3128"</literal> の行を追加してください。FTP プロキシは <literal>Acquire::ftp::proxy "ftp://<replaceable>yourproxy</replaceable>"</literal> のように追加してください。より多くの設定オプションを確認するには、<command>man apt.conf</command> コマンドで <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> マニュアルページをご覧ください (マニュアルページの詳細は<xref linkend="sect.manual-pages" />をご覧ください)。
pl_pl: Jeżeli dostęp do sieci jest możliwy jedynie przez proxy, należy dodać linię podobną do <literal>Acquire::http::proxy "http://<replaceable>twojeproxy</replaceable>:3128"</literal>. Dla proxy FTP należy wpisać <literal>Acquire::ftp::proxy "ftp://<replaceable>twojeproxy</replaceable>"</literal>. Więcej opcji konfiguracyjnych można znaleźć na stronach pomocy <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> za pomocą komendy <command>man apt.conf</command> (szczegóły korzystania ze stron pomocy można znaleźć w <xref linkend="sect.manual-pages" />).

source: <emphasis>BACK TO BASICS</emphasis> Directories ending in <filename>.d</filename>
de_de: <emphasis>ZURÜCK ZU DEN GRUNDLAGEN</emphasis> Auf <filename>.d</filename> endende Verzeichnisse
ja_jp: <emphasis>BACK TO BASICS</emphasis> <filename>.d</filename> で終わるディレクトリ
pl_pl: <emphasis>WRACAJĄC DO PODSTAW</emphasis> Katalogi zakończone na <filename>.d</filename>
pt_br: <emphasis>DE VOLTA AO BÁSICO</emphasis> Diretórios terminados em <filename>.d</filename>
