Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: In this section, we will focus on upgrading a <emphasis role="distribution">Lenny</emphasis> system to <emphasis role="distribution">Squeeze</emphasis>. This is a major operation on a system; as such, it is never 100% risk-free, and should not be attempted before all important data has been backed up.
de_de: In diesem Abschnitt gehen wir auf die Aktualisierung eines <emphasis role="distribution">Lenny</emphasis> Systems auf <emphasis role="distribution">Squeeze</emphasis> ein. Dies ist ein erheblicher Eingriff in ein System, der niemals 100% risikofrei ist und nur nach der Sicherung aller wichtigen Daten unternommen werden sollte.
pt_br: Nesta seção, vamos focar em atualizar um sistema de <emphasis role="distribution">Lenny</emphasis> para <emphasis role="distribution">Squeeze</emphasis>. Esta é uma operação importante num sistema; e como tal, nunca é 100% segura, e só deve ser tentada depois que todos os dados tenham sido protegidos num backup.

source: Another good habit which makes the upgrade easier (and shorter) is to tidy your installed packages and keep only the ones that are really needed. Helpful tools to do that include <command>aptitude</command>, <command>deborphan</command> and <command>debfoster</command> (see <xref linkend="aptitude" />). For example, you can use the following command:
de_de: Eine weitere gute Angewohnheit, die das Aktualisieren erleichtert (und verkürzt), ist das Aufräumen der installierten Pakete und nur die zu behalten, die wirklich gebraucht werden. Hilfreiche Werkzeuge dazu sind unter anderem <command>aptitude</command>, <command>deborphan</command> und <command>debfoster</command> (siehe <xref linkend="aptitude" />). Sie können beispielsweise folgenden Befehl nutzen:
pt_br: Outro hábito que mantém a atualização mais fácil (e rápida) é organizar a quantidade de pacotes instalados e manter apenas aqueles que são realmente necessários. Ferramentas úteis para isto incluem <command>aptitude</command>, <command>deborphan</command> e <command>debfoster</command> (veja <xref linkend="aptitude" />). Por exemplo, você pode usar o seguinte comando:

source: Now for the upgrading itself. First, you need to change the <filename>/etc/apt/sources.list</filename> file to tell APT to get its packages from <emphasis role="distribution">Squeeze</emphasis> instead of <emphasis role="distribution">Lenny</emphasis>. If the file only contains references to <emphasis role="distribution">Stable</emphasis> rather than explicit codenames, the change isn't even required, since <emphasis role="distribution">Stable</emphasis> always refers to the latest released version of Debian. In both cases, the database of available packages must be refreshed (with the <command>aptitude update</command> command or the refresh button in <command>synaptic</command>).
de_de: Nun zur Aktualisierung selbst: Zuerst müssen Sie die Datei <filename>/etc/apt/sources.list</filename> anpassen, um APT anzuweisen, die Pakete aus <emphasis role="distribution">Squeeze</emphasis> anstatt aus <emphasis role="distribution">Lenny</emphasis> zu verwenden. Wenn die Datei ausschließlich Verweise auf <emphasis role="distribution">Stable</emphasis> statt auf einen expliziten Codenamen enthält, ist diese Änderung nicht einmal nötig, da <emphasis role="distribution">Stable</emphasis> immer auf die zuletzt veröffentlichte Version von Debian zeigt. In beiden Fällen muss die Datenbank der verfügbaren Pakete aktualisiert werden (mit dem Befehl <command>aptitude update</command> oder der Schaltfläche "Neu laden" in <command>synaptic</command>).
pt_br: Agora para a atualização em si. Primeiro, você precisa mudar o arquivo <filename>/etc/apt/sources.list</filename> para dizer ao APT para obter os pacotes da <emphasis role="distribution">Squeeze</emphasis> ao invés da <emphasis role="distribution">Lenny</emphasis>. Se o arquivo apenas contém referências à <emphasis role="distribution">Stable</emphasis> ao invés do codinome explicitamente, esta mudança não é necessária, já que o nome <emphasis role="distribution">Stable</emphasis> sempre se refere à última versão lançcada do Debian. Em ambos os casos, o banco de dados de pacotes disponíveis deve ser atualizado (com o comando <command>aptitude update</command> ou o botão command or the recarregar no <command>synaptic</command>).

source: Once these new package sources are registered, you need to upgrade the <emphasis role="pkg">aptitude</emphasis> and <emphasis role="pkg">apt</emphasis> packages; their versions in <emphasis role="distribution">Lenny</emphasis> have some limitations that could compromise the automatic upgrade.
de_de: Sobald die neuen Paketquellen eingetragen sind, müssen Sie die Pakete <emphasis role="pkg">aptitude</emphasis> und <emphasis role="pkg">apt</emphasis> aktualisieren – die Versionen in <emphasis role="distribution">Lenny</emphasis> haben Einschränkungen, die eine automatische Aktualisierung beeinträchtigen können.
pt_br: Uma vez que estas novas origens de pacotes estiverem registradas, você vai precisar atualizar os pacotes <emphasis role="pkg">aptitude</emphasis> e <emphasis role="pkg">apt</emphasis>; suas versões na <emphasis role="distribution">Lenny</emphasis> tem algumas limitações que podem comprometer a atualização automática.

source: Remember to upgrade (or install) the most essential packages listed below, otherwise you might find that your system is unbootable:
de_de: Achten Sie darauf, die wesentlichsten, unten aufgeführten, Pakete zu aktualisieren (oder zu installieren), andernfalls könnte Ihr System nicht bootfähig sein:
pt_br: lembre de atualizar (ou instalar) os pacotes mais essenciais listados abaixo, caso contrário você pode terminar com um sistema que não inicia:

source: the bootloader <emphasis role="pkg">grub-pc</emphasis> or <emphasis role="pkg">grub-legacy</emphasis> (sometimes <emphasis role="pkg">lilo</emphasis>);
de_de: der Bootloader <emphasis role="pkg">grub-pc</emphasis> oder <emphasis role="pkg">grub-legacy</emphasis> (manchmal auch <emphasis role="pkg">lilo</emphasis>);
pt_br: o carregador de boot <emphasis role="pkg">grub-pc</emphasis> ou o <emphasis role="pkg">grub-legacy</emphasis> (às vezes <emphasis role="pkg">lilo</emphasis>);

source: the tools that build the initial ramdisk (initrd): <emphasis role="pkg">initramfs-tools</emphasis>;
de_de: die Programme, um die initiale RAM-Disk anzulegen (initrd): <emphasis role="pkg">initramfs-tools</emphasis>;
pt_br: a ferramenta que constrói o ramdisk inicial (initrd): <emphasis role="pkg">initramfs-tools</emphasis>;

source: the standard library: <emphasis role="pkg">libc6</emphasis> or one of its optimized variants such as <emphasis role="pkg">libc6-i686</emphasis>;
de_de: die Standard-Bibliothek: <emphasis role="pkg">libc6</emphasis> oder eine ihrer optimierten Varianten, wie <emphasis role="pkg">libc6-i686</emphasis>;
pt_br: a biblioteca padrão: <emphasis role="pkg">libc6</emphasis> ou uma de suas variações otimizadas como a <emphasis role="pkg">libc6-i686</emphasis>;

source: the management system for device files: <emphasis role="pkg">udev</emphasis>;
de_de: das Verwaltungssystem für Gerätedateien: <emphasis role="pkg">udev</emphasis>;
pt_br: o sistema de gestão para arquivos de dispositivo: <emphasis role="pkg">udev</emphasis>;

source: last but not least, the kernel: depending on the hardware, the metapackages to use are <emphasis role="pkg">linux-image-486</emphasis>, <emphasis role="pkg">linux-image-686</emphasis> or <emphasis role="pkg">linux-image-686-bigmem</emphasis>. These packages will only work for the i386 architecture; owners of computers based on different hardware will use other packages, most likely <emphasis role="pkg">linux-image-2.6-amd64</emphasis> for AMD64 or <emphasis role="pkg">linux-image-powerpc*</emphasis> for PowerPC.
de_de: und nicht zuletzt, den Kernel: Abhängig von der Hardware sind die zu nutzenden Metapakete <emphasis role="pkg">linux-image-486</emphasis>, <emphasis role="pkg">linux-image-686</emphasis> oder <emphasis role="pkg">linux-image-686-bigmem</emphasis>. Diese Pakete funktionieren nur auf der i386 Architektur; Besitzer von Computern mit anderer Hardware benötigen andere Pakete, sehr wahrscheinlich <emphasis role="pkg">linux-image-2.6-amd64</emphasis> für AMD64 oder <emphasis role="pkg">linux-image-powerpc*</emphasis> für PowerPC.
pt_br: e por último, mas não menos importante, o núcleo: dependendo do hardware, os metapacotes para usar são <emphasis role="pkg">linux-image-486</emphasis>, <emphasis role="pkg">linux-image-686</emphasis> ou <emphasis role="pkg">linux-image-686-bigmem</emphasis>. Estes pacotes só vão funcionar na arquitetura i386; proprietários de computadores baseados em hardware diferente vão usar outros pacotes, mais provavelmente <emphasis role="pkg">linux-image-2.6-amd64</emphasis> para AMD64 ou <emphasis role="pkg">linux-image-powerpc*</emphasis> para PowerPC.

source: Once these first steps are done, it is time to handle the upgrade itself, either with <command>aptitude</command> or <command>synaptic</command>. You should carefully check the suggested actions before applying them: you might want to add suggested packages or deselect packages which are only recommended and known not to be useful. In any case, the front-end should come up with a scenario ending in a coherent and up-to-date <emphasis role="distribution">Squeeze</emphasis> system. Then, all you need is to do is wait while the required packages are downloaded, answer the Debconf questions and possibly those about locally modified configuration files, and sit back while APT does its magic.
de_de: Nachdem diese ersten Schritte getan sind, ist es an der Zeit, die Aktualisierung selbst durchzuführen. Entweder mit <command>aptitude</command> oder <command>synaptic</command>. Sie sollten die vorgeschlagenen Aktionen sehr sorgfältig prüfen, bevor Sie sie ausführen: Vielleicht möchten Sie vorgeschlagene Pakete auswählen oder nur empfohlene Pakete abwählen, die als nicht nützlich bekannt sind. In jedem Fall sollte die Benutzeroberfläche ein Szenario vorschlagen, das in einem kohärenten, aktuellen <emphasis role="distribution">Squeeze</emphasis> System resultiert. Danach müssen Sie sich nur noch gedulden, bis die benötigten Pakete heruntergeladen sind, die Fragen von Debconf und möglicherweise über lokal veränderte Konfigurationsdateien beantworten und sich zurücklehnen, während APT seine Magie wirkt.
pt_br: Uma vez que estes primeiros passos tenha sido feitos, é hora de partir para a atualização em si, com o <command>aptitude</command> ou com o <command>synaptic</command>. Você deve cuidadosamente verificar as ações sugeridas antes de aplicá-las: você pode querer adicionar os pacotes sugeridos ou desmarcar pacotes que são apenas recomendados e que você saiba que não serão úteis. De qualquer forma, a interface deve terminar com um cenário de um sistema <emphasis role="distribution">Squeeze</emphasis> coerente e atualizado. Então, tudo o que você tem a fazer é esperar que os pacotes necessários sejam baixados, responder as perguntas do Debconf e possivelmente as perguntas relativas a arquivos de configuração localmente modificados, e sentar e esperar que o APT faça sua mágica.

source: Depending on the severity of the bug, a new version of the package may be prepared specifically for a new revision of the stable release. When this happens, the fixed package is made available in the <literal>proposed-updates</literal> section of the Debian mirrors (see <xref linkend="section.proposed-updates" />). The corresponding entry can then be temporarily added to the <filename>sources.list</filename> file, and updated packages can be installed with <command>apt-get</command> or <command>aptitude</command>.
de_de: Abhängig von der Schwere eines Fehlers, kann eine neue Paketversion speziell für die nächste Ausgabe der Stable Veröffentlichung vorbereitet werden. Sollte dies der Fall sein, wird das korrigierte Paket im Bereich <literal>proposed-updates</literal> der Debian Spiegelserver bereitgestellt (siehe <xref linkend="section.proposed-updates" />). Der entsprechende Eintrag kann dann temporär der Datei <filename>sources.list</filename> hinzugefügt werden. Aktualisierte Pakete können mit <command>apt-get</command> oder <command>aptitude</command> installiert werden.
pt_br: Dependendo da severidade do bug, uma nova versão do pacote pode ser preparada especificamente para para uma nova revisão do lançamento estável. Quando isto acontece, o pacote consertado é disponibilizado na seção <literal>proposed-updates</literal> dos espelhos Debian (veja <xref linkend="section.proposed-updates" />). A entrada correspondente pode então ser adicionada temporariamente ao arquivo <filename>sources.list</filename>, e pacotes atualizados podem ser instalados com <command>apt-get</command> ou <command>aptitude</command>.

source: The first of these tools is <command>apticron</command>, in the package of the same name. Its main effect is to run a script daily (via <command>cron</command>). The script updates the list of available packages, and, if some installed packages are not in the latest available version, it sends an email with a list of these packages along with the changes that have been made in the new versions. Obviously, this package mostly targets users of Debian <emphasis role="distribution">Stable</emphasis>, since the daily emails would be very long for the more mobile versions of Debian. When updates are available, <command>apticron</command> automatically downloads them. It does not install them — the administrator will still do it — but having the packages already downloaded and available locally (in APT's cache) makes the job faster.
de_de: Das erste dieser Werkzeuge ist <command>apticron</command> im Paket gleichen Namens. Seine Hauptaufgabe ist, täglich ein Skript (via <command>cron</command>) auszuführen. Das Skript aktualisiert die Liste der verfügbaren Pakete und schickt, falls ein installiertes Paket nicht in der aktuellsten Version vorliegt, eine E-Mail mit der Liste dieser Pakete zusammen mit den Änderungen in den neuen Versionen. Offenkundig richtet sich dieses Paket an Anwender von Debian <emphasis role="distribution">Stable</emphasis>, da tägliche E-Mails für die sich häufiger ändernden Versionen von Debian doch sehr lang würden. Sind Aktualisierungen verfügbar, lädt <command>apticron</command> sie automatisch herunter. Es installiert sie nicht – das ist dem Administrator überlassen – aber dass die Pakete bereits heruntergeladen und lokal verfügbar (im Zwischenspeicher von APT) sind, beschleunigt die Aufgabe.
pt_br: A primeira destas ferramentas é a <command>apticron</command>, no pacote de mesmo nome. Seu principal efeito é executar um script diariamente (via <command>cron</command>). O script atualiza a lista de pacotes disponíveis, e, se alguns pacotes instalados não estão na versão mais recente, ele envia um email com uma lista destes pacotes e com as mudanças que foram feitas nas novas versões. Obviamente, este pacote foca principalmente em usuários do Debian <emphasis role="distribution">Stable</emphasis>, já que os emails diários podem ser muito longos para versões mais dinâmicas do Debian. Quando atualizações são disponibilizadas, o <command>apticron</command> automaticamente baixa elas. Mas não as instala — o administrador ainda tem que fazer isto — mas ter os pacotes já baixados e disponíveis localmente (no cache do APT) torna o serviço mais rápido.

source: Administrators in charge of several computers will no doubt appreciate being informed of pending upgrades, but the upgrades themselves are still as tedious as they used to be, which is where the <filename>/etc/cron.daily/apt</filename> script (in the <emphasis role="pkg">apt</emphasis> package) comes in handy. This script is also run daily (and non-interactively) by <command>cron</command>. To control its behavior, use APT configuration variables (which are therefore stored in a file under <filename>/etc/apt/apt.conf.d/</filename>). The main three variables are:
de_de: Administratoren, die für viele Computer zuständig sind, werden es ohne Zweifel schätzen, über anstehende Aktualisierungen informiert zu werden, das Durchführen der Aktualisierungen selbst bleibt aber weiterhin mühsam. An dieser Stelle wird das Skript <filename>/etc/cron.daily/apt</filename> (aus dem <emphasis role="pkg">apt</emphasis> Paket) interessant. Dieses Skript wird ebenfalls täglich durch <command>cron</command> ausgeführt (nicht-interaktiv). Um sein Verhalten zu bestimmen, verwenden Sie APT Konfigurationsvariablen (gespeichert in einer Datei unter <filename>/etc/apt/apt.conf.d/</filename>). Die drei Hauptvariablen sind:
pt_br: Administradores responsáveis por vários computadores com certeza vão apreciar ser informados de atualizações pendentes, mas as atualizações em si são tediosas como sempre, o que torna o script <filename>/etc/cron.daily/apt</filename> (no pacote <emphasis role="pkg">apt</emphasis>) útil. Este script também é executado diariamente (e não-interativamente) pelo <command>cron</command>. Para controlar seu comportamento, use variáveis de configuração do APT (que devem ser postas num arquivo em <filename>/etc/apt/apt.conf.d/</filename>). As três principais variáveis são:

source: This last option covers a feature that <command>apticron</command> doesn't have. It controls how often obsolete packages (those not referenced by any distribution anymore) are removed from the APT cache. This keeps the APT cache at a reasonable size and means that you don't need to worry about that task.
de_de: Die letzte Option deckt ein Merkmal ab, über das <command>apticron</command> nicht verfügt. Sie bestimmt, wie häufig veraltete Pakete (die von keiner Veröffentlichung mehr referenziert werden) aus dem Zwischenspeicher von APT entfernt werden. Dies hält den Zwischenspeicher von APT auf einer sinnvollen Größe und entlastet Sie davon, sich Gedanken um diese Aufgabe machen zu müssen.
pt_br: Esta última opção cobre uma funcionalidade que o <command>apticron</command> não tem. Ela controla quão frequentemente pacotes obsoletos (aqueles não referenciados por mais nenhuma distribuição) são removidos do cache do APT. Isto mantém o cache do APT num tamanho razoável e evita que você tenha que se preocupar com esta tarefa.

source: These tools work very well for servers, but desktop users generally prefer a more interactive system. That is why the “Graphical desktop environment” task installs <command>update-notifier</command> and <command>update-manager</command>. The former displays an icon in the notification area of desktop environments when updates are available; clicking on this icon then runs <command>update-manager</command>, a simplified interface to perform updates. You can browse through available updates, read the description of the relevant packages and their <filename>changelog</filename>, and select whether to apply the update or not on a case-by-case basis. Note that these packages contain configuration data for <filename>/etc/cron.daily/apt</filename> so that it refreshes the lists of available packages and downloads the relevant ones. The <command>update-notifier</command>/<command>update-manager</command> combination is far from having as many features as <command>aptitude</command> and <command>synaptic</command>, since it only handles the upgrades of packages which are already installed; as a consequence, its minimalistic interface leaves little room for mistakes, and therefore little risk of breaking the system.
de_de: Diese Werkzeuge eignen sich sehr gut für Server, aber Anwender von Arbeitsplatzrechnen bevorzugen üblicherweise ein interaktiveres System. Aus diesem Grund installiert die Programmgruppe "Desktop-Umgebung“ (Arbeitsplatzrechner)" <command>update-notifier</command> und <command>update-manager</command>. Das erste blendet ein Symbol im Benachrichtigungsfeld der Benutzeroberfläche ein, sobald Aktualisierungen verfügbar sind. Das Anklicken dieses Symbols startet dann <command>update-manager</command>, eine vereinfachte Oberfläche, um die Aktualisierung durchzuführen. Sie können die Liste der verfügbaren Aktualisierungen durchblättern, die Beschreibungen der betroffenen Pakete und deren <filename>changelog</filename> lesen und auswählen, welche Pakete Sie aktualisieren wollen und welche nicht. Beachten Sie, dass beide Pakete Konfigurationsdaten für <filename>/etc/cron.daily/apt</filename> enthalten, damit die Listen der verfügbaren Pakete aktualisiert und betroffene Pakete heruntergeladen werden können. Die Kombination <command>update-notifier</command>/<command>update-manager</command> ist weit vom Funktionsumfang von <command>aptitude</command> und <command>synaptic</command> entfernt, da sie nur Aktualisierungen für bereits installierte Pakete behandeln, dafür lässt die minimalistische Oberfläche kaum Raum für Fehler und birgt daher wenig Gefahr, das System zu beschädigen.
pt_br: Estas ferramentas funcionam muito bem em servidores, mas usuários de desktop normalmente preferem um sistema mais interativo. É por isto que a tarefa “Graphical desktop environment” ("ambiente de área de trabalho gráfico") instala o <command>update-notifier</command> e o <command>update-manager</command>. O primeiro exibe um ícone na área de notificação do dos ambientes de desktop quando existem atualizações disponíveis; ao clicar neste ícone é aberto o <command>update-manager</command>, uma interface simplificada para realizar atualizações. Você pode navegar através de atualizações disponíveis, ler a descrição dos pacotes relevantes e seus <filename>changelog</filename>, e selecionar se deve aplicar a atualização caso-a-caso. Observe que estes pacotes contém dados de configuração para o <filename>/etc/cron.daily/apt</filename> de forma que ele renova as listas de pacotes disponíveis e baixa os relevantes. A combinação <command>update-notifier</command>/<command>update-manager</command> está longe de ter tantas funcionalidades quanto o <command>aptitude</command> e o <command>synaptic</command>, já que ele apenas manipula atualizações de pacotes que já estão instalados; como consequência, sua interface minimalista dá poucas chances de erro, e portanto pouco risco de inutilizar o sistema.

source: Upgrading with <command>update-manager</command>
de_de: Aktualisieren mit <command>update-manager</command>
pt_br: Atualizando com <command>update-manager</command>

source: <primary>upgrade</primary><secondary>automatic (of the system)</secondary>
de_de: <primary>Aktualisierung</primary><secondary>automatische (des Systems)</secondary>
pt_br: <primary>atualização</primary><secondary>automática (do sistema)</secondary>
