Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: When APT checks <filename>/etc/apt/preferences</filename>, it first takes into account the most specific entries (often those specifying the concerned package), then the more generic ones (including for example all the packages of a distribution). If several generic entries exist, the first match is used. The available selection criteria include the package's name and the source providing it. Every package source is identified by the information contained in a <filename>Release</filename> file that APT downloads together with the <filename>Packages.gz</filename> files. It specifies the origin (usually “Debian” for the packages of official mirrors, but it can also be a person's or an organization's name for third-parties repositories). It also gives the name of the distribution (usually <emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> or <emphasis role="distribution">Experimental</emphasis> for the standard distributions provided by Debian) together with its version (for example 5.0 for Debian <emphasis role="distribution">Lenny</emphasis>). Let's have a look at its syntax through some realistic case studies of this mechanism.
de_de: Wenn APT <filename>/etc/apt/preferences</filename> prüft, betrachtet es zuerst die spezifischsten Einträge (oftmals die Einträge, die das betreffende Paket beschreiben) und die allgemeineren (dies beinhaltet beispielsweise alle Pakete einer Distribution). Wenn mehrere allgemeine Einträge existieren, wird der erste Treffer genutzt. Die zur Verfügung stehenden Auswahlkriterien umfassen den Paketnamen und die zur Verfügung stellenden Quelle. Jede Paketquelle wird durch die Informationen in einer <filename>Release</filename>-Datei beschrieben, die APT zusammen mit den <filename>Packages.gz</filename>-Dateien herunter lädt. Sie umfasst die Herkunft (bei Paketen der offiziellen Spiegel normalerweise "Debian", es können aber auch Personen- oder Organisationsnamen sein, falls es sich um Paketdepots Dritter handelt) und den Distributionsnamen (normalerweise <emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> oder <emphasis role="distribution">Experimental</emphasis> bei den Debian von bereitgestellten Standarddistributionen) zusammen mit der Version (zum Beispiel 5.0 für Debian <emphasis role="distribution">Lenny</emphasis>). Betrachten wir die Syntax und Mechanismus anhand einiger Praxisbeispiele.
pt_br: Quando o APT verifica o <filename>/etc/apt/preferences</filename>, ele leva em conta primeiro as entradas mais específicas (geralmente aquelas especificando o pacote em consideração), para depois ir para as mais genéricas (incluindo, por exemplo, todos os pacotes de uma distribuição). Se várias entradas genéricas existirem, o primeiro "match" é usado. O critério de seleção disponível inclui o nome do pacote e a fonte que o fornece. Cada fonte de pacote é identificada pela informação contida em um arquivo <filename>Release</filename> que o APT baixa junto com os arquivos <filename>Packages.gz</filename>. Ele especifica a origem (normalmente "Debian" para os pacotes de espelhos oficiais, mas pode ser também um nome de pessoa ou organização para repositórios de terceiros). Ele também dá o nome da distribuição (normalmente <emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> ou <emphasis role="distribution">Experimental</emphasis> para as distribuições padrão fornecidas pelo Debian) junto com sua versão (por exemplo 5.0 para o Debian <emphasis role="distribution">Lenny</emphasis>). Vamos dar uma olhada na sintaxe em alguns estudos de caso reais deste mecanismo.

source: Let's now assume that you have a server with several local programs depending on the version 5.10 of Perl and that you want to ensure that upgrades will not install another version of it. You could use this entry:
de_de: Lassen Sie uns nun annehmen, die besäßen einen Server mit lokalen Programmen, die Perl in der Version 5.10 benötigen und Sie wollen sicherstellen, das Aktualisierungen keine neuere Version installieren. Sie könnten folgenden Eintrag benutzen:
pt_br: Suponha agora que você tenha um servidor com vários programas locais que dependem da versão 5.10 do Perl e que você queira garantir que atualizações não vão instalar outra versão dele. Você pode usar esta entrada:

source: <primary><literal>Explanation</literal></primary>
pt_br: <primary><literal>Explicação</literal></primary>

source: Explanation: The package xserver-xorg-video-intel provided Explanation: in experimental can be used safely Package: xserver-xorg-video-intel Pin: release a=experimental Pin-Priority: 500
pt_br: Explanation: O pacote xserver-xorg-video-intel fornecido na Explanation: experimental pode ser usado Package: xserver-xorg-video-intel Pin: release a=experimental Pin-Priority: 500

source: <command>aptitude</command> being such a marvelous tool, it is tempting to pick packages coming from other distributions. For example, after having installed a <emphasis role="distribution">Stable</emphasis> system, you might want to try out a software package available in <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> without diverging too much from the system's initial state.
de_de: <command>aptitude</command> ist ein so hervorragendes Werkzeug, dass es geradezu dazu herausfordert, Pakete aus unterschiedlichen Distributionen zu nutzen. Beispielsweise könnten Sie nach der Installation eines <emphasis role="distribution">Stable</emphasis>-Systems ein in <emphasis role="distribution">Testing</emphasis> oder <emphasis role="distribution">Unstable</emphasis> verfügbares Paket ausprobieren, ohne zu sehr vom Ursprungszustand Ihres Systems abzuweichen.
pt_br: Sendo o <command>aptitude</command> uma ferramenta assim tão maravilhosa, é tentador pegar pacotes de outras ditribuicões. Por exemplo, depois de instalar um sistema <emphasis role="distribution">Stable</emphasis>, você pode querer tentar um pacote de software disponível na <emphasis role="distribution">Testing</emphasis> ou <emphasis role="distribution">Unstable</emphasis> sem divergir muito do estado inicial do sistema.

source: Even if you will occasionally encounter problems while mixing packages from different distributions, <command>aptitude</command> manages such coexistence very well and limits risks very effectively. The best way to proceed is to list all distributions used in <filename>/etc/apt/sources.list</filename> (some people always put the three distributions, but remember that <emphasis role="distribution">Unstable</emphasis> is reserved for experienced users) and to define your reference distribution with the <literal>APT::Default-Release</literal> parameter (see <xref linkend="section.apt-mise-a-jour" />).
de_de: Selbst wenn Sie beim Mischen von Paketen aus unterschiedlichen Distributionen gelegentlich auf Probleme stossen sollten, <command>aptitude</command> verwaltet ein solches Nebeneinander sehr gut und beschränkt die Risiken sehr effektiv. Die beste Vorgehensweise ist, alle benutzten Distributionen in <filename>/etc/apt/sources.list</filename> einzutragen (es gibt Leute, die immer alle drei Distributionen eintragen, aber beachten Sie, dass <emphasis role="distribution">Unstable</emphasis> nur für erfahrene Anwender vorgesehen ist) und die Referenzdistribution mit dem <literal>APT::Default-Release</literal> Parameter fest zu legen (siehe <xref linkend="section.apt-mise-a-jour" />).
pt_br: Mesmo se você ocasionalmente encontrar problemas enquanto estiver misturando pacotes de distribuições diferentes, o <command>aptitude</command> gerencia tal coexistência muito bem e limita os riscos de forma bastante efetiva. A melhor maneira de proceder é listando todas as distribuições usadas em <filename>/etc/apt/sources.list</filename> (algumas pessoas sempre botam as três distribuições, mas lembre-se que <emphasis role="distribution">Unstable</emphasis> é reservada para usuários experientes) e definindo a sua distribuição de referência com o parâmetro <literal>APT::Default-Release</literal> (see <xref linkend="section.apt-mise-a-jour" />).

source: Let's suppose that <emphasis role="distribution">Stable</emphasis> is your reference distribution but that <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> are also listed in your <filename>sources.list</filename> file. In this case, you can use <command>aptitude install <replaceable>package</replaceable>/testing</command> to install a package from <emphasis role="distribution">Testing</emphasis>. If the installation fails due to some unsatisfiable dependencies, let it solve those dependencies within <emphasis role="distribution">Testing</emphasis> by adding the <literal>-t testing</literal> parameter. The same obviously applies to <emphasis role="distribution">Unstable</emphasis>.
de_de: Nehmen wir einmal an, <emphasis role="distribution">Stable</emphasis> sei Ihre Referenzdistribution aber <emphasis role="distribution">Testing</emphasis> und <emphasis role="distribution">Unstable</emphasis> seien auch in Ihrer <filename>sources.list</filename>-Datei gelistet. In diesem Fall können Sie <command>aptitude install <replaceable>package</replaceable>/testing</command> nutzen, um ein Paket aus <emphasis role="distribution">Testing</emphasis> zu installieren. Sollte die Installation auf Grund von nicht auflösbaren Abhängigkeiten scheitern, lassen sich diese Abhängigkeiten in <emphasis role="distribution">Testing</emphasis> durch Angabe des <literal>-t testing</literal> Parameters lösen. Dies gilt gleichermassen für <emphasis role="distribution">Unstable</emphasis>.
pt_br: suponha que <emphasis role="distribution">Stable</emphasis> é sua distribuição de referência mas que <emphasis role="distribution">Testing</emphasis> e <emphasis role="distribution">Unstable</emphasis> também estão listadas em seu arquivo <filename>sources.list</filename>. Neste caso, você pode usar <command>aptitude install <replaceable>pacote</replaceable>/testing</command> para instalar um pacote da <emphasis role="distribution">Testing</emphasis>. Se a instalação falha devido a algumas dependências não-satisfeitas, deixe ela resolver estas dependências na <emphasis role="distribution">Testing</emphasis> adicionando o parâmetro <literal>-t testing</literal>. O mesmo obviamente se aplica à <emphasis role="distribution">Unstable</emphasis>.

source: In this situation, upgrades (<command>safe-upgrade</command> and <command>dist-upgrade</command>) are done within <emphasis role="distribution">Stable</emphasis> except for packages already upgraded to an other distribution: those will follow updates available in the other distributions. We'll explain this behavior with the help of the default priorities set by APT below. Do not hesitate to use <command>apt-cache policy</command> (see sidebar) to verify the given priorities.
de_de: In dieser Situation werden Aktualisierungen (<command>safe-upgrade</command> und <command>dist-upgrade</command>) in <emphasis role="distribution">Stable</emphasis> vorgenommen, ausgenommen Pakete, die bereits auf eine andere Distribution aktualisiert wurden: Diese folgen den Aktualisierungen der anderen Distributionen. Wir erklären dieses Verhalten mit Hilfe der von APT gesetzten Standardprioritäten weiter unten. Benutzen Sie <command>apt-cache policy</command> (siehe Seitenleiste), um die gesetzten Prioritäten zu überprüfen.
pt_br: Nesta situação, atualizações (<command>safe-upgrade</command> e <command>dist-upgrade</command>) são feitas no <emphasis role="distribution">Stable</emphasis> exceto para pacotes já atualizados para uma outra distribuição: estes vão seguir as atualizações disponíveis em outras distribuições. Vamos explicar este comportamento com a ajuda de prioridades padrão configuradas pelo APT abaixo. Não hesite em usar <command>apt-cache policy</command> (veja a barra lateral) para verificar as prioridades dadas.

source: The <command>apt-cache</command> command can display much of the information stored in APT's internal database. This information is a sort of cache since it is gathered from the different sources listed in the <filename>sources.list</filename> file. This happens during the <command>aptitude update</command> operation.
de_de: Der Befehl <command>apt-cache</command> kann viele Informationen aus APTs interner Datenbank anzeigen. Diese Informationen sind eine Art von Zwischenspeicher (Cache), da sie aus verschiedenen, in der Datei <filename>sources.list</filename> gelisteten, Quellen zusammengetragen wurden. Dies passiert während der <command>aptitude update</command> Operation.
pt_br: O comando <command>apt-cache</command> pode apresentar grande parte das informações armazenadas no banco de dados interno do APT. Esta informação é uma espécie de cache, pois é recolhida de diferentes fontes, listadas no arquivo <filename>sources.list</filename>. Isso acontece durante a operação do <command>aptitude update</command>.

source: The <command>apt-cache</command> command can do keyword-based package searches with <command>apt-cache search <replaceable>keyword</replaceable></command>. It can also display the headers of the package's available versions with <command>apt-cache show <replaceable>package</replaceable></command>. This command provides the package's description, its dependencies, the name of its maintainer, etc. Note that <command>aptitude search</command> and <command>aptitude show</command> work in the same way. <indexterm><primary><command>apt-cache show</command></primary></indexterm><indexterm><primary><command>apt-cache search</command></primary></indexterm><indexterm><primary><command>aptitude show</command></primary></indexterm><indexterm><primary><command>aptitude search</command></primary></indexterm>
de_de: Der Befehl <command>apt-cache</command> kann eine Schlüsselwort-basierte Paketsuche mittels <command>apt-cache search <replaceable>Schlüsselwort</replaceable></command> durchführen. Ebenso kann er die Kopfzeilen verfügbarer Versionen von Paketen mit <command>apt-cache show <replaceable>Paket</replaceable></command> anzeigen. Dieser Befehl liefert die Paketbeschreibung, dessen Abhängigkeiten, den Namen des Paket-Maintainers usw. Beachten Sie, dass <command>aptitude search</command> und <command>aptitude show</command> auf gleiche Weise funktionieren. <indexterm><primary><command>apt-cache show</command></primary></indexterm><indexterm><primary><command>apt-cache search</command></primary></indexterm><indexterm><primary><command>aptitude show</command></primary></indexterm><indexterm><primary><command>aptitude search</command></primary></indexterm>
pt_br: O comando <command>apt-cache</command> pode buscar pacotes baseado em palavras-chave com <command>apt-cache search <replaceable>palavra-chave</replaceable></command>. Também pode mostrar os cabeçalhos das versões disponíveis dos pacotes com <command>apt-cache show <replaceable>pacote</replaceable></command>. Este comando fornece a descrição do pacote, suas dependências, o nome de seu mantenedor, etc. Observe que <command>aptitude search</command> e <command>aptitude show</command> funcionam do mesmo jeito. <indexterm><primary><command>apt-cache show</command></primary></indexterm><indexterm><primary><command>apt-cache search</command></primary></indexterm><indexterm><primary><command>aptitude show</command></primary></indexterm><indexterm><primary><command>aptitude search</command></primary></indexterm>

source: Some features are more rarely used. For instance, <command>apt-cache policy</command> displays the priorities of package sources as well as those of individual packages. Another example is <command>apt-cache dumpavail</command> which displays the headers of all available versions of all packages. <command>apt-cache pkgnames</command> displays the list of all the packages which appear at least once in the cache.<indexterm><primary><command>apt-cache policy</command></primary></indexterm><indexterm><primary><command>apt-cache dumpavail</command></primary></indexterm>
de_de: Einige Merkmale werden seltener genutzt. Zum Beispiel <command>apt-cache policy</command>, das sowohl die Prioritäten von Paketquellen als auch die invidueller Pakete anzeigt. Ein weiteres Beispiel ist <command>apt-cache dumpavail</command>, welches die Kopfzeilen aller verfügbaren Versionen aller Pakete anzeigt. <command>apt-cache pkgnames</command> zeigt eine Liste aller Pakete an, die wenigstens einmal im Cache enthalten sind.<indexterm><primary><command>apt-cache policy</command></primary></indexterm><indexterm><primary><command>apt-cache dumpavail</command></primary></indexterm>
pt_br: Algumas funcionalidades são raramente usadas. Por exemplo, <command>apt-cache policy</command> mostra as prioridades das fontes de pacotes assim como de pacotes individuais. Outro exemplo é <command>apt-cache dumpavail</command> que mostra os cabeçalhos de todas as versões disponíveis de todos os pacotes. <command>apt-cache pkgnames</command> mostra a lista de todos os pacotes que aparecem pelo menos uma vez no cache.<indexterm><primary><command>apt-cache policy</command></primary></indexterm><indexterm><primary><command>apt-cache dumpavail</command></primary></indexterm>

source: One of the essential functionalities of <command>aptitude</command> (which has also been integrated to <command>apt-get</command> since <emphasis role="distribution">Lenny</emphasis>) is the tracking of packages installed only through dependencies. These packages are called “automatic” and are tagged with an “A” in the list of packages — they often include libraries for instance. When a package is removed, the corresponding automatic packages are also selected for removal unless another “manually installed” package depends on them. It is possible to mark a package as automatic (with <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>) or to remove the mark (<keycombo><keycap>m</keycap></keycombo> key). When maintaining a system with <command>aptitude</command>, it is a good habit to mark as automatic any package that you don't need directly so that they are automatically removed when they aren't necessary anymore. You can either navigate the list of installed packages and play with <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>, or apply the flag to entire sections (for example the <literal>libs</literal> section). This habit can help you to keep your system tidy and offers a simple way to visualize the packages in use on a machine, without all the libraries and dependencies that you don't really care about. The related pattern that can be used with <keycombo><keycap>l</keycap></keycombo> (to activate the filter mode) is <literal>~i!~M</literal>. It specifies that you only want to see installed packages (<literal>~i</literal>) not marked as automatic (<literal>!~M</literal>).
de_de: Eine der wichtigsten Funktionalitäten von <command>aptitude</command> ist das Verfolgen von Paketen, die nur auf Grund von Abhängigkeiten installiert wurden (diese Funktionalität wurde mit <emphasis role="distribution">Lenny</emphasis> ebenfalls in <command>apt-get</command> integriert). Diese Pakete werden "automatisch installiert" genannt und werden durch ein "A" in der Paketliste gekennzeichnet – oftmals enthalten sie beispielsweise Bibliotheken. Wenn ein Paket entfernt wird, werden dazugehörende automatisch installierte Pakete ebenfalls zum Entfernen vorgemerkt, es sei denn, andere, nicht automatisch installierte Pakete, hängen ebenfalls von ihnen ab. Es ist möglich, ein Paket als automatisch installiert zu kennzeichnen (mit <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>), oder die Kennzeichnung zu entfernen (mit <keycombo><keycap>m</keycap></keycombo>). Wird ein System mit <command>aptitude</command> verwaltet, ist es eine hilfreiche Gewohnheit, alle Pakete als automatisch zu markieren, die Sie nicht direkt benötigen, damit diese entfernt werden, sobald sie nicht mehr benötigt werden. Sie können entweder durch die Paketliste navigieren und <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo> benutzen, oder Sie können ganze Bereiche markieren (zum Beispiel <literal>libs</literal>). Diese Angewohnheit kann Ihnen helfen, Ihr System aufgeräumt zu halten und bietet eine einfache Möglichkeit, die auf dem System benutzten Pakete ohne all die Bibliotheken und Abhängigkeiten anzuzeigen. Das passende Suchmuster dazu ist <literal>~i!~M</literal>, das Sie im Filtermodus eingeben, den Sie mit <keycombo><keycap>l</keycap></keycombo> aktivieren. Es legt fest, dass nur als nicht-automatisch markierte (<literal>!~M</literal>) installierte <keycombo><keycap>l</keycap></keycombo> Pakete angezeigt werden.
pt_br: Uma das funcionalidades essenciais do <command>aptitude</command> (que também foi integrada ao <command>apt-get</command> desde a <emphasis role="distribution">Lenny</emphasis>) é o rastreio de pacotes instalados apenas através de dependências. Estes pacotes são chamados "automáticos" e são marcados com um "A" na lista de pacotes — Eles frequentemente incluem bibliotecas "for instance". Quando um pacote é removido, os pacotes automáticos correspondentes são também selecionados para remoção a menos que outro pacote "manualmente instalado" dependa dele. É possível marcar um pacote como automático (com <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>) ou remover a marcação (tecla <keycombo><keycap>m</keycap></keycombo>). Quando mantendo um sistema com <command>aptitude</command>, é um bom hábito marcar como automático qualquer pacote que você não precise diretamente de forma que eles sejam removidos automáticamente quando não forem mais necessários. Você pode tanto navegar na lista de pacotes instalados e usar <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>, ou aplicar a opção para seções inteiras (por exemplo a seção <literal>libs</literal>). Este hábito pode ajudar você a manter seu sistema organizado e oferecer uma forma simples de visualizar os pacotes em uso em uma máquina, sem todas as bibliotecas e dependências que você não cuida. O padrão relacionado que pode ser usado com <keycombo><keycap>l</keycap></keycombo> (para ativar o modo filtro) é <literal>~i!~M</literal>. Ele especifica que você apenas quer ver os pacotes instalados (<literal>~i</literal>) e não marcados como automáticos (<literal>!~M</literal>).

source: People might want to know why an automatically installed package is present on the system. To get this information from the command-line, you can use <command>aptitude why <replaceable>package</replaceable></command>:
de_de: Manchmal möchte man wissen, warum ein automatisch installiertes Paket installiert wurde. Um auf der Kommandozeile an diese Information zu gelangen, können Sie <command>aptitude why <replaceable>Paket</replaceable></command> benutzen:
pt_br: ALguém pode querer saber porque ("why") um pacote foi automaticamente instalado no sistema. Para obter esta informação na linha de comando, você pode usar <command>aptitude why <replaceable>pacote</replaceable></command>:
