Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: If you listed <emphasis role="distribution">Experimental</emphasis> in your <filename>sources.list</filename> file, the corresponding packages will almost never be installed because their default APT priority is 1. This is of course a specific case, designed to keep users from installing <emphasis role="distribution">Experimental</emphasis> packages by mistake. The packages can only be installed by typing <command>aptitude install <replaceable>package</replaceable>/experimental</command> — users typing this command can only be aware of the risks that they take. It is still possible (though <emphasis>not</emphasis> recommended) to treat packages of <emphasis role="distribution">Experimental</emphasis> like those of other distributions by giving them a priority of 500. This is done with a specific entry in <filename>/etc/apt/preferences</filename>:
de_de: Auch wenn Sie <emphasis role="distribution">Experimental</emphasis> zu Ihrer <filename>sources.list</filename>-Datei hinzugefügt haben, werden die darin enthaltenen Pakete wahrscheinlich niemals installiert, da deren Priorität auf 1 voreingestellt ist. Dabei handelt es sich um eine Sicherheitsvorkehrung, die verhindern soll, dass Anwender <emphasis role="distribution">Experimental</emphasis> Pakete aus Versehen installieren. Diese Pakete lassen sich nur mittels <command>aptitude install <replaceable>Paket</replaceable>/experimental</command> installieren – Anwender, die diesen Befehl eingeben, müssen sich der Risiken bewusst sein, die sie damit eingehen. Es ist dennoch möglich (wenn auch <emphasis>nicht</emphasis> empfohlen), Pakete aus <emphasis role="distribution">Experimental</emphasis> wie Pakete anderer Distributionen zu behandeln, indem Sie ihnen eine Priorität von 500 zuweisen. Sie erreichen dies über einen Eintrag in <filename>/etc/apt/preferences</filename>:
ja_jp: <emphasis role="distribution">実験版</emphasis>を <filename>sources.list</filename> ファイルに含めても対応するパッケージは決してインストールされません。なぜなら優先度が 1 だからです。これはもちろん特別な場合で、誤って<emphasis role="distribution">実験版</emphasis>のパッケージをインストールするのを避けるためこうなっています。パッケージをインストールする唯一の方法は <command>aptitude install <replaceable>package</replaceable>/experimental</command> と実行する事です - このコマンドを実行するユーザは嫌でもリスクをとることに気付くでしょう。<emphasis role="distribution">実験版</emphasis> のパッケージの優先度を 500 にして他のディストリビューションのパッケージと同列に扱う事も (推奨<emphasis>しません</emphasis>が) 不可能ではありません。こうするには <filename>/etc/apt/preferences</filename> に以下のエントリを含めてください:
pl_pl: Jeżeli w pliku <filename>sources.list</filename> został wymieniony <emphasis role="distribution">Eksperymentalny</emphasis>, to jego pakiety prawie nidgy nie zostaną zainstalowane, ponieważ ich domyślny priorytet wynosi 1. Jest to oczywiście szczególny przypadek, zaprojektowany, aby uchronić użytkowników przed przypadkowym zainstalowaniem <emphasis role="distribution">Eksperymentalnych</emphasis> pakietów. Pakiety te mogą być zainstalowane tylko poprzez wpisanie <command>aptitude install <replaceable>pakiet</replaceable>/experimental</command> — użytkownicy wpisujący tę komendę powinni być świadomi zagrożenia, którego się podejmują. Jest nadal możliwe (ale <emphasis>nie</emphasis> zalecane), aby traktować pakiety <emphasis role="distribution">Eksperymentalne</emphasis> tak jak te z innych dystrybucji, poprzez nadanie im priorytetu 500. Można to osiągnąć przez dodanie specjalnego wpisu w <filename>/etc/apt/preferences</filename>:
pt_br: Se você listou a <emphasis role="distribution">Experimental</emphasis> em seu arquivo <filename>sources.list</filename>, os pacotes correspondentes quase nunca vão ser instalados, por que a prioridade padrão do APT é 1. Este é, claro, um caso particular, projetado para evitar que usuários instalem pacotes da <emphasis role="distribution">Experimental</emphasis> por engano. Os pacotes podem apenas ser intalados digitando <command>aptitude install <replaceable>pacote</replaceable>/experimental</command> — usuários digitando este comando podem apenas ser avisados dos riscos que estão assumindo. Ainda é possível (embora <emphasis>não</emphasis> recomendado) tratar pacotes da <emphasis role="distribution">Experimental</emphasis> como aqueles de outras distribuições dando a eles uma prioridade de 500. Isto é feito com uma entrada específica no <filename>/etc/apt/preferences</filename>:

source: Let's suppose that you only want to use packages from the stable version of Debian. Those provided in other versions should not be installed except if explicitly requested. You could write the following entries in the <filename>/etc/apt/preferences</filename> file:
de_de: Angenommen, Sie wollen nur Pakete aus der stable-Version von Debian verwenden. Pakete anderer Versionen sollen nicht installiert werden, es sei denn, dies wird explizit gewünscht. In dem Falle können Sie folgenden Eintrag in der Datei <filename>/etc/apt/preferences</filename> vornehmen:
ja_jp: Debian の安定版バージョンからのパッケージだけを使いたいと仮定しましょう。他のバージョンから提供されるパッケージは、はっきりと要求されない限り、インストールされるべきではありません。この場合、<filename>/etc/apt/preferences</filename> ファイルに以下のエントリを書きます:
pl_pl: Załóżmy, że chcesz używać tylko pakietów ze stabilnej wersji Debiana. Te dostarczane w innych wersjach nie powinny być instalowane, chyba że na bezpośrednie żądanie. Mógłbyś dodać następujące wpisy w pliku <filename>/etc/apt/preferences</filename>:
pt_br: Vamos supor que você só quer usar os pacotes da versão estável do Debian. As previstas em outras versões não devem ser instaladas exceto se explicitamente solicitado. Você poderia escrever as seguintes entradas do arquivo <filename>/etc/apt/preferences</filename> :

source: <literal>a=stable</literal> defines the name of the selected distribution. <literal>o=Debian</literal> limits the scope to packages whose origin is “Debian”.
de_de: <literal>a=stable</literal> bestimmt den Namen der ausgewählten Distribution. <literal>o=Debian</literal> beschränkt den Umfang auf Pakete mit der Herkunft "Debian".
ja_jp: <literal>a=stable</literal> で選択するディストリビューションの名前を定義します。<literal>o=Debian</literal> で提供者が「Debian」のパッケージに範囲を限定します。
pl_pl: <literal>a=stable</literal> definiuje nazwę wybranej dystrybucji. <literal>o=Debian</literal> ogranicza zakres pakietów do tych, których źródłem jest "Debian".
pt_br: <literal>a=stable</literal> define o nome da distribuição selecionada. <literal>o=Debian</literal> limita o escopo para pacotes cuja origem seja "Debian".

source: Let's now assume that you have a server with several local programs depending on the version 5.14 of Perl and that you want to ensure that upgrades will not install another version of it. You could use this entry:
ja_jp: さてここで、サーバには Perl バージョン 5.14 に依存するローカルプログラムがあり、アップグレードによって他のバージョンがインストールされない事を保証したいと仮定しましょう。この場合、以下のエントリを使います:
pl_pl: Załóżmy, że masz serwer z kilkoma lokalnymi programami zależnymi od wersji 5.14 Perla i chcesz upewnić się, że uaktualnienia nie zainstalują innej jego wersji. Możesz użyć takiego wpisu:

source: The reference documentation for this configuration file is available in the manual page <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry>, which you can display with <command>man apt_preferences</command>.
de_de: Die Referenzdokumentation für diese Konfigurationsdatei finden Sie auf der Handbuchseite <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry>, die Sie mit <command>man apt_preferences</command> anzeigen lassen können.
ja_jp: マニュアルページ <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry> にはこの設定ファイルに対する関連文書があり、<command>man apt_preferences</command> で表示できます。
pl_pl: Referencyjna dokumentacja dla tego pliku konfiguracyjnego jest dostępna na stronach pomocy <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry>, które można wyświetlić za pomocą <command>man apt_preferences</command>.
pt_br: A documentação de referência para este arquivo de configuração está disponível na página de manual <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry>, que você lê com <command>man apt_preferences</command>.

source: <emphasis>TIP</emphasis> Comments in <filename>/etc/apt/preferences</filename>
de_de: <emphasis>TIPP</emphasis> Kommentare in <filename>/etc/apt/preferences</filename>
ja_jp: <emphasis>TIP</emphasis> <filename>/etc/apt/preferences</filename> 内のコメント
pl_pl: <emphasis>WSKAZÓWKA</emphasis> Komentarze w pliku <filename>/etc/apt/preferences</filename>
pt_br: <emphasis>DICA</emphasis> Comentários no <filename>/etc/apt/preferences</filename>

source: There is no official syntax to put comments in the <filename>/etc/apt/preferences</filename> file, but some textual descriptions can be provided by putting one or more “<literal>Explanation</literal>” fields at the start of each entry:
de_de: Es existiert keine offzielle Syntax für Kommentare in der <filename>/etc/apt/preferences</filename> Datei, aber Beschreibungen lassen sich mittels einer oder mehrerer “<literal>Explanation</literal>” Felder zu Beginn jedes Eintrags einfügen:
ja_jp: <filename>/etc/apt/preferences</filename> ファイルにコメントを記入する正しいやり方はありませんが、それぞれのエントリの前の行に「<literal>Explanation</literal>」フィールドをつけるとテキスト説明を記入できます。
pl_pl: Nie istnieje oficjalna składnia do umieszczania komentarzy w pliku <filename>/etc/apt/preferences</filename>, ale można wprowadzić pewne opisy tekstowe przez dodanie jednego lub więcej pól “<literal>Explanation</literal>” na początku każdego wpisu.
pt_br: Não existe uma sintaxe oficial para colocar comentários no arquivo <filename>/etc/apt/preferences</filename>, mas algumas descrições textuais pode ser fornecidas colocando um ou mais campos "<literal>Explanation</literal>" no começo de cada entrada:

source: Working with Several Distributions
de_de: Mit mehreren Distributionen arbeiten
ja_jp: 複数ディストリビューションの利用
pl_pl: Praca z Kilkoma Dystrybucjami
pt_br: Trabalhando com Distribuições Diversas

source: <command>apt-get</command> being such a marvelous tool, it is tempting to pick packages coming from other distributions. For example, after having installed a <emphasis role="distribution">Stable</emphasis> system, you might want to try out a software package available in <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> without diverging too much from the system's initial state.
ja_jp: <command>apt-get</command> はこのように素晴らしく、他のディストリビューションからパッケージを選ぶ際に力を発揮するツールです。例えば、<emphasis role="distribution">安定版</emphasis>システムをインストールした後に<emphasis role="distribution">テスト版</emphasis>や<emphasis role="distribution">不安定版</emphasis>に収録されているあるソフトウェアのパッケージを試したいが、システムを最初の状態から大きく変更したくないという場合です。
pl_pl: To genialne narzędzie, jakim jest <command>apt-get</command>, pozwala wybierać pakiety pochodzące z innych dystrybucji. Jeżeli chciałbyś na przykład po zainstalowaniu systemu <emphasis role="distribution">Stabilnego</emphasis> przetestować pakiety dostępne w <emphasis role="distribution">Testowym</emphasis> lub <emphasis role="distribution">Niestabilnym</emphasis> nie odbiegając zbytnio od początkowego stanu systemu.

source: Even if you will occasionally encounter problems while mixing packages from different distributions, <command>apt-get</command> manages such coexistence very well and limits risks very effectively. The best way to proceed is to list all distributions used in <filename>/etc/apt/sources.list</filename> (some people always put the three distributions, but remember that <emphasis role="distribution">Unstable</emphasis> is reserved for experienced users) and to define your reference distribution with the <literal>APT::Default-Release</literal> parameter (see <xref linkend="sect.apt-upgrade" />).
ja_jp: ディストリビューションの異なるパッケージを混在させると、時々問題に遭遇するかもしれませんが、<command>apt-get</command> はパッケージを上手く共存させ、危険の及ぶ範囲を上手く限定します。進むべき最善の道は、<filename>/etc/apt/sources.list</filename> で使われているすべてのディストリビューションをリストアップ (常に 3 つのディストリビューションを使う人がいるかもしれませんが、<emphasis role="distribution">不安定版</emphasis>は経験豊かなユーザ向けである事を忘れないでください) して、<literal>APT::Default-Release</literal> パラメータ (<xref linkend="sect.apt-upgrade" />参照) で基準ディストリビューションをを定義する事です。
pl_pl: Nawet jeżeli sporadycznie wystąpią problemy związane z mieszaniem pakietów z różnych dystrybucji, <command>apt-get</command> bardzo dobrze zarządza ich współistnieniem i efektywnie ogranicza wynikające z tego zagrożenia. Najlepszym sposobem postępowania jest wylistowanie wszystkich dystrybucji występujących w pliku <filename>/etc/apt/sources.list</filename> (niektórzy zawsze umieszczają wszystkie trzy dystrybucje, ale należy pamiętać, że <emphasis role="distribution">Niestabilny</emphasis> jest przeznaczony dla doświadczonych użytkowników) i zdefiniowanie przewodniej dystrybucji używając parametru <literal>APT::Default-Release</literal> (spójrz na <xref linkend="sect.apt-upgrade" />).

source: Let's suppose that <emphasis role="distribution">Stable</emphasis> is your reference distribution but that <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> are also listed in your <filename>sources.list</filename> file. In this case, you can use <command>apt-get install <replaceable>package</replaceable>/testing</command> to install a package from <emphasis role="distribution">Testing</emphasis>. If the installation fails due to some unsatisfiable dependencies, let it solve those dependencies within <emphasis role="distribution">Testing</emphasis> by adding the <literal>-t testing</literal> parameter. The same obviously applies to <emphasis role="distribution">Unstable</emphasis>.
ja_jp: <emphasis role="distribution">安定版</emphasis>が基準ディストリビューションと仮定しますが、併せて<emphasis role="distribution">テスト版</emphasis>と<emphasis role="distribution">不安定版</emphasis>も <filename>sources.list</filename> ファイルに書かれているとします。この場合、<emphasis role="distribution">テスト版</emphasis> からのパッケージをインストールするには <command>apt-get install <replaceable>package</replaceable>/testing</command> を使います。依存関係の解決に失敗してインストールできなかった場合、<literal>-t testing</literal> パラメータをつけて <emphasis role="distribution">テスト版</emphasis>を使って依存関係を解決させる事が可能です。<emphasis role="distribution">不安定版</emphasis>でも同じ事が言えます。
pl_pl: Załóżmy, że <emphasis role="distribution">Stabilny</emphasis> jest przewodnią dystrybucją, ale <emphasis role="distribution">Testowy</emphasis> i <emphasis role="distribution">Niestabilny</emphasis> są również wymienione w pliku <filename>sources.list</filename>. W takim przypadku można użyć <command>apt-get install <replaceable>pakiet</replaceable>/testing</command>, aby zainstalować pakiet z <emphasis role="distribution">Testowego</emphasis>. Jeżeli instalacja nie powiedzie się z powodu niespełnionych zależności, można je spełnić w zakresie <emphasis role="distribution">Testowego</emphasis> przez dodanie parametru <literal>-t testing</literal>. Oczywiście dla <emphasis role="distribution">Niestabilnego</emphasis> sposób postępowania jest analogiczny.

source: In this situation, upgrades (<command>upgrade</command> and <command>dist-upgrade</command>) are done within <emphasis role="distribution">Stable</emphasis> except for packages already upgraded to another distribution: those will follow updates available in the other distributions. We'll explain this behavior with the help of the default priorities set by APT below. Do not hesitate to use <command>apt-cache policy</command> (see sidebar) to verify the given priorities.
ja_jp: この状況では、アップグレード (<command>upgrade</command> と <command>dist-upgrade</command>) は、他のディストリビューションでパッケージがアップグレードされていない限り、<emphasis role="distribution">安定版</emphasis>のパッケージを使って終了します: 他のディストリビューションに利用可能な更新があれば、アップグレードします。以下では、APT によって設定されたデフォルト優先度の助けを借りてこの挙動を説明します。パッケージの優先度を確認するには、遠慮なく <command>apt-cache policy</command> (傍注参照) を使ってください。
pl_pl: W tym przypadku uaktualnienia (<command>upgrade</command> i <command>dist-upgrade</command>) są wykonywane w zakresie <emphasis role="distribution">Stabilnego</emphasis> z wyjątkiem pakietów, które już zostały uaktualnione do innej dystrybucji: będą one używać aktualizacji z danej dystrybucji. Opisane zachowanie zostanie wyjaśnione poniżej, z użyciem domyślnych priorytetów ustawianych przez APTa. Nie wahaj się używać <command>apt-cache policy</command> (spójrz na fiszkę), aby zweryfikować wartości priorytetów.

source: Everything centers around the fact that APT only considers packages of higher or equal version than the installed one (assuming that <filename>/etc/apt/preferences</filename> has not been used to force priorities higher than 1000 for some packages).
de_de: Alles beruht auf der Tatsache, dass APT nur Pakete gleich oder höher der installierten Version in Betracht zieht (unter der Annahme das <filename>/etc/apt/preferences</filename> für kein Paket eine Priorität größer als 1000 erzwingt).
ja_jp: APT はインストール済みのパッケージに比べてバージョンが高いか同じのパッケージだけを考慮するという事実を知れば、すべてを理解できます (ここでは <filename>/etc/apt/preferences</filename> の中に一部のパッケージに対して 1000 より高い優先度を強制する設定が無いと仮定します)。
pl_pl: Wszystko to jest związane z faktem, że APT rozpatruje tylko pakiety mające większy lub równy numer wersji w porównaniu z zainstalowanym (zakładając, że nie użyto <filename>/etc/apt/preferences</filename> do wymuszenia wartości priorytetów większych niż 1000).
pt_br: Tudo se baseia no fato de que o APT apenas considera pacotes com versão igual ou superior à instalada (assumindo que o <filename>/etc/apt/preferences</filename> não foi usado para forçar prioridades maiores que 1000 para alguns pacotes).

source: To gain a better understanding of the mechanism of priority, do not hesitate to execute <command>apt-cache policy</command> to display the default priority associated with each package source. You can also use <command>apt-cache policy <replaceable>package</replaceable></command> to display the priorities of all available versions of a given package.
de_de: Zögern Sie nicht, sich die mit einer Paketquelle verbundenen Standardprioritäten mittels <command>apt-cache policy</command> anzeigen zu lassen, um ein besseres Verständnis des Prioritäten-Mechanismus zu gewinnen. Sie können ebenfalls <command>apt-cache policy <replaceable>Paket</replaceable></command> verwenden, um sich die Prioritäten aller verfügbaren Versionen eines gegebenen Paketes anzeigen zu lassen.
ja_jp: 優先度のメカニズムをさらに良く理解するためには、<command>apt-cache policy</command> を実行し、各パッケージソースに対して設定されているデフォルトの優先度を確認して下さい。また、あるパッケージの利用可能なバージョンすべてに対する優先度を表示するために <command>apt-cache policy <replaceable>package</replaceable></command> を使う事も可能です。
pl_pl: W celu lepszego zrozumienia mechanizmu priorytetów można wykonać komendę <command>apt-cache policy</command>, która wyświetla domyślny priorytet związany z danym źródłem pakietów. Można także użyć <command>apt-cache policy <replaceable>pakiet</replaceable></command>, aby wyświetlić priorytety wszystkich dostępnych wersji danego pakietu.
pt_br: Para entender melhor o mecanismo das prioridades, não hesite em executar <command>apt-cache policy</command> para exibir as prioridades padrão associadas a cada fonte de pacote. Você também pode usar <command>apt-cache policy <replaceable>pacote</replaceable></command> para exibir as prioridades de todas as versões disponíveis de um dado pacote.

source: Let's assume that you have installed version 1 of a first package from <emphasis role="distribution">Stable</emphasis> and that version 2 and 3 are available respectively in <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis>. The installed version has a priority of 100 but the version available in <emphasis role="distribution">Stable</emphasis> (the very same) has a priority of 990 (because it is part of the target release). Packages in <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> have a priority of 500 (the default priority of a non-installed version). The winner is thus version 1 with a priority of 990. The package “stays in <emphasis role="distribution">Stable</emphasis>”.
de_de: Lassen Sie uns annehmen, Sie hätten Version 1 eines ersten Pakets aus <emphasis role="distribution">Stable</emphasis> installiert und Version 2 und 3 wären in <emphasis role="distribution">Testing</emphasis> bzw. in <emphasis role="distribution">Unstable</emphasis> verfügbar. Die installierte Version hat eine Priorität von 100 aber die Version aus <emphasis role="distribution">Stable</emphasis> (genau die gleiche) hat eine Priorität von 990 (weil sie Bestandteil der Zieldistribution ist). Pakete in <emphasis role="distribution">Testing</emphasis> und <emphasis role="distribution">Unstable</emphasis> haben eine Priorität von 500 (die Standardpriorität einer nicht installierten Version). Der Gewinner ist daher die Version 1 mit der Priorität 990. Das Paket "bleibt in <emphasis role="distribution">Stable</emphasis>”.
ja_jp: あるパッケージの、<emphasis role="distribution">安定版</emphasis>から提供されるバージョン 1 がインストール済みで、<emphasis role="distribution">テスト版</emphasis>と<emphasis role="distribution">不安定版</emphasis>から提供されるバージョン 2 と 3 が利用可能と仮定しましょう。インストール済みバージョンの優先度は 100 ですが、<emphasis role="distribution">安定版</emphasis>から提供されるバージョン (インストール済みと全く同じバージョン) の (ターゲットリリースから提供されるバージョンの) 優先度は 990 です。<emphasis role="distribution">テスト版</emphasis>と<emphasis role="distribution">不安定版</emphasis>から提供されるバージョンの優先度 (インストールされていないバージョンに対するデフォルト優先度) は 500 です。この場合、バージョン 1 が最も高い優先度 990 を持ちます。パッケージは「<emphasis role="distribution">安定版</emphasis>のまま」です。
pl_pl: Załóżmy, że zainstalowano wersję 1 pierwszego pakietu ze <emphasis role="distribution">Stabilnego</emphasis>, a wersje 2 i 3 są dostępne odpowiednio w <emphasis role="distribution">Testowym</emphasis> i <emphasis role="distribution">Niestabilnym</emphasis>. Zainstalowana wersja ma priorytet 100, ale wersja dostępna w <emphasis role="distribution">Stabilnym</emphasis> (ta sama) ma priorytet 990 (ponieważ jest częścią docelowego wydania). Pakiety w <emphasis role="distribution">Testowym</emphasis> i <emphasis role="distribution">Niestabilnym</emphasis> mają priorytet 500 (domyślny priorytet dla wersji niezainstalowanej). Zwycięzcą jest więc wersja 1 posiadająca priorytet 990. W związku z tym pakiet "zostaje w <emphasis role="distribution">Stabilnym</emphasis>".
pt_br: Suponha que você instalou a versão 1 de um primeiro pacote da <emphasis role="distribution">Stable</emphasis> e que versão 2 e 3 estão respectivamente disponíveis na <emphasis role="distribution">Testing</emphasis> e na <emphasis role="distribution">Unstable</emphasis>. A versão instalada tem uma prioridade de 100 mas a versão disponível na <emphasis role="distribution">Stable</emphasis> (exatamente a mesma) tem uma prioridade de 990 (porque ela é parte da "target release"). Pacotes na <emphasis role="distribution">Testing</emphasis> e na <emphasis role="distribution">Unstable</emphasis> tem a prioridade de 500 (a prioridade padrão de uma versão não instalada). O ganhador é então a versão 1 com uma prioridade de 990. O pacote “fica na <emphasis role="distribution">Stable</emphasis>”.
