Repository: Neamar/KISS
Catalog: */06_apt.po
Languages: de_de, ja_jp, pl_pl, pt_br

source: <computeroutput>$ </computeroutput><userinput> aptitude why python-debian</userinput> <computeroutput>i aptitude Recommends apt-xapian-index i A apt-xapian-index Depends python-debian (&gt;= 0.1.15)</computeroutput>
pt_br: <computeroutput>$ </computeroutput><userinput> aptitude why python-debian</userinput> <computeroutput>i aptitude Recomenda apt-xapian-index i A apt-xapian-index Depende python-debian (&gt;= 0.1.15)</computeroutput>

source: <primary><command>aptitude why</command></primary>
pt_br: <primary><command>aptitude por que</command></primary>

source: <emphasis>WORTH FOLLOWING</emphasis> Recent evolutions of <command>apt-get</command> and <command>aptitude</command>
de_de: <emphasis>NACHVERFOLGENSWERT</emphasis> Jüngste Entwicklungen bei <command>apt-get</command> und <command>aptitude</command>
pt_br: <emphasis>VALE A PENA SEGUIR</emphasis> Evoluções recentes <command>apt-get</command> e <command>aptitude</command>

source: Some of the advantages that <command>aptitude</command> historically had over <command>apt-get</command> have recently disappeared. For instance, since the release of <emphasis role="distribution">Lenny</emphasis>, <command>apt-get</command> memorizes the packages that have been installed only to satisfy dependencies, just like <command>aptitude</command> has always done. It can also follow recommendations expressed by one package on another.
de_de: Einige Vorteile, die <command>aptitude</command> in der Vergangenheit gegenüber <command>apt-get</command> hatte, haben sich kürzlich aufgelöst. Zum Beispiel merkt sich <command>apt-get</command> seit der Veröffentlichung von <emphasis role="distribution">Lenny</emphasis> die Pakete, die nur zur Auflösung von Abhängigkeiten installiert wurden, genauso wie es <command>aptitude</command> schon immer gemacht hat. Es kann auch den Empfehlungen folgen, die ein Paket für andere Pakete vorschlägt.
pt_br: Algumas das vantagens que o <command>aptitude</command> historicamente tem sobre o <command>apt-get</command> desapareceram recentemente. Por exemplo, desde o lançamento da <emphasis role="distribution">Lenny</emphasis>, o <command>apt-get</command> memoriza os pacotes que foram instalados apenas para satisfazer dependências, exatamente como o <command>aptitude</command> sempre fez. Ele também pode seguir recomendação expressas por um pacote em outro pacote.

source: Among the recent evolutions of <command>aptitude</command>, a new version with a graphical interface is currently being developed. Even if it's available in <emphasis role="distribution">Squeeze</emphasis> (in the separate <emphasis role="pkg">aptitude-gtk</emphasis> package), it's not complete yet and is subject to stability issues.
de_de: Neben anderen Weiterentwicklungen von <command>aptitude</command> befindet sich eine neue Version der grafischen Benutzerschnittstelle in der Entwicklung. Auch wenn diese in <emphasis role="distribution">Squeeze</emphasis> (im separaten Paket <emphasis role="pkg">aptitude-gtk</emphasis>) verfügbar ist, ist sie noch nicht vollständig und noch nicht stabil.
pt_br: Dentre as evoluções recentes do <command>aptitude</command>, uma nova versão com uma interface gráfica está atualmente sendo desenvolvida. Mesmo se ela estiver disponível no <emphasis role="distribution">Squeeze</emphasis> (no pacote a parte <emphasis role="pkg">aptitude-gtk</emphasis>), ainda não está completa e tem problemas de estabilidade.

source: The advanced features of <command>aptitude</command> are also available on the command-line. You can use the same package search patterns as in the interactive version. For example, if you want to run the previously suggested cleanup of “automatic” packages, and if you know that none of the locally installed programs require any particular libraries or Perl modules, you can mark the corresponding packages as automatic with a single command:
de_de: Die fortgeschrittenen Eigenschaften von <command>aptitude</command> sind auch auf der Kommandozeile verfügbar. Sie können die selben Paket-Suchmuster wie in der interaktiven Version nutzen. Wenn Sie beispielsweise eine vorher vorgeschlagene Bereinigung von automatisch installierten Paketen durchführen wollen und Sie wissen, das keines der lokal installieren Programme bestimmte Bibliotheken oder Perl Module benötigt, können Sie diese Pakete mit einem einzigen Kommando als "automatisch installiert" markieren:
pt_br: As funcionalidade avançadas do <command>aptitude</command> também estão disponíveis na linha de comando. Você pode usar os mesmos padrões de busca de pacotes da versão interativa. Por exemplo, se você quiser executar a limpeza de pacotes "automáticos" sugerida acima, e sabe que nenhum dos programas instalados localmente requer bibliotecas particulares ou módulos Perl, você pode marcar os pacotes correspondentes como automáticos com um único comando:

source: Before <command>aptitude</command> came to life with its tracking of automatic packages, there were two utilities producing lists of unnecessary packages: <command>deborphan</command> and <command>debfoster</command>.
de_de: Bevor <command>aptitude</command>, mit seiner Verfolgung automatischer Pakete, ins Leben gerufen wurde, erzeugten zwei Werkzeuge eine Liste nicht benötigter Pakete: <command>deborphan</command> und <command>debfoster</command>.
pt_br: Antes do surgimento do <command>aptitude</command> e sua capacidade de achar pacotes automáticos, havia dois utilitários que produziam listas de pacotes desnecessários: <command>deborphan</command> e <command>debfoster</command>.

source: <command>debfoster</command> has a more elaborate approach, very similar to <command>aptitude</command>'s: it maintains a list of packages that have been explicitly installed, and remembers what packages are really required between each invocation. If new packages appear on the system and if <command>debfoster</command> doesn't know them as required packages, they will be shown on the screen together with a list of their dependencies. The program then offers a choice: remove the package (possibly together with those that depend on it), mark it as explicitly required, or ignore it temporarily.
de_de: <command>debfoster</command> verfolgt einen komplexeren Ansatz, ähnlich dem von <command>aptitude</command>: Es verwaltet eine Liste von Paketen, die ausdrücklich installiert wurden und merkt sich, welche Pakete zwischen zwei Aufrufen wirklich benötigt wurden. Wenn neue Pakete im System auftauchen und wenn <command>debfoster</command> diese nicht als benötigte Pakete kennt, werden diese zusammen mit ihren Abhängigkeiten angezeigt. Das Programm bietet dann die Wahl: Entfernen der Pakete (wenn möglich mit den Abhängigkeiten), als explizit benötigt markieren oder temporär ignorieren.
pt_br: <command>debfoster</command> tem uma abordagem mais elaborada, parecida com a do <command>aptitude</command>: Ele mantem uma lista de pacotes que foram explicitamente instalados, e lembra que pacotes são realmente requeridos entre cada invocação. Se novos pacotes aparecem no sistema e se o <command>debfoster</command> não reconhece eles como pacotes requeridos, eles serão mostrados na tela junto com uma lista de suas dependências. O programa então oferece uma escolha: remover o pacote (possivelmente junto com tudo que depende dele), marcá-lo como explicitamente requerido, ou ignorâ-lo temporariamente.

source: Another interesting feature of <command>aptitude</command> is the fact that it respects recommendations between packages while still giving users the choice not to install them on a case by case basis. For example, the <emphasis role="pkg">gnome-desktop-environment</emphasis> package recommends <emphasis role="pkg">gnome-accessibility</emphasis> (among others). When you select the former for installation, the latter will also be selected (and marked as automatic if not already installed on the system). Typing <keycombo><keycap>g</keycap></keycombo> will make it obvious: <emphasis role="pkg">gnome-accessibility</emphasis> appears on the summary screen of pending actions in the list of packages installed automatically to satisfy dependencies. However, you can decide not to install it by deselecting it before confirming the operations.
de_de: Eine weitere interessante Eigenschaft von <command>aptitude</command> ist, dass es die Empfehlungen zwischen Paketen berücksichtigt und dabei dem Benutzer trotzdem gestattet von Fall zu Fall die Wahl zu treffen, ausgewählte Pakete nicht zu installieren. Zum Beispiel empfiehlt das Paket <emphasis role="pkg">gnome-desktop-environment</emphasis> <emphasis role="pkg">gnome-accessibility</emphasis> (neben anderen). Wenn Sie das erste zur Installation auswählen, wird das zweite ebenfalls ausgewählt (und als automatisch installiert markiert, falls es nicht bereits installiert ist). Drücken Sie <keycombo><keycap>g</keycap></keycombo>, wird dies deutlich: <emphasis role="pkg">gnome-accessibility</emphasis> taucht in der Vorschau der der anstehenden Aktionen auf, unter "Pakete, die von anderen Paketen vorgeschlagen werden". Trotzdem bleibt Ihnen die Wahl, das Paket nicht zu installieren, indem Sie es abwählen, bevor Sie die anstehenden Aktionen ausführen lassen.
pt_br: Outra funcionalidade interessante do <command>aptitude</command> é o fato que ele respeita recomendações entre pacotes mesmo dando aos usuários a escolha de, caso a caso, não instalá-los. Por exemplo, o pacote <emphasis role="pkg">gnome-desktop-environment</emphasis> recomenda <emphasis role="pkg">gnome-accessibility</emphasis> (entre outros). Quando você seleciona o primeiro para instalação, o último também vai ser selecionado (e marcado como automático se ainda não estiver instalado no sistema). Digitando <keycombo><keycap>g</keycap></keycombo> torna isto óbvio: <emphasis role="pkg">gnome-accessibility</emphasis> aparece na tela de resumo das ações pendentes na lista de pacotes instalados automaticamente para satisfazer dependências. Entretanto, você pode decidir não instalar ele desmarcando-o antes de confirmar a operação.

source: Note that this recommendation tracking feature does not apply to upgrades. For instance, if a new version of <emphasis role="pkg">gnome-desktop-environment</emphasis> recommends a package that it did not recommend formerly, the package won't be marked for installation. However, it will be listed on the upgrade screen so that the administrator can still select it for installation.
de_de: Beachten Sie, dass die Verfolgung von Empfehlungen nicht bei Aktualisierungen greift. Wenn beispielsweise eine neue Version von <emphasis role="pkg">gnome-desktop-environment</emphasis> ein Paket vorschlägt, das es vorher nicht vorgeschlagen hat, wird dieses neue Paket nicht zur Installation ausgewählt. Es wird allerdings in der Aktualisierungsliste angezeigt, damit der Administrator es trotzdem zur Installation auswählen kann.
pt_br: Observe que esta funcionalidade de rastreio de recomendação não se aplica a atualizações (upgrades). Por exemplo, se uma nova versão do <emphasis role="pkg">gnome-desktop-environment</emphasis> recomenda um pacote que não recomendava antes, o pacote não vai ser marcado para instalação. Entretanto, ele vai ser listado na tela de atualização para que o administrador possa selecioná-lo para instalação, se desejar.

source: Suggestions between packages are also taken into account, but in a manner adapted to their specific status. For example, since <emphasis role="pkg">gnome-desktop-environment</emphasis> suggests <emphasis role="pkg">gnome-audio</emphasis>, the latter will be displayed on the summary screen of pending actions (in the section of packages suggested by other packages). This way, it is visible and the administrator can decide whether to take the suggestion into account or not. Since it is only a suggestion and not a dependency or a recommendation, the package will not be selected automatically — its selection requires a manual intervention from the user (thus, the package will not be marked as automatic).
de_de: Vorschläge zwischen Paketen werden ebenfalls in Betracht gezogen, allerdings angepasst an ihren jeweiligen Status. Beispielsweise schlägt <emphasis role="pkg">gnome-desktop-environment</emphasis> <emphasis role="pkg">gnome-audio</emphasis> vor, welches dann in der Vorschau (in der Kategorie "Pakete, die von anderen Paketen vorgeschlagen werden") angezeigt wird. Auf diesem Weg ist es für den Administrator sichtbar und er kann entscheiden, ob er den Vorschlag annimmt, oder nicht. Da es sich nur um einen Vorschlag und nicht um eine Abhängigkeit handelt, wird das Paket nicht automatisch ausgewählt – seine Auswahl bedarf eines manuellen Eingriffs seitens des Benutzers (aus diesem Grund wird das Paket auch nicht als automatisch installiert markiert).
pt_br: Sugestões entre pacotes são também levadas em consideração, mas adaptadas a seu status específico. Por exemplo, já que o <emphasis role="pkg">gnome-desktop-environment</emphasis> sugere o <emphasis role="pkg">gnome-audio</emphasis>, este último será exibido na tela de resumo das ações pendentes (na seção de pacotes sugeridos por outros pacotes). Desta forma, ficará visível e o administrador poderá decidir se deve aceitar a sugestão ou não. Já que isto é apenas uma sugestão e não uma dependência ou uma recomendação, o pacote não será selecionado automaticamente — sua seleção requer uma intervenção manual do usuário (portanto o pacote não será marcado como automático).

source: In the same spirit, remember that <command>aptitude</command> makes intelligent use of the concept of task. Since tasks are displayed as categories in the screens of package lists, you can either select a full task for installation or removal, or browse the list of packages included in the task to select a smaller subset.
de_de: Im gleichen Sinn: Beachten Sie, dass <command>aptitude</command> intelligenten Gebrauch vom Aufgaben-Konzept macht (Aufgaben in diesem Kontext sind Programmgruppen für dedizierte Zwecke/Aufgaben). Da Aufgaben (Tasks) als Kategorien in den Paketlisten-Darstellungen angezeigt werden, können Sie entweder eine vollständige Aufgabe zur Installation oder zum Entfernen auswählen, oder Sie können die Paketliste der Aufgabe durchgehen, um eine Untermenge auszuwählen.
pt_br: No mesmo espírito, lembre que o <command>aptitude</command> faz um uso inteligente do conceito de tarefa. Como tarefas são mostradas como categorias nas telas de listas de pacotes, você pode tanto selecionar uma tarefa completa para instalar ou remover, ou navegar na lista de pacotes inclusa na tarefa para selecionar um subconjunto menor.

source: <primary>pacakage</primary><secondary>signature</secondary>
de_de: <primary>Paket</primary><secondary>Signatur</secondary>
pt_br: <primary>pacote</primary><secondary>assinatura</secondary>

source: <primary>signature</primary><secondary>of a package</secondary>
de_de: <primary>Signatur</primary><secondary>eines Pakets</secondary>
pt_br: <primary>assinatura</primary><secondary>de um pacote</secondary>

source: The trusted keys are managed with the <command>apt-key</command> command found in the <emphasis role="pkg">apt</emphasis> package. This program maintains a keyring of GnuPG public keys, which are used to verify signatures in the <filename>Release.gpg</filename> files available on the mirrors. It can be used to add new keys manually (when non-official mirrors are needed). Generally however, only the official Debian keys are needed. These keys are automatically kept up-to-date by the <emphasis role="pkg">debian-archive-keyring</emphasis> package (which invokes <command>apt-key</command> when it is installed or upgraded). However, the first installation of this particular package requires caution: even if the package is signed like any other, the signature cannot be verified externally. Cautious administrators should therefore check the fingerprints of imported keys before trusting them to install new packages:
de_de: Die vertrauenswürdigen Schlüssel werden mit dem Befehl <command>apt-key</command> aus dem Paket <emphasis role="pkg">apt</emphasis> verwaltet. Dieses Programm pflegt einen Schlüsselbund mit öffentlichen GnuPG Schlüsseln, mit denen die Signaturen in den <filename>Release.gpg</filename>-Dateien der Spiegelserver geprüft werden können. Es kann dazu benutzt werden, von Hand neue Schlüssel hinzuzufügen (wenn nicht-offizielle Spiegelserver benötigt werden). Im Allgemeinen werden aber nur die offiziellen Debian Schlüssel benötigt. Diese Schlüssel werden automatisch durch das <emphasis role="pkg">debian-archive-keyring</emphasis>-Paket aktuell gehalten (welches im Falle einer Installation oder Aktualisierung dann <command>apt-key</command> ausführt). Dennoch erfordert die Erstinstallation dieses speziellen Paketes Aufmerksamkeit: Auch wenn dieses Paket wie alle anderen signiert ist, kann dessen Signatur nicht von außen überprüft werden. Vorsichtige Administratoren sollten deshalb die Fingerabdrücke importierter Schlüssel überprüfen, bevor sie ihnen zur Installation neuer Pakete vertrauen:
pt_br: As chaves confiáveis são gerenciadas com o comando <command>apt-key</command> encontrado no pacote <emphasis role="pkg">apt</emphasis>. Este programa mantém um chaveiro de chaves públicas GnuPG, que são usados para verificar assinaturas nos arquivos <filename>Release.gpg</filename> disponíveis nos espelhos. Ele pode ser usado para adicionar novas chaves manualmente (quando espelhos não-oficiais são necessários). Mas normalmente apenas as chaves Debian oficiais são necessárias. Estas chaves são mantidas atualizadas automaticamente pelo pacote <emphasis role="pkg">debian-archive-keyring</emphasis> (que invoca o comando <command>apt-key</command> quando ele é instalado ou atualizado). Entretanto, a primeira instalação deste pacote em particular requer cautela: mesmo se o pacote é assinado como qualquer outro, a assinatura não pode ser verificada externamente. Administradores cautelosos devem portanto verificar as "fingerprints" de chaves importadas antes de confiar nelas para instalar novos pacotes:

source: When a third-party package source is added to the <filename>sources.list</filename> file, APT needs to be told about the corresponding GPG trusted key (otherwise it will keep complaining that it can't ensure the authenticity of the packages coming from that repository). The first step is of course to get the public key. More often than not, the key will be provided as a small text file, which we'll call <filename>key.asc</filename> in the following examples.
de_de: Wenn eine Paketquellen von Dritten zur <filename>sources.list</filename>Datei hinzugefügt wird, muss APT der vertrauenswürdige GPG-Schlüssel der Paketquelle bekannt gemacht werden. Andernfalls wird es sich ständig darüber beklagen, dass es die Authentizität der Pakete aus dieser Quelle nicht sicherstellen kann. Der erste Schritt ist natürlich, den öffentlichen GPG-Schlüssel der Paketquelle zu besorgen, der meist in Form einer kleinen Textdatei bereitgestellt wird. In den folgenden Beispielen werden wir sie <filename>key.asc</filename> nennen.
pt_br: Quando uma origem de pacotes de terceiros é adicionada ao arquivo <filename>sources.list</filename>, o APT precisa ficar sabendo da chave confiável GPG correspondente (caso contrário ele vai ficar reclamando que não pode garantir a autenticidade dos pacotes vindo daquele repositório). O primeiro passo, obviamente, é obter a chave pública. Em geral, a chave vai ser fornecida como um pequeno arquivo texto, que vamos chamar de <filename>key.asc</filename> nos seguintes exemplos.

source: For people who would want a dedicated application and more details on the trusted keys, it is possible to use <command>gui-apt-key</command> (in the package of the same name), a small graphical user interface which manages the trusted keyring. <indexterm><primary><emphasis role="pkg">gui-apt-key</emphasis></primary></indexterm>
de_de: Anwender, die eine eigenständige Anwendung und mehr Details über vertrauenswürdige Schlüssel wünschen, steht mit <command>gui-apt-key</command> (im Paket gleichen Namens) eine grafische Benutzeroberfläche zur Verwaltung des Schlüsselbundes vertrauenswürdiger Schlüssel zur Verfügung. <indexterm><primary><emphasis role="pkg">gui-apt-key</emphasis></primary></indexterm>
pt_br: Para pessoas que precisam de uma aplicação dedicada e mais detalhes sobre as chaves confiáveis, é possível usar o <command>gui-apt-key</command> (no pacote de mesmo nome), uma pequena interface gráfica que gerencia o chaveiro confiável. <indexterm><primary><emphasis role="pkg">gui-apt-key</emphasis></primary></indexterm>

source: One of the best-known features of Debian is its ability to upgrade an installed system from one stable release to the next: <foreignphrase>dist-upgrade</foreignphrase> — a well-known phrase — has largely contributed to the project's reputation. With a few precautions, upgrading a computer can take as little as a few, or a few dozen, minutes depending on the download speed from the package repositories.
de_de: Eine der bekanntesten Eigenschaften von Debian ist die Fähigkeit, ein installiertes System von einer Stable Veröffentlichung auf die nächste aktualisieren zu können: <foreignphrase>dist-upgrade</foreignphrase> – ein wohlbekannter Ausdruck – hat erheblich zum Leumund des Projekts beigetragen. Mit ein paar Vorsichtsmaßnahmen dauert die Aktualisierung eines Computers nur ein paar, oder ein paar Dutzend, Minuten, abhängig von der Downloadgeschwindigkeit der Paketquellen.
pt_br: Uma das funcionalidades mais conhecidas do Debian é sua habilidade de atualizar um sistema instalado de uma versão estável para a próxima: <foreignphrase>dist-upgrade</foreignphrase> — um termo bem conhecido — tem contribuído amplamente para a reputação do projeto. Com algumas poucas precauções, atualizar um computador pode levar alguns minutos, ou algumas dezenas de minutos, dependendo da velocidade do download do do repositório de pacotes.

source: Release notes are available online: the release notes for the current stable release have a dedicated URL, while older release notes can be found with their codenames: <ulink type="block" url="http://www.debian.org/releases/stable/releasenotes" /> <ulink type="block" url="http://www.debian.org/releases/lenny/releasenotes" />
de_de: Veröffentlichungshinweise sind online verfügbar: Die Veröffentlichungshinweise für die aktuelle Stable Veröffentlichung haben eine fest zugeordnete URL, während ältere Veröffentlichungshinweise unter ihrem Codenamen zu finden sind: <ulink type="block" url="http://www.debian.org/releases/stable/releasenotes" /> <ulink type="block" url="http://www.debian.org/releases/lenny/releasenotes" />
pt_br: As notas de lançamento estão disponíveis online: as notas de lançamento para a versão atual da estável tem uma URL dedicada, enquanto notas de lançamento mais antigas podem ser encontradas com seus codinomes: <ulink type="block" url="http://www.debian.org/releases/stable/releasenotes" /> <ulink type="block" url="http://www.debian.org/releases/lenny/releasenotes" />
