Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: Many programs exist, such as <command>amanda</command>, a client/server system featuring many options, whose configuration is rather difficult. <command>BackupPC</command> is also a client/server solution, but with a web interface for configuration which makes it more user-friendly. Dozens of other Debian packages are dedicated to backup solutions, as you can easily confirm with <command>apt-cache search backup</command>.
it_it: Esistono molti programmi, come <command>amanda</command> , un sistema client / server con molte opzioni, la cui configurazione è piuttosto difficile. <command>BackupPC</command> è anche una soluzione client / server, ma con una interfaccia web per la configurazione che rende più user-friendly. Decine di altri pacchetti Debian sono dedicati alle soluzioni di backup, come si può facilmente confermare con <command>apt-cache search backup</command> .

source: Rather than detailing some of them, this section will present the thoughts of the Falcot Corp administrators when they defined their backup strategy.
it_it: Invece di scendere in dettaglio per alcuni di loro, in questa sezione esporrà i pensieri degli amministratori Falcot Corp quando definirono la loro strategia di backup.
ja_jp: これらのうちの幾つかを詳細に説明するのではなく、この節では、Falcot Corp 管理者がバックアップ戦略を定義する際にどのように考えたかを説明します。

source: At Falcot Corp, backups have two goals: recovering erroneously deleted files, and quickly restoring any computer (server or desktop) whose hard drive has failed.
it_it: Nella Falcot Corp, i backup hanno due obiettivi: recuperare i file erroneamente cancellati e ripristinare rapidamente qualsiasi computer (server o desktop), il cui disco rigido è venuto meno.
ja_jp: Falcot Corp では、バックアップには 2 つの目標があります: 誤って削除したファイルを回復することと、ハードドライブに障害が起きた際にコンピュータ (サーバおよびデスクトップ) を素早く復元することです。

source: Backing Up with <command>rsync</command>
it_it: Backup con <command>rsync</command>
ja_jp: <command>rsync</command> を使ったバックアップ

source: Backups on tape having been deemed too slow and costly, data will be backed up on hard drives on a dedicated server, on which the use of software RAID (see <xref linkend="section.raid-soft" />) will protect the data from hard drive failure. Desktop computers are not backed up individually, but users are advised that their personal account on their department's file server will be backed up. The <command>rsync</command> command (from the package of the same name) is used daily to back up these different servers.
it_it: Dato che i backup su nastro vengono ritenuti troppo lenti e costosi, i dati vengono salvati su hard disk su un server dedicato, in cui l'uso di RAID software (vedi <xref linkend="section.raid-soft" /> ) proteggerà i dati da guasti del disco rigido. I computer desktop non viene processati singolarmente, ma gli utenti sono avvisati che il loro account personale sul file server del proprio reparto verrà eseguito il backup. Il comando <command>rsync</command> (dal pacchetto con lo stesso nome) viene utilizzato quotidianamente per eseguire il backup di questi server diversi.

source: <emphasis>BACK TO BASICS</emphasis> The hard link, a second name for the file
it_it: <emphasis>Concetti di base</emphasis> Il collegamento rigido, un secondo nome per il file
ja_jp: <emphasis>BACK TO BASICS</emphasis> ハードリンク、ファイルの別名

source: <primary>link</primary><secondary>hard link</secondary>
it_it: <primary>collegamento</primary><secondary>hard link</secondary>
ja_jp: <primary>リンク</primary><secondary>ハードリンク</secondary>

source: A hard link, as opposed to a symbolic link, can not be differentiated from the linked file. Creating a hard link is essentially the same as giving an existing file a second name. This is why the deletion of a hard link only removes one of the names associated with the file. As long as another name is still assigned to the file, the data therein remain present on the filesystem. It is interesting to note that, unlike a copy, the hard link does not take up additional space on the hard drive.
it_it: Un hard link, al contrario di un link simbolico, non può essere differenziato dal file collegato. La creazione di un collegamento è essenzialmente la stessa dando ad un file esistente un secondo nome. Ecco perché la rimozione di un collegamento rigido rimuove solo uno dei nomi associati al file. Finché un altro nome è ancora assegnato al file, i dati in esso rimangono presenti sul filesystem. E 'interessante notare che, a differenza di una copia, il collegamento rigido non occupa spazio aggiuntivo sul disco rigido.
ja_jp: ハードリンクはシンボリックリンクと異なり、リンクされたファイルと区別することができません。本質的に、ハードリンクの作成は既存のファイルに別名を与えることと同義です。そのため、ハードリンクの削除はそのファイルに関連する名前を削除するに過ぎません。他の名前がまだそのファイルに関連付けられている場合、データの実体ファイルシステムから削除されません。コピーと異なり、ハードリンクはハードドライブ上に追加的なスペースを必要としない点について注意することは興味深いです。

source: A hard link is created with the <command>ln <replaceable>target</replaceable> <replaceable>link</replaceable></command> command. The <replaceable>link</replaceable> file is then a new name for the <replaceable>target</replaceable> file. Hard links can only be created on the same filesystem, while symbolic links are not subject to this limitation.
it_it: Un hard link viene creato con il comando <command>ln <replaceable>target</replaceable><replaceable>link</replaceable></command>. Il file <replaceable>link</replaceable> è quindi un nuovo nome per il file <replaceable>obiettivo</replaceable>. Gli hard link possono essere creati solo sullo stesso filesystem, mentre i collegamenti simbolici non sono soggetti a questa limitazione.
ja_jp: ハードリンクは <command>ln <replaceable>target</replaceable> <replaceable>link</replaceable></command> コマンドで作成されます。ここで <replaceable>link</replaceable> ファイルは <replaceable>target</replaceable> ファイルの新しい名前です。ハードリンクは <replaceable>target</replaceable> と <replaceable>link</replaceable> が同じファイルシステム上にあるときのみ作成可能です。対してシンボリックリンクはこの制限を受けません。

source: The available hard drive space prohibits implementation of a complete daily backup. As such, the <command>rsync</command> command is preceded by a duplication of the content of the previous backup with hard links, which prevents usage of too much hard drive space. The <command>rsync</command> process then only replaces files that have been modified since the last backup. With this mechanism a great number of backups can be kept in a small amount of space. Since all backups are immediately available and accessible (for example, in different directories of a given share on the network), you can quickly make comparisons between two given dates.
it_it: Lo spazio disponibile su disco fisso vieta l'attuazione di un backup completo ogni giorno. Come tale, il comando <command>rsync</command> è preceduto da una duplicazione del contenuto del backup precedente con collegamenti rigidi, il che impedisce l'utilizzo eccessivo di spazio su disco. Il processo <command>rsync</command> quindi sostituisce solo i file che sono stati modificati dall'ultimo backup. Con questo meccanismo un gran numero di backup può essere mantenuto in una piccola quantità di spazio. Dal momento che tutti i backup sono immediatamente disponibili e accessibili (per esempio, in diverse cartelle di una determinata quota della rete), è possibile fare rapidamente paragoni tra due date.
ja_jp: 利用可能なハードドライブの空き領域によっては、完全な日次バックアップが出来ない場合があります。このため、まず <command>rsync</command> コマンドはバックアップの内容をハードリンクで複製します。このお陰で、ハードドライブ領域を無駄に消費する事がなくなります。そして <command>rsync</command> プロセスは最後のバックアップ以降に変更されたファイルだけを置き換えます。このメカニズムにより、多くのバックアップを少ない領域に保存することが可能です。全てのバックアップは素早く利用可能でアクセス可能 (例えば、ネットワーク共有されたディレクトリの中) なので、ある日付同士の違いを素早く比較できます。

source: <primary>copy, backup copy</primary>
it_it: <primary>copia, copia di backup</primary>
ja_jp: <primary>コピー、バックアップコピー</primary>

source: <primary>backup</primary><secondary>copy</secondary>
it_it: <primary>copia</primary><secondary>di backup</secondary>
ja_jp: <primary>バックアップ</primary><secondary>コピー</secondary>

source: This backup mechanism is easily implemented with the <command>dirvish</command> program. It uses a backup storage space (“bank” in its vocabulary) in which it places timestamped copies of sets of backup files (these sets are called “vaults” in the dirvish documentation).
it_it: Questo meccanismo di backup viene facilmente implementato con il programma <command>dirvish</command>. Si utilizza uno spazio di archiviazione di backup ("banca" nel suo vocabolario), in cui colloca copie del timestamp dei set di file di backup (questi insiemi sono chiamati "volte" nella documentazione di dirvish).
ja_jp: <command>dirvish</command> プログラムを使えば、このバックアップメカニズムを簡単に実現できます。<command>dirvish</command> プログラムはバックアップストレージ領域 (dirvish 用語で「bank」) を使い、「bank」の中に一連のバックアップファイルのタイムスタンプを付けたコピー (dirvish の文書ではこれらを「vaults」と呼びます) を置きます。

source: The main configuration is in the <filename>/etc/dirvish/master.conf</filename> file. It defines the location of the backup storage space, the list of “vaults” to manage, and default values for expiration of the backups. The rest of the configuration is located in the <filename><replaceable>bank</replaceable>/<replaceable>vault</replaceable>/dirvish/default.conf</filename> files and contains the specific configuration for the corresponding set of files.
it_it: La configurazione principale è nel file <filename>/ etc / dirvish / master.conf</filename>. Si definisce la posizione dello spazio di archiviazione di backup, l'elenco delle "volte" da gestire, ed i valori di default per la scadenza dei backup. Il resto della configurazione si trova nel file <filename><replaceable>bank</replaceable>/<replaceable>vault</replaceable>/dirvish/default.conf</filename> e contiene una configurazione specifica per la corrispondente serie di file.
ja_jp: 主要な設定は <filename>/etc/dirvish/master.conf</filename> ファイルに含まれます。<filename>/etc/dirvish/master.conf</filename> ファイルでは、バックアップストレージスペースの場所、管理する「vaults」のリスト、バックアップの保存期限のデフォルト値を定義します。残りの設定は <filename><replaceable>bank</replaceable>/<replaceable>vault</replaceable>/dirvish/default.conf</filename> ファイルの中に書き、このファイルには対応するファイルセットに対する特定の設定が含まれます。

source: The <filename>/etc/dirvish/master.conf</filename> file
it_it: Il file <filename>/ etc / dirvish / master.conf</filename>
ja_jp: <filename>/etc/dirvish/master.conf</filename> ファイル

source: bank: /backup exclude: lost+found/ core *~ Runall: root 22:00 expire-default: +15 days expire-rule: # MIN HR DOM MON DOW STRFTIME_FMT * * * * 1 +3 months * * 1-7 * 1 +1 year * * 1-7 1,4,7,10 1
it_it: bank: /backup exclude: lost+found/ core *~ Runall: root 22:00 expire-default: +15 days expire-rule: # MIN HR DOM MON DOW STRFTIME_FMT * * * * 1 +3 mesi * * 1-7 * 1 +1 anno * * 1-7 1,4,7,10 1

source: The <literal>bank</literal> setting indicates the directory in which the backups are stored. The <literal>exclude</literal> setting allows you to indicate files (or file types) to exclude from the backup. The <literal>Runall</literal> is a list of file sets to backup with a time-stamp for each set, which allows you to assign the correct date to the copy, in case the backup is not triggered at precisely the assigned time. You have to indicate a time just before the actual execution time (which is, by default, 10:04 pm in Debian, according to <filename>/etc/cron.d/dirvish</filename>). Finally, the <literal>expire-default</literal> and <literal>expire-rule</literal> settings define the expiration policy for backups. The above example keeps forever backups that are generated on the first Sunday of each quarter, deletes after one year those from the first Sunday of each month, and after 3 months those from other Sundays. Other daily backups are kept for 15 days. The order of the rules does matter, Dirvish uses the last matching rule, or the <literal>expire-default</literal> one if no other <literal>expire-rule</literal> matches.
it_it: L'impostazione della <literal>banca</literal> indica la directory in cui sono memorizzati i backup. L'impostazione <literal>esclude</literal> consente di indicare i file (o i tipi di file) da escludere nel backup.
ja_jp: <literal>bank</literal> 設定はバックアップが保存されるディレクトリを表します。<literal>exclude</literal> 設定を使うと、バックアップからファイル (またはファイルタイプ) を除外することが可能です。<literal>Runall</literal> はタイムスタンプを付けてバックアップするファイルセットのリストです。これにより、万が一割り当てられた時間に正確にバックアップが実行されない場合、コピーする正確な時刻を割り当てることが可能です。ここで指定する時刻は実際の実行時間の直前の時刻でなければいけません (<filename>/etc/cron.d/dirvish</filename> によれば、Debian では実際の実行時間はデフォルトで午後 10:04です)。最後に <literal>expire-default</literal> と <literal>expire-rule</literal> 設定でバックアップ保存期限ポリシーを定義します。上の例は、各四半期の最初の日曜日に作成されたバックアップを永久に保存し、それに当てはまらない各月の最初の日曜日作成されたバックアップを 1 年経過後に削除し、それに当てはまらない日曜日に作成されたバックアップを 3 ヶ月経過後に削除します。その他の日次バックアップは 15 日間保存されます。ルールが適用される順番が問題です。Dirvish は最後にマッチしたルールを使い、<literal>expire-rule</literal> にマッチするものがなければ <literal>expire-default</literal> を使います。

source: <emphasis>IN PRACTICE</emphasis> Scheduled expiration
it_it: <emphasis>IN PRATICA</emphasis> Scadenza programmata
ja_jp: <emphasis>IN PRACTICE</emphasis> 削除スケジュール

source: The expiration rules are not used by <command>dirvish-expire</command> to do its job. In reality, the expiration rules are applied when creating a new backup copy to define the expiration date associated with that copy. <command>dirvish-expire</command> simply peruses the stored copies and deletes those for which the expiration date has passed.
it_it: Le regole di scadenza non vengono utilizzate da <command>dirvish-expire</command> per fare il suo lavoro. In realtà, le regole di scadenza vengono applicate quando si crea una nuova copia di backup per definire la data di scadenza associata a quella copia. <command>dirvish-expire</command> analizza semplicemente le copie memorizzate ed elimina quelle per le quali la data di scadenza è trascorsa.
ja_jp: 削除ルールは削除を担当する <command>dirvish-expire</command> によって使われます。実際には、新しいバックアップコピーの作成時に削除ルールが適用され、そのバックアップコピーに関連付けられた期限の切れる日が定義されます。<command>dirvish-expire</command> は保存されたコピーを単純に調べて、期限の過ぎているコピーを削除します。

source: The <filename>/backup/root/dirvish/default.conf</filename> file
it_it: Il file <filename>/ backup / root / dirvish / default.conf</filename>
ja_jp: <filename>/backup/root/dirvish/default.conf</filename> ファイル

source: The above example specifies the set of files to back up: these are files on the machine <emphasis>rivendell.falcot.com</emphasis> (for local data backup, simply specify the name of the local machine as indicated by <command>hostname</command>), especially those in the root tree (<literal>tree: /</literal>), except those listed in <literal>exclude</literal>. The backup will be limited to the contents of one filesystem (<literal>xdev: 1</literal>). It will not include files from other mount points. An index of saved files will be generated (<literal>index: gzip</literal>), and the image will be named according to the current date (<literal>image-default: %Y%m%d</literal>).
it_it: L'esempio precedente specifica l'insieme di file per cui eseguire il backup: questi sono i file sulla macchina <emphasis>rivendell.falcot.com</emphasis> (Per il backup locale dei dati, è sufficiente specificare il nome della macchina locale come indicato da <command>hostname</command> ), in particolare quelli nella struttura di root ( <literal>tree: /</literal> ), eccetto quelli elencati in <literal>exclude</literal> . Il backup sarà limitato ai contenuti del filesystem ( <literal>xdev: 1</literal> ). Non include i file da altri punti di mount. Un indice di file salvati sarà generato ( <literal>index: gzip</literal> ), e l'immagine sarà nominata in base alla data corrente ( <literal>image-default:%Y%m%d</literal> ).
ja_jp: 上の例は、バックアップするファイルセットを指定します: バックアップ対象は <emphasis>rivendell.falcot.com</emphasis> マシン (ローカルデータをバックアップするには、単純に <command>hostname</command> の出力するローカルマシンの名前を指定します) にあり、特にルートツリーの内容 (<literal>tree: /</literal>) から、<literal>exclude</literal> に含まれるものを除外したファイルです。さらに、バックアップは <literal>tree</literal> と同一のファイルシステムの内容に制限されます (<literal>xdev: 1</literal>)。他のマウントポイントのファイルはバックアップされません。保存されたファイルのインデックスが生成され (<literal>index: gzip</literal>)、イメージには現在の日付に関連する名前が付けられます (<literal>image-default: %Y%m%d</literal>)。

source: There are many options available, all documented in the <citerefentry><refentrytitle>dirvish.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page. Once these configuration files are setup, you have to initialize each file set with the <command>dirvish --vault <replaceable>vault</replaceable> --init</command> command. From there on the daily invocation of <command>dirvish-runall</command> will automatically create a new backup copy just after having deleted those that expired.
it_it: Ci sono molte opzioni disponibili, tutte documentate nella pagina di manuale <citerefentry><refentrytitle>dirvish.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Una volta che questi file di configurazione sono impostati, è necessario inizializzare ogni file impostato con il <command>dirvish --vault <replaceable>vault</replaceable> --init</command> comando. Da lì l'invocazione quotidiana di <command>dirvish-runall</command> creerà automaticamente una nuova copia di backup subito dopo aver cancellato quella scaduta.
ja_jp: 多くのオプションがあり、全ては <citerefentry><refentrytitle>dirvish.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> マニュアルページに書かれています。一度これらの設定ファイルを作ったら、<command>dirvish --vault <replaceable>vault</replaceable> --init</command> コマンドを使って、各ファイルセットを初期化します。毎日の <command>dirvish-runall</command> 実行時に、期限切れになったバックアップコピーが削除され、その直後に自動的に新しいバックアップコピーが作成されます。

source: <emphasis>IN PRACTICE</emphasis> Remote backup over SSH
it_it: <emphasis>IN PRATICA</emphasis> Backup da remoto tramite SSH
ja_jp: <emphasis>IN PRACTICE</emphasis> SSH を使ったリモートバックアップ

source: When dirvish needs to save data to a remote machine, it will use <command>ssh</command> to connect to it, and will start <command>rsync</command> as a server. This requires the root user to be able to automatically connect to it. The use of an SSH authentication key allows precisely that (see <xref linkend="section.ssh-cle-auth" />).
it_it: Quando dirvish ha bisogno di salvare i dati in un computer remoto, verrà utilizzato <command>ssh</command> per connettersi ed avvierà <command>rsync</command> come server. Questo richiede che l'utente root sia in grado di connettersi automaticamente ad esso. E' richiesto l'utilizzo di una chiave di autenticazione SSH consente appunto questo (vedi <xref linkend="section.ssh-cle-auth"></xref>).

source: Restoring Machines without Backups
it_it: ﻿Ripristino di macchine senza backup
ja_jp: バックアップ無しのマシンの復元

source: Desktop computers, which are not backed up, will be easy to regenerate from CD-ROMs made by the <command>mondo</command> program. These bootable CD-ROMs allow complete re-installation of the machine's system. But beware: files that are not part of the system or the user's home directory will not, themselves, be backed up by <command>mondo</command>. This includes, for example, users' local <emphasis>crontabs</emphasis>, as well as any changes made to system configuration since the preparation of the CD-ROM.
it_it: I computer desktop, per cui non viene eseguito il backup, saranno facili da ripristinare da CD-ROM da parte del programma <command>mondo</command>. Questi CD-ROM avviabili consentano la completa reinstallazione del sistema sulla macchina. Ma attenzione: per i file che non fanno parte del sistema o per la directory home dell'utente non saranno, essi stessi, non ne verrà fatta una copia di sicurezza da <command>mondo</command>. Questo include, per esempio, il <emphasis>crontab</emphasis> degli utenti locali, così come tutte le modifiche apportate al sistema di configurazione a partire dalla preparazione del CD-ROM.

source: <primary>backup</primary><secondary>on CD-ROM</secondary>
it_it: <primary>il backup</primary><secondary>su CD-ROM</secondary>

source: <primary>CD-ROM</primary><secondary>backup on CD-ROM</secondary>
it_it: <primary>CD-ROM</primary><secondary>backup su CD-ROM</secondary>

source: The Falcot Corp administrators are aware of the limits in their backup policy. Since they can't protect the backup server as well as a tape in a fireproof safe, they have installed it in a separate room so that a disaster such as a fire in the server room won't destroy backups along with everything else. Furthermore, they do an incremental backup on DVD-ROM once per week — only files that have been modified since the last backup are included.
it_it: Gli amministratori della Falcot Corp sono consapevoli dei limiti nella loro politica di backup. Dal momento che non possono proteggere il server di backup, come un nastro in una cassetta di sicurezza a prova di fuoco, l'hanno installato in una stanza separata in modo che un disastro come un incendio nella stanza del server non distruggerà i backup insieme a tutto il resto. Inoltre, ne fanno un backup incrementale su DVD-ROM, una volta a settimana - vengono inclusi solo quei file che sono stati modificati dopo l'ultimo backup.
ja_jp: Falcot Corp の管理者は自分達のバックアップポリシーの限界を理解しています。バックアップサーバを、テープを耐火金庫に入れるかの如く、保護することが出来ないため、管理者はバックアップサーバを他のサーバと別の部屋に設置しました。そうすれば災害、例えばサーバルームの火事、が起きてもその他全てと一緒にバックアップも破壊されることを避けられるからです。更に、管理者は 1 週間に 1 回 DVD-ROM に増分バックアップ - 最後のバックアップ以降に修正されたファイルだけのバックアップ - をとります。

source: <emphasis>GOING FURTHER</emphasis> Backing up SQL and LDAP services
it_it: <emphasis>APPROFONDIMENTO</emphasis> Backup SQL e servizi LDAP
ja_jp: <emphasis>GOING FURTHER</emphasis> SQL と LDAP サービスのバックアップ

source: Many services (such as SQL or LDAP databases) can not be backed up by simply copying their files (unless they are properly interrupted during creation of the backups, which is frequently problematic, since they are intended to be available at all times). As such, it is necessary to use an “export” mechanism to create a “data dump” that can be safely backed up. These are often quite large, but they compress well. To reduce the storage space required, you will only store a complete text file per week, and a <command>diff</command> each day, which is created with a command of the type <command>diff <replaceable>file_from_yesterday</replaceable> <replaceable>file_from_today</replaceable></command>. The <command>xdelta</command> program produces incremental differences from binary dumps.
it_it: Per molti servizi (ad esempio SQL o i database LDAP) non è possibile farne il backup semplicemente copiando i file (a meno che non siano interrotti durante la creazione dei backup, che è spesso problematico, in quanto sono destinati ad essere disponibili in qualsiasi momento). In questo modo, è necessario utilizzare un meccanismo di "esportazione" per creare un "dump di dati" che può essere tranquillamente considerato come backup. Si tratta spesso di file di grandi dimensioni, ma si comprimono bene. Per ridurre lo spazio di archiviazione necessario, è consigliato salvare un file di testo completo a settimana, e un <command>diff</command> ogni giorno, che è stato creato con un comando del tipo <command>diff <replaceable>file_from_yesterday</replaceable><replaceable>file_from_today</replaceable></command>. Il programma <command>xdelta</command> produce differenze incrementali dei dump binari.
ja_jp: 多くのサービス (SQL や LDAP データベースなど) は単純にファイルをコピーするだけではバックアップできません (それらのサービスをバックアップの作成中に適切に中断しない限りバックアップできません。サービスの中断は通常問題です。なぜなら、サービスは常に利用可能であることを意図されているからです)。そのような場合、安全にバックアップ可能な「データダンプ」を作るために「エクスポート」メカニズムを使う事が必要です。データダンプは通常サイズのとても大きいファイルですが、よく圧縮できます。要求されるストレージ領域を減らすために、完全なテキストファイルを保存するのは 1 週間に 1 回、<command>diff</command> を保存するのは毎日にするでしょう。差分は <command>diff <replaceable>file_from_yesterday</replaceable> <replaceable>file_from_today</replaceable></command> で生成されます。バイナリダンプから増分差分を作成するには <command>xdelta</command> プログラムを使ってください。

source: <emphasis>CULTURE</emphasis> <emphasis>TAR</emphasis>, the standard for tape backups
it_it: <emphasis>CULTURA</emphasis><emphasis>TAR</emphasis> , Lo standard per il backup su nastro
ja_jp: <emphasis>CULTURE</emphasis> <emphasis>TAR</emphasis>、テープバックアップ用の標準規格
