Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: The <emphasis>SSH</emphasis> (Secure SHell) protocol was designed with security and reliability in mind. Connections using SSH are secure: the partner is authenticated and all data exchanges are encrypted.
ja_jp: <emphasis>SSH</emphasis> (Secure SHell) プロトコルは安全性と信頼性を念頭に置いて設計されました。SSH を使う接続は安全です: 通信相手は認証され、交換されるデータは全て暗号化されます。

source: <emphasis>CULTURE</emphasis> Telnet and RSH are obsolete
ja_jp: <emphasis>CULTURE</emphasis> Telnet と RSH は時代遅れです

source: Before SSH, <emphasis>Telnet</emphasis> and <emphasis>RSH</emphasis> were the main tools used to login remotely. They are now largely obsolete and should no longer be used even if Debian still provides them.
ja_jp: SSH 以前、<emphasis>Telnet</emphasis> と <emphasis>RSH</emphasis> がリモートからログインするために使われる主なツールでした。両者は今や大幅に時代遅れです。両者がまだ Debian から配布されているとしても、もはやそれを使うべきではありません。

source: <emphasis>BACK TO BASICS</emphasis> <foreignphrase>Fork</foreignphrase>
ja_jp: <emphasis>BACK TO BASICS</emphasis> <foreignphrase>フォーク</foreignphrase>

source: <primary>fork</primary>
ja_jp: <primary>フォーク</primary>

source: OpenSSH is split into two packages: the client part is in the <emphasis role="pkg">openssh-client</emphasis> package, and the server is in the <emphasis role="pkg">openssh-server</emphasis> package. The <emphasis role="pkg">ssh</emphasis> meta-package depends on both parts and facilitates installation of both (<command>apt-get install ssh</command>).
ja_jp: OpenSSH は 2 つのパッケージに分解されています: クライアント部分は <emphasis role="pkg">openssh-client</emphasis> パッケージ、サーバ部分は <emphasis role="pkg">openssh-server</emphasis> パッケージです。<emphasis role="pkg">ssh</emphasis> メタパッケージは両方のパッケージに依存し、両方のインストールが簡単に (<command>apt-get install ssh</command>) なります。

source: The OpenSSL library, as initially provided in Debian <emphasis role="distribution">Etch</emphasis>, had a serious problem in its random number generator (RNG). Indeed, the Debian maintainer had made a change so that applications using it would no longer generate warnings when analyzed by memory testing tools like <command>valgrind</command>. Unfortunately, this change also meant that the RNG was employing only one source of entropy corresponding to the process number (PID) whose 32,000 possible values do not offer enough randomness. <ulink type="block" url="http://www.debian.org/security/2008/dsa-1571" />
ja_jp: 当初 Debian <emphasis role="distribution">Etch</emphasis> から配布されていた OpenSSL ライブラリは乱数発生器 (RNG) に深刻な問題がありました。具体的には、Debian メンテナによって、メモリテストツール <command>valgrind</command> で OpenSSL ライブラリを使うアプリケーションを解析した際に警告を出さなくなるような、変更が行われました。不幸なことに、この変更により RNG はエントロピーのソースを 1 つしか使わなくなりました。ここで使われたエントロピーソースはプロセス番号 (PID) に相当するもので、PID の取りうる値は 32,000 程度しかないため PID をソースとして用いても十分な乱数度は得られません。<ulink type="block" url="http://www.debian.org/security/2008/dsa-1571" />

source: <primary>port forwarding</primary>
ja_jp: <primary>ポート転送</primary>

source: Its <literal>-R</literal> and <literal>-L</literal> options allow <command>ssh</command> to create “encrypted tunnels” between two machines, securely forwarding a local TCP port (see sidebar <xref linkend="sidebar.tcp-udp" />) to a remote machine or vice versa.
ja_jp: <literal>-R</literal> と <literal>-L</literal> オプションを使うと、<command>ssh</command> が 2 台のマシン間で「暗号化トンネル」を作成することが可能です。ローカル TCP ポート (傍注<xref linkend="sidebar.tcp-udp" />参照) をリモートのマシンに安全に転送したりその逆も可能です。

source: <primary>tunnel (SSH)</primary><seealso>VPN</seealso>
ja_jp: <primary>トンネル (SSH)</primary><seealso>VPN</seealso>

source: <primary>SSH tunnel</primary><seealso>VPN</seealso>
ja_jp: <primary>SSH トンネル</primary><seealso>VPN</seealso>

source: First, the user must authorize sharing their session. The GNOME and KDE graphical desktop environments include, respectively, <command>vino</command> and <command>krfb</command>, which provide a graphical interface that allows sharing an existing session over VNC (both are identified as <emphasis>Desktop Sharing</emphasis> either in the GNOME application list or in the KDE menu). For other graphical desktop environments, the <command>x11vnc</command> command (from the Debian package of the same name) serves the same purpose; you can make it available to the user with an explicit icon.
ja_jp: 最初に、ユーザは自分のセッションの権限を共有しなければいけません。GNOME と KDE グラフィカルデスクトップ環境には、それぞれ <command>vino</command> と <command>krfb</command> が含まれています。これらは VNC を通じて既存のセッションを共有する事が可能になるグラフィカルインターフェイス提供します (GNOME アプリケーションリストか KDE メニューの中にある<emphasis>デスクトップ共有</emphasis>がこのプログラムです)。他のグラフィカルデスクトップ環境に対しては、(同名の Debian パッケージの提供する) <command>x11vnc</command> コマンドがその代わりになります; 明確なアイコンを使って、ユーザがこれを使えるようにすることが可能です。

source: When the graphical session is made available by VNC, the administrator must connect to it with a VNC client. GNOME has <command>vinagre</command> and <command>remmina</command> for that, while KDE includes <command>krdc</command> (in the menu at <menuchoice> <guimenu>K</guimenu> <guisubmenu>Internet</guisubmenu> <guimenuitem>Remote Desktop Client</guimenuitem></menuchoice>). There are other VNC clients that use the command line, such as <command>xvnc4viewer</command> in the Debian package of the same name. Once connected, the administrator can see what's going on, work on the machine remotely, and show the user how to proceed.
ja_jp: VNC がグラフィカルセッションを利用可能にしたら、管理者は VNC クライアントでセッションに接続しなければいけません。VNC クライアントとして、GNOME には <command>vinagre</command> と <command>remmina</command> が、KDE には <command>krdc</command> (<menuchoice> <guimenu>K</guimenu> <guisubmenu>Internet</guisubmenu> <guimenuitem>リモートデスクトップクライアント</guimenuitem></menuchoice>) が用意されています。コマンドラインを使う他の VNC クライアントもあります。例えば、同名の Debian パッケージが提供する<command>xvnc4viewer</command> などです。一旦セッションに接続したら、管理者は、何が起きているか見て、リモートでマシンの作業を行い、ユーザにその様子を見せることが可能です。

source: If you want to connect by VNC, and you don't want your data sent in clear text on the network, it is possible to encapsulate the data in an SSH tunnel (see <xref linkend="sect.ssh-port-forwarding" />). You simply have to know that VNC uses port 5900 by default for the first screen (called “localhost:0”), 5901 for the second (called “localhost:1”), etc.
ja_jp: VNC で接続したいけれども、データを平文でネットワークに流したくない場合、SSH トンネルでデータをカプセル化することが可能です (<xref linkend="sect.ssh-port-forwarding" />参照)。知っておかなければいけない点は、VNC がデフォルトで最初の画面 (「localhost:0」と呼ばれる) にポート 5900 番、2 番目の画面に (「localhost:1」と呼ばれる) 5901 番を使うという点だけです。

source: <emphasis>BACK TO BASICS</emphasis> Display manager
ja_jp: <emphasis>BACK TO BASICS</emphasis> ディスプレイマネージャ

source: <primary>manager</primary><secondary>display manager</secondary>
ja_jp: <primary>マネージャ</primary><secondary>ディスプレイマネージャ</secondary>

source: <primary>display manager</primary>
ja_jp: <primary>ディスプレイマネージャ</primary>

source: <command>gdm</command>, <command>kdm</command>, <command>lightdm</command>, and <command>xdm</command> are Display Managers. They take control of the graphical interface shortly after boot in order to provide the user a login screen. Once the user has logged in, they execute the programs needed to start a graphical work session.
ja_jp: <command>gdm</command>、<command>kdm</command>、<command>lightdm</command>、<command>xdm</command> はディスプレイマネージャです。ディスプレイマネージャは起動直後にログイン画面をユーザに提供する目的でグラフィカルインターフェイスを制御します。ユーザがログインしたら、ディスプレイマネージャはグラフィカル作業セッションを始めるために必要なプログラムを実行します。

source: VNC also works for mobile users, or company executives, who occasionally need to login from their home to access a remote desktop similar to the one they use at work. The configuration of such a service is more complicated: you first install the <emphasis role="pkg">vnc4server</emphasis> package, change the configuration of the display manager to accept <literal>XDMCP Query</literal> requests (for <command>gdm3</command>, this can be done by adding <literal>Enable=true</literal> in the “xdmcp” section of <filename>/etc/gdm3/daemon.conf</filename>), and finally, start the VNC server with <command>inetd</command> so that a session is automatically started when a user tries to login. For example, you may add this line to <filename>/etc/inetd.conf</filename>:
ja_jp: また VNC は、モバイルユーザや会社幹部のような、自分が仕事場で使っているのとよく似たリモートデスクトップにアクセスするために時々自分の家からログインする必要があるユーザにとって、都合が良いものです。そのようなサービス用の設定はより複雑です: ユーザは、最初に <emphasis role="pkg">vnc4server</emphasis> パッケージをインストールし、<literal>XDMCP Query</literal> 要求を受け入れるようにディスプレイマネージャの設定を変更 (<command>gdm3</command> の場合、<filename>/etc/gdm3/daemon.conf</filename> の「xdmcp」セクションに <literal>Enable=true</literal> を追加) し、そして最後に <command>inetd</command> を使って VNC サーバを起動します。こうすることで、ユーザがログインを試行したらセッションが自動的に開始されるようになります。例えば、以下の行を <filename>/etc/inetd.conf</filename> に追加します:

source: Each file or directory has specific permissions for three categories of users:
ja_jp: ファイルとディレクトリには、ユーザの種類別に 3 種類の特定のパーミッションが付けられます:

source: <primary>execution, right</primary>
ja_jp: <primary>実行、権限</primary>

source: A directory is handled differently. Read access gives the right to consult the list of its entries (files and directories), write access allows creating or deleting files, and execute access allows crossing through it (especially to go there with the <command>cd</command> command). Being able to cross through a directory without being able to read it gives permission to access the entries therein that are known by name, but not to find them if you do not know their existence or their exact name.
ja_jp: ディレクトリは別のやり方で取り扱われます。読み込み権限があれば、そのエントリ (ファイルとディレクトリ) のリストを閲覧することが可能です。書き込み権限があれば、ファイルを作成および削除することが可能です。実行権限があれば、そのディレクトリを横断することが可能です (<command>cd</command> コマンドでそのディレクトリに移動できます)。ディレクトリの読み込み権限が無くてもディレクトリを横断する事ができるならば、ディレクトリ内の名前を知っているエントリにアクセスすることが可能です。ただし、エントリの存在を知らないか、エントリの完全な名前を知らない場合、そのエントリを見つけることは出来ません。

source: <primary><literal>setgid</literal> directory</primary>
ja_jp: <primary><literal>setgid</literal> ディレクトリ</primary>

source: <primary>sticky bit</primary>
ja_jp: <primary>スティッキービット</primary>

source: <primary>rights</primary><secondary>octal representation</secondary>
ja_jp: <primary>権限</primary><secondary>8 進数表記</secondary>

source: Administrating on a Web Interface: <command>webmin</command>
ja_jp: ウェブインターフェイスを使った管理: <command>webmin</command>

source: Sadly, <command>webmin</command> is no longer part of Debian. Its Debian maintainer — Jaldhar H. Vyas — removed the packages he created because he no longer had the time required to maintain them at an acceptable quality level. Nobody has officially taken over, so <emphasis role="distribution">Wheezy</emphasis> does not have the <command>webmin</command> package.
ja_jp: 残念なことに、Debian はもはや <command>webmin</command> を配布していません。<command>webmin</command> の Debian メンテナ - Jaldhar H. Vyas さん - は自分の作ったこのパッケージを削除しました。なぜなら、彼にはもはや合格基準に達するだけの品質でメンテナンス作業を行うのに必要な時間が無かったからです。公式にパッケージを引き継ぐ人がいなかったため、<emphasis role="distribution">Wheezy</emphasis> には <command>webmin</command> パッケージがありません。

source: There is, however, an unofficial package distributed on the <literal>webmin.com</literal> website. Contrary to the original Debian packages, this package is monolithic; all of its configuration modules are installed and activated by default, even if the corresponding service is not installed on the machine.
ja_jp: しかしながら、非公式パッケージが <literal>webmin.com</literal> ウェブサイトから配布されています。元の Debian パッケージと異なり、このパッケージは柔軟性に欠けています; 対応するサービスがマシンがインストールされているか否かに関わらず、全ての設定モジュールがインストールされ、デフォルトで有効化されます。

source: <emphasis>ALTERNATIVE</emphasis> GNOME control center
ja_jp: <emphasis>ALTERNATIVE</emphasis> GNOME コントロールセンター

source: The GNOME project also provides multiple administration interfaces that are usually accessible via the “Settings” entry in the user menu on the top right. <command>gnome-control-center</command> is the main program that brings them all together but many of the system wide configuration tools are effectively provided by other packages (<emphasis role="pkg">accountsservice</emphasis>, <emphasis role="pkg">system-config-printer</emphasis>, etc.). Easy to use, these applications cover only a limited number of base services: user management, time configuration, network configuration, printer configuration, and so on.
ja_jp: GNOME プロジェクトは、通常右上に位置するユーザメニューの「設定」エントリから利用可能な、複数の管理インターフェイスを提供します。<command>gnome-control-center</command> は複数の管理インターフェイスを一纏めにしたメインプログラムですが、システム共通設定ツールの多くは他のパッケージによって提供されています (<emphasis role="pkg">accountsservice</emphasis>、<emphasis role="pkg">system-config-printer</emphasis> など)。それらのアプリケーションは使いやすく、基本サービスの一部だけをカバーします: ユーザ管理、時間設定、ネットワーク設定、プリンタ設定、など。

source: <primary>logs</primary><secondary>dispatching</secondary>
ja_jp: <primary>ログ</primary><secondary>配送</secondary>

source: The <command>rsyslogd</command> daemon is responsible for collecting service messages coming from applications and the kernel, then dispatching them into log files (usually stored in the <filename>/var/log/</filename> directory). It obeys the <filename>/etc/rsyslog.conf</filename> configuration file.
ja_jp: <command>rsyslogd</command> デーモンはアプリケーションおよびカーネルからのサービスメッセージを収集を担当し、サービスメッセージをログファイル (通常 <filename>/var/log/</filename> ディレクトリに保存されます) に配送します。<command>rsyslogd</command> デーモンは <filename>/etc/rsyslog.conf</filename> ファイルの設定に従います。

source: <primary>named pipe</primary>
ja_jp: <primary>名前付きパイプ</primary>

source: <primary>pipe, named pipe</primary>
ja_jp: <primary>パイプ、名前付きパイプ</primary>

source: <primary>super-server</primary>
ja_jp: <primary>スーパーサーバ</primary>

source: The options: two possible values: <literal>wait</literal> or <literal>nowait</literal>, to tell <command>inetd</command> whether it should wait or not for the end of the launched process before accepting another connection. For TCP connections, easily multiplexable, you can usually use <literal>nowait</literal>. For programs responding over UDP, you should use <literal>nowait</literal> only if the server is capable of managing several connections in parallel. You can suffix this field with a period, followed by the maximum number of connections authorized per minute (the default limit is 256).
ja_jp: オプション: 設定できる値は 2 種類です: <literal>wait</literal> または <literal>nowait</literal> です。これは <command>inetd</command> に他の接続を受け入れる前に、起動されたプロセスの終了を待つか否かを伝えます。簡単に多重送信対応できる TCP 接続の場合、通常 <literal>nowait</literal> を使います。UDP を使って応答するプログラムに対しては、サーバが複数接続の並列化を管理する機能を持っている場合に限り <literal>nowait</literal> を使うべきです。この後に子プロセスの最大数、さらに 1 分間に認められる接続の最大数 (デフォルトの値は 256) を指定することが可能です。

source: The <command>tcpd</command> program is frequently used in the <filename>/etc/inetd.conf</filename> file. It allows limiting incoming connections by applying access control rules, documented in the <citerefentry><refentrytitle>hosts_access</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page, and which are configured in the <filename>/etc/hosts.allow</filename> and <filename>/etc/hosts.deny</filename> files. Once it has been determined that the connection is authorized, <command>tcpd</command> executes the real server (like <command>in.fingerd</command> in our example). It is worth noting that <command>tcpd</command> relies on the name under which it was invoked (that is the first argument, <literal>argv[0]</literal>) to identify the real program to run. So you should not start the arguments list with <literal>tcpd</literal> but with the program that must be wrapped.
ja_jp: <filename>/etc/inetd.conf</filename> ファイルの中では <command>tcpd</command> プログラムを使うことが多いです。<command>tcpd</command> プログラムを使うと、アクセス制御ルールを適用して新たな接続を制限することが可能です。アクセス制御ルール <citerefentry><refentrytitle>hosts_access</refentrytitle><manvolnum>5</manvolnum></citerefentry> マニュアルページで説明されており、<filename>/etc/hosts.allow</filename> と <filename>/etc/hosts.deny</filename> ファイルを使います。一旦その接続が認証されたら、<command>tcpd</command> は実際のサーバを実行します (以下の例では <command>in.fingerd</command> など)。<command>tcpd</command> はそれが実行されたときの名前 (1 番目の引数 <literal>argv[0]</literal>) を頼りに、実際に実行するプログラムを識別します。この点に注意してください。そのため、引数リストは <literal>tcpd</literal> で始めるのではなく、ラップされなければいけないプログラムで始めるべきです。

source: <emphasis>COMMUNITY</emphasis> Wietse Venema
ja_jp: <emphasis>COMMUNITY</emphasis> Wietse Venema さん

source: While Debian installs <emphasis role="pkg">openbsd-inetd</emphasis> by default, there is no lack of alternatives: we can mention <emphasis role="pkg">inetutils-inetd</emphasis>, <emphasis role="pkg">micro-inetd</emphasis>, <emphasis role="pkg">rlinetd</emphasis> and <emphasis role="pkg">xinetd</emphasis>.
ja_jp: Debian はデフォルトで <emphasis role="pkg">openbsd-inetd</emphasis> をインストールしますが、他にも沢山の代替品があります: <emphasis role="pkg">inetutils-inetd</emphasis>、<emphasis role="pkg">micro-inetd</emphasis>、<emphasis role="pkg">rlinetd</emphasis>、<emphasis role="pkg">xinetd</emphasis> などです。

source: Many Debian packages rely on this service: by putting maintenance scripts in these directories, they ensure optimal operation of their services.
ja_jp: 多くの Debian パッケージはこのサービスに頼っています: メンテナンススクリプトをこれらのディレクトリに入れて、サービスの最適な動作を保証しています。

source: two limits (called “soft” and “hard”) refer to the number of blocks consumed. If the filesystem was created with a block-size of 1 kibibyte, a block contains 1024 bytes from the same file. Unsaturated blocks thus induce losses of disk space. A quota of 100 blocks, which theoretically allows storage of 102,400 bytes, will however be saturated with just 100 files of 500 bytes each, only representing 50,000 bytes in total.
ja_jp: 消費ブロック数に対する 2 種類の制限 (「ソフト」と「ハード」と呼ばれます) があります。もしファイルシステムが 1 キロバイトのブロックサイズで作られた場合、1 ブロックには、あるファイルの 1024 バイト分を入れることが可能です。飽和していないブロックにより、ディスクスペースの損失が生じます。100 ブロックのクォータは理論的には 102,400 バイト保存できることを意味しますが、500 バイトのファイル 100 個、合計 50,000 バイト、で上限に達することになります。

source: <primary>inode</primary>
ja_jp: <primary>i ノード</primary>

source: The filesystem divides the hard drive into blocks — small contiguous areas. The size of these blocks is defined during creation of the filesystem, and generally varies between 1 and 8 kibibytes.
ja_jp: ファイルシステムはハードドライブをブロック - 小さく連続した領域 - に分割します。ブロックのサイズはファイルシステムの作成時に定義され、一般的に 1 から 8 キロバイトまでの範囲を取ります。

source: Many programs exist, such as <command>amanda</command>, <command>bacula</command>, <command>BackupPC</command>. Those are client/server system featuring many options, whose configuration is rather difficult. Some of them provide user-friendly web interfaces to mitigate this. But Debian contains dozens of other backup software covering all possible use cases, as you can easily confirm with <command>apt-cache search backup</command>.
ja_jp: <command>amanda</command>、<command>bacula</command>、<command>BackupPC</command> 等の多くのプログラムが存在します。これらはクライアント/サーバシステムに適した多くの選択肢で、設定はかなり難しいです。幾つかは難しさを和らげるためのユーザフレンドリーなウェブインターフェイスを提供しています。しかし Debian には、全ての考え得る使用事例に対応できる、他の数多くのバックアップソフトウェアが含まれています。ソフトウェアを確認するには <command>apt-cache search backup</command> を使ってください。

source: Backups on tape having been deemed too slow and costly, data will be backed up on hard drives on a dedicated server, on which the use of software RAID (see <xref linkend="sect.raid-soft" />) will protect the data from hard drive failure. Desktop computers are not backed up individually, but users are advised that their personal account on their department's file server will be backed up. The <command>rsync</command> command (from the package of the same name) is used daily to back up these different servers.
ja_jp: テープへのバックアップは遅くて費用がかかりすぎるとみなされ、データは専用サーバのハードドライブにバックアップされる事になりました。専用サーバはソフトウェア RAID (<xref linkend="sect.raid-soft" />参照) を使ってデータをハードウェア障害から守っています。デスクトップコンピュータは個別にバックアップされませんが、ユーザは部署のファイルサーバの個人アカウントはバックアップされると忠告されています。毎日 <command>rsync</command> コマンド (同名のパッケージに含まれる) を使って、異なるサーバにバックアップを行います。

source: <primary>hard link</primary>
ja_jp: <primary>ハードリンク</primary>

source: When dirvish needs to save data to a remote machine, it will use <command>ssh</command> to connect to it, and will start <command>rsync</command> as a server. This requires the root user to be able to automatically connect to it. The use of an SSH authentication key allows precisely that (see <xref linkend="sect.ssh-key-based-auth" />).
ja_jp: dirvish がリモートマシンのデータをバックアップする場合、<command>ssh</command> を使ってリモートマシンに接続し、<command>rsync</command> をサーバとして開始します。この場合、root ユーザは自動的にリモートマシンに接続できなければいけません。これを実現するには、SSH 認証鍵を使ってください (<xref linkend="sect.ssh-key-based-auth" />参照)。

source: Desktop computers, which are not backed up, will be easy to reinstall from custom DVD-ROMs prepared with <emphasis>Simple-CDD</emphasis> (see <xref linkend="sect.simple-cdd" />). Since this performs an installation from scratch, it loses any customization that can have been made after the initial installation. This is fine since the systems are all hooked to a central LDAP directory for accounts and most desktop applications are preconfigured thanks to dconf (see <xref linkend="sect.gnome-desktop" /> for more information about this).
ja_jp: バックアップされていないデスクトップコンピュータに対しては <emphasis>Simple-CDD</emphasis> でカスタマイズされた DVD-ROM からシステムを再インストールするのが簡単でしょう (see <xref linkend="sect.simple-cdd" />)。インストールを最初からやり直すので、初回インストール後に行われた全ての設定は失われます。これは問題ではありません。なぜなら、アカウントについてはシステムは全て中央 LDAP ディレクトリに接続されており、ほとんどのデスクトップアプリケーションについては dconf のお陰で事前設定されている (詳しい情報は<xref linkend="sect.gnome-desktop" />参照) からです。

source: <primary>dump</primary>
ja_jp: <primary>ダンプ</primary>

source: The <emphasis>hotplug</emphasis> kernel subsystem dynamically handles the addition and removal of devices, by loading the appropriate drivers and by creating the corresponding device files (with the help of <command>udevd</command>). With modern hardware and virtualization, almost everything can be hotplugged: from the usual USB/PCMCIA/IEEE 1394 peripherals to SATA hard drives, but also the CPU and the memory.
ja_jp: <emphasis>hotplug</emphasis> カーネルサブシステムはデバイスの追加と削除を、適切なドライバを読み込んだり関連するデバイスファイルを作成する (<command>udevd</command> の助けを借りて) ことで、動的に取り扱います。現代的なハードウェアと仮想化を使えば、ほとんど全てはホットプラグ対応です: USB/PCMCIA/IEEE 1394 周辺機器から SATA ハードドライブ、さらには CPU やメモリに至るまで。

source: The kernel has a database that associates each device ID with the required driver. This database is used during boot to load all the drivers for the peripheral devices detected on the different buses, but also when an additional hotplug device is connected. Once the device is ready for use, a message is sent to <command>udevd</command> so it will be able to create the corresponding entry in <filename>/dev/</filename>.
ja_jp: カーネルは必要なドライバとデバイス ID を関連付けるデータベースを持っています。このデータベースは、起動中に様々なバスで検出された周辺機器用の全てのドライバを読み込んだり、追加的なホットプラグデバイスが接続された時に、使われます。デバイスの使用準備が整ったら、メッセージが <command>udevd</command> に送信され、<command>udevd</command> は対応するエントリを <filename>/dev/</filename> 内に作成します。

source: <primary><emphasis>hotplug</emphasis></primary>
ja_jp: <primary><emphasis>ホットプラグ</emphasis></primary>

source: <primary>hotplug</primary>
ja_jp: <primary>ホットプラグ</primary>

source: Power Management: Advanced Configuration and Power Interface (ACPI)
ja_jp: 電源管理: Advanced Configuration and Power Interface (ACPI)

source: The topic of power management is often problematic. Indeed, properly suspending the computer requires that all the computer's device drivers know how to put them to standby, and that they properly reconfigure the devices upon waking. Unfortunately, there are still a few devices unable to sleep well under Linux, because their manufacturers have not provided the required specifications.
ja_jp: 電源管理は問題のある場合が多いです。実際、適切にコンピュータを一時停止するには、コンピュータの全てのデバイスドライバがデバイスをスタンバイ状態にする方法を知り、デバイスドライバがデバイスを再始動する際に適切に再設定できなければいけません。不幸なことに、Linux の下では上手くスタンバイ状態に出来ないデバイスが多いです。なぜなら、デバイスの製造業者が必要な仕様を公開しないからです。

source: Linux supports ACPI (Advanced Configuration and Power Interface) — the most recent standard in power management. The <emphasis role="pkg">acpid</emphasis> package provides a daemon that looks for power management related events (switching between AC and battery power on a laptop, etc.) and that can execute various commands in response.
ja_jp: Linux は ACPI (Advanced Configuration and Power Interface) - 最新の標準的な電源管理規格 - をサポートします。<emphasis role="pkg">acpid</emphasis> パッケージは、電源管理に関するイベント (ラップトップで交流電源とバッテリ電源の切り替えに対するイベントなど) を司り、イベントに応答して様々なコマンドを実行する、デーモンを提供します。
