Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: If you give it a new octal value, the <command>umask</command> command modifies the mask. Used in a shell initialization file (for example, <filename>~/.bash_profile</filename>), it will effectively change the default mask for your work sessions.
it_it: Assegnando un nuovo valore ottale, il comando <command>umask</command> modifica la maschera. Utilizzato in un file di inizializzazione shell (per esempio, <filename>~ /.bash_profile</filename> ), cambiarà effettivamente la maschera di default per le vostre sessioni di lavoro.
ja_jp: 新しい 8 進数値でマスクを再設定したければ、<command>umask</command> コマンドでマスクを変更できます。シェル初期化ファイル (例えば、<filename>~/.bash_profile</filename>) の中で <command>umask</command> コマンドを使った場合、作業セッション内で有効なデフォルトのマスクを変更します。

source: Administration Interfaces
it_it: Interfacce di amministrazione
ja_jp: 管理インターフェイス

source: <primary>interface</primary><secondary>administration interface</secondary>
it_it: <primary>interfaccia</primary><secondary>Interfaccia di amministrazione</secondary>
ja_jp: <primary>インターフェイス</primary><secondary>管理インターフェイス</secondary>

source: <primary>administration, interfaces</primary>
it_it: <primary>amministrazione, le interfacce</primary>
ja_jp: <primary>管理、インターフェイス</primary>

source: Using a graphical interface for administration is interesting in various circumstances. An administrator does not necessarily know all the configuration details for all their services, and doesn't always have the time to go seeking out the documentation on the matter. A graphical interface for administration can thus accelerate the deployment of a new service. It can also simplify the setup of services which are hard to configure.
it_it: L'utilizzo di un'interfaccia grafica per l'amministrazione è interessante per diversi motivi. Un amministratore non deve necessariamente conoscere tutti i dettagli di configurazione per tutti i servizi, e non sempre ha il tempo per andare a cercare documentazione in materia. Un'interfaccia grafica per l'amministrazione può quindi accelerare la diffusione di un nuovo servizio. Si può anche semplificare la configurazione di quei servizi che sono difficili da configurare.
ja_jp: 管理にグラフィカルインターフェイスを使うことは様々な状況で興味深いです。管理者は全てのサービスの全ての設定の詳細を知る必要はありませんし、常に問題に関連する文書を探し出すための時間があるというわけでもありません。管理用のグラフィカルインターフェイスを使うと、新しいサービスを素早く配置できるようになります。さらに、設定の難しいサービスのセットアップを単純に行うことが可能です。

source: Such an interface is only an aid, and not an end in itself. In all cases, the administrator must master its behavior in order to understand and work around any potential problem.
it_it: Tale interfaccia è solo di aiuto, e non un fine in sé. In ogni caso, l'amministratore deve padroneggiare il proprio comportamento al fine di capire e risolvere eventuali problemi.
ja_jp: グラフィカルインターフェイスは補助でしかなく、インターフェイス自身は目的ではありません。どんな場合でも管理者は、様々な潜在的問題を理解してに対処するために、サービスの挙動に精通しなければいけません。

source: Since no interface is perfect, you may be tempted to try several solutions. This is to be avoided as much as possible, since different tools are sometimes incompatible in their work methods. Even if they all target to be very flexible and try to adopt the configuration file as a single reference, they are not always able to integrate external changes.
it_it: Dal momento che nessun interfaccia è perfetta, si può essere tentati di provare diverse soluzioni. Questo è da evitare per quanto possibile, dal momento che diversi strumenti sono a volte incompatibili tra di loro. Anche se tutti i target di essere molto flessibile e cercare di adottare il file di configurazione come unico riferimento, non sono sempre in grado di integrare cambiamenti esterni.
ja_jp: どんなインターフェイスも完璧ではありませんから、様々なインターフェイスを試したくなるかもしれません。これは可能な限り避けるべきです。なぜなら、ツールが違えばそのやり方に互換性がないこともあるからです。ツールが、全ての目標をとても柔軟性の高い方法で取り扱い、基準としてその設定ファイルを採用しようとしていたとしても、ツールは外部からの変更を必ず統合出来るわけではありません。

source: Administrating On a Web Interface: <command>webmin</command>
it_it: Amministrare tramite un'interfaccia Web: <command>webmin</command>

source: This is, without a doubt, one of the most successful administration interfaces. It is a modular system managed through a web browser, covering a wide array of areas and tools. Furthermore, it is internationalized and available in many languages.
it_it: Questo è, senza dubbio, una delle interfacce di amministrazione di maggior successo. Si tratta di un sistema modulare gestito attraverso un browser web, che copre una vasta gamma di aree e strumenti. Inoltre, è internazionalizzato e disponibile in molte lingue.
ja_jp: <command>webmin</command> が最も成功した管理インターフェイスの 1 つであることは間違いないでしょう。<command>webmin</command> はモジュールシステムで、ウェブブラウザから管理され、幅広い領域とツールをカバーしています。更に、<command>webmin</command> は国際化されており、多くの言語で利用可能です。

source: Sadly, <command>webmin</command> is no longer part of Debian since <emphasis role="distribution">Etch</emphasis>. Its Debian maintainer — Jaldhar H. Vyas — removed the packages he created because he no longer had the time required to maintain them at an acceptable quality level. Nobody has officially taken over, so <emphasis role="distribution">Squeeze</emphasis> does not have the <command>webmin</command> package.
it_it: Purtroppo, <command>webmin</command> non fa più parte di Debian da <emphasis role="distribution">Etch</emphasis> . Il suo maintainer Debian - Jaldhar H. Vyas - ha rimosso i pacchetti che ha creato, perché non aveva più il tempo necessario per mantenerli a un livello qualitativo accettabile. Nessuno ha ufficialmente preso il sopravvento, così in <emphasis role="distribution">Squeeze</emphasis> non è presente il pacchetto <command>webmin</command>.

source: There is, however, an unofficial package distributed on the <literal>webmin.com</literal> website. Contrary to the packages included in <emphasis role="distribution">Sarge</emphasis>, this package is monolithic; all of its configuration modules are installed and activated by default, even if the corresponding service is not installed on the machine.
it_it: Esiste, comunque, un pacchetto ufficiale distribuito sul sito web <literal>webmin.com</literal>. Contrariamente ai pacchetti inclusi in <emphasis role="distribution">Sarge</emphasis> , questo pacchetto è monolitico, tutti i suoi moduli di configurazione sono installati e attivati di default, anche se il servizio corrispondente non è installato sulla macchina.

source: <emphasis>SECURITY</emphasis> Changing the root password
it_it: <emphasis>SICUREZZA</emphasis> Cambiare la password di root
ja_jp: <emphasis>SECURITY</emphasis> root パスワードの変更

source: On first login, identification is conduced with the root username and its usual password. It is recommended to change the password used for <command>webmin</command> as soon as possible, so that if it is compromised, the root password for the server will not be involved, even if this confers important administrative rights to the machine.
it_it: Per il primo accesso, l'identificazione è basata sul nome utente root e la password predefinita. Si raccomanda di modificare la password utilizzata per <command>webmin</command> il più presto possibile, in modo che se fosse compromesso, la password di root del server non sarà coinvolta, anche se questo conferisse importanti diritti amministrativi per la macchina.
ja_jp: 最初のログインでは、root というユーザ名と root のパスワードを使って身分証明します。可能な限り早く、<command>webmin</command> 用のパスワードを変更することを推奨します。<command>webmin</command> を使えばマシンに対する重要な管理上の権限が必要な操作が可能とは言っても、こうしておけば、<command>webmin</command> が不正アクセスを受けた場合でも、サーバの root パスワードは守られます。

source: Beware! Since <command>webmin</command> has so many features, a malicious user accessing it could compromise the security of the entire system. In general, interfaces of this kind are not recommended for important systems with strong security constraints (firewall, sensitive servers, etc.).
it_it: Attenzione! Dato che <command>webmin</command> ha così tante caratteristiche, un utente malintenzionato accedendo potrebbe compromettere la sicurezza dell'intero sistema. In generale, questo tipo di interfacce non sono raccomandate per quei sistemi importanti con forti vincoli di sicurezza (firewall, server sensibili, ecc.).
ja_jp: 注意してください! <command>webmin</command> は多くの機能を持っていますから、悪意あるユーザが <command>webmin</command> を使って全システムのセキュリティを侵害する事が可能です。一般に、この種のインターフェイスを強固なセキュリティを要求される重要なシステム (ファイヤーウォール、外部向けサーバなど) で使うのは推奨されません。

source: Webmin is used through a web interface, but it does not require Apache to be installed. Essentially, this software has its own integrated mini web server. This server listens by default on port 10000 and accepts secure HTTP connections.
it_it: Webmin va usato tramite un'interfaccia web, ma non richiede che Apache sia installato. In sostanza, questo software dispone di un proprio mini server web integrato. Questo server è in ascolto di default sulla porta 10000 e accetta connessioni HTTP protette.
ja_jp: Webmin はウェブインターフェイスを通じて使われますが、Apache をインストールする必要はありません。元から Webmin には統合された小さなウェブサーバが含まれています。このサーバはデフォルトでポート 10000 番をリッスンし、安全な HTTP 接続を受け入れます。

source: Included modules cover a wide variety of services, among which:
it_it: I moduli inclusi coprono una vasta gamma di servizi, tra cui:
ja_jp: 導入されたモジュールは多種多様なサービスをカバーしています、例えば:

source: all base services: creation of users and groups, management of <filename>crontab</filename> files, init scripts, viewing of logs, etc.
it_it: tutti i servizi di base: creazione di utenti e gruppi, gestione dei file <filename>crontab</filename>, script di init, visualizzazione dei log, ecc.
ja_jp: 全ての基本的サービス: ユーザとグループの作成、<filename>crontab</filename> ファイルの管理、init スクリプト、ログの閲覧など。

source: bind: DNS server configuration (name service);
it_it: bind: configurazione del server DNS (nome del servizio);
ja_jp: bind: DNS サーバ設定 (ネームサービス);

source: postfix: SMTP server configuration (e-mail);
it_it: postfix: configurazione del server SMTP (e-mail);
ja_jp: postfix: SMTP サーバ設定 (電子メール);

source: inetd: configuration of the <command>inetd</command> super-server;
it_it: inetd: configurazione del super-server <command>inetd</command>;
ja_jp: inetd: <command>inetd</command> スーパーサーバの設定;

source: quota: user quota management;
it_it: quota: gestione delle quote degli utenti;
ja_jp: quota: ユーザクォータの管理;

source: dhcpd: DHCP server configuration;
it_it: dhcpd: configurazione del server DHCP;
ja_jp: dhcpd: DHCP サーバの設定;

source: proftpd: FTP server configuration;
it_it: proftpd: configurazione del server FTP;
ja_jp: proftpd: FTP サーバの設定;

source: samba: Samba file server configuration;
it_it: samba: configurazione del file server Samba;
ja_jp: samba: Samba ファイルサーバの設定;

source: software: installation or removal of software from Debian packages and system updates.
it_it: software: installazione o rimozione di software di pacchetti Debian e aggiornamenti di sistema.
ja_jp: ソフトウェア: Debian パッケージを使ったソフトウェアのインストールと削除、システム更新。

source: The administration interface is available in a web browser at <literal>https://localhost:10000</literal>. Beware! Not all the modules are directly usable. Sometimes they must be configured by specifying the locations of the corresponding configuration files and some executable files (program). Frequently the system will politely prompt you when it fails to activate a requested module.
it_it: L'interfaccia di amministrazione è disponibile in un browser web all'URL <literal>https://localhost:10000</literal> . Attenzione! Non tutti i moduli sono direttamente utilizzabili. A volte devono essere configurati specificando i percorsi dei file di configurazione corrispondenti e di alcuni file eseguibili (programma). Spesso il sistema notificherà educatamente nel caso non riesca ad attivare un modulo richiesto.
ja_jp: ウェブブラウザで <literal>https://localhost:10000</literal> にアクセスすれば管理インターフェイスを使えます。注意してください! 全てのモジュールがすぐに使えるわけではありません。対応する設定ファイルと一部の実行ファイル (プログラム) の場所を指定して、モジュールを設定しなければいけない場合もあります。要求されたモジュールの有効化に失敗した場合、Webmin システムから丁寧な指示をもらうでしょう。

source: The GNOME project also provides a graphical administration interface in the <emphasis role="pkg">gnome-system-tools</emphasis> package. Installed by default for a desktop system, it includes applications that can be found in the menu at <menuchoice><guimenu>System</guimenu><guisubmenu>Administration</guisubmenu></menuchoice>. Easy to use, these applications cover only a limited number of base services: user and group management, time configuration, network configuration, disk management, and management of startup services.
it_it: Il progetto GNOME fornisce anche una interfaccia grafica di amministrazione nel pacchetto <emphasis role="pkg">gnome-system-tools</emphasis>. Viene installato per impostazione predefinita per un sistema desktop, ed include le applicazioni che si possono trovare nel menù <menuchoice><guimenu>Sistema</guimenu><guisubmenu>Amministrazione</guisubmenu></menuchoice>. Facile da usare, queste applicazioni riguardano solo un numero limitato di servizi di base: uso e gestione del gruppo, configurazione di ora e data, configurazione di rete, gestione del disco e gestione dei servizi di avvio.

source: Configuring Packages: <command>debconf</command>
it_it: Configurazione dei pacchetti: <command>debconf</command>
ja_jp: パッケージの設定: <command>debconf</command>

source: Many packages are automatically configured after asking a few questions during installation through the Debconf tool. These packages can be reconfigured by running <command>dpkg-reconfigure <replaceable>package</replaceable></command>.
it_it: Molti pacchetti vengono configurati automaticamenti dopo aver posto alcune domande durante l'installazione attraverso il tool Debconf. Questi pacchetti possono essere riconfigurati mediante l'esecuzione di <command>dpkg-reconfigure <replaceable>pacchetto</replaceable></command> .
ja_jp: 多くのパッケージが、インストール中 Debconf ツールを使って僅かな質問をした後に、自動的に設定されるようになっています。そのようなパッケージは <command>dpkg-reconfigure <replaceable>package</replaceable></command> を実行すれば再設定可能です。

source: For most cases, these settings are very simple; only a few important variables in the configuration file are changed. These variables are often grouped between two “demarcation” lines so that reconfiguration of the package only impacts the enclosed area. In other cases, reconfiguration will not change anything if the script detects a manual modification of the configuration file, in order to preserve these human interventions (because the script can't ensure that its own modifications will not disrupt the existing settings).
it_it: Nella maggior parte dei casi, queste impostazioni sono molto semplici, solo alcune importanti variabili nel file di configurazione vengono modificate. Queste variabili sono spesso raggruppate tra due "linee di demarcazione" in modo che la riconfigurazione del pacchetto influisca solo per l'area racchiusa. In altri casi, la riconfigurazione non cambierà nulla se lo script rileva una modifica manuale del file di configurazione, al fine di conservare questi interventi umani (perché lo script non può garantire che le sue proprie modifiche non ostacoleranno le impostazioni esistenti).
ja_jp: 殆どの場合、これらの設定はとても簡素です; 設定ファイル中の僅かな重要変数だけが変更されます。これらの重要変数は多くの場合 2 つの「境界」線で挟まれています。そうすれば、パッケージを再設定しても影響を受けるのは境界線で挟まれた範囲だけに限定されるからです。「境界」線で挟まれていない場合、スクリプトが手作業で設定ファイルが変更されたことを検出したら、人間による設定変更を上書きしないよう、再設定しても何も変更されません (なぜなら、スクリプトは自分の修正が既存の設定を破壊しないことを保証できないからです)。

source: <emphasis>DEBIAN POLICY</emphasis> Preserving changes
it_it: <emphasis>Debian Policy</emphasis> Preservare le modifiche
ja_jp: <emphasis>DEBIAN POLICY</emphasis> 変更の保存

source: The Debian Policy expressly stipulates that everything should be done to preserve manual changes made to a configuration file, so more and more scripts take precautions when editing configuration files. The general principle is simple: the script will only make changes if it knows the status of the configuration file, which is verified by comparing the checksum of the file against that of the last automatically generated file. If they are the same, the script is authorized to change the configuration file. Otherwise, it determines that the file has been changed and asks what action it should take (install the new file, save the old file, or try to integrate the new changes with the existing file). This precautionary principle has long been unique to Debian, but other distributions have gradually begun to embrace it.
it_it: La Debian Policy prevede espressamente che tutto dovrebbe essere fatto per mantenere le modifiche manuali apportate a un file di configurazione, in questo modo sempre più script dovranno prendere le dovute precauzioni durante la modifica dei file di configurazione. Il principio generale è semplice: lo script apportare modifiche solo se si conosce lo stato del file di configurazione, il quale viene verificato confrontando il checksum del file contro quello dell'ultimo file generato automaticamente. Se sono la stessa cosa, lo script è autorizzato a modificare il file di configurazione. In caso contrario, si determina che il file è stato modificato e chiede quale comportamento deve adottare (installare il nuovo file, salvare il vecchio file, o cercare di integrare i nuovi cambiamenti con il file esistente). Questo principio di precauzione è stato a lungo l'unico per Debian, ma altre distribuzioni hanno gradualmente cominciato ad abbracciarlo.
ja_jp: Debian ポリシーには、スクリプトは設定ファイルに対して行われた手作業の変更を保護するように作業を実行しなければいけないことが、明確に規定されています。このため、ますます多くのスクリプトが設定ファイルを編集する際に事前注意を出します。一般的な原則は単純です: スクリプトが修正を行うのは、設定ファイルの状態を検証して、修正しても問題ないと判断した場合だけです。設定ファイルの状態検証は、最後に自動的に生成された設定ファイルのチェックサムと現在の設定ファイルのチェックサムを比較することで行います。両者のチェックサムが同じ場合、スクリプトは設定ファイルを変更する権限を与えられます。チェックサムが違った場合、設定ファイルが変更されたと判断し、対応 (新しいファイルをインストールする、古いファイルを保存する、新しい変更を既存のファイルと統合しようとする) を尋ねます。この事前注意の原則は長きに渡り Debian に固有のものでしたが、他のディストリビューションもこの原則を採用し始めています。

source: The <command>ucf</command> program (from the Debian package of the same name) can be used to implement such a behavior.
it_it: Il programma <command>ucf</command> (dal pacchetto Debian omonimo) può essere utilizzato per implementare un tale comportamento.
ja_jp: (同名の Debian パッケージの提供する) <command>ucf</command> プログラムはこの原則を実行に移すために使われます。

source: <command>syslog</command> System Events
it_it: <command>syslog</command> Eventi di sistema
ja_jp: <command>syslog</command> システムイベント

source: <primary>files</primary><secondary>log files</secondary>
it_it: <primary>file</primary><secondary>file di log</secondary>
ja_jp: <primary>ファイル</primary><secondary>ログファイル</secondary>

source: <primary>logs</primary><secondary>distribution</secondary>
it_it: <primary>log</primary><secondary>distribuzione</secondary>

source: Principle and Mechanism
it_it: Principi e Meccanismi
ja_jp: 原理とメカニズム

source: The <command>rsyslogd</command> daemon is responsible for collecting service messages coming from applications and the kernel, then distributing them into log files (usually stored in the <filename>/var/log/</filename> directory). It obeys the <filename>/etc/rsyslog.conf</filename> configuration file.
it_it: Il demone <command>rsyslogd</command> è responsabile per la raccolta di messaggi di servizio provenienti da applicazioni e dal kernel, distribuendoli poi nei file di log (di solito memorizzati nella directory <filename>/ var / log /</filename>). Obbedisce al file di configurazione <filename>/ etc / rsyslog.conf</filename>.

source: <emphasis>SUPPLEMENTS</emphasis> Moving from sysklogd to rsyslog
it_it: <emphasis>SUPPLEMENTI</emphasis> Passare da sysklogd a rsyslog

source: Debian <emphasis role="distribution">Squeeze</emphasis> installs <emphasis role="pkg">rsyslog</emphasis> by default, while older versions (up to <emphasis role="distribution">Etch</emphasis>, but not <emphasis role="distribution">Lenny</emphasis>) used <emphasis role="pkg">sysklogd</emphasis>. The transition was not automatic, and in the case of an upgrade from <emphasis role="distribution">Etch</emphasis>, <emphasis role="pkg">rsyslog</emphasis> should be installed manually if you want to keep in sync with Debian's default choice.
it_it: Debian <emphasis role="distribution">Squeeze</emphasis> installa <emphasis role="pkg">rsyslog</emphasis> per impostazione predefinita, mentre le versioni più vecchie (fino a <emphasis role="distribution">Etch</emphasis> , Ma non <emphasis role="distribution">Lenny</emphasis> ) usavano <emphasis role="pkg">sysklogd</emphasis> . La transizione non è stata automatica, e nel caso di un aggiornamento da <emphasis role="distribution">Etch</emphasis> , <emphasis role="pkg">rsyslog</emphasis> deve essere installato manualmente se si desidera mantenere la sincronia con la scelta di default di Debian.

source: Migration from one to the other is painless, since the default configuration is very similar, and the syntax of the older <filename>/etc/syslog.conf</filename> is compatible with the new <filename>/etc/rsyslog.conf</filename>.
it_it: La migrazione da una all'altra è indolore, dal momento che la configurazione di default è molto simile, e la sintassi del vecchio <filename>/ etc / syslog.conf</filename> è compatibile con il nuovo <filename>/ etc / rsyslog.conf</filename> .

source: Each log message is associated with an application subsystem (called “facility” in the documentation):
it_it: Ciascun messaggio di registro è associato a un sottosistema dell'applicazione (denominata "struttura" nella documentazione):
ja_jp: 各ログメッセージはアプリケーションサブシステム (文書中では「facility」と呼ばれます) に関連付けられます:

source: <literal>auth</literal> and <literal>authpriv</literal>: for authentication;
it_it: <literal>auth</literal> e <literal>authpriv</literal> : Per l'autenticazione;
ja_jp: <literal>auth</literal> と <literal>authpriv</literal>: 認証;

source: <literal>cron</literal>: comes from task scheduling services, <command>cron</command> and <command>atd</command>;
it_it: <literal>cron</literal> : Proviene da servizi di pianificazione delle attività, <command>cron</command> e <command>ATD</command> ;
ja_jp: <literal>cron</literal>: タスクスケジューリングサービスからのメッセージ、<command>cron</command> と <command>atd</command>;

source: <literal>daemon</literal>: affects a daemon without any special classification (DNS, NTP, etc.);
it_it: <literal>demone</literal> : interessa un demone senza alcuna classificazione speciale (DNS, NTP, ecc);
ja_jp: <literal>daemon</literal>: 特別な分類の無いデーモン (DNS、NTP、など);

source: <literal>ftp</literal>: concerns the FTP server;
it_it: <literal>ftp</literal> : Riguarda il server FTP;
ja_jp: <literal>ftp</literal>: FTP サーバ関連;

source: <literal>kern</literal>: message coming from the kernel;
it_it: <literal>kern</literal> : Messaggio proveniente dal kernel;
ja_jp: <literal>kern</literal>: カーネルからのメッセージ;

source: <literal>lpr</literal>: comes from the printing subsystem;
it_it: <literal>lpr</literal> : Deriva dal sottosistema di stampa;
ja_jp: <literal>lpr</literal>: 印刷サブシステムからのメッセージ;

source: <literal>mail</literal>: comes from the e-mail subsystem;
it_it: <literal>posta</literal> : Proviene dal sottosistema per l'indirizzo e-mail;
ja_jp: <literal>mail</literal>: 電子メールサブシステムからのメッセージ;

source: <literal>news</literal>: Usenet subsystem message (especially from an NNTP — Network News Transfer Protocol — server that manages newsgroups);
it_it: <literal>notizie</literal> : Messaggio di sottosistema Usenet (specialmente da NNTP - Network News Transfer Protocol - il server che gestisce i newsgroup);
ja_jp: <literal>news</literal>: Usenet サブシステムからのメッセージ (特にニュースグループを管理する NNTP - Network News Transfer Protocol - サーバ);

source: <literal>syslog</literal>: messages from the <command>syslogd</command> server, itself;
it_it: <literal>syslog</literal> : Messaggi dal server <command>syslogd</command> stesso;
ja_jp: <literal>syslog</literal>: <command>syslogd</command> サーバ (自分) からのメッセージ;

source: <literal>user</literal>: user messages (generic);
it_it: <literal>utente</literal> : Messaggi utente (generico);
ja_jp: <literal>user</literal>: ユーザメッセージ (一般);
