Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: APM (Advanced Power Management) is the ancestor of ACPI in the power management world. While Debian still provides <command>apmd</command> (the counterpart to <command>acpid</command> for the APM standard), the official Debian kernel no longer supports APM so you'll have to run a custom kernel if you really need it for some old computer.
ja_jp: APM (Advanced Power Management) は電源管理分野における ACPI の先祖です。Debian ではまだ <command>apmd</command> (APM 規格用の <command>acpid</command> に対応するもの) を配布していますが、公式の Debian カーネルはもはや APM をサポートしません。このため、一部の古いコンピュータで本当に APM が必要ならば、カスタムカーネルを実行しなければいけません。

source: <emphasis>BEWARE</emphasis> Graphics card and standby
ja_jp: <emphasis>BEWARE</emphasis> グラフィックカードとスタンバイ

source: The graphics card driver is often the culprit when standby doesn't work properly. In that case, it is a good idea to test the latest version of the X.org graphics server.
ja_jp: グラフィックカードドライバはスタンバイが上手くできない問題の原因になることが多いです。この場合、X.org グラフィックサーバの最新版を試してみるのが良いアイディアです。
