Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: The SSH protocol allows forwarding of graphical data (“X11” session, from the name of the most widespread graphical system in Unix); the server then keeps a dedicated channel for those data. Specifically, a graphical program executed remotely can be displayed on the X.org server of the local screen, and the whole session (input and display) will be secure. Since this feature allows remote applications to interfere with the local system, it is disabled by default. You can enable it by specifying <literal>X11Forwarding yes</literal> in the server configuration file (<filename>/etc/ssh/sshd_config</filename>). Finally, the user must also request it by adding the <literal>-X</literal> option to the <command>ssh</command> command-line.
it_it: Il protocollo SSH consente la trasmissione dei dati grafici (sessione "X11", dal nome del più diffuso sistema grafico in Unix), il server mantiene un canale dedicato per tali dati. In particolare, un programma grafico eseguito da remoto può essere visualizzato sul server X.org dello schermo locale e l'intera sessione (ingresso e display) sarà sicura. Poiché questa funzionalità consente alle applicazioni remote di interferire con il sistema locale, è disabilitato per default. È possibile abilitare questa funzionalità specificando <literal>X11Forwarding yes</literal> nel file di configurazione del server ( <filename>/ etc / ssh / sshd_config</filename> ). Infine, l'utente deve anche richiedere aggiungendo <literal>-X</literal> opzione per la riga di comando <command>ssh</command>.
ja_jp: SSH プロトコルを使うと、グラフィカルデータ (「X11」セッション、Unix で最も広く使われているグラフィカルシステム) を転送することが可能です; そして、サーバはこれらのデータ専用の経路を開いたままにします。具体的に言うと、リモートで実行されたグラフィカルプログラムはローカル画面の X.org サーバ上に表示され、全てのセッション (入力と表示) は安全です。この機能により、リモートアプリケーションがローカルシステムに干渉することになるため、この機能はデフォルトで無効化されています。この機能を有効化するには、サーバ設定ファイル (<filename>/etc/ssh/sshd_config</filename>) で <literal>X11Forwarding yes</literal> と指定してください。最後に、ユーザは <command>ssh</command> コマンドラインに <literal>-X</literal> オプションを追加して、転送を要求しなければいけません。

source: Creating Encrypted Tunnels with Port Forwarding
it_it: Creazione di tunnel cifrati con il port forwarding
ja_jp: ポート転送を使った暗号化トンネルの作成

source: Its <literal>-R</literal> and <literal>-L</literal> options allow <command>ssh</command> to create “encrypted tunnels” between two machines, securely forwarding a local TCP port (see sidebar <xref linkend="cadre.tcp-udp" />) to a remote machine or vice versa.
it_it: Le opzioni <literal>-R</literal> e <literal>-L</literal> consentono a <command>ssh</command> di creare "tunnel criptati" tra due macchine, inoltrando in modo sicuro una porta TCP locale (vedi a lato <xref linkend="cadre.tcp-udp" /> ) ad un computer remoto o viceversa.

source: <emphasis>VOCABULARY</emphasis> Tunnel
it_it: <emphasis>VOCABOLARIO</emphasis> Tunnel
ja_jp: <emphasis>VOCABULARY</emphasis> トンネル

source: The Internet, and most LANs that are connected to it, operate in packet mode and not in connected mode, meaning that a packet issued from one computer to another is going to be stopped at several intermediary routers to find its way to its destination. You can still simulate a connected operation where the stream is encapsulated in normal IP packets. These packets follow their usual route, but the stream is reconstructed unchanged at the destination. We call this a “tunnel”, analogous to a road tunnel in which vehicles drive directly from the entrance (input) to the exit (output) without encountering any intersections, as opposed to a path on the surface that would involve intersections and changing direction.
it_it: Internet, e la maggior parte delle LAN a cui sono collegate, opera in modalità a pacchetto e non in modalità connessa, il che significa che un pacchetto emesso da un computer ad un altro sta per essere fermato in vari router intermedi per trovare la strada verso la destinazione. È ancora possibile simulare un'operazione in collegamento in cui è racchiuso il flusso in pacchetti IP normali. Questi pacchetti seguino il loro percorso abituale, ma il flusso viene ricostruito invariato a destinazione. Chiamiamo questo un "tunnel", analogo ad una galleria stradale in cui i veicoli viaggiano direttamente dall'ingresso (input) all'uscita (output) senza incontrare alcuna intersezioni, al contrario di un percorso sulla superficie che comporterebbe intersezioni e cambiamenti di direzione.
ja_jp: インターネットとインターネットに接続されているほとんどの LAN はパケットモードで動作しており、接続モードで動作していません。これは、一方のコンピュータから他方のコンピュータに向かって送信されたパケットは、宛先への経路を見つけるために複数の中間ルータで止められることを意味しています。とは言っても、接続モードを模倣することも可能です。接続モードではストリームを普通の IP パケットの中にカプセル化します。これらのパケットは通常の経路を通過しますが、ストリームの宛先を変わりません。我々はこれを道路のトンネルにかけて「トンネル」と読んでいます。トンネルでは車両が入り口 (入力) から出口 (出力) まで交差点に遭遇すること無くまっすぐ進むのに対し、見かけ上の経路は交差点や方向の変化を伴います。

source: You can use this opportunity to add encryption to the tunnel: the stream that flows through it is then unrecognizable from the outside, but it is returned in decrypted form at the exit of the tunnel.
it_it: È possibile utilizzare questa opportunità per aggiungere la crittografia al tunnel: il flusso che scorre attraverso di esso è quindi irriconoscibile dall'esterno, ma viene inviato in forma decodificata all'uscita del tunnel.
ja_jp: トンネルに暗号化機能を追加することが可能です: トンネルの中を流れるストリームは外から認識できませんが、トンネルの出口で復号化された形で返されます。

source: <command>ssh -L 8000:server:25 intermediary</command> establishes an SSH session with the <replaceable>intermediary</replaceable> host and listens to local port 8000 (see <xref linkend="figure.ssh-L" />). For any connection established on this port, <command>ssh</command> will initiate a connection from the <replaceable>intermediary</replaceable> computer to port 25 on the <replaceable>server</replaceable>, and will bind both connections together.
it_it: <command>ssh-L 8000: server: 25 intermediario</command> stabilisce una sessione SSH con l'host <replaceable>intermediario</replaceable> e ascolta sulla porta locale 8000 (vedi <xref linkend="figure.ssh-L" /> ). Per ogni connessione stabilita su questa porta, <command>ssh</command> avvierà una connessione dal computer <replaceable>intermediario</replaceable> alla porta 25 sul <replaceable>server</replaceable> legando insieme entrambe le connessioni.
ja_jp: <command>ssh -L 8000:server:25 intermediary</command> は <replaceable>intermediary</replaceable> ホストと SSH セッションを確立し、ローカルの <command>ssh</command> がローカルのポート 8000 番をリッスンします (<xref linkend="figure.ssh-L" />参照)。 <replaceable>intermediary</replaceable> の <command>ssh</command> は、ローカルのポート 8000 番を経由して接続が開始されたら、<replaceable>intermediary</replaceable> コンピュータから <replaceable>server</replaceable> のポート 25 番に接続し、ローカルから <replaceable>server</replaceable> への接続を中継します。

source: <command>ssh -R 8000:server:25 intermediary</command> also establishes an SSH session to the <replaceable>intermediary</replaceable> computer, but it is on this machine that <command>ssh</command> listens to port 8000 (see <xref linkend="figure.ssh-R" />). Any connection established on this port will cause <command>ssh</command> to open a connection from the local machine on to port 25 of the <replaceable>server</replaceable>, and to bind both connections together.
it_it: <command>ssh-R 8000: server: 25 intermediario</command> stabilisce inoltre una sessione SSH al computer <replaceable>intermediario</replaceable>, ma è in questa macchina che <command>ssh</command> è in ascolto sulla porta 8000 (vedi <xref linkend="figure.ssh-R" /> ). Ogni connessione stabilita sulla porta porterà <command>ssh</command> ad aprire una connessione dalla macchina locale alla porta 25 del <replaceable>server</replaceable> mantenendo entrambe le connessioni insieme.
ja_jp: <command>ssh -R 8000:server:25 intermediary</command> は <replaceable>intermediary</replaceable> コンピュータとの SSH セッションを確立し、<replaceable>intermediary</replaceable> の <command>ssh</command> が <replaceable>intermediary</replaceable> のポート 8000 番をリッスンします (<xref linkend="figure.ssh-R" />参照)。ローカルの <command>ssh</command> は、<replaceable>intermediary</replaceable> のポート 8000 番を経由して接続が開始されたら、ローカルマシンから <replaceable>server</replaceable> のポート 25 番に接続し、<replaceable>intermediary</replaceable> から <replaceable>server</replaceable> への接続を中継します。

source: In both cases, connections are made to port 25 on the <replaceable>server</replaceable> host, which pass through the SSH tunnel established between the local machine and the <replaceable>intermediary</replaceable> machine. In the first case, the entrance to the tunnel is local port 8000, and the data move towards the <replaceable>intermediary</replaceable> machine before being directed to the <replaceable>server</replaceable> on the “public” network. In the second case, the input and output in the tunnel are reversed; the entrance is port 8000 on the <replaceable>intermediary</replaceable> machine, the output is on the local host, and the data are then directed to the <replaceable>server</replaceable>. In practice, the server is usually either the local machine or the intermediary. That way SSH secures the connection from one end to the other.
it_it: In entrambi i casi, le connessioni sono realizzate sulla porta 25 del <replaceable>server</replaceable> host, che passano attraverso il tunnel SSH stabilito tra la macchina locale e la macchina <replaceable>intermediario</replaceable>. Nel primo caso, l'ingresso del tunnel è locale sulla porta 8000, ed i dati verso la macchina <replaceable>intermediario</replaceable> prima di essere diretti al <replaceable>server</replaceable> sulla rete "pubblica". Nel secondo caso, l'ingresso e l'uscita del tunnel sono invertiti, l'ingresso è la porta 8000 sulla macchina <replaceable>intermediario</replaceable>, l'uscita è sulla macchina locale, ed i dati vengono poi indirizzati al <replaceable>server</replaceable>. In pratica, il server è di solito o la macchina locale o l'intermediario. In questo modo SSH assicura la connessione da un'estremità all'altra.
ja_jp: どちらの場合も <replaceable>server</replaceable> ホストのポート 25 番に対して、ローカルマシンと <replaceable>intermediary</replaceable> マシンの間に確立した SSH トンネルを通り抜けて、接続します。最初の例の場合、トンネルの入口はローカルのポート 8000 番で、データはまず<replaceable>intermediary</replaceable> マシンを目指し、その後に「公開」ネットワークを経由して <replaceable>server</replaceable> に向かいます。2 番目の例の場合、トンネルの入口と出口が逆になります; トンネルの入口は <replaceable>intermediary</replaceable> マシンのポート 8000 番で、出口はローカルホストにあります。出口から出たデータは <replaceable>server</replaceable> に向かいます。現実的な話をすると、ここで言うサーバは通常、ローカルマシンまたは <replaceable>intermediary</replaceable> です。このようにして SSH は端から端までの接続を保護します。

source: Forwarding a local port with SSH
it_it: Inoltro di una porta locale con SSH
ja_jp: SSH を使ったローカルポートの転送

source: Forwarding a remote port with SSH
it_it: Inoltro di una porta remota con SSH
ja_jp: SSH を使ったリモートポートの転送

source: Using Remote Graphical Desktops
it_it: Utilizzo di un Desktop Remoto grafico
ja_jp: リモートグラフィカルデスクトップの利用

source: VNC (Virtual Network Computing) allows remote access to graphical desktops.
it_it: VNC (Virtual Network Computing) permette l'accesso remoto a desktop grafici.
ja_jp: VNC (Virtual Network Computing) を使うとグラフィカルデスクトップにリモートからアクセスすることが可能になります。

source: <primary>graphical desktop</primary><secondary>remote</secondary>
it_it: <primary>desktop grafico</primary><secondary>remoto</secondary>
ja_jp: <primary>グラフィカルデスクトップ</primary><secondary>リモート</secondary>

source: <primary>remote graphical desktop</primary>
it_it: <primary>desktop remoto grafico</primary>
ja_jp: <primary>リモートグラフィカルデスクトップ</primary>

source: <primary>desktop, remote graphical desktop</primary>
it_it: <primary>desktop, desktop remoto grafico</primary>
ja_jp: <primary>デスクトップ、リモートグラフィカルデスクトップ</primary>

source: This tool is mostly used for technical assistance; the administrator can see the errors that the user is facing, and show them the correct course of action without having to stand by them.
it_it: Questo strumento è usato soprattutto per assistenza tecnica; l'amministratore può visualizzare gli errori che l'utente si trova ad affrontare, e mostrare loro il corretto svolgimento dell'operazione, senza dover essere fisicamente presente.
ja_jp: このツールは技術支援に使われることが多いです: 管理者はユーザが直面しているエラーを見ることが可能で、ユーザの側にいなくても正しい行動の仕方をユーザに示すことが可能です。

source: First, the user must authorize sharing their session. The GNOME and KDE graphical desktop environments include, respectively, <command>vino</command> and <command>krfb</command>, which provide a graphical interface that allows sharing an existing session over VNC (found, respectively, in the menus at <menuchoice> <guimenu>System</guimenu> <guisubmenu>Preferences</guisubmenu> <guimenuitem>Remote Desktop</guimenuitem></menuchoice> and <menuchoice> <guimenu>K</guimenu> <guisubmenu>Internet</guisubmenu> <guimenuitem>Desktop Sharing</guimenuitem></menuchoice>). For other graphical desktop environments, the <command>x11vnc</command> command (from the Debian package of the same name) serves the same purpose; you can make it available to the user with an explicit icon.
it_it: In primo luogo, l'utente deve autorizzare la condivisione della sessione. Gli ambienti desktop grafici GNOME e KDE includono, rispettivamente, <command>vino</command> e <command>krfb</command> , che forniscono una interfaccia grafica che permette di condividere una sessione esistente tramite VNC (che si trova, rispettivamente, nei menu a <menuchoice><guimenu>Sistema</guimenu><guisubmenu>Preferenze</guisubmenu><guimenuitem>Remote Desktop</guimenuitem></menuchoice> e <menuchoice><guimenu>K</guimenu><guisubmenu>Internet</guisubmenu><guimenuitem>Desktop Sharing</guimenuitem></menuchoice> ). Per gli altri ambienti desktop grafici, il comando <command>x11vnc</command> (dal pacchetto Debian con lo stesso nome) serve allo stesso scopo, è possibile renderlo disponibile per l'utente con un'icona esplicita.

source: When the graphical session is made available by VNC, the administrator must connect to it with a VNC client. GNOME has <command>vinagre</command> and <command>tsclient</command> for that, while KDE includes <command>krdc</command> (in the menu at <menuchoice> <guimenu>K</guimenu> <guisubmenu>Internet</guisubmenu> <guimenuitem>Remote Desktop Client</guimenuitem></menuchoice>). There are other VNC clients that use the command line, such as <command>xvnc4viewer</command> in the Debian package of the same name. Once connected, the administrator can see what's going on, work on the machine remotely, and show the user how to proceed.
it_it: Quando la sessione grafica è messa a disposizione da VNC, l'amministratore deve connettersi con un client VNC. GNOME ha <command>vinagre</command> e <command>tsclient</command> a questo scopo, mentre KDE include <command>krdc</command> (Nel menu <menuchoice><guimenu>K</guimenu><guisubmenu>Internet</guisubmenu><guimenuitem>Remote Desktop Client</guimenuitem></menuchoice> ). Ci sono altri client VNC che utilizzano la linea di comando, come ad esempio <command>xvnc4viewer</command> nel pacchetto Debian con lo stesso nome. Una volta connesso, l'amministratore può vedere cosa sta succedendo, lavorare sulla macchina in remoto, e mostrare all'utente come procedere.

source: <emphasis>SECURITY</emphasis> VNC over SSH
it_it: <emphasis>SICUREZZA</emphasis> VNC su SSH

source: <primary>SSH tunnel</primary><secondary>VNC</secondary>
it_it: <primary>Tunnel SSH</primary><secondary>VNC</secondary>
ja_jp: <primary>SSH トンネル</primary><secondary>VNC</secondary>

source: If you want to connect by VNC, and you don't want your data sent in clear text on the network, it is possible to encapsulate the data in an SSH tunnel (see <xref linkend="section.ssh-port-forwarding" />). You simply have to know that VNC uses port 5900 by default for the first screen (called “localhost:0”), 5901 for the second (called “localhost:1”), etc.
it_it: Se si desidera connettersi a VNC, e non si desidera che i dati siano trasmessi in chiaro sulla rete, è possibile incapsulare i dati in un tunnel SSH (vedi <xref linkend="section.ssh-port-forwarding" /> ). È sufficiente sapere che VNC usa la porta 5900 per impostazione predefinita per la prima schermata (chiamata "localhost: 0"), 5.901 per il secondo ("localhost: 1" chiamato), ecc.

source: The <command>ssh -L localhost:5901:localhost:5900 -N -T <replaceable>machine</replaceable></command> command creates a tunnel between local port 5901 in the localhost interface and port 5900 of the <replaceable>machine</replaceable> host. The first “localhost” restricts SSH to listening to only that interface on the local machine. The second “localhost” indicates the interface on the remote machine which will receive the network traffic entering in “localhost:5901”. Thus <command>vncviewer localhost:1</command> will connect the VNC client to the remote screen, even though you indicate the name of the local machine.
it_it: Il comando <command>ssh-L localhost: 5901: localhost: 5900-N-T <replaceable>macchina</replaceable></command> crea un tunnel tra porta locale 5901 nell'interfaccia localhost e la porta 5900 della <replaceable>macchina</replaceable> host. Il primo "localhost" SSH si limita ad ascoltare solo sull'interfaccia della macchina locale. Il secondo "localhost" indica l'interfaccia sul computer remoto che riceverà il traffico di rete in entrata "localhost: 5901". Così <command>vncviewer localhost: 1</command> collegherà il client VNC per lo schermo remoto, anche se si indica il nome della macchina locale.
ja_jp: <command>ssh -L localhost:5901:localhost:5900 -N -T <replaceable>machine</replaceable></command> コマンドは localhost インターフェイスのポート 5901 番と<replaceable>machine</replaceable> ホストのポート 5900 番の間にトンネルを作成します。最初の「localhost」はローカルマシンのインターフェイスのみをリッスンするように SSH を制限します。2 番目の「localhost」は「localhost:5901」に入ってきたネットワークトラフィックを受け取るリモートマシンのインターフェイスを表します。そんな訳で、<command>vncviewer localhost:1</command> はローカルマシンの名前を使っているにも関わらず VNC クライアントをリモートのスクリーンに接続します。

source: When the VNC session is closed, remember to close the tunnel by also quitting the corresponding SSH session.
it_it: Quando la sessione VNC è chiusa, bisogna ricordarsi di chiudere il tunnel anche all'uscita dalla corrispondente sessione SSH.
ja_jp: VNC セッションを閉じたら、対応する SSH セッションを終了してトンネルを閉じることも忘れないで下さい。

source: <command>gdm</command>, <command>kdm</command> and <command>xdm</command> are Display Managers. They take control of the graphical interface shortly after boot in order to provide the user a login screen. Once the user has logged in, they execute the programs needed to start a graphical work session.
it_it: <command>gdm</command> , <command>kdm</command> e <command>xdm</command> sono display manager. Assumono il controllo dell'interfaccia grafica poco dopo l'avvio in modo da fornire all'utente una schermata di accesso. Una volta che l'utente si è connesso, vengono eseguiti i programmi necessari per avviare una sessione grafica di lavoro.

source: VNC also works for mobile users, or company executives, who occasionally need to login from their home to access a remote desktop similar to the one they use at work. The configuration of such a service is more complicated: you first install the <emphasis role="pkg">vnc4server</emphasis> package, change the configuration of the display manager to accept <literal>XDMCP Query</literal> requests (for <command>gdm</command>, this can be done graphically via the <menuchoice><guimenu>System</guimenu> <guisubmenu>Administration</guisubmenu> <guimenuitem>Login Screen</guimenuitem></menuchoice> menu and then the “Remote” tab; note that this applies only to <command>gdm</command> and not <command>gdm3</command>, which is the version installed by default in <emphasis role="distribution">Squeeze</emphasis>), and finally, start the VNC server with <command>inetd</command> so that a session is automatically started when a user tries to login. For example, you may add this line to <filename>/etc/inetd.conf</filename>:
it_it: VNC funziona anche per utenti mobili, o dirigenti di società, che a volte hanno bisogno di effettuare il login da casa per accedere a un desktop remoto simile a quello che utilizzano sul posto di lavoro. La configurazione di tale servizio è più complicata: alla prima installazione del pacchetto <emphasis role="pkg">vnc4server</emphasis>, modificare la configurazione del display manager in modo da accettare richieste <literal>XDMCP query</literal> (per <command>gdm</command>, questa operazione può essere fatta graficamente attraverso il menu <menuchoice><guimenu>System</guimenu> <guisubmenu>Administration</guisubmenu> <guimenuitem>Login Screen</guimenuitem></menuchoice> e quindi il tab “Remote”; si noti che questo vale solo per <command>gdm</command> e non per <command>gdm3</command>, che è la versione installata in <emphasis role="distribution">Squeeze</emphasis>), e infine avviare il server VNC con <command>inetd</command> in modo che una sessione venga avviata automaticamente quando un utente tenta di effettuare il login. Ad esempio, si può aggiungere questa riga a <filename>/etc/inetd.conf</filename>:

source: Redirecting incoming connections to the display manager solves the problem of authentication, because only users with local accounts will pass the <command>gdm</command> login screen (or equivalent <command>kdm</command>, <command>xdm</command>, etc.). As this operation allows multiple simultaneous logins without any problem (provided the server is powerful enough), it can even be used to provide complete desktops for mobile users (or for less powerful desktop systems, configured as thin clients). Users simply login to the server's screen with <command>vncviewer <replaceable>server</replaceable>:50</command>, because the port used is 5950.
it_it: Deviare le connessioni in entrata al display manager risolve il problema dell'autenticazione, in quanto solo gli utenti con account locali supereranno la schermata di accesso <command>gdm</command> (o equivalente <command>kdm</command> , <command>xdm</command> , ecc). Poiché questa operazione consente più connessioni simultanee senza alcun problema (se il server è abbastanza potente), può anche essere utilizzato per fornire desktop completi per gli utenti mobili (o per sistemi desktop meno potenti, configurati come thin client). Gli utenti devono semplicemente accedere alla schermata del server con <command>vncviewer <replaceable>server</replaceable> : 50</command> , perché la porta utilizzata è 5950.
ja_jp: 入ってくる接続をディスプレイマネージャに転送することにより、認証の問題が解決されます。なぜなら、ローカルアカウントを持つユーザだけが <command>gdm</command> (または同等の <command>kdm</command>、<command>xdm</command> など) のログイン画面を突破できるからです。このやり方は (サーバの性能が十分高いなら) なんの問題も無く複数の同時ログインを許すため、完全なデスクトップをモバイルユーザに対して (またはシンクライアントとして設定された非力なデスクトップシステムに対して) 提供するという用途にも応用できます。ユーザは単純に <command>vncviewer <replaceable>server</replaceable>:50</command> でサーバの画面にログインするだけです。なぜなら、使われているポートは 5950 番だからです。

source: Managing Rights
it_it: Gestione dei diritti
ja_jp: 権限の管理

source: Linux is definitely a multi-user system, so it is necessary to provide a permission system to control the set of authorized operations on files and directories, which includes all the system resources and devices (on a Unix system, any device is represented by a file or directory). This principle is common to all Unix systems, but a reminder is always useful, especially as there are some interesting and relatively unknown advanced uses.
it_it: Linux è decisamente un sistema multi-utente, per cui è necessario prevedere un sistema di autorizzazione per il controllo delle operazioni autorizzate su file e directory, che comprende tutte le risorse di sistema e dispositivi in un sistema Unix, qualsiasi dispositivo è rappresentato da un file o directory). Questo principio è comune a tutti i sistemi Unix, ma un promemoria è sempre utile, soprattutto perché ci sono alcuni utilizzi avanzate interessanti e relativamente sconosciuto.
ja_jp: Linux は完全なマルチユーザシステムです。このため、ユーザの権限に基いてファイルやディレクトリに対する操作を制御するために、パーミッションシステムを提供する事が必要です。このパーミッションシステムは、全てのシステムリソースとデバイス (Unix システムでは全てのデバイスはファイルまたはディレクトリとして表現されます) を対象とします。この原理は全ての Unix システムで共通ですが、特に興味深く比較的知られていない上級の使い方があるので、注意は常に必要です。
