Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: System boot
it_it: Avvio del sistema
ja_jp: システム起動

source: Rights
it_it: Diritti
ja_jp: 権限

source: Permissions
it_it: Permessi
ja_jp: パーミッション

source: Supervision
it_it: Supervisione
ja_jp: 管理

source: Backup
it_it: Copia di sicurezza
ja_jp: バックアップ

source: Unix Services
it_it: Servizi Unix
ja_jp: Unix サービス

source: This chapter covers a number of basic services that are common to many Unix systems. All administrators should be familiar with them.
it_it: Questo capitolo comprende una serie di servizi di base che sono comuni a molti sistemi Unix. Tutti gli amministratori dovrebbero esserne a conoscenza.
ja_jp: この章では、多くの Unix システムに共通する数多くの基本的なサービスをカバーします。全ての管理者はこれらに精通しているべきです。

source: System Boot
it_it: Avvio del sistema
ja_jp: システム起動

source: <primary>booting</primary><secondary>the system</secondary>
it_it: <primary>l'avvio</primary><secondary>del sistema</secondary>
ja_jp: <primary>起動</primary><secondary>システムの</secondary>

source: When you boot the computer, the many messages scrolling by on the console display many automatic initializations and configurations that are being executed. Sometimes you may wish to slightly alter how this stage works, which means that you need to understand it well. That is the purpose of this section.
it_it: Quando si avvia il computer, lo scorrimento di molti messaggi sulla console visualizzano molte inizializzazioni e configurazioni automatiche che vengono eseguite. A volte si potrebbe desiderare di modificare un pò come funziona questa fase, il che significa che è necessario conoscerla bene. Questo è lo scopo di questa sezione.
ja_jp: コンピュータを起動する際、コンソール画面にスクロールされる多くのメッセージには、実行されている多くの自動初期化と自動設定に関する情報が表示されます。この段階の挙動を少し変えたいと思うことがあるかもしれません。これは起動処理をよく理解する必要があることを意味しています。これがこの節の目的です。

source: First, the BIOS takes control of the computer, detects the disks, loads the <emphasis>Master Boot Record</emphasis>, and executes the bootloader. The bootloader takes over, finds the kernel on the disk, loads and executes it. The kernel is then initialized, and starts to search for and mount the partition containing the root filesystem, and finally executes the first program — <command>init</command>. Frequently, this “root partition” and this <command>init</command> are, in fact, located in a virtual filesystem that only exists in RAM (hence its name, “initramfs”, formerly called “initrd” for “initialization RAM disk”). This filesystem is loaded in memory by the bootloader, often from a file on a hard drive or from the network. It contains the bare minimum required by the kernel to load the “true” root filesystem: this may be driver modules for the hard drive, or other devices without which the system can not boot, or, more frequently, initialization scripts and modules for assembling RAID arrays, opening encrypted partitions, activating LVM volumes, etc. Once the root partition is mounted, the initramfs hands over control to the real init, and the machine goes back to the standard boot process.
it_it: In primo luogo, il BIOS prende il controllo del computer, rileva i dischi, carica il <emphasis>Master Boot Record</emphasis>, ed esegue il bootloader. Il bootloader subentra, trova il kernel sul disco, lo carica e lo esegue. Il kernel è quindi inizializzato, e comincia a cercare e montare la partizione contenente il filesystem root, infine esegue il primo programma — <command>init</command>. Spesso, questa "partizione root" e questo <command>init</command> sono, infatti, presenti in un filesystem virtuale che esiste solo nella RAM (da qui il suo nome, "initramfs", precedentemente chiamato "initrd" che sta per "inizializzazione RAM disco "). Questo file system è caricato in memoria dal bootloader, spesso da un file su disco rigido o dalla rete. Contiene il minimo indispensabile richiesto dal kernel per caricare il "vero" filesystem root: e possono essere moduli driver per l'hard disk, o altri dispositivi senza i quali il sistema non si avvia, o, più frequentemente, gli script di inizializzazione ed i moduli per il montaggio dell'array RAID, l'apertura di partizioni cifrate, l'attivazione di volumi LVM, ecc. ecc. Una volta che la partizione di root è montata, initramfs passa il controllo all'init reale, e la macchina torna al processo di avvio standard.
ja_jp: 最初に BIOS がコンピュータを制御し、ディスクを検出し、<emphasis>Master Boot Record</emphasis> を読み込み、ブートローダを実行します。以降、ブートローダが引き継ぎ、ディスクからカーネルを見つけ、カーネルを読み込んで実行します。そして、カーネルが初期化され、root ファイルシステムを含むパーティションの検索とマウントを開始し、最後に最初のプログラム - <command>init</command> - を実行します。実際には、「root パーティション」と <command>init</command> は RAM の中にだけ存在する仮想ファイルシステム (そのためこの名前は「initramfs」、以前は「初期化 RAM ディスク」という意味で「initrd」と呼ばれていました) 上に置かれていることが多いです。このファイルシステムは、多くの場合ハードドライブのファイルかネットワークから、ブートローダによってメモリに読み込まれます。このファイルシステムには、カーネルが「真の」root ファイルシステムを読み込むために必要な最低限の要素が含まれています: ハードドライブやそれなしではシステムが起動できないその他のデバイスのドライバモジュール、より頻繁にあるのが、RAID アレイを組み立て、暗号化パーティションを開き、LVM ボリュームを有効化するなどの初期化スクリプトとモジュールです。一度 root パーティションがマウントされたら、initramfs は制御を真の init に渡し、マシンは標準的な起動プロセスに戻ります。

source: <emphasis>SPECIFIC CASE</emphasis> Booting from the network
it_it: <emphasis>CASO PARTICOLARE</emphasis> Avvio da rete
ja_jp: <emphasis>SPECIFIC CASE</emphasis> ネットワークからの起動

source: In some configurations, the BIOS may be configured not to execute the MBR, but to seek its equivalent on the network, making it possible to build computers without a hard drive, or which are completely reinstalled on each boot. This option is not available on all hardware and it generally requires an appropriate combination of BIOS and network card.
it_it: In alcune configurazioni, il BIOS può essere configurato per non eseguire l'MBR, ma per cercare il suo equivalente in rete, rendendo possibile la costruzione di computer senza un disco rigido, o che sono completamente reinstallati ad ogni avvio. Questa opzione non è disponibile su tutto l'hardware e richiede in genere una combinazione appropriata di BIOS e scheda di rete.
ja_jp: 一部の設定では、BIOS が MBR を実行しないように設定され、その代わり同じものをネットワークから探すように設定されているかもしれません。こうすることで、ハードドライブ無しでコンピュータを組み立てたり、起動時に毎回完全に再インストールすることが可能になります。このオプションは、全てのハードウェアで利用可能というわけではありませんし、通常 BIOS とネットワークカードの適切な組み合わせが必要です。

source: Booting from the network can be used to launch the <command>debian-installer</command> or FAI (see <xref linkend="sect.installation-methods" />).
it_it: L'avvio da rete può essere utilizzato per lanciare il <command>debian-installer</command> o FAI (vedi <xref linkend="sect.installation-methods" /> ).
ja_jp: ネットワークからの起動は <command>debian-installer</command> や FAI (<xref linkend="sect.installation-methods" />参照) を起動するために使われます。

source: <emphasis>BACK TO BASICS</emphasis> The process, a program instance
it_it: <emphasis>Concetti di base</emphasis> Il processo, un'istanza di programma
ja_jp: <emphasis>BACK TO BASICS</emphasis> プロセス、プログラムインスタンス

source: <primary>process</primary>
it_it: <primary>processo</primary>
ja_jp: <primary>プロセス</primary>

source: A process is the representation in memory of a running program. It includes all of the information necessary for the proper execution of the software (the code itself, but also the data that it has in memory, the list of files that it has opened, the network connections it has established, etc.). A single program may be instantiated into several processes, not necessarily running under different user IDs.
it_it: Un processo è la rappresentazione in memoria di un programma in esecuzione. Esso comprende tutte le informazioni necessarie per la corretta esecuzione del software (il codice stesso, ma anche i dati che ha in memoria, l'elenco di file che è aperto, le connessioni di rete che ha stabilito, ecc.) Un programma unico può essere istanziato in vari processi diversi, non necessariamente in esecuzione con diversi ID utente.
ja_jp: プロセスとは、実行中のプログラムのメモリ内表現です。プロセスには、ソフトウェアを適切に実行するために必要な全ての情報が含まれます (ソフトウェアのコードだけでなく、ソフトウェアが所有するメモリ内のデータ、ソフトウェアが開いたファイルのリスト、ソフトウェアが確立したネットワーク接続など)。単独のプログラムは複数のプロセスにインスタンス化されるかもしれませんし、異なるユーザ ID の下で実行される必要はありません。

source: Init executes several processes, following instructions from the <filename>/etc/inittab</filename> file. The first program that is executed (which corresponds to the <emphasis>sysinit</emphasis> step) is <command>/etc/init.d/rcS</command>, a script that executes all of the programs in the <filename>/etc/rcS.d/</filename> directory. <indexterm><primary><filename>/etc/init.d/rcS</filename></primary></indexterm> <indexterm><primary><filename>rcS</filename></primary></indexterm> <indexterm><primary><filename>/etc/init.d/rcS.d/</filename></primary></indexterm> <indexterm><primary><filename>rcS.d</filename></primary></indexterm>
it_it: Init esegue più processi, seguendo le istruzioni dal file <filename>/etc/inittab</filename>. Il primo programma che viene eseguito (che corrisponde al passaggio <emphasis>sysinit</emphasis>) è <command>/etc/init.d/rcS</command>, uno script che esegue tutti i programmi nella directory <filename>/etc/rcS.d/</filename>. <indexterm><primary><filename>/etc/init.d/rcS</filename></primary></indexterm><indexterm><primary><filename>rcS</filename></primary></indexterm><indexterm><primary><filename>/etc/init.d/rcS.d/</filename></primary></indexterm><indexterm><primary><filename>rcS.d</filename></primary></indexterm>
ja_jp: init は、<filename>/etc/inittab</filename> ファイルの指示に従って、複数のプロセスを起動します。実行される最初のプログラム (<emphasis>sysinit</emphasis> 段階に相当します) は <command>/etc/init.d/rcS</command> で、これは <filename>/etc/rcS.d/</filename> ディレクトリに含まれるすべてのプログラムを起動するスクリプトです。<indexterm><primary><filename>/etc/init.d/rcS</filename></primary></indexterm> <indexterm><primary><filename>rcS</filename></primary></indexterm> <indexterm><primary><filename>/etc/init.d/rcS.d/</filename></primary></indexterm> <indexterm><primary><filename>rcS.d</filename></primary></indexterm>

source: Among these, you will find successively programs in charge of:
it_it: Tra questi, si trovano successivamente i programmi incaricati di:
ja_jp: これらのスクリプトは特に以下の点を担当します:

source: configuring the console's keyboard;
it_it: configurare la tastiera della console;
ja_jp: コンソールキーボードの設定;

source: loading drivers: most of the kernel modules are loaded by the kernel itself as the hardware is detected; extra drivers are then loaded automatically when the corresponding modules are listed in <filename>/etc/modules</filename>;
it_it: caricamento di driver: la maggior parte dei moduli del kernel vengono caricati dal kernel stesso, al rilevamento dell'hardware, altri driver aggiuntivi vengono caricati in seguito in base ai moduli corrispondenti elencati nel file <filename>/etc/modules</filename> ;
ja_jp: ドライバの読み込み: カーネルはほとんどのカーネルモジュールを読み込み、ハードウェアを検出します; 追加のドライバは、それに対応するモジュールが <filename>/etc/modules</filename> にリストされている場合に、読み込まれます。

source: checking the integrity of filesystems;
it_it: verificare l'integrità del file system;
ja_jp: ファイルシステムの整合性確認;

source: mounting local partitions;
it_it: montare partizioni locali;
ja_jp: ローカルパーティションのマウント;

source: configuring the network;
it_it: configurare la rete;
ja_jp: ネットワークの設定;

source: mounting network filesystems (NFS).
it_it: montaggio filesystem di rete (NFS).
ja_jp: ネットワークファイルシステム (NFS) のマウント。

source: <emphasis>SECURITY</emphasis> Using a shell as <command>init</command> to gain root rights
it_it: <emphasis>SICUREZZA</emphasis> Usare una shell come <command>init</command> per ottenere i privilegi di root
ja_jp: <emphasis>SECURITY</emphasis> root 権を獲得するために <command>init</command> としてシェルを使う

source: By convention, the first process that is booted is the <command>init</command> program. However, it is possible to pass an <literal>init</literal> option to the kernel indicating a different program.
it_it: Per convenzione, il primo processo che viene avviato è il programma <command>init</command>. Tuttavia, è possibile passare un'opzione a <literal>init</literal> per il kernel che indica un programma diverso.
ja_jp: 慣例により、起動される最初のプロセスは <command>init</command> プログラムです。しかしながら、カーネルに異なるプログラムを示す <literal>init</literal> オプションを渡すことが可能です。

source: Any person who is able to access the computer can press the <keycap>Reset</keycap> button, and thus reboot it. Then, at the bootloader's prompt, it is possible to pass the <literal>init=/bin/sh</literal> option to the kernel to gain root access without knowing the administrator's password.
it_it: Chiunque è in grado di accedere al computer può premere il pulsante <keycap>Reset</keycap> e quindi riavviare. Poi, a richiesta del bootloader, è possibile far passare l'opzione <literal>init=/bin/sh</literal> per il kernel per ottenere l'accesso root senza conoscere la password dell'amministratore.
ja_jp: コンピュータに触ることができる人は誰でも、<keycap>Reset</keycap> ボタンを押して、コンピュータを再起動することが可能です。そして、ブートローダプロンプトでカーネルに <literal>init=/bin/sh</literal> オプションを渡せば、管理者パスワードを知らなくても root 権を取得できます。

source: To prevent this, you can protect the bootloader itself with a password. You might also think about protecting access to the BIOS (a password protection mechanism is almost always available), without which a malicious intruder could still boot the machine on a removable media containing its own Linux system, which they could then use to access data on the computer's hard drives.
it_it: Per evitare ciò, è possibile proteggere lo stesso bootloader con una password. Si potrebbe anche pensare di proteggere l'accesso al BIOS (un meccanismo di protezione con password è quasi sempre disponibile), senza la quale un intruso malintenzionato potrebbe ancora avviare la macchina su un supporto rimovibile contenente il proprio sistema Linux, che avrebbero potuto utilizzare per accedere ai dati sull'hard disk del computer.
ja_jp: これを避けるため、パスワードでブートローダを保護することが可能です。さらに BIOS へのアクセスも保護したいと考えるかもしれません (パスワード保護機能はほぼ必ず付いています)。パスワードが無ければ、悪意ある侵入者が、自分の Linux システムを含むリムーバブルメディアからマシンを起動して、コンピュータのハードドライブのデータにアクセスするかもしれません。

source: Finally, be aware that most BIOS have a generic password available. Initially intended for troubleshooting for those who have forgotten their password, these passwords are now public and available on the Internet (see for yourself by searching for “generic BIOS passwords” in a search engine). All of these protections will thus impede unauthorized access to the machine without being able to completely prevent it. There's no reliable way to protect a computer if the attacker can physically access it; they could dismount the hard drives to connect them to a computer under their own control anyway, or even steal the entire machine, or erase the BIOS memory to reset the password…
it_it: Infine, siate consapevoli del fatto che la maggior parte dei BIOS dispone di una password generica. Inizialmente destinata alla risoluzione di problemi per coloro che hanno dimenticato la password, queste password sono ora pubbliche e disponibili su Internet (provate a cercare "password generica per BIOS" in un motore di ricerca). Tutte queste protezioni impediranno quindi l'accesso non autorizzato alla macchina senza essere in grado di evitarne completamente l'accesso. Non c'è modo affidabile per proteggere un computer se l'utente malintenzionato può accedervi fisicamente; in ogni caso è possibile smontare gli hard disk per connetterli a un computer sotto il loro controllo, o addirittura rubare l'intera macchina, o cancellare la memoria del BIOS per ripristinarne la password…
ja_jp: 最後に、ほとんどの BIOS では、汎用的なパスワードが使えることに注意してください。当初、汎用パスワードはパスワードを忘れた人向けのトラブルシューティングを意図していましたが、今や汎用パスワードは公開され Internet から入手できます (ご自分の手で、検索エンジンで「generic BIOS passwords」を検索してみてください)。これらの保護により、マシンへの不正アクセスを完全に防ぐことは出来ないにせよ、それを遅らせる事になるでしょう。攻撃者が物理的にコンピュータにアクセスできる場合、確実にコンピュータを保護する方法はありません; 攻撃者はハードドライブを取り外して自分の制御下にあるコンピュータに接続したり、マシン本体ごと盗んだり、パスワードをリセットするために BIOS メモリを消去することも可能です。

source: <emphasis>BACK TO BASICS</emphasis> Kernel modules and options
it_it: <emphasis>Concetti di base</emphasis> I moduli del kernel e le opzioni
ja_jp: <emphasis>BACK TO BASICS</emphasis> カーネルモジュールとオプション

source: <primary>modules</primary><secondary>kernel modules</secondary>
it_it: <primary>moduli</primary><secondary>I moduli del kernel</secondary>
ja_jp: <primary>モジュール</primary><secondary>カーネルモジュール</secondary>

source: Kernel modules also have options that can be configured by putting some files in <filename>/etc/modprobe.d/</filename>. These options are defined with directives like this: <literal>options <replaceable>module-name</replaceable> <replaceable>option-name</replaceable>=<replaceable>option-value</replaceable></literal>. Several options can be specified with a single directive if necessary.
it_it: I moduli del kernel hanno anche opzioni che possono essere configurate mettendo alcuni file in <filename>/etc/modprobe.d/</filename> . Queste opzioni sono definite con direttive come questa: <literal>options <replaceable>module-name</replaceable> <replaceable>option-name</replaceable>=<replaceable>option-value</replaceable></literal>. Diverse opzioni possono essere specificate con un'unica direttiva, se necessario.
ja_jp: カーネルモジュールにオプションを指定するには、<filename>/etc/modprobe.d/</filename> にファイルを追加してください。これらのオプションは次のような指示文を使って定義します。<literal>options <replaceable>module-name</replaceable> <replaceable>option-name</replaceable>=<replaceable>option-value</replaceable></literal>。場合によっては、幾つかのオプションは単独の指示文で指定できます。

source: These configuration files are intended for <command>modprobe</command> — the program that loads a kernel module with its dependencies (modules can indeed call other modules). This program is provided by the <emphasis role="pkg">module-init-tools</emphasis> package.
it_it: Questi file di configurazione sono destinati a <command>modprobe</command> - Il programma che carica un modulo del kernel con le sue dipendenze (i moduli possono infatti chiamare altri moduli). Questo programma è fornito dal pacchetto <emphasis role="pkg">module-init-tools</emphasis>.

source: After this stage, <command>init</command> takes over and starts the programs enabled in the default runlevel (which is usually runlevel 2). It executes <command>/etc/init.d/rc 2</command>, a script that starts all services which are listed in <filename>/etc/rc2.d/</filename> and whose name start with the “S” letter. The two-figures number that follows had historically been used to define the order in which services had to be started. In <emphasis role="distribution">Squeeze</emphasis>, the default boot system uses <command>insserv</command>, which schedules everything automatically based on the scripts' dependencies. Each boot script thus declares the conditions that must be met to start or stop the service (for example, if it must start before or after another service); <command>init</command> then launches them in the order that meets these conditions. The static numbering of scripts is therefore no longer taken into consideration (but they must always have a name beginning with “S” followed by two digits and the actual name of the script used for the dependencies). Generally, base services (such as logging with <command>rsyslog</command>, or port assignment with <command>portmap</command>) are started first, followed by standard services and the graphical interface (<command>gdm</command>).
it_it: In seguito a questa fase, subentra <command>init</command> e avvia quei programmi attivatinel runlevel di default (che di solito è runlevel 2). Viene eseguito <command>/etc/init.d/rc2</command>, uno script che lancia tutti i servizi che sono elencati in <filename>/etc/rc2.d/</filename> e il cui nome inizia con la lettera "S". Il numero a due cifre che segue era storicamente utilizzato per definire l'ordine in cui i servizi avrebbero dovuto essere avviati. In <emphasis role="distribution">Squeeze</emphasis>, il sistema di avvio di default utilizza <command>insserv</command>, pianificando tutto automaticamente in base alle dipendenze degli script. Ogni script di avvio dichiara in tal modo le condizioni che devono essere soddisfatte per avviare o arrestare il servizio (per esempio, se si deve avviare prima o dopo un altro servizio); <command>init</command> poi li esegue nell'ordine che soddisfa queste condizioni . La numerazione statica degli script quindi non è più presa in considerazione (ma devono sempre avere un nome che inizia con "S" seguita da due cifre ed il nome effettivo dello script usato per le dipendenze). In generale, i servizi di base (come la registrazione con <command>rsyslog</command>, o la porta con <command>portmap</command>) vengono avviati per primi, seguiti dai servizi standard e dall'interfaccia grafica (<command>gdm</command>).

source: This dependency-based boot system makes it possible to automate re-numbering, which could be rather tedious if it had to be done manually, and it limits the risks of human error, since scheduling is conducted according to the parameters that are indicated. Another benefit is that services can be started in parallel when they are independent from one another, which can accelerate the boot process.
it_it: Questo sistema di avvio basato su dipendenze consente di automatizzare la rinumerazione, che potrebbe risultare piuttosto noioso se dovesse essere effettuata manualmente, e limita i rischi di errore umano, poiché la programmazione viene effettuata secondo i parametri indicati. Un altro vantaggio è che i servizi possono essere eseguiti in parallelo quando sono indipendenti l'uno dall'altro, e quindi è possibile accelerare il processo di avvio.
ja_jp: この依存関係に基づく起動システムのお陰で、自動的な起動順の再定義が可能になります。これは手作業でやるにはちょっと退屈な作業で、人的ミスの危険性があります。なぜなら、起動順は宣言された依存関係に従って定義されるからです。別の利益として、他のサービスに依存しないサービスは並列して開始できるという点があります。この事により、起動プロセスを加速する事ができます。

source: <emphasis>ALTERNATIVE</emphasis> Other boot systems
it_it: <emphasis>ALTERNATIVA</emphasis> Altri sistemi di avvio
ja_jp: <emphasis>ALTERNATIVE</emphasis> 他の起動システム

source: This book describes the boot system used by default in Debian (as implemented by <emphasis role="pkg">sysvinit</emphasis> package), which is derived and inherited from <emphasis>System V</emphasis> Unix systems, but there are others.
it_it: Questo libro descrive il sistema di avvio usato di default in Debian (come attuato dal pacchetto <emphasis role="pkg">sysvinit</emphasis>), che è derivato ed ereditato dal <emphasis>System V</emphasis> dei Sistemi Unix, ma ce ne sono altri.

source: In the original <emphasis>System V</emphasis>, and in versions of Debian up to <emphasis role="distribution">Lenny</emphasis>, the execution order of initialization scripts was defined only by the names of the <filename>/etc/rc*.d/S*</filename> symbolic links (and <filename>/etc/rc*.d/K*</filename> upon shutdown). This behavior can be re-established by setting <literal>CONCURRENCY=none</literal> in the <filename>/etc/default/rcS</filename> file.
it_it: Nel <emphasis>System V</emphasis> originale, e nelle versioni di Debian fino a <emphasis role="distribution">Lenny</emphasis> , l'ordine di esecuzione degli script di inizializzazione è stato definito solo dai nomi dei link simbolici in <filename>/etc/rc*.d/S*</filename> (e <filename>/etc/rc*.d/K*</filename> alla chiusura). Questo comportamento può essere ristabilito impostando <literal>CONCURRENCY = none</literal> nel file <filename>/etc/default/rcS</filename>.

source: <emphasis role="pkg">file-rc</emphasis> is another boot system with a very simple process. It keeps the principle of runlevels, but replaces the directories and symbolic links with a configuration file, which indicates to <command>init</command> the processes that must be started and their launch order
it_it: <emphasis role="pkg">file-rc</emphasis> è un altro sistema di avvio con un procedimento molto semplice. Mantiene il principio dei runlevel, ma sostituisce le directory e link simbolici con un file di configurazione, che indica a <command>init</command> i processi che devono essere avviati e il loro ordine di lancio
