Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: There is no lack of alternatives. In addition to <emphasis role="pkg">openbsd-inetd</emphasis> and <emphasis role="pkg">netkit-inetd</emphasis> already mentioned, there are <emphasis role="pkg">inetutils-inetd</emphasis>, <emphasis role="pkg">micro-inetd</emphasis>, <emphasis role="pkg">rlinetd</emphasis> and <emphasis role="pkg">xinetd</emphasis>.
it_it: Non c'è mancanza di alternative. Oltre ai già accennati <emphasis role="pkg">openbsd-inetd</emphasis> e <emphasis role="pkg">netkit-inetd</emphasis>, ci sono <emphasis role="pkg">inetutils-inetd</emphasis> , <emphasis role="pkg">micro-inetd</emphasis> , <emphasis role="pkg">rlinetd</emphasis> e <emphasis role="pkg">xinetd</emphasis> .

source: This last incarnation of a super-server offers very interesting possibilities. Most notably, its configuration can be split into several files (stored, of course, in the <filename>/etc/xinetd.d/</filename> directory), which can make an administrator's life easier.
it_it: Questa ultima incarnazione di un super-server offre possibilità molto interessanti. In particolare, la sua configurazione può essere suddiviso in più file (memorizzati, naturalmente, nella directory <filename>/ etc / xinetd.d /</filename>), che può rendere la vita più facile ad un amministratore.
ja_jp: <emphasis role="pkg">xinetd</emphasis> は大変興味深い機能を持っています。中でも注目すべきは、<emphasis role="pkg">xinetd</emphasis> の設定を複数のファイル (これはもちろん <filename>/etc/xinetd.d/</filename> ディレクトリの中に保存されています) に分割できるという点です。このお陰で、管理がもっと楽になります。

source: Scheduling Tasks with <command>cron</command> and <command>atd</command>
it_it: Pianificare attività con <command>cron</command> e <command>atd</command>
ja_jp: <command>cron</command> と <command>atd</command> を使ったスケジューリングタスク

source: <primary>scheduled commands</primary>
it_it: <primary>comandi pianificati</primary>
ja_jp: <primary>スケジュールされたコマンド</primary>

source: <primary>command scheduling</primary>
it_it: <primary>comando di pianificazione</primary>
ja_jp: <primary>コマンドスケジューリング</primary>

source: <command>cron</command> is the daemon responsible for executing scheduled and recurring commands (every day, every week, etc.); <command>atd</command> is that which deals with commands to be executed a single time, but at a specific moment in the future.
it_it: <command>cron</command> è il demone responsabile per l'esecuzione di comandi pianificati e ricorrenti (ogni giorno, ogni settimana, ecc); <command>atd</command> è quello che riguarda i comandi da eseguire una sola volta, ma in un determinato momento nel futuro.
ja_jp: <command>cron</command> は定期的に (毎日、毎週、など) 実行するよう予定されたコマンドの実行を担当するデーモンです; <command>atd</command> は未来の特定の時間に 1 回だけ実行するよう予定されたコマンドの実行を担当するデーモンです。

source: In a Unix system, many tasks are scheduled for regular execution:
it_it: In un sistema Unix, molte attività sono previste come regolare esecuzione:
ja_jp: Unix システムでは、多くのタスクがは定期的に実行されるよう予定されています:

source: rotating the logs;
it_it: rotazione dei log;
ja_jp: ログの循環;

source: updating the database for the <command>locate</command> program;
it_it: aggiornamento del database per il programma <command>locate</command>;
ja_jp: <command>locate</command> プログラムの使うデータベースの更新;

source: back-ups;
it_it: backup;
ja_jp: バックアップ;

source: maintenance scripts (such as cleaning out temporary files).
it_it: script di manutenzione (come ad esempio la pulizia dei file temporanei).
ja_jp: メンテナンススクリプト (一時ファイルの掃除など)。

source: By default, all users can schedule the execution of tasks. Each user has thus their own <emphasis>crontab</emphasis> in which they can record scheduled commands. It can be edited by running <command>crontab -e</command> (its content is stored in the <filename>/var/spool/cron/crontabs/<replaceable>user</replaceable></filename> file).
it_it: Per impostazione predefinita, tutti gli utenti possono programmare l'esecuzione di attività. Ogni utente ha quindi il propria <emphasis>crontab</emphasis> in cui può registrare i comandi pianificati. Esso può essere modificato eseguendo <command>crontab -e</command> (il suo contenuto è memorizzato nel file <filename>/ var / spool / cron / crontab / <replaceable>utente</replaceable></filename>).
ja_jp: デフォルトで、全てのユーザはタスク実行の予定を入れることが可能です。各ユーザは自分専用の <emphasis>crontab</emphasis> を持っており、これを使ってコマンド実行の予定を登録することが可能です。<emphasis>crontab</emphasis> を編集するには <command>crontab -e</command>を実行します (<filename>/var/spool/cron/crontabs/<replaceable>user</replaceable></filename> ファイルに保存されます)。

source: <emphasis>SECURITY</emphasis> Restricting <command>cron</command> or <command>atd</command>
it_it: <emphasis>SICUREZZA</emphasis> Limitare <command>cron</command> o <command>atd</command>
ja_jp: <emphasis>SECURITY</emphasis> <command>cron</command> または <command>atd</command> の使用制限

source: You can restrict access to <command>cron</command> by creating an explicit authorization file (whitelist) in <filename>/etc/cron.allow</filename>, in which you indicate the only users authorized to schedule commands. All others will automatically be deprived of this feature. Conversely, to only block one or two troublemakers, you could write their username in the explicit prohibition file (blacklist), <filename>/etc/cron.deny</filename>. This same feature is available for <command>atd</command>, with the <filename>/etc/at.allow</filename> and <filename>/etc/at.deny</filename> files.
it_it: È possibile limitare l'accesso a <command>cron</command> creando un file con esplicita autorizzazione (whitelist) in <filename>/ etc / cron.allow</filename> , in cui si indicano i soli utenti autorizzati per pianificare i comandi. Tutti gli altri saranno automaticamente privati di questa funzione. Al contrario, per bloccare solo uno o due facinorosi, si può scrivere il corrispondente nome utente per divieto esplicito (blacklist), nel file <filename>/ etc / cron.deny</filename> . Questa stessa caratteristica è disponibile per <command>atd</command> , con i file <filename>/ etc / at.allow</filename> e <filename>/ etc / at.deny</filename>.
ja_jp: 実行を許可するユーザを明示するファイル (ホワイトリスト) <filename>/etc/cron.allow</filename> の中にコマンドの予定を入れることを許可するユーザを書けば、<command>cron</command> へのアクセスを制限することが可能です。その他のユーザは自動的にこの機能を使えなくなります。反対に、実行を禁止するユーザを明示するファイル (ブラックリスト) <filename>/etc/cron.deny</filename> の中にユーザ名を書けば、1 人か 2 人の問題児だけをブロックすることが可能です。<command>atd</command> に対しても <filename>/etc/at.allow</filename> と <filename>/etc/at.deny</filename> ファイルを使って同等の機能が利用可能です。

source: The root user has their own <emphasis>crontab</emphasis>, but can also use the <filename>/etc/crontab</filename> file, or write additional <emphasis>crontab</emphasis> files in the <filename>/etc/cron.d</filename> directory. These last two solutions have the advantage of being able to specify the user identity to use when executing the command.
it_it: L'utente root ha una propria <emphasis>crontab</emphasis> , ma può anche utilizzare il file <filename>/ etc / crontab</filename>, o scrivere <emphasis>crontab</emphasis> supplementari nella directory <filename>/ etc / cron.d</filename>. Queste ultime due soluzioni presentano il vantaggio di essere in grado di specificare l'identità dell'utente da usare quando si esegue il comando.
ja_jp: root ユーザは自分専用の <emphasis>crontab</emphasis> を持っていますが、<filename>/etc/crontab</filename> ファイルを使ったり、追加的な <emphasis>crontab</emphasis> ファイルを <filename>/etc/cron.d</filename> ディレクトリに置くことが可能です。最後の 2 つの解決策には、コマンドを実行する際に実行するユーザを明示できるという利点があります。

source: The <emphasis>cron</emphasis> package includes by default some scheduled commands that execute:
it_it: Il pacchetto <emphasis>cron</emphasis> include di default alcuni comandi pianificati che eseguono:
ja_jp: デフォルトで <emphasis>cron</emphasis> パッケージには、幾つかのスケジュールされたコマンドが含まれています:

source: programs in the <filename>/etc/cron.hourly/</filename> directory once per hour;
it_it: programmi nella directory <filename>/ etc / cron.hourly /</filename> una volta ogni ora;
ja_jp: <filename>/etc/cron.hourly/</filename> ディレクトリ内のプログラムは 1 時間に 1 回実行されます;

source: programs in <filename>/etc/cron.daily/</filename> once per day;
it_it: programmi in <filename>/ etc / cron.daily /</filename> una volta al giorno;
ja_jp: <filename>/etc/cron.daily/</filename> ディレクトリ内のプログラムは 1 日に 1 回実行されます;

source: programs in <filename>/etc/cron.weekly/</filename> once per week;
it_it: programmi in <filename>/ etc / cron.weekly /</filename> una volta a settimana;
ja_jp: <filename>/etc/cron.weekly/</filename> ディレクトリ内のプログラムは 1 週間に 1 回実行されます;

source: programs in <filename>/etc/cron.monthly/</filename> once per month.
it_it: programmi in <filename>/ etc / cron.monthly /</filename> una volta al mese.
ja_jp: <filename>/etc/cron.monthly/</filename> ディレクトリ内のプログラムは 1 ヶ月に 1 回実行されます。

source: Many Debian packages rely on this service, they put maintenance scripts in these directories, which ensure optimal operation of their services.
it_it: Molti pacchetti Debian contano su questo servizio, hanno messo gli script di manutenzione in queste directory, per garantire un funzionamento ottimale dei loro servizi.

source: Format of a <filename>crontab</filename> File
it_it: Formato del file <filename>crontab</filename>
ja_jp: <filename>crontab</filename> ファイルの書式

source: <emphasis>TIP</emphasis> Text shortcuts for <command>cron</command>
it_it: <emphasis>TIP</emphasis> Collegamenti di testo per <command>cron</command>
ja_jp: <emphasis>TIP</emphasis> <command>cron</command> のテキストショートカット

source: <command>cron</command> recognizes some abbreviations which replace the first five fields in a <filename>crontab</filename> entry. They correspond to the most classic scheduling options:
it_it: <command>cron</command> riconosce alcune abbreviazioni che sostituiscono i primi cinque campi in una voce <filename>crontab</filename>. Essi corrispondono alle opzioni di pianificazione più classiche:
ja_jp: <command>cron</command> は幾つかの略語を認識します。略語は <filename>crontab</filename> エントリの最初の 5 つのフィールドを置き換えます。略語は最も古典的なスケジュール化オプションに対応します:

source: <literal>@yearly</literal>: once per year (January 1, at 00:00);
it_it: <literal>@yearly</literal> : Una volta all'anno (1 ° gennaio alle 00:00);
ja_jp: <literal>@yearly</literal>: 1 年に 1 回 (1 月 1 日の 00:00);

source: <literal>@monthly</literal>: once per month (the 1st of the month, at 00:00);
it_it: <literal>@monthly</literal> : Una volta al mese (il 1 ° del mese, alle 00:00);
ja_jp: <literal>@monthly</literal>: 1 ヶ月に 1 回 (毎月 1 日の 00:00);

source: <literal>@weekly</literal>: once per week (Sunday at 00:00);
it_it: <literal>@weekly</literal> : Una volta a settimana (Domenica alle 00:00);
ja_jp: <literal>@weekly</literal>: 1 週間に 1 回 (日曜日の 00:00);

source: <literal>@daily</literal>: once per day (at 00:00);
it_it: <literal>@daily</literal> : Una volta al giorno (alle 00:00);
ja_jp: <literal>@daily</literal>: 1 日 1 回 (00:00);

source: <literal>@hourly</literal>: once per hour (at the beginning of each hour).
it_it: <literal>@hourly</literal> : Una volta all'ora (all'inizio di ogni ora).
ja_jp: <literal>@hourly</literal>: 1 時間に 1 回 (毎時 0 分)。

source: <emphasis>SPECIAL CASE</emphasis> <command>cron</command> and daylight savings time.
it_it: <emphasis>CASO PARTICOLARE</emphasis><command>cron</command> e l'ora legale.
ja_jp: <emphasis>SPECIAL CASE</emphasis> <command>cron</command> と夏時間。

source: In Debian, <command>cron</command> takes the time change (for Daylight Savings Time, or in fact for any significant change in the local time) into account as best as it can. Thus, the commands that should have been executed during an hour that never existed (for example, tasks scheduled at 2:30 am during the Spring time change in France, since at 2:00 am the clock jumps directly to 3:00 am) are executed shortly after the time change (thus around 3:00 am DST). On the other hand, in autumn, when commands would be executed several times (2:30 am DST, then an hour later at 2:30 am standard time, since at 3:00 am DST the clock turns back to 2:00 am) are only executed once.
it_it: In Debian, <command>cron</command> calcola il cambiamento di orario (per l'ora legale, o di fatto per qualsiasi cambiamento significativo nel tempo locale) in considerazione come meglio può. In questo modo, i comandi che avrebbero dovuto essere eseguiti nel corso di un ora che non è mai esistita (per esempio, le operazioni pianificate alle 2:30 durante il cambio di primavera in Francia, dato che alle 2:00 l'orologio salta direttamente alle 3:00 AM) vengono eseguiti subito dopo il cambio di orario (e quindi intorno alle 3:00 ora legale). D'altra parte, in autunno, quando i comandi dovrebbe essere eseguito più volte (2:30 DST, poi un'ora dopo, alle 2:30 del mattino, ora standard, in quanto alle 3:00 AM ora legale l'orologio torna alle 2:00 am ) vengono eseguite solo una volta.
ja_jp: Debian では、<command>cron</command> は可能な限り正確に時刻変化 (夏時間、もっと言えば、ローカル時間の大幅な変更) に追従します。このため、決して存在しない 1 時間内に実行されるべきコマンド (例えば、フランスで春に午前 2:30 に予定されているタスクです。夏時間に切り替わると標準時の午前 2:00 は夏時間の午後 3:00 になります) は時刻が変わった後すぐに実行されます (つまり夏時間で午前 3:00 頃)。一方で、秋に複数回実行されると思われるコマンド (夏時間の午前 2:30 とその 1 時間後の標準時の午前 2:30。標準時に戻ると夏時間の午前 3:00 は標準時の午前 2:00 になります) は 1 回だけ実行されます。

source: Be careful, however, if the order in which the different scheduled tasks and the delay between their respective executions matters, you should check the compatibility of these constraints with <command>cron</command>'s behavior; if necessary, you can prepare a special schedule for the two problematic nights per year.
it_it: Attenzione, tuttavia, se l'ordine in cui i diversi compiti previsti e il ritardo tra le rispettive esecuzioni, si dovesse verificare la compatibilità di questi vincoli con il comportamento di <command>cron</command>, se necessario, si può preparare un programma speciale per quelle due notti problematiche all'anno.
ja_jp: しかしながら気を付けてください、別にスケジュールされたタスクとの順番とそれぞれの実行間の遅延が重要な問題の場合、それらの制約の互換性と <command>cron</command> の挙動を照合するべきです。必要ならは、1 年に 2 回の問題の夜用に特別なスケジュールを用意することも可能です。

source: Each significant line of a <emphasis>crontab</emphasis> describes a scheduled command with the six (or seven) following fields:
it_it: Ogni riga significativa di <emphasis>crontab</emphasis> descrive un comando programmato con i sei (o sette) seguenti campi:
ja_jp: <emphasis>crontab</emphasis> の有効な各行は以下の 6 つ (または 7 つ) のフィールドを含むスケジュールされたコマンド表します:

source: the value for the minute (number from 0 to 59);
it_it: il valore per il minuto (numero da 0 a 59);
ja_jp: 分 (0 から 59 までの数字)

source: the value for the hour (from 0 to 23);
it_it: il valore per l'ora (da 0 a 23);
ja_jp: 時間 (0 から 23 までの数字);

source: the value for the day of the month (from 1 to 31);
it_it: il valore per il giorno del mese (da 1 a 31);
ja_jp: 月の日付 (1 から 31 までの数字);

source: the value for the month (from 1 to 12);
it_it: il valore per il mese (da 1 a 12);
ja_jp: 月 (1 から 12 までの数字);

source: the value for the day of the week (from 0 to 7, 1 corresponding to Monday, Sunday being represented by both 0 and 7; it is also possible to use the first three letters of the name of the day of the week in English, such as <literal>Sun</literal>, <literal>Mon</literal>, etc.);
it_it: il valore per il giorno della settimana (da 0 a 7, 1 corrispondente a Lunedi, Domenica essendo rappresentata sia da 0 che da 7, è anche possibile utilizzare le prime tre lettere del nome del giorno della settimana in inglese, come <literal>Sun</literal> , <literal>Mon</literal> , ecc);
ja_jp: 曜日 (0 から 7 までの数字、月曜日は 1、日曜日は 0 と 7 の両方; 英語で書いた曜日の最初の 3 文字 <literal>Sun</literal>、<literal>Mon</literal> などを使うことも可能です);

source: the user name under whose identity the command must be executed (in the <filename>/etc/crontab</filename> file and in the fragments located in <filename>/etc/cron.d/</filename>, but not in the users' own crontab files);
it_it: il nome utente a cui fa riferimento identità e con cui il comando deve essere eseguito (nel file <filename>/ etc / crontab</filename> e nei frammenti situati in <filename>/ etc / cron.d /</filename> , ma non nei file crontab degli utenti);
ja_jp: コマンドを実行するユーザ名 (<filename>/etc/crontab</filename> ファイルと <filename>/etc/cron.d/</filename> にある分割されたファイルでは必要。各ユーザ専用のファイルでは不要);

source: the command to execute (when the conditions defined by the first five columns are met).
it_it: il comando da eseguire (quando le condizioni definite dalle prime cinque colonne sono soddisfatte).
ja_jp: 実行するコマンド (最初の 5 つのフィールドで定義された条件が満足されたら実行します)。

source: All these details are documented in the <citerefentry><refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man page.
it_it: Tutti questi dettagli sono documentati nella man page <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
ja_jp: 全ての詳細は <citerefentry><refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man ページに書かれています。

source: Each value can be expressed in the form of a list of possible values (separated by commas). The syntax <literal>a-b</literal> describes the interval of all the values between <literal>a</literal> and <literal>b</literal>. The syntax <literal>a-b/c</literal> describes the interval with an increment of <literal>c</literal> (example: <literal>0-10/2</literal> means <literal>0,2,4,6,8,10</literal>). An asterisk <literal>*</literal> is a wildcard, representing all possible values.
it_it: Ogni valore può essere espresso nella forma di un elenco di possibili valori (separati da virgole). La sintassi <literal>ab</literal> descrive l'intervallo di tutti i valori tra <literal>a</literal> e <literal>b</literal> . La sintassi <literal>a-b/c</literal> descrive l'intervallo con un incremento <literal>c</literal> (Esempio: <literal>0-10/2</literal> significa <literal>0,2,4,6,8,10</literal> ). Un asterisco <literal>*</literal> è un carattere jolly che rappresenta tutti i possibili valori.
ja_jp: 各値は設定可能な値の (コンマ区切り) リストの形で表現することが可能です。<literal>a-b</literal> 構文は <literal>a</literal> と <literal>b</literal> の間にある全ての値を表現します。<literal>a-b/c</literal> 構文は <literal>a</literal> から <literal>c</literal> づつ増加させて <literal>b</literal> までの全ての値を表現します (例: <literal>0-10/2</literal> は <literal>0,2,4,6,8,10</literal> を意味します)。アスタリスク <literal>*</literal> はワイルドカードで、とり得るすべての値を意味します。

source: Sample <filename>crontab</filename> file
it_it: Esempio di file <filename>crontab</filename>
ja_jp: 単純な <filename>crontab</filename> ファイル

source: <emphasis>TIP</emphasis> Executing a command on boot
it_it: <emphasis>TIP</emphasis> Esecuzione di un comando al boot
ja_jp: <emphasis>TIP</emphasis> 起動時のコマンド実行

source: To execute a command a single time, just after booting the computer, you can use the <literal>@reboot</literal> macro (a simple restart of <command>cron</command> does not trigger a command scheduled with <literal>@reboot</literal>). This macro replaces the first five fields of an entry in the <emphasis>crontab</emphasis>.
it_it: Per eseguire un comando una sola volta, subito dopo l'avvio del computer, è possibile utilizzare la macro <literal>@ Reboot</literal> (un semplice riavvio di <command>cron</command> non innesca un comando pianificato con <literal>@ Reboot</literal> ). Questa macro sostituisce i primi cinque campi di una voce <emphasis>crontab</emphasis> .
ja_jp: コンピュータを起動した後に、毎回コマンドを実行するためには、<literal>@reboot</literal> マクロを使ってください (<command>cron</command> を単純に再起動しただけでは <literal>@reboot</literal> でスケジュールされたコマンドは実行されません)。このマクロを使うには <emphasis>crontab</emphasis> 内の最初の 5 つのフィールドを置換してください。

source: Using the <command>at</command> Command
it_it: Utilizzo del comando <command>at</command>
ja_jp: <command>at</command> コマンドの利用

source: The <command>at</command> executes a command at a specified moment in the future. It takes the desired time and date as command-line parameters, and the command to be executed in its standard input. The command will be executed as if it had been entered in the current shell. <command>at</command> even takes care to retain the current environment, in order to reproduce the same conditions when it executes the command. The time is indicated by following the usual conventions: <literal>16:12</literal> or <literal>4:12pm</literal> represents 4:12 pm. The date can be specified in several European and Western formats, including <literal>DD.MM.YY</literal> (<literal>27.07.12</literal> thus representing 27 July 2012), <literal>YYYY-MM-DD</literal> (this same date being expressed as <literal>2012-07-27</literal>), <literal>MM/DD/[CC]YY</literal> (ie., <literal>12/25/12</literal> or <literal>12/25/2012</literal> will be December 25, 2012), or simple <literal>MMDD[CC]YY</literal> (so that <literal>122512</literal> or <literal>12252012</literal> will, likewise, represent December 25, 2012). Without it, the command will be executed as soon as the clock reaches the time indicated (the same day, or tomorrow if that time has already passed on the same day). You can also simply write “today” or “tomorrow”, which is self-explanatory.
it_it: Il comando <command>at</command> esegue uno specifico comando nel futuro. Basta specificare come parametri della riga di comando la data e l'ora desiderata, e il comando da eseguire come suo input. Il comando verrà eseguito come se fosse stato inserito nella shell corrente. <command>at</command> si preoccupa anche di mantenere l'ambiente attuale, in modo da riprodurre le stesse condizioni quando esegue il comando. Il tempo viene indicato seguendo le solite convenzioni: <literal>16:12</literal> o <literal>4:12 PM</literal> rappresentano le 4:12 PM. La data può essere specificata in diversi formati europei ed occidentali, che includono <literal>DD.MM.YY</literal> (<literal>27.07.12</literal> così da rappresentare 27 Luglio 2012), <literal>YYYY-MM-DD</literal> (questa stessa data è espressa <literal>2012-07-27</literal>), <literal>MM/DD/[CC]YY</literal> (cioè, <literal>12/25/12</literal> o <literal>12/25/2012</literal> rappresenterà il 25 Dicembre 2012), o semplicemente <literal>MMDD[CC]YY</literal> (in modo che <literal>122512</literal> o <literal>12252012</literal> rappresenteranno, altresì, il 25 Dicembre 2012). Senza di essa, il comando verrà eseguito non appena l'orologio raggiunge il tempo indicato (lo stesso giorno, o domani, se quell'orario è già passato durante lo stesso giorno). Potete anche semplicemente scrivere "oggi" o "domani", che si spiega da sé.
ja_jp: <command>at</command> は未来の特定の時点にコマンドを実行します。<command>at</command> は時刻と日付をコマンドラインパラメータで受け取り、実行するコマンドを標準入力で受け取ります。このコマンドは、あたかも現在のシェルで実行されたかの如く実行されます。<command>at</command> はコマンドを実行する際に現在と同じ状況を再現するために、現在の環境を保存するように気を付けます。時刻は以下のように普通の慣例に従って表現されます: <literal>16:12</literal> または <literal>4:12pm</literal> は午後 4:12 を意味します。日付はヨーロッパと西洋で使われる幾つかの書式で指定します。<literal>DD.MM.YY</literal> (<literal>27.07.12</literal> は 2012 年 7 月 27 日を意味します)、<literal>YYYY-MM-DD</literal> (<literal>2012-07-27</literal> は上と同じ日付を意味します)、<literal>MM/DD/[CC]YY</literal> (<literal>12/25/12</literal> や <literal>12/25/2012</literal> は 2012 年 12 月 25 日を意味します)、または単純な <literal>MMDD[CC]YY</literal> (<literal>122512</literal> や <literal>12252012</literal> は同様に 2012 年 12 月 25 日を意味します) などです。日付の指定がなければ、コマンドは最も早く到達した指定時刻に実行されます (当日中、または、指定時刻が既に過ぎていれば明日)。読んで字の通り「today」、「tomorrow」などと簡単に書くことも可能です。
