Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: <primary>rights</primary>
it_it: <primary>diritti</primary>
ja_jp: <primary>権限</primary>

source: <primary>permissions</primary>
it_it: <primary>autorizzazioni</primary>
ja_jp: <primary>パーミッション</primary>

source: <primary>user</primary><secondary>owner</secondary>
it_it: <primary>utente</primary><secondary>proprietario</secondary>
ja_jp: <primary>ユーザ</primary><secondary>所有者</secondary>

source: <primary>group</primary><secondary>owner</secondary>
it_it: <primary>gruppo</primary><secondary>proprietario</secondary>
ja_jp: <primary>グループ</primary><secondary>所有者</secondary>

source: <primary>owner</primary><secondary>user</secondary>
it_it: <primary>utente</primary><secondary>proprietario</secondary>
ja_jp: <primary>所有者</primary><secondary>ユーザ</secondary>

source: <primary>owner</primary><secondary>group</secondary>
it_it: <primary>gruppo</primary><secondary>proprietario</secondary>
ja_jp: <primary>所有者</primary><secondary>グループ</secondary>

source: its owner (symbolized by <literal>u</literal> as in “user”);
it_it: il proprietario (simboleggiato dalla lettera <literal>u</literal> come in "user");
ja_jp: 所有者 (「user」の <literal>u</literal> で表記されます);

source: its owner group (symbolized by <literal>g</literal> as in “group”), representing all the members of the group;
it_it: suo gruppo proprietario (simboleggiata dalla lettera <literal>g</literal> come in "group"), in rappresentanza di tutti i membri del gruppo;
ja_jp: 所有者グループ (「group」の <literal>g</literal> で表記されます)、グループに所属する全ユーザを意味します;

source: the others (symbolized by <literal>o</literal> as in “other”).
it_it: gli altri (simboleggiati dalla lettera <literal>o</literal> come in "other").
ja_jp: その他 (「other」の <literal>o</literal> で表記されます)。

source: Three types of rights can be combined:
it_it: I tre tipi di diritti possono essere combinati:
ja_jp: 3 種類の権限は組み合わせて使うことが可能です:

source: reading (symbolized by <literal>r</literal> as in “read”);
it_it: lettura (simboleggiata dalla lettera <literal>r</literal> come in "read");
ja_jp: 読み込み (「read」の <literal>r</literal> で表記されます);

source: writing (or modifying, symbolized by <literal>w</literal> as in “write”);
it_it: scrittura (o modifica, simboleggiata dalla lettera <literal>w</literal> come in "write");
ja_jp: 書き込み (または変更、「write」の <literal>w</literal> で表記されます);

source: executing (symbolized by <literal>x</literal> as in “eXecute”).
it_it: esecuzione (simboleggiata dalla lettera <literal>x</literal> come in "eXecute").
ja_jp: 実行 (「eXecute」の <literal>x</literal> で表記されます)。

source: <primary>read, right</primary>
it_it: <primary>lettura, diritti</primary>
ja_jp: <primary>読み込み、権限</primary>

source: <primary>write, right</primary>
it_it: <primary>scrittura, diritti</primary>
ja_jp: <primary>書き込み、権限</primary>

source: <primary>modification, right</primary>
it_it: <primary>modifica, diritti</primary>
ja_jp: <primary>変更、権限</primary>

source: <primary>execution</primary><secondary>right</secondary>
it_it: <primary>esecuzione</primary><secondary>diritti</secondary>

source: In the case of a file, these rights are easily understood: read access allows reading the content (including copying), write access allows changing it, and execute access allows you to run it (which will only work if it's a program).
it_it: Nel caso di un file, questi diritti sono di facile comprensione: l'accesso in lettura permette di leggerne il contenuto (inclusa la copia), l'accesso in scrittura permette di cambiarlo, e l'accesso in esecuzione permette di eseguirlo (che funziona solo se si tratta di un programma).
ja_jp: ファイルの場合、これらの権限は簡単に理解できます: 読み込み権限があれば、内容を読む (コピーを含めて) ことが可能です。書き込み権限があれば、内容を変更する事が可能です。実行権限があれば、内容を実行することが可能です (プログラムの場合のみ有効)。

source: <emphasis>SECURITY</emphasis> <literal>setuid</literal> and <literal>setgid</literal> executables
it_it: <emphasis>SICUREZZA</emphasis><literal>setuid</literal> e <literal>setgid</literal> eseguibili
ja_jp: <emphasis>SECURITY</emphasis> <literal>setuid</literal> と <literal>setgid</literal> 実行ファイル

source: Two particular rights are relevant to executable files: <literal>setuid</literal> and <literal>setgid</literal> (symbolized with the letter “s”). Note that we frequently speak of “bit”, since each of these boolean values can be represented by a 0 or a 1. These two rights allow any user to execute the program with the rights of the owner or the group, respectively. This mechanism grants access to features requiring higher level permissions than those you would usually have.
it_it: Due diritti particolari sono rilevanti per i file eseguibili: <literal>setuid</literal> e <literal>setgid</literal> (Simboleggiato con la lettera "s"). Si noti che spesso parla di "bit", poiché ciascuno di questi valori booleani può essere rappresentato da uno 0 o un 1. Questi due diritti consentono a qualsiasi utente di eseguire il programma con i diritti del proprietario o del gruppo, rispettivamente. Questo meccanismo garantisce l'accesso alle funzionalità che richiedono le autorizzazioni di livello superiore rispetto a quelli che avrebbero di solito.
ja_jp: 実行ファイルに関係する 2 種類の特別な権限があります: <literal>setuid</literal> と <literal>setgid</literal> (「s」で表記されます) です。これらは「ビット」と呼ばれることが多い点に注意してください。なぜなら、これらは 0 か 1 で表されるブール値だからです。これら 2 種類の権限を使うと、実行されたプログラムは、所有者か所有グループの権限で動くことになります。このメカニズムを使うと、プログラムはプログラムを実行したユーザが通常持っているよりも高位のパーミッションを要求する機能にアクセスできるようになります。

source: <primary><literal>setuid</literal>, right</primary>
it_it: <primary><literal>setuid</literal> , diritti</primary>
ja_jp: <primary><literal>setuid</literal>、権限</primary>

source: <primary><literal>setgid</literal>, right</primary>
it_it: <primary><literal>setgid</literal> , diritti</primary>
ja_jp: <primary><literal>setgid</literal>、権限</primary>

source: Since a <literal>setuid</literal> root program is systematically run under the super-user identity, it is very important to ensure it is secure and reliable. Indeed, a user who would manage to subvert it to call a command of their choice could then impersonate the root user and have all rights on the system.
it_it: Poiché il programma principale <literal>setuid</literal> è sistematicamente eseguito con l'identità super-user, è molto importante assicurarsi che sia sicuro e affidabile. Infatti, un utente che riuscisse a sovvertirlo per invocare un comando di sua scelta potrebbe quindi rappresentare l'utente root ed avere tutti i diritti sul sistema.
ja_jp: <literal>setuid</literal> root プログラムは一貫してスーパーユーザとして実行されるため、安全で信頼できるプログラムか否かはとても重要です。実際、好きなコマンドを呼び出すために何とかしてシステムを破壊したいと思うユーザは root ユーザになりすまし、システムの全ての権限を持つ事が可能です。

source: A directory is handled differently. Read access gives the right to consult the list of its entries (files and directories), write access allows creating or deleting files, and execute access allows crossing through it (especially to go there with the <command>cd</command> command). Being able to cross through a directory without being able to read it gives permission to access the entries therein that are known by name, but not to find them if you do not know that they exist or under what name.
it_it: Una directory è gestita in modo diverso. L'accesso in lettura dà il diritto di consultare l'elenco delle sue voci (file e directory), l'accesso in scrittura permette di creare o eliminare file, mentre l'accesso in esecuzione permette di attraversarla (soprattutto ad andare lì con il comando <command>cd</command>). Essere in grado di attraversare una directory senza essere in grado di leggerla dà il permesso di accedere alle voci all'interno che sono note per nome, ma non verrebbero trovate senza sapere che esistono o sotto quale nome.

source: <emphasis>SECURITY</emphasis> <literal>setgid</literal> directory and <emphasis>sticky bit</emphasis>
it_it: <emphasis>SICUREZZA</emphasis><literal>setgid</literal> directory e <emphasis>sticky bit</emphasis>
ja_jp: <emphasis>SECURITY</emphasis> <literal>setgid</literal> ディレクトリと<emphasis>スティッキービット</emphasis>

source: The <literal>setgid</literal> bit also applies to directories. Any newly-created item in such directories is automatically assigned the owner group of the parent directory, instead of inheriting the creator's main group as usual. This setup avoids the user having to change its main group (with the <command>newgrp</command> command) when working in a file tree shared between several users of the same dedicated group.
it_it: Il bit <literal>setgid</literal> vale anche per le directory. Qualsiasi elemento appena creato in tali elenchi viene assegnato automaticamente al gruppo proprietario della directory genitore, invece di ereditare il gruppo principale del creatore come al solito. Questa configurazione evita che l'utente debba cambiare il suo gruppo principale (con il comando <command>newgrp</command>) quando si lavora in un albero di file condiviso tra più utenti dello stesso gruppo dedicato.
ja_jp: <literal>setgid</literal> ビットはディレクトリにも適用されます。<literal>setgid</literal> ビットが適用されたディレクトリの中に新しく作成されたアイテムは、作成者のメイングループを継承するのではなく、自動的に親ディレクトリの所有者グループを割り当てられます。こうすることで、ユーザが同じ専用グループに所属する複数のユーザの間で共有されているファイルツリーの中で作業をしている場合、自分の (<command>newgrp</command> コマンドを使って) メイングループを変更しなくてもよくなります。

source: The “sticky” bit (symbolized by the letter “t”) is a permission that is only useful in directories. It is especially used for temporary directories where everybody has write access (such as <filename>/tmp/</filename>): it restricts deletion of files so that only their owner (or the owner of the parent directory) can do it. Lacking this, everyone could delete other users' files in <filename>/tmp/</filename>.
it_it: Il bit "sticky" (simboleggiato dalla lettera "t") è un'autorizzazione che è utile solo nelle directory. E' particolarmente utilizzato per la directory temporanee in cui tutti hanno accesso in scrittura (come <filename>/ tmp /</filename> ): esso limita la cancellazione di file in modo che solo il suo proprietario (o il proprietario della directory padre) possa farlo. In mancanza di questo, tutti potevano eliminare i file di altri utenti in <filename>/ tmp /</filename> .
ja_jp: 「スティッキー」ビット (「t」で表記されます) とはディレクトリだけに有効なパーミッションです。これは特に、誰でも書き込み権限を持つ一時ディレクトリ (<filename>/tmp/</filename> など) に使われます: スティッキービットを付けられたディレクトリ以下に含まれるファイルの削除が制限されます。ファイルは所有者 (または親ディレクトリの所有者) だけが削除できるようになります。<filename>/tmp/</filename> にスティッキービットが無ければ、そのディレクトリ以下にある他のユーザのファイルを誰でも削除できる事になります。

source: Three commands control the permissions associated with a file:
it_it: Tre comandi per controllare i permessi associati ad un file:
ja_jp: ファイルのパーミッションを制御する 3 種類のコマンド:

source: <command>chown <replaceable>user</replaceable> <replaceable>file</replaceable></command> changes the owner of the file;
it_it: <command>chown <replaceable>utente</replaceable><replaceable>file</replaceable></command> cambia il proprietario del file;
ja_jp: <command>chown <replaceable>user</replaceable> <replaceable>file</replaceable></command> ファイルの所有者を変更します;

source: <command>chgrp <replaceable>group</replaceable> <replaceable>file</replaceable></command> alters the owner group;
it_it: <command>chgrp <replaceable>gruppo</replaceable><replaceable>file</replaceable></command> cambia il gruppo proprietario;
ja_jp: <command>chgrp <replaceable>group</replaceable> <replaceable>file</replaceable></command> ファイルの所有グループを変更します;

source: <command>chmod <replaceable>rights</replaceable> <replaceable>file</replaceable></command> changes the permissions for the file.
it_it: <command>chmod <replaceable>diritti</replaceable><replaceable>file</replaceable></command> cambia le autorizzazioni per il file.
ja_jp: <command>chmod <replaceable>rights</replaceable> <replaceable>file</replaceable></command> ファイルのパーミッションを変更します。

source: There are two ways of presenting rights. Among them, the symbolic representation is probably the easiest to understand and remember. It involves the letter symbols mentioned above. You can define rights for each category of users (<literal>u</literal>/<literal>g</literal>/<literal>o</literal>), by setting them explicitly (with <literal>=</literal>), by adding (<literal>+</literal>), or subtracting (<literal>-</literal>). Thus the <literal>u=rwx,g+rw,o-r</literal> formula gives the owner read, write, and execute rights, adds read and write rights for the owner group, and removes read rights for other users. Rights not altered by the addition or subtraction in such a command remain unmodified. The letter <literal>a</literal>, for “all”, covers all three categories of users, so that <literal>a=rx</literal> grants all three categories the same rights (read and execute, but not write).
it_it: Ci sono due modi di rappresentare i diritti. Tra questi, la rappresentazione simbolica è probabilmente la più facile da capire e ricordare. Si tratta dei simboli lettera di cui sopra. È possibile definire i diritti per ogni categoria di utenti ( <literal>u</literal> / <literal>g</literal> / <literal>o</literal> ), Impostando in modo esplicito (con <literal>=</literal> ), aggiungendo ( <literal>+</literal> ), o sottraendo ( <literal>-</literal> ). Così la formula <literal>u = rwx, g rw, o</literal> conferisce al titolare lettura, scrittura ed esecuzione dei diritti, aggiunge i diritti di lettura e scrittura per il gruppo proprietario, e rimuove i diritti di lettura per altri utenti. I diritti non alterati con l'aggiunta o sottrazione di tale comando non vengono modificati. La lettera <literal>a</literal> , per "tutti", copre tutte le tre categorie di utenti, in modo che <literal>a = rx</literal> garantisca a tutte e tre le categorie gli stessi diritti (lettura ed esecuzione, ma non scrittura).
ja_jp: 権限の指定方法には 2 種類あります。それらの中でも、記号指定が最もわかりやすく覚えやすいでしょう。これは上で述べた文字記号を使います。ユーザのカテゴリ (<literal>u</literal>/<literal>g</literal>/<literal>o</literal>) に対する権限を (<literal>=</literal> で) 明示するか、(<literal>+</literal> で) 追加するか、(<literal>-</literal> で) 取り除く事ができます。そんな訳で、<literal>u=rwx,g+rw,o-r</literal> 式は、所有者に読み込み、書き込み、実行権限を与え、所有グループに読み込み、書き込み権限を追加し、その他のユーザから読み込み権限を奪います。追加と削除によって変更されない権限はそのままです。「all」を意味する文字 <literal>a</literal> は 3 つのユーザカテゴリ全てを表現します。このため、<literal>a=rx</literal> は全てのカテゴリのユーザに対して同じ権限 (読み込みと実行権限を与えますが、書き込み権限は与えません) を与えます。

source: <primary>octal representation of rights</primary>
it_it: <primary>rappresentazione ottale dei diritti</primary>
ja_jp: <primary>権限の 8 進数表記</primary>

source: <primary>rights, octal representation</primary>
it_it: <primary>diritti, rappresentazione ottale</primary>

source: The (octal) numeric representation associates each right with a value: 4 for read, 2 for write, and 1 for execute. We associate each combination of rights with the sum of the figures. Each value is then assigned to different categories of users by putting them end to end in the usual order (owner, group, others).
it_it: La rappresentazione numerica (ottale) associa ogni diritto con un valore: 4 per la lettura, 2 per la scrittura e 1 per l'esecuzione. Associamo ogni combinazione di diritti con la somma delle cifre. Ogni valore viene quindi assegnato a diverse categorie di utenti mettendoli da un estremo all'altro l'ordine consueto (proprietario, gruppo, altri).
ja_jp: (8 進数) 数値表記は各権限を値で表現します: 読み込みは 4、書き込みは 2、実行権限は 1 です。権限を組み合わせるには組み合わせたい権限に対応する数字を合計します。ユーザの各カテゴリ (所有者、グループ、その他) に対して与える権限を同じ順番で連結して、それぞれの権限を割り当てます。

source: For instance, the <command>chmod 754 <replaceable>file</replaceable></command> command will set the following rights: read, write and execute for the owner (since 7 = 4 + 2 + 1); read and execute for the group (since 5 = 4 + 1); read-only for others. The <literal>0</literal> means no rights; thus <command>chmod 600 <replaceable>file</replaceable></command> allows for read/write rights for the owner, and no rights for anyone else. The most frequent right combinations are <literal>755</literal> for executable files and directories, and <literal>644</literal> for data files.
it_it: Ad esempio, il comando <command>chmod 754 <replaceable>file</replaceable></command> imposta i seguenti diritti: lettura, scrittura ed esecuzione per il proprietario (da 7 = 4 + 2 + 1), lettura ed esecuzione per il gruppo (da 5 = 4 + 1), sola lettura per gli altri. Il numero <literal>0</literal> significa che non si hanno diritti; così <command>chmod 600 <replaceable>file</replaceable></command> permette la lettura / scrittura per il proprietario, e nessun diritto per chiunque altro. Le combinazioni di diritti più frequenti sono <literal>755</literal> per i file eseguibili e le directory, e <literal>644</literal> per i file di dati.
ja_jp: 例えば、<command>chmod 754 <replaceable>file</replaceable></command> コマンドは以下の権限を設定します: 所有者に書き込み、読み込み、実行権限 (7 = 4 + 2 + 1 なので) を設定し; 所有グループに読み込み、実行権限 (5 = 4 + 1 なので) を設定し; その他のユーザに読み込み権限を設定します。<literal>0</literal> は権限が無いことを意味します; このため <command>chmod 600 <replaceable>file</replaceable></command> は所有者に読み込み、書き込み権限を設定し、所有者以外のユーザにはいかなる権限も与えません。最もよく使われる権限の組み合わせは、実行ファイルやディレクトリの場合 <literal>755</literal> で、データファイルの場合 <literal>644</literal> です。

source: To represent special rights, you can prefix a fourth digit to this number according to the same principle, where the <literal>setuid</literal>, <literal>setgid</literal> and <literal>sticky</literal> bits are 4, 2 and 1, respectively. <command>chmod 4754</command> will associate the <literal>setuid</literal> bit with the previously described rights.
it_it: Per rappresentare i diritti speciali, è possibile anteporre una quarta cifra a questo numero in base allo stesso principio, in cui il bit <literal>setuid</literal> , il bit <literal>setgid</literal> e il bit <literal>sticky</literal> sono rispettivamente 4, 2 e 1. <command>chmod 4754</command> assocerà il bit <literal>setuid</literal> con i diritti descritti in precedenza.
ja_jp: 同じ原則に従って特別な権限を表す 4 番目の桁は先に説明した 3 桁の権限表記の前に付けます。<literal>setuid</literal>、<literal>setgid</literal>、<literal>sticky</literal> ビットがそれぞれ 4、2、1 に対応します。<command>chmod 4754</command> は前に説明した権限に加えて、<literal>setuid</literal> ビットを設定します。

source: Note that the use of octal notation only allows to set all the rights at once on a file; you can not use it to simply add a new right, such as read access for the group owner, since you must take into account the existing rights and compute the new corresponding numerical value.
it_it: Si noti che l'uso della notazione ottale consente solo di impostare tutti i diritti in una sola volta su un file, non è possibile utilizzarlo per aggiungere semplicemente un nuovo diritto, come l'accesso in lettura per il proprietario del gruppo, in quanto è necessario tener conto dei diritti esistenti e calcolare il nuovo valore numerico corrispondente.
ja_jp: 8 進数表記の権限設定が使えるのは、あるファイルに対する全ての権限を一度に設定する場合だけです; 例えば、所有グループに読み込み権限を与えるなどの、新しい権限を追加したい場合は使えません。なぜなら、既に設定されている権限を考慮して、新しい権限を数値表記に直さなければいけないからです。

source: <emphasis>TIP</emphasis> Recursive operation
it_it: <emphasis>TIP</emphasis> Operazioni ricorsive
ja_jp: <emphasis>TIP</emphasis> 再帰操作

source: Sometimes we have to change rights for an entire file tree. All the commands above have a <literal>-R</literal> option to operate recursively in sub-directories.
it_it: A volte dobbiamo cambiare i diritti per un albero intero file. Tutti i comandi sopra hanno l'opzione <literal>-R</literal> per operare ricorsivamente in sotto-directory.
ja_jp: しばしばファイルツリー全体の権限を変更しなければいけない場合があります。上に挙げた 3 種類のコマンドには、サブディレクトリを再帰的に辿って操作を行うための <literal>-R</literal> オプションがあります。

source: The distinction between directories and files sometimes causes problems with recursive operations. That's why the “X” letter has been introduced in the symbolic representation of rights. It represents a right to execute which applies only to directories (and not to files lacking this right). Thus, <command>chmod -R a+X <replaceable>directory</replaceable></command> will only add execute rights for all categories of users (<literal>a</literal>) for all of the sub-directories and files for which at least one category of user (even if their sole owner) already has execute rights.
it_it: La distinzione tra le directory ed i file a volte causa problemi con le operazioni ricorsive. Ecco perché la lettera "X" è stata introdotta nella rappresentazione simbolica dei diritti. Esso rappresenta un diritto di eseguire, che si applica solo alle directory (e non ai file privi di tale diritto). Così, <command>chmod -R a+X <replaceable>directory</replaceable></command> aggiungerà solo i diritti di esecuzione per tutte le categorie di utenti ( <literal>a</literal> ) per tutte le sub-directory e tutti i file per almeno una categoria di utenti (anche se fosse il loro unico proprietario) che hanno già i diritti di esecuzione.
ja_jp: 再帰操作を行った時に、ディレクトリとファイルの間の違いが原因で、時々問題が起こります。このため、「X」文字が権限の記号表記に導入されました。「X」文字はディレクトリだけに適用される (そして実行権限の無いファイルには適用されない) 実行権限を表します。このため、<command>chmod -R a+X <replaceable>directory</replaceable></command> は、少なくとも 1 つのカテゴリのユーザ (所有者が一人しかいなくても) が既に対象の実行権限を持っている場合に、全てのカテゴリのユーザ (<literal>a</literal>) に対して全てのサブディレクトリとファイルへの実行権限を追加します。

source: <emphasis>TIP</emphasis> Changing the user and group
it_it: <emphasis>TIP</emphasis> Cambiare utente e gruppo
ja_jp: <emphasis>TIP</emphasis> ユーザとグループの変更

source: Frequently you want to change the group of a file at the same time that you change the owner. The <command>chown</command> command has a special syntax for that: <command>chown <replaceable>user</replaceable>:<replaceable>group</replaceable></command>
it_it: Spesso si desidera cambiare il gruppo di un file nello stesso momento in cui si cambia il proprietario. Il comando <command>chown</command> ha una sintassi speciale a questo scopo: <command>chown <replaceable>utente</replaceable> : <replaceable>gruppo</replaceable></command>
ja_jp: しばしば、ファイルのグループと所有者を同時に変更したい場合があります。この用途向けに <command>chown</command> コマンドには特別な構文があります: <command>chown <replaceable>user</replaceable>:<replaceable>group</replaceable></command>

source: <emphasis>GOING FURTHER</emphasis> <command>umask</command>
it_it: <emphasis>APPROFONDIMENTO</emphasis><command>umask</command>

source: When an application creates a file, it assigns indicative permissions, knowing that the system automatically removes certain rights, given by the command <command>umask</command>. Enter <command>umask</command> in a shell; you will see a mask such as <computeroutput>0022</computeroutput>. This is simply an octal representation of the rights to be systematically removed (in this case, the write right for the group and other users).
it_it: Quando un'applicazione crea un file, assegna i permessi indicativi, sapendo che il sistema rimuove automaticamente alcuni diritti, grazie al comando <command>umask</command> . Inserire <command>umask</command> in una shell, vedrete una maschera come <computeroutput>0022</computeroutput> . Questo è semplicemente una rappresentazione ottale dei diritti automaticamente rimossi (in questo caso, il diritto di scrittura per il gruppo e altri utenti).
ja_jp: アプリケーションがファイルを作成する際、ファイルには目安となるパーミッションが割り当てられます。このパーミッションは <command>umask</command> コマンドで表示される特定の権限が自動的に削除されたものです。シェルで <command>umask</command> を実行すると; <computeroutput>0022</computeroutput> 等のマスクが表示されます。これは権限の単純な 8 進数表記で、これで表される権限は体系的に削除されます (上の場合、グループとその他のユーザに対する書き込み権限が削除されます)。

source: <primary>rights</primary><secondary>mask</secondary>
it_it: <primary>maschera</primary><secondary>diritti</secondary>
ja_jp: <primary>権限</primary><secondary>マスク</secondary>

source: <primary>mask</primary><secondary>rights mask</secondary>
it_it: <primary>maschera</primary><secondary>diritti maschera</secondary>
ja_jp: <primary>マスク</primary><secondary>権限マスク</secondary>
