Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: <literal>$major</literal> or <literal>%M</literal>: the kernel major number of the device;
it_it: <literal>$major</literal> o <literal>%M</literal> : il numero kernel maggiore del dispositivo;
ja_jp: <literal>$major</literal> または <literal>%M</literal>: デバイスのカーネルメジャー番号;

source: <literal>$minor</literal> or <literal>%m</literal>: the kernel minor number of the device;
it_it: <literal>$minor</literal> o <literal>%m</literal> : il numero kernel minore del dispositivo;
ja_jp: <literal>$minor</literal> または <literal>%m</literal>: デバイスのカーネルのマイナー番号;

source: <literal>$result</literal> or <literal>%c</literal>: the string output by the last program invoked by <literal>PROGRAM</literal>;
it_it: <literal>$result</literal> o <literal>%c</literal> : la stringa di uscita dall'ultimo programma invocato da <literal>PROGRAMMA</literal> ;
ja_jp: <literal>$result</literal> または <literal>%c</literal>: <literal>PROGRAM</literal> によって起動された最後のプログラムの出力文字列;

source: and, finally, <literal>%%</literal> and <literal>$$</literal> for the percent and dollar sign, respectively.
it_it: e, infine, <literal>%%</literal> e <literal>$$</literal> per, rispettivamente, il segno di percentuale e di dollaro.
ja_jp: そして最後に、<literal>%%</literal> と <literal>$$</literal> はそれぞれパーセントとドル記号を意味します。

source: The above lists are not complete (they include only the most important parameters), but the <citerefentry><refentrytitle>udev</refentrytitle><manvolnum>7</manvolnum></citerefentry> manual page should be.
it_it: Gli elenchi di cui sopra non sono completi (che comprendono solo i parametri più importanti), ma la pagina di manuale <citerefentry><refentrytitle>udev</refentrytitle><manvolnum>7</manvolnum></citerefentry> dovrebbe essere completa.
ja_jp: 上のリストは完全なものではありません (最も重要なパラメータの抜粋です)。完全なリストは <citerefentry><refentrytitle>udev</refentrytitle><manvolnum>7</manvolnum></citerefentry> マニュアルページを御覧ください。

source: A concrete example
it_it: Un esempio concreto
ja_jp: 具体例

source: Let us consider the case of a simple USB key and try to assign it a fixed name. First, you must find the elements that will identify it in a unique manner. For this, plug it in and run <command>udevadm info -a -n /dev/sdc</command> (replacing <replaceable>/dev/sdc</replaceable> with the actual name assigned to the key).
it_it: Consideriamo il caso di una semplice penna USB a cui tentiamo di assegnare un nome fisso. In primo luogo, è necessario individuare gli elementi che la identificano in modo univoco. Per far questo, collegarla ed eseguire <command>udevadm info -a -n /dev/sdc</command> (In sostituzione <replaceable>/dev/sdc</replaceable> con il nome effettivo assegnato al tasto).
ja_jp: 単純な USB メモリに固定された名前を割り当てる場合を考えましょう。最初に、一意的な方法で USB メモリを識別するために必要な要素を見つけなければいけません。このために、USB メモリを取り付け、<command>udevadm info -a -n /dev/sdc</command> を実行してください (ここで、<replaceable>/dev/sdc</replaceable> は USB メモリに割り当てられた実際のデバイス名で置き換えてください)。

source: To create a new rule, you can use tests on the device's variables, as well as those of one of the parent devices. The above case allows us to create two rules like these:
it_it: Per creare una nuova regola, è possibile utilizzare i test sulle variabili del dispositivo, così come quelli di uno dei dispositivi da cui deriva. Il caso di cui sopra ci permette di creare due regole come queste:
ja_jp: 新しいルールを作るために、デバイスの変数および親デバイスの変数に対するテストを行います。上の例から、以下の様な 2 つのルールを作成します:

source: Once these rules are set in a file, named for example <filename>/etc/udev/rules.d/010_local.rules</filename>, you can simply remove and reconnect the USB key. You can then see that <filename>/dev/usb_key/disk</filename> represents the disk associated with the USB key, and <filename>/dev/usb_key/part1</filename> is its first partition.
it_it: Una volta che queste regole sono specificate in un file, chiamato ad esempio <filename>/etc/udev/rules.d/010_local.rules</filename>, si può semplicemente rimuovere e ricollegare la chiave USB. È quindi possibile vedere che <filename>/dev/ usb_key/disk</filename> rappresenta il disco associato alla chiave USB, e <filename>/dev/usb_key/part1</filename> è la sua prima partizione.
ja_jp: これらのルールを例えば <filename>/etc/udev/rules.d/010_local.rules</filename> という 1 つのファイルに書き込んだら、USB メモリを取り外し、再度取り付けてください。この USB キーに関連付けられたディスクを表す <filename>/dev/usb_key/disk</filename> と第 1 パーティションを表す <filename>/dev/usb_key/part1</filename> が生成されたことと思います。

source: <emphasis>GOING FURTHER</emphasis> Debugging <emphasis>udev</emphasis>'s configuration
it_it: <emphasis>APPROFONDIMENTO</emphasis> Debug della configurazione di <emphasis>udev</emphasis>
ja_jp: <emphasis>GOING FURTHER</emphasis> <emphasis>udev</emphasis> 設定のデバッグ

source: Like many daemons, <command>udevd</command> stores logs in <filename>/var/log/daemon.log</filename>. But it is not very verbose by default, and it's usually not enough to understand what's happening. The <command>udevadm control --log-priority=info</command> command increases the verbosity level and solves this problem. <command>udevadm control --log-priority=err</command> returns to the default verbosity level.
it_it: Come molti demoni, <command>udevd</command> memorizza i file di log in <filename>/var/log/daemon.log</filename>. Ma non è molto dettagliato per impostazione predefinita e non è, di solito, sufficiente per capire cosa sta succedendo. Il comando <command>udevadm control --log-priority=info</command> aumenta il livello di dettaglio e risolve questo problema. Mentre invece <command>udevadm control --log-priority=err</command> torna al livello di dettaglio predefinito.
ja_jp: 多くのデーモンと同様に、<command>udevd</command> は <filename>/var/log/daemon.log</filename> にログを保存します。しかしデフォルトの状態だとログはそれほど詳細でなく、何が起きているかを理解するには不十分な場合が多いです。<command>udevadm control --log-priority=info</command> コマンドを使ってログの詳細度を上げることで、この問題は解決されます。デフォルトの詳細度に戻すには、<command>udevadm control --log-priority=err</command> を使ってください。

source: Power Management
it_it: Gestione energia

source: <primary>power management</primary>
it_it: <primary>gestione energetica</primary>
ja_jp: <primary>電源管理</primary>

source: <primary>management, power management</primary>
it_it: <primary>gestione, gestione energetica</primary>
ja_jp: <primary>管理、電源管理</primary>

source: The topic of power management is often problematic. Indeed, properly suspending the computer requires that all the computer's device drivers know how to put them to standby, and that they properly reconfigure the devices upon waking. Unfortunately, there are still many devices unable to sleep well under Linux, because their manufacturers have not provided the required specifications.
it_it: Il tema della gestione energetica è spesso problematico. Infatti, per sospendere correttamente il computer è necessario che tutti i driver delle periferiche del computer sappiano come andare in stand-by, per poi riconfigurare correttamente i dispositivi al risveglio. Purtroppo, ci sono ancora molti dispositivi non sono in grado di essere sospesi correttamente sotto Linux, perché i loro produttori non hanno fornito le specifiche richieste.

source: <emphasis>WORTH FOLLOWING</emphasis> Software suspend
it_it: <emphasis>WORTH SEGUITO</emphasis> Sospensione software

source: <primary>software suspend</primary>
it_it: <primary>Sospensione software</primary>

source: <primary>suspend</primary>
it_it: <primary>sospensione</primary>

source: <primary>hibernation</primary>
it_it: <primary>ibernazione</primary>

source: The software suspend banner rallies several recent efforts to integrate reliable hibernation under Linux, on disk or in memory. Recent kernels are relatively reliable in that regard, when used in cooperation with tools of the <emphasis role="pkg">uswsusp</emphasis> package. Unfortunately the problems related to hibernation are not yet ancient history, and you should run tests on your hardware before putting too much faith in its ability to wake from suspend.
it_it: Il software di sospensione raccoglie più recenti sforzi per integrare l'ibernazione in maniera affidabile sotto Linux, su disco o in memoria. I kernel recenti sono relativamente affidabili a tal proposito, quando usato in cooperazione con gli strumenti del pacchetto <emphasis role="pkg">uswsusp</emphasis>. Purtroppo i problemi legati alla sospensione non sono ancora storia antica, e si dovrebbero eseguire dei test sul vostro hardware prima di mettere troppa fiducia nella sua capacità di svegliarsi dalla sospensione.

source: For those who want to learn more about how standby works with ACPI, Matthew Garrett has an excellent article about this in his blog. <ulink type="block" url="http://www.advogato.org/article/913.html" /> <indexterm><primary>Garrett, Matthew</primary></indexterm> <indexterm><primary>Matthew Garrett</primary></indexterm>
it_it: Per chi vuole saperne di più su come funziona la modalità standby con ACPI, Matthew Garrett ha un eccellente articolo a questo proposito nel suo blog. <ulink type="block" url="http://www.advogato.org/article/913.html" /><indexterm><primary>Garrett, Matthew</primary></indexterm><indexterm><primary>Matthew Garrett</primary></indexterm>

source: Advanced Power Management (APM)
it_it: Gestione avanzata dell'energia (APM)

source: APM (Advanced Power Management) control is present in all Debian kernels, but disabled by default. To activate it, you add the <literal>apm=on</literal> option to the kernel parameters passed at boot time. With LILO, you would add the <literal>append="apm=on"</literal> directive to the block indicating which image to boot (in the <filename>/etc/lilo.conf</filename> file), and relaunch <command>lilo</command>. With GRUB2, you simply add <literal>apm=on</literal> to the <literal>GRUB_CMDLINE_LINUX=</literal> variable in <filename>/etc/default/grub</filename>, and run <command>update-grub</command> to regenerate the contents of the boot menu.
it_it: Il controllo APM (Advanced Power Management) è presente in tutti i kernel di Debian, ma disabilitato di default. Per attivarlo, si aggiunge l'opzione <literal>apm = on</literal> per i parametri del kernel passati al momento del boot. Con LILO, si dovrebbe aggiungere <literal>append = "apm = on"</literal> al blocco indicante quale immagine di avvio (nel <filename>/ etc / lilo.conf</filename> file), e rilanciare <command>lilo</command> . Con GRUB2, è sufficiente aggiungere <literal>apm = on</literal> alla variabile <literal>GRUB_CMDLINE_LINUX =</literal> in <filename>/etc/default/grub</filename> , ed eseguire <command>update-grub</command> per rigenerare il contenuto del menu di avvio.

source: The <emphasis role="pkg">apmd</emphasis> package provides a daemon that looks for events connected to energy management (switching between AC and battery power on a laptop, etc.), and allows you to run specific commands in response.
it_it: Il pacchetto <emphasis role="pkg">apmd</emphasis> fornisce un demone che cerca eventi legati alla gestione energetica (il passaggio tra AC e la potenza della batteria su un portatile, etc), e permette di eseguire comandi specifici in risposta.

source: These days, APM is really only justified on older computers that do not support ACPI properly. In all other cases, ACPI should be used.
it_it: In questi giorni, APM è davvero giustificato solo sui computer più vecchi che non supportano ACPI correttamente. In tutti gli altri casi, dovrebbe essere usato ACPI.

source: Modern power savings: Advanced Configuration and Power Interface (ACPI)
it_it: Risparmio di energia moderno: Advanced Configuration and Power Interface (ACPI)

source: Linux supports ACPI (Advanced Configuration and Power Interface) — the most recent standard in power management. More powerful and flexible, it is also more complicated to implement. The <emphasis role="pkg">acpid</emphasis> package is the counterpart to <emphasis role="pkg">apmd</emphasis> for the ACPI world.
it_it: Linux supporta ACPI (Advanced Configuration and Power Interface) - lo standard più recente nella gestione dell'energia. Più potente e flessibile, è anche più complicato da implementare. Il pacchetto <emphasis role="pkg">acpid</emphasis> è la controparte di <emphasis role="pkg">apmd</emphasis> per il mondo ACPI.

source: If you know that your BIOS correctly manages ACPI, then this should be preferred over APM (removed upon update of the BIOS). When moving from one to the other, you must take care to remove the <emphasis role="pkg">apmd</emphasis> package, since keeping it alongside with <emphasis role="pkg">acpid</emphasis> could cause problems (and vice-versa).
it_it: Se sapete che il vostro BIOS gestisce correttamente ACPI, allora questo dovrebbe essere preferito ad APM (rimosso durante l'aggiornamento del BIOS). Quando si passa da uno all'altro, si deve avere cura di rimuovere il pacchetto <emphasis role="pkg">apmd</emphasis>, poiché insieme con <emphasis role="pkg">acpid</emphasis> potrebbe causare problemi (e viceversa).

source: <emphasis>ATTENTION</emphasis> Graphics card and standby
it_it: <emphasis>ATTENZIONE</emphasis> Scheda grafica e standby

source: The graphics card driver often has a problem with standby. In case of trouble, it is a good idea to test the latest version of the X.org graphics server.
it_it: Il driver della scheda grafica è spesso un problema con lo standby. In caso di problemi, è una buona idea testare l'ultima versione del server grafico X.org.

source: <emphasis>HARDWARE</emphasis> Apple and power management
it_it: <emphasis>HARDWARE</emphasis> Apple e la gestione dell'energia

source: On Apple Powerbooks (thus PowerPC processors), <emphasis role="pkg">apmd</emphasis> should be replaced with <emphasis role="pkg">pmud</emphasis>.
it_it: Sui Powerbook Apple (quindi su processori PowerPC), <emphasis role="pkg">apmd</emphasis> dovrebbe essere stato sostituito con <emphasis role="pkg">pmud</emphasis> .

source: Laptop Extension Cards: PCMCIA
it_it: Schede di esapnsione per portatili: PCMCIA

source: PCMCIA card drivers are built into the kernel as modules since kernel version 2.6.13. On a system running Debian <emphasis role="distribution">Squeeze</emphasis>, you simply have to install the user space support contained in the <emphasis role="pkg">pcmciautils</emphasis> package.
it_it: Il driver delle schede PCMCIA sono integrati nel kernel come moduli dalla versione 2.6.13. Su un sistema con Debian <emphasis role="distribution">Squeeze</emphasis> , devi semplicemente installare il supporto in user space contenuto nel pacchetto <emphasis role="pkg">pcmciautils</emphasis>.

source: The <emphasis role="pkg">wireless-tools</emphasis> package is also necessary for good management of Wifi cards.
it_it: Il pacchetto <emphasis role="pkg">wireless-tools</emphasis> è necessario anche per una buona gestione delle schede WiFi.

source: <primary>network</primary><secondary>wireless</secondary>
it_it: <primary>rete</primary><secondary>senza fili</secondary>

source: <primary>wireless network</primary>
it_it: <primary>rete wireless</primary>

source: Every time you connect or remove a card, the daemon configures or deconfigures it, by executing a script in the <filename>/etc/pcmcia/</filename> directory, which gets its settings from the <filename>/etc/pcmcia/*.opts</filename> files. These files have been slightly adapted to work with a Debian system; the configuration of the network is delegated to <command>ifup</command> if the <filename>/etc/pcmcia/network.opts</filename> file does not take care of it. The same is true for configuration of a wireless network, which can be specified in <filename>/etc/network/interfaces</filename> instead of <filename>/etc/pcmcia/wireless.opts</filename>. The <filename>/usr/share/doc/wireless-tools/README.Debian</filename> file also describes the syntax to use.
it_it: Ogni volta che si collega o si rimuove una scheda, il demone la configura o meno, mediante l'esecuzione di uno script nella directory <filename>/etc/pcmcia/</filename>, che prende le impostazioni dal file <filename>/etc/pcmcia/*.opts</filename> . Questi file sono stati leggermente adattati per funzionare con un sistema Debian, la configurazione della rete è delegata al comando <command>ifup</command> se il file <filename>/ etc / pcmcia / network.opts</filename> non si prende cura di esso. Lo stesso vale per la configurazione di una rete wireless, che può essere specificata in <filename>/ etc / network / interfaces</filename> invece di <filename>/ etc / pcmcia / wireless.opts</filename>. Il file <filename>/ usr / share / doc / wireless-tools / README.Debian</filename> descrive inoltre la sintassi da utilizzare.

source: After this overview of basic services common to many Unix systems, we will focus on the environment of the administered machines: the network. Many services are required for the network to work properly. They will be discussed in the next chapter.
it_it: Dopo questa panoramica dei servizi di base comuni a molti sistemi Unix, ci concentreremo sull'ambiente delle macchine amministrate: la rete. Molti servizi sono necessari per la rete, per funzionare correttamente. Essi saranno discussi nel prossimo capitolo.
ja_jp: 多くの Unix システムで共通の基本的サービスの概要の後、管理されているマシンの環境に焦点を合わせます: ネットワークです。多くのサービスはネットワークを正しく動作させることを必要とします。次の章ではこれについて議論します。

source: Initscripts
ja_jp: 初期化スクリプト

source: Hotplug
ja_jp: ホットプラグ

source: The “real init” is currently provided by <emphasis role="pkg">sysv-rc</emphasis> (“System V”) and this section documents this init system.
ja_jp: 「真の init」は現在 <emphasis role="pkg">sysv-rc</emphasis> (「System V」) によって提供されています。この節ではこの init システムに付いて説明します。

source: These configuration files are intended for <command>modprobe</command> — the program that loads a kernel module with its dependencies (modules can indeed call other modules). This program is provided by the <emphasis role="pkg">kmod</emphasis> package.
ja_jp: <command>modprobe</command> がこれらの設定ファイルを使います。このプログラムは依存関係に従ってカーネルモジュールを読み込みます (モジュールは他のモジュールを呼ぶ事ができます)。<command>modprobe</command> は <emphasis role="pkg">kmod</emphasis> パッケージによって提供されます。

source: After this stage, <command>init</command> takes over and starts the programs enabled in the default runlevel (which is usually runlevel 2). It executes <command>/etc/init.d/rc 2</command>, a script that starts all services which are listed in <filename>/etc/rc2.d/</filename> and whose name start with the “S” letter. The two-figures number that follows had historically been used to define the order in which services had to be started, but nowadays the default boot system uses <command>insserv</command>, which schedules everything automatically based on the scripts' dependencies. Each boot script thus declares the conditions that must be met to start or stop the service (for example, if it must start before or after another service); <command>init</command> then launches them in the order that meets these conditions. The static numbering of scripts is therefore no longer taken into consideration (but they must always have a name beginning with “S” followed by two digits and the actual name of the script used for the dependencies). Generally, base services (such as logging with <command>rsyslog</command>, or port assignment with <command>portmap</command>) are started first, followed by standard services and the graphical interface (<command>gdm</command>).
ja_jp: この段階の後、<command>init</command> が引き継ぎ、デフォルトランレベル (通常ランレベル 2) で有効化されたプログラムを起動します。<command>init</command> は <command>/etc/init.d/rc 2</command> を実行します。これは <filename>/etc/rc2.d/</filename> 置かれて、「S」で始まる名前の全てのサービスを開始するスクリプトです。「S」の後に続く 2 桁の数字は、歴史的言って、起動するサービスの順番を定義するために使われていました。しかし今やデフォルトの起動システムは <command>insserv</command> を使って、スクリプト同士の依存関係に従った起動順を自動的に決定します。このため、各起動スクリプトはサービスを起動または終了させる時に満足しなければいけない条件を宣言します (例えば、あるサービスは他のサービスの前または後に起動しなければいけないなど); そして、<command>init</command> は条件を満足するようにサービスを起動します。このため、スクリプトの静的な番号付けはもはや考慮されません (しかしスクリプトの名前は必ず「S」で始まり、その後ろに 2 桁の番号を付け、依存関係に使われる実際のスクリプトの名前を続けなければいけません)。一般に、基本システム (ログ記録を担当する <command>rsyslog</command> やポート割り当てを担当する <command>portmap</command>) が最初に起動され、その後に標準的なサービスとグラフィカルインターフェイス (<command>gdm</command>) が起動されます。

source: This book describes the boot system used by default in Debian (as implemented by the <emphasis role="pkg">sysvinit</emphasis> package), which is derived and inherited from <emphasis>System V</emphasis> Unix systems, but there are others. <emphasis role="distribution">Jessie</emphasis> will likely come with another init system by default since the current one is no longer suited to the dynamic nature of computing.
ja_jp: この本は Debian のデフォルトで使われる起動システム (<emphasis role="pkg">sysvinit</emphasis> パッケージによる実装) を説明します。このシステムは <emphasis>System V</emphasis> Unix システムから生まれて受け継がれましたが、他の起動システムも存在します。<emphasis role="distribution">Jessie</emphasis> はデフォルトで他の init システムを搭載するでしょう。なぜなら、現在の init システムはもはやコンピュータの動的性質には適さないからです。

source: <emphasis role="pkg">file-rc</emphasis> is a boot system with a very simple process. It keeps the principle of runlevels, but replaces the directories and symbolic links with a configuration file, which indicates to <command>init</command> the processes that must be started and their launch order.
ja_jp: <emphasis role="pkg">file-rc</emphasis> は極めて単純なやり方を使う起動システムです。<emphasis role="pkg">file-rc</emphasis> はランレベルの原則を守りますが、ディレクトリとシンボリックリンクを設定ファイルで置換します。この設定ファイルを使っては <command>init</command> に対して起動するプロセスとその起動順を伝えます。

source: The <command>upstart</command> system is still not perfectly tested on Debian. It is event based: init scripts are no longer executed in a sequential order but in response to events such as the completion of another script upon which they are dependent. This system, started by Ubuntu, is present in Debian <emphasis role="distribution">Wheezy</emphasis>, but is not the default; it comes, in fact, as a replacement for <emphasis role="pkg">sysvinit</emphasis>, and one of the tasks launched by <command>upstart</command> is to launch the scripts written for traditional systems, especially those from the <emphasis role="pkg">sysv-rc</emphasis> package.
ja_jp: Debian は <command>upstart</command> システムをまだ完全に試していません。<command>upstart</command> はイベントに基づく起動システムです: init スクリプトはもはや逐次的順序でなく、あるスクリプトが依存する他のスクリプトの完了等のイベントに応じて起動されます。Ubuntu の始めたこのシステムは Debian <emphasis role="distribution">Wheezy</emphasis> に含まれますが、デフォルトではありません; 実際のところ、<command>upstart</command> は <emphasis role="pkg">sysvinit</emphasis> の代替として始まりました。<command>upstart</command> の起動するタスクの 1 つが <emphasis role="pkg">sysv-rc</emphasis> パッケージの提供する伝統的なシステム向けに書かれたスクリプトを起動します。

source: Another new option that is gaining a lot of traction is <command>systemd</command>. Its approach is opposite to the previous systems; instead of preemptively launching all services, and having to deal with the question of scheduling, <command>systemd</command> chooses to start services on demand, somewhat along the principle of <command>inetd</command>. But this means that the boot system must be able to know how services are made available (it could be through a socket, a filesystem, or others), and thus requires small modifications of those services. It also provides backwards compatibility to System V init scripts.
ja_jp: 別の新しい選択肢は <command>systemd</command> で、多くの注目を集めています。<command>systemd</command> は前に挙げたシステムと対極のやり方を取ります; 事前に全てのサービスを起動して、起動順の問題を解決する代わりに、<command>systemd</command> は要求に応じてサービスを起動します。これは若干 <command>inetd</command> の原則と似ています。しかしこれは、起動システムは必ずサービスを利用可能にする方法を知らなければいけない (ソケット、ファイルシステム、その他を介すことで可能です) こと、を意味しており、サービスはこれに合わせて挙動を少し変更しなければいけません。さらに <command>systemd</command> は System V init スクリプトに対する後方互換性を提供します。

source: <primary>runlevel</primary>
ja_jp: <primary>ランレベル</primary>

source: <primary>client</primary><secondary>client/server architecture</secondary>
ja_jp: <primary>クライアント</primary><secondary>クライアント/サーバアーキテクチャ</secondary>
