Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: <literal>uucp</literal>: messages from the UUCP server (Unix to Unix Copy Program, an old protocol notably used to distribute e-mail messages);
it_it: <literal>uucp</literal> : I messaggi dal server UUCP (Unix to Unix Copy Program, un vecchio protocollo utilizzato in particolare per distribuire messaggi di posta elettronica);
ja_jp: <literal>uucp</literal>: UUCP サーバからのメッセージ (Unix to Unix Copy Program、とりわけ昔は電子メールメッセージの配送に使われていた古いプロトコル);

source: <literal>local0</literal> to <literal>local7</literal>: reserved for local use.
it_it: <literal>local0</literal> a <literal>LOCAL7</literal> : Riservato per uso locale.
ja_jp: <literal>local0</literal> から <literal>local7</literal>: ローカル利用向けに予約されています。

source: Each message is also associated with a priority level. Here is the list in decreasing order:
it_it: Ogni messaggio è anche associato a un livello di priorità. Ecco l'elenco in ordine decrescente:
ja_jp: さらに各メッセージは優先順位と関連付けられます。以下は優先度の高い順に挙げたリストです:

source: <literal>emerg</literal>: “Help!” There's an emergency, the system is probably unusable.
it_it: <literal>emerg</literal> : "Aiuto" C'è un emergenza, il sistema è probabilmente inutilizzabile.
ja_jp: <literal>emerg</literal>: 「助けて!」非常事態です。おそらくシステムが不安定になっています。

source: <literal>alert</literal>: hurry up, any delay can be dangerous, action must be taken immediately;
it_it: <literal>alert</literal> : Affrettati, ogni ritardo può essere pericoloso, bisogna agire immediatamente;
ja_jp: <literal>alert</literal>: 急いで下さい、遅れると危険な状態になります。すぐに何らかの措置が必要です;

source: <literal>crit</literal>: conditions are critical;
it_it: <literal>crit</literal> : Le condizioni sono critiche;
ja_jp: <literal>crit</literal>: 危機的状態です;

source: <literal>err</literal>: error;
it_it: <literal>err</literal> : Errore;
ja_jp: <literal>err</literal>: エラー;

source: <literal>warn</literal>: warning (potential error);
it_it: <literal>warn</literal> : Attenzione (potenziale errore);
ja_jp: <literal>warn</literal>: 警告 (潜在的エラー);

source: <literal>notice</literal>: conditions are normal, but the message is important;
it_it: <literal>notice</literal> : Le condizioni sono normali, ma il messaggio è importante;
ja_jp: <literal>notice</literal>: 正常な状態ですが、このメッセージは重要です;

source: <literal>info</literal>: informative message;
it_it: <literal>info</literal> : Messaggio informativo;
ja_jp: <literal>info</literal>: 有益なメッセージ;

source: <literal>debug</literal>: debugging message.
it_it: <literal>debug</literal> : Messaggio di debug.
ja_jp: <literal>debug</literal>: デバッグメッセージ。

source: The Configuration File
it_it: file di configurazione
ja_jp: 設定ファイル

source: The syntax of the <filename>/etc/rsyslog.conf</filename> file is detailed in the <citerefentry><refentrytitle>rsyslog.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page, but there is also HTML documentation available in the <emphasis role="pkg">rsyslog-doc</emphasis> package (<filename>/usr/share/doc/rsyslog-doc/html/index.html</filename>). The overall principle is to write “selector” and “action” pairs. The selector defines all relevant messages, and the actions describes how to deal with them.
it_it: La sintassi del file <filename>/ etc / rsyslog.conf</filename> viene specificata nella pagina di manuale <citerefentry><refentrytitle>rsyslog.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>, ma c'è anche la documentazione HTML disponibile nel pacchetto <emphasis role="pkg">rsyslog-doc</emphasis> ( <filename>/ usr / share / doc / rsyslog-doc / html / index.html</filename> ). Il principio generale è quello di scrivere coppie di "selettore" e "azione". Il selettore definisce tutti i messaggi rilevanti, e le azioni descrive come trattarli.
ja_jp: <filename>/etc/rsyslog.conf</filename> ファイルの構文は <citerefentry><refentrytitle>rsyslog.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> マニュアルページで詳しく説明されています。しかし、<emphasis role="pkg">rsyslog-doc</emphasis> パッケージから提供される HTML 文書 (<filename>/usr/share/doc/rsyslog-doc/html/index.html</filename>) も利用可能です。全般的な原則は「セレクタ」と「アクション」の組を書くことです。セレクタは全ての関連するメッセージを定義し、アクションはそれらのメッセージをどのように取り扱うかを定義します。

source: Syntax of the Selector
it_it: Sintassi del Selettore
ja_jp: セレクタの構文

source: The selector is a semicolon-separated list of <literal><replaceable>subsystem</replaceable>.<replaceable>priority</replaceable></literal> pairs (example: <literal>auth.notice;mail.info</literal>). An asterisk may represent all subsystems or all priorities (examples: <literal>*.alert</literal> or <literal>mail.*</literal>). Several subsystems can be grouped, by separating them with a comma (example: <literal>auth,mail.info</literal>). The priority indicated also covers messages of equal or higher priority; thus <literal>auth.alert</literal> indicates the <literal>auth</literal> subsystem messages of <literal>alert</literal> or <literal>emerg</literal> priority. Prefixed with an exclamation point (!), it indicates the opposite, in other words the strictly lower priorities; <literal>auth.!notice</literal>, thus, indicates messages issued from <literal>auth</literal>, with <literal>info</literal> or <literal>debug</literal> priority. Prefixed with an equal sign (=), it corresponds to precisely and only the priority indicated (<literal>auth.=notice</literal> only concerns messages from <literal>auth</literal> with <literal>notice</literal> priority).
it_it: Il selettore è un elenco separato da virgola di <literal><replaceable>sottosistema</replaceable> <replaceable>priorità</replaceable></literal> coppie (esempio: <literal>auth.notice;mail.info</literal>). Un asterisco può rappresentare tutti i sottosistemi o tutte le priorità (esempi:.. <literal>* Alert</literal> o posta <literal>*</literal>). Vari sottosistemi possono essere raggruppati, separandoli con una virgola (esempio: <literal>auth, mail.info</literal>). La priorità indicata copre anche i messaggi di priorità uguale o superiore: così <literal>auth.alert</literal> indica la <literal>auth</literal> sottosistema messaggi di <literal>alert</literal> o <literal>emerg</literal> letterale. (!) Preceduto da un punto esclamativo, indica il contrario, in altre parole le priorità rigorosamente inferiori;.! Auth <literal>preavviso</literal>, quindi, indica i messaggi emessi dal <literal>auth</literal>, con <literal>info</literal> o <literal>debug</literal> priorità. Preceduto da un segno di uguale (=), che corrisponde al proprio e solo la priorità indicata (<literal>auth. = Avviso</literal> riguarda solo i messaggi provenienti da <literal>auth</literal> con <literal>preavviso</literal> priorità).
ja_jp: セレクタは <literal><replaceable>subsystem</replaceable>.<replaceable>priority</replaceable></literal> の組からなるセミコロン区切りリストです (例: <literal>auth.notice;mail.info</literal>)。アスタリスクは全てのサブシステムまたは全ての優先順位を表します (例: <literal>*.alert</literal>、<literal>mail.*</literal>)。コンマで区切れば複数のサブシステムをグループ化することが可能です (例: <literal>auth,mail.info</literal>)。優先度は同じかより高い優先度を持つメッセージを意味します; このため <literal>auth.alert</literal> は <literal>alert</literal> および <literal>emerg</literal> 優先度を持つ <literal>auth</literal> サブシステムメッセージを表現します。優先度の前に感嘆符 (!) を付けると否定を表します。言い換えれば、その優先度より低い優先度です; このため <literal>auth.!notice</literal> は <literal>auth</literal> から発行された <literal>info</literal> および <literal>debug</literal> 優先度を持つメッセージを表現します。優先度の前に等号 (=) をつけると、その優先度だけを表します (<literal>auth.=notice</literal> は <literal>auth</literal> から発行された <literal>notice</literal> 優先度を持つメッセージを表現します)。

source: Each element in the list on the selector overrides previous elements. It is thus possible to restrict a set or to exclude certain elements from it. For example, <literal>kern.info;kern.!err</literal> means messages from the kernel with priority between <literal>info</literal> and <literal>warn</literal>. The <literal>none</literal> priority indicates the empty set (no priorities), and may serve to exclude a subsystem from a set of messages. Thus, <literal>*.crit;kern.none</literal> indicates all the messages of priority equal to or higher than <literal>crit</literal> not coming from the kernel.
it_it: Ogni elemento della lista sul selettore sostituisce gli elementi precedenti. È così possibile limitare un set o di escludere alcuni elementi da esso. Per esempio, <literal>kern.info;.! kern err</literal> i messaggi dei mezzi del kernel con priorità tra <literal>Informazioni</literal> e <literal>avvertire</literal> . Il <literal>nessuno</literal> priorità indica l'insieme vuoto (senza priorità), e può servire ad escludere un sottosistema da un insieme di messaggi. Così, <literal>. * Crit; kern.none</literal> indica tutti i messaggi di priorità pari o superiori <literal>crit</literal> non proveniente dal kernel.
ja_jp: セレクタリスト内の各要素は前の要素を上書きします。このため、セレクタリストからある組を制限したり、ある要素を除外することが可能です。例えば、<literal>kern.info;kern.!err</literal> はカーネルの発行した <literal>info</literal> と <literal>warn</literal> の間の優先度を持つメッセージを意味します。<literal>none</literal> 優先度は空の組 (優先度を持たない) を意味します。これはあるサブシステムをメッセージの組から除外するのに役立つかもしれません。そんなわけで、<literal>*.crit;kern.none</literal> はカーネルの発行した <literal>crit</literal> 以上の優先度を持つメッセージを意味します。

source: Syntax of Actions
it_it: Sintassi delle Azioni
ja_jp: アクションの構文

source: <emphasis>BACK TO BASICS</emphasis> The named pipe, a persistent pipe
it_it: <emphasis>Concetti di base</emphasis> Il named pipe, un tubo persistente
ja_jp: <emphasis>BACK TO BASICS</emphasis> 名前付きパイプ、永続的パイプ

source: A named pipe is a particular type of file that operates like a traditional pipe (the pipe that you make with the “|” symbol on the command line), but via a file. This mechanism has the advantage of being able to relate two unrelated processes. Anything written to a named pipe blocks the process that writes until another process attempts to read the data written. This second process reads the data written by the first, which can then resume execution.
it_it: Una named pipe è un particolare tipo di file che funziona come una pipe tradizionale (la pipe che si fa con il simbolo "|" sulla linea di comando), ma tramite un file. Questo meccanismo ha il vantaggio di essere in grado di collegare due processi indipendenti. Qualunque cosa scritta su alcuni blocchi named pipe, il processo li scrive fino a quando un altro processo tenta di leggere i dati scritti. Questo secondo processo legge i dati scritti dalla prima, che può poi riprendere l'esecuzione.
ja_jp: 名前付きパイプは特殊なファイル型で、古典的なパイプ (コマンドラインで「|」文字を使って表すパイプ) のように振る舞いますが、ファイルを経由します。名前付きパイプのメカニズムは 2 つの別々のプロセスを関連付けることが可能という利点を持っています。別のプロセスが名前付きパイプに書き込まれたデータを読む準備を整えるまで、名前付きパイプに書き込むプロセスはブロックされます。読み込み側のプロセスが書き込み側のプロセスの書き込んだデータを読み込むと、書き込み側のプロセスのブロックが解除されます。

source: Such a file is created with the <command>mkfifo</command> command.
it_it: Tale file viene creato con il comando <command>mkfifo</command>.
ja_jp: 名前付きパイプは <command>mkfifo</command> コマンドで作成します。

source: The various possible actions are:
it_it: Le varie azioni possibili sono:
ja_jp: 様々なアクションが利用可能です:

source: add the message to a file (example: <filename>/var/log/messages</filename>);
it_it: aggiungere il messaggio ad un file (esempio: <filename>/ var / log / messages</filename> );
ja_jp: ファイルにメッセージを追記する (例: <filename>/var/log/messages</filename>);

source: send the message to a remote <command>syslog</command> server (example: <literal>@log.falcot.com</literal>);
it_it: inviare il messaggio ad un server remoto <command>syslog</command> (esempio: <literal>@log.falcot.com</literal> );
ja_jp: メッセージをリモートの <command>syslog</command> サーバに送信する (例: <literal>@log.falcot.com</literal>);

source: send the message to an existing named pipe (example: <literal>|/dev/xconsole</literal>);
it_it: inviare il messaggio ad una named pipe esistente (esempio: <literal>| / dev / xconsole</literal> );
ja_jp: 既存の名前付きパイプにメッセージを送信する (例: <literal>|/dev/xconsole</literal>);

source: send the message to one or more users, if they are logged in (example: <literal>root,rhertzog</literal>);
it_it: inviare il messaggio ad uno o più utenti, se sono collegati in (esempio: <literal>root, rhertzog</literal> );
ja_jp: ログイン中の 1 人かそれ以上のユーザにメッセージを送信する (例: <literal>root,rhertzog</literal>);

source: send the message to all logged in users (example: <literal>*</literal>);
it_it: inviare un messaggio a tutti gli utenti registrati (ad esempio: <literal>*</literal> );
ja_jp: ログイン中の全ユーザにメッセージを送信する (例: <literal>*</literal>);

source: write the message in a text console (example: <literal>/dev/tty8</literal>).
it_it: scrivere il messaggio in una console di testo (ad esempio: <literal>/ dev/tty8</literal> ).
ja_jp: テキストコンソールにメッセージを書き込む (例: <literal>/dev/tty8</literal>)。

source: <emphasis>SECURITY</emphasis> Forwarding logs
it_it: <emphasis>SICUREZZA</emphasis> Inoltro dei log
ja_jp: <emphasis>SECURITY</emphasis> ログの転送

source: <primary>log</primary><secondary>forwarding</secondary>
it_it: <primary>log</primary><secondary>invio</secondary>
ja_jp: <primary>ログ</primary><secondary>転送</secondary>

source: It is a good idea to record the most important logs on a separate machine (perhaps dedicated for this purpose), since this will prevent any possible intruder from removing traces of their intrusion (unless, of course, they also compromise this other server). Furthermore, in the event of a major problem (such as a kernel crash), you have the logs available on another machine, which increases your chances of determining the sequence of events that caused the crash.
it_it: E' una buona idea registrare i log più importanti su una macchina separata (forse dedicata a questo scopo), questo per prevenire ogni possibilità che un intruso elimini le tracce di un'intrusione (a meno che, naturalmente, non comprometta anche questo altro server). Inoltre, in caso di un grave problema (come un crash del kernel), avete a disposizione i log su un altro computer, il che aumenta le possibilità di determinare la sequenza di eventi che hanno causato il crash.
ja_jp: 最重要のログを別のマシン (ログ記録専用マシン) に記録することをは良い考えです。なぜなら、そうすることで侵入者に不正侵入の形跡を削除されないようにすることが可能だからです (これを削除するにはもちろん、ログを記録させた別のマシンに不正アクセスするしかありません)。更に、深刻な問題 (カーネルクラッシュなど) が起きた場合に、他のマシンにログを記録しておけば、クラッシュを引き起こす一連の出来事を決定できる可能性を増やす事が可能です。

source: To accept log messages sent by other machines, you must reconfigure <emphasis>rsyslog</emphasis>: in practice, it is sufficient to activate the ready-for-use entries in <filename>/etc/rsyslog.conf</filename> (<literal>$ModLoad imudp</literal> and <literal>$UDPServerRun 514</literal>).
it_it: Per accettare messaggi di log inviati da altre macchine, è necessario configurare <emphasis>rsyslog</emphasis> : in pratica, è sufficiente attivare le voci <filename>/ etc / rsyslog.conf</filename> ( <literal>$ ModLoad imudp</literal> e <literal>UDPServerRun $ 514</literal> ).
ja_jp: 他のマシンから送信されたログメッセージを受け入れるには、<emphasis>rsyslog</emphasis> を再設定しなければいけません: 具体的に言えば、<filename>/etc/rsyslog.conf</filename> の中ですぐに利用できる状態になっているエントリ (<literal>$ModLoad imudp</literal> と <literal>$UDPServerRun 514</literal>) を有効化するだけで十分です。

source: The <command>inetd</command> Super-Server
it_it: Il super server <command>inetd</command>
ja_jp: <command>inetd</command> スーパーサーバ

source: Inetd (often called “Internet super-server”) is a server of servers. It executes rarely used servers on demand, so that they do not have to run continuously.
it_it: Inetd (spesso chiamato "Internet super-server") è un server di server. Esegue i server usati raramente on demand, in modo che non si debbano eseguire continuamente.
ja_jp: Inetd (通常「Internet スーパーサーバ」と呼ばれます) はサーバのサーバです。Inetd は要求に応じてまれに使われるサーバを実行します。そうすれば、まれにしか使われないサーバを常に実行しておく必要が無くなります。

source: The <filename>/etc/inetd.conf</filename> file lists these servers and their usual ports. The <command>inetd</command> command listens to all of them; when it detects a connection to any such port, it executes the corresponding server program.
it_it: Il file <filename>/ etc / inetd.conf</filename> elenca i server con le rispettive porte. Il comando <command>inetd</command> rimane in ascolto, quando rileva una connessione verso una qualsiasi di queste porte, esegue il programma corrispondente al server.
ja_jp: <filename>/etc/inetd.conf</filename> ファイルには、そのようなサーバとサーバの使うポート番号が書かれています。<command>inetd</command> コマンドはここで書かれた全てのポートをリッスンします; そのポートに対する接続を検出したら、<command>inetd</command> は対応するサーバプログラムを実行します。

source: <emphasis>DEBIAN POLICY</emphasis> Register a server in <filename>inetd.conf</filename>
it_it: <emphasis>Debian Policy</emphasis> Registrare un server in <filename>inetd.conf</filename>
ja_jp: <emphasis>DEBIAN POLICY</emphasis> <filename>inetd.conf</filename> へのサーバの登録

source: Packages frequently want to register a new server in the <filename>/etc/inetd.conf</filename> file, but Debian Policy prohibits any package from modifying a configuration file that it doesn't own. This is why the <command>updated-inetd</command> script (in the package with the same name) was created: It manages the configuration file, and other packages can thus use it to register a new server to the super-server's configuration.
it_it: I pacchetti spesso tentano di registrare un nuovo server nel file <filename>/ etc / inetd.conf</filename>, ma la Debian Policy vieta a qualsiasi pacchetto di modificare un file di configurazione che non possiede. Per questo motivo è stato creato lo script <command>updated-inetd</command> (nel pacchetto con lo stesso nome): gestisce il file di configurazione, e gli altri pacchetti possono quindi utilizzarlo per registrare un nuovo server nella configurazione del super-server.
ja_jp: 多くの場合 inetd を使うサーバのパッケージは <filename>/etc/inetd.conf</filename> ファイルに自分を登録することを望むのですが、Debian ポリシーはあるパッケージが提供する設定ファイルを他のパッケージが修正することを禁止しています。このため、<command>updated-inetd</command> スクリプト (同名のパッケージに含まれる) が作成されました: <command>updated-inetd</command> スクリプトは設定ファイルを管理し、他のパッケージはこれを使って、スーパーサーバの設定に新しいサーバを登録します。

source: Each significant line of the <filename>/etc/inetd.conf</filename> file describes a server through seven fields (separated by spaces):
it_it: Ogni riga significativa del file <filename>/ etc / inetd.conf</filename> descrive un server attraverso sette campi (separati da spazi):
ja_jp: <filename>/etc/inetd.conf</filename> ファイルの有効な各行は (スペースで区切られた) 7 つのフィールドで 1 つのサーバを表現します:

source: The TCP or UDP port number, or the service name (which is mapped to a standard port number with the information contained in the <filename>/etc/services</filename> file).
it_it: Il numero della porta TCP o UDP, o il nome del servizio (che si associa a un numero di porta standard con le informazioni contenute nel file <filename>/ etc / services</filename>).
ja_jp: TCP か UDP のポート番号、またはサービス名 (この場合、<filename>/etc/services</filename> ファイルに含まれる情報を使って標準的なポート番号に置換されます)。

source: The socket type: <literal>stream</literal> for a TCP connection, <literal>dgram</literal> for UDP datagrams.
it_it: Il tipo di socket: <literal>stream</literal> per una connessione TCP, <literal>dgram</literal> per datagrammi UDP.
ja_jp: ソケットタイプ: TCP 接続の場合 <literal>stream</literal>、 UDP データグラムの場合 <literal>dgram</literal>。

source: The protocol: <literal>tcp</literal> or <literal>udp</literal>.
it_it: Il protocollo: <literal>tcp</literal> o <literal>udp</literal> .
ja_jp: プロトコル: <literal>tcp</literal> または <literal>udp</literal>。

source: The options: two possible values: <literal>wait</literal> or <literal>nowait</literal>, to tell <command>inetd</command> whether it should wait or not for the end of the launched process before accepting another connection. For TCP connections, easily multiplexable, you can usually use <literal>nowait</literal>. For programs responding over UDP, you should use <literal>nowait</literal> only if the server is capable of managing several connections in parallel. You can suffix this field with a period, followed by the maximum number of connections authorized per minute (the default limit is 40).
it_it: Le opzioni: due valori possibili: <literal>wait</literal> o <literal>nowait</literal> , per dire a <command>inetd</command> se deve attendere o meno la fine del processo avviato prima di accettare un'altra connessione. Per le connessioni TCP, facilmente canalizzabili, di solito si può usare <literal>nowait</literal> . Per i programmi che rispondono su UDP, è necessario utilizzare <literal>nowait</literal> solo se il server è in grado di gestire diverse connessioni in parallelo. È possibile aggiungere a questo campo un suffisso con un punto, seguito dal numero massimo di connessioni autorizzate al minuto (il limite predefinito è 40).

source: The user name of the user under whose identity the server will run.
it_it: Il nome utente dell'utente sotto la cui identità verrà eseguito il server.
ja_jp: ユーザ名、サーバはこのユーザの権限で実行されます。

source: The full path to the server program to execute.
it_it: Il percorso completo del programma server da eseguire.
ja_jp: 実行するサーバプログラムのフルパス。

source: The arguments: this is a complete list of the program's arguments, including its own name (<literal>argv[0]</literal> in C).
it_it: Gli argomenti: si tratta di un elenco completo degli argomenti del programma, compreso il suo nome ( <literal>argv [0]</literal> in C).
ja_jp: 引数: これはプログラムの引数の完全なリストで、サーバプログラムの名前 (C 言語で言えば <literal>argv[0]</literal>) を含みます。

source: The following example illustrates the most common cases:
it_it: L'esempio seguente illustra i casi più comuni:
ja_jp: 最も一般的な場合、以下の例のようになります:

source: Excerpt from <filename>/etc/inetd.conf</filename>
it_it: Estratto dal <filename>/ etc / inetd.conf</filename>
ja_jp: <filename>/etc/inetd.conf</filename> からの抜粋

source: The <command>tcpd</command> program is frequently used in the <filename>/etc/inetd.conf</filename> file. It allows limiting incoming connections by applying access control rules, documented in the <citerefentry><refentrytitle>hosts_access</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page, and which are configured in the <filename>/etc/hosts.allow</filename> and <filename>/etc/hosts.deny</filename> files. Once it has been determined that the connection is authorized, <command>tcpd</command> executes the real server (like <command>/usr/bin/in.fingerd</command> in our example).
it_it: Il programma <command>tcpd</command> viene frequentemente utilizzato nel file <filename>/ etc / inetd.conf</filename>. Consente di limitare le connessioni in entrata mediante l'applicazione di regole di controllo dell'accesso, documentato nella pagina di manuale <citerefentry><refentrytitle>hosts_access</refentrytitle><manvolnum>5</manvolnum></citerefentry>, e che sono configurati nel file <filename>/ etc / hosts.allow</filename> e <filename>/ etc / hosts.deny</filename>. Una volta determinato che la connessione è autorizzata, <command>tcpd</command> esegue il server reale (come <command>/ usr / bin / in.fingerd</command> nel nostro esempio).

source: Wietse Venema, whose expertise in security has made him a renowned programmer, is the author of the <command>tcpd</command> program. He is also the main creator of Postfix, the modular e-mail server (SMTP, Simple Mail Transfer Protocol), designed to be safer and more reliable than <command>sendmail</command>, which features a long history of security vulnerabilities.
it_it: Wietse Venema, la cui esperienza in materia di sicurezza lo ha reso un programmatore conosciuto, è l'autore del programma <command>tcpd</command>. Egli è anche il principale artefice di Postfix, il server di posta elettronica modulare (SMTP, Simple Mail Transfer Protocol), progettato per essere più sicuro e più affidabile di <command>sendmail</command>, che dispone di una lunga storia di vulnerabilità di sicurezza.
ja_jp: Wietse Venema さんは <command>tcpd</command> プログラムの作者で、セキュリティ分野における専門知識によって名を挙げたプログラマです。彼はまた Postfix の主な考案者です。Postfix はモジュール式電子メールサーバ (SMTP、Simple Mail Transfer Protocol)で、セキュリティ脆弱性の長い歴史を特徴付ける <command>sendmail</command> よりも安全で信頼性が高くなるように設計されました。

source: <emphasis>ALTERNATIVE</emphasis> Other <command>inetd</command> commands
it_it: <emphasis>ALTERNATIVE</emphasis> Altri comandi <command>inetd</command>
ja_jp: <emphasis>ALTERNATIVE</emphasis> 他の <command>inetd</command> コマンド
