Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: The newly arrived <command>upstart</command> system is still not perfectly tested on Debian. It is event based: init scripts are no longer executed in a sequential order but in response to events such as the completion of another script upon which they are dependent. This system, started by Ubuntu, is present in Debian <emphasis role="distribution">Squeeze</emphasis>, but is not the default; it comes, in fact, as a replacement for <emphasis role="pkg">sysvinit</emphasis>, and one of the tasks launched by <command>upstart</command> is to launch the scripts written for traditional systems, especially those from the <emphasis role="pkg">sysv-rc</emphasis> package.
it_it: Il nuovo sistema arrivato <command>upstart</command> non è ancora perfettamente testato su Debian. E' basato su eventi: gli script di init non vengono più eseguiti in un ordine sequenziale, ma in risposta a eventi come il completamento di un altro script da cui essi dipendono. Questo sistema, avviato da Ubuntu, è presente in Debian <emphasis role="distribution">Squeeze</emphasis> , ma non è il predefinito, viene infatti in sostituzione di <emphasis role="pkg">sysvinit</emphasis>, e uno dei compiti avviati da <command>upstart</command> è quello di avviare gli script scritti per i sistemi tradizionali, in particolare quelli del pacchetto <emphasis role="pkg">sysv-rc</emphasis>.

source: Another new option is <command>systemd</command>, but it still lacks the maturity needed to be part of <emphasis role="distribution">Squeeze</emphasis>. Its approach is opposite to the previous systems; instead of preemptively launching all services, and having to deal with the question of scheduling, <command>systemd</command> chooses to start services on demand, somewhat along the principle of <command>inetd</command>. But this means that the boot system must be able to know how services are made available (it could be through a socket, a filesystem, or others), and thus requires small modifications of those services.
it_it: Un'altra nuova opzione è <command>systemd</command> , ma manca ancora la maturità necessaria per essere parte di <emphasis role="distribution">Squeeze</emphasis> . Il suo approccio è opposto ai sistemi precedenti, invece di lanciare preventivamente tutti i servizi, e di dover affrontare la questione della pianificazione, <command>systemd</command> sceglie di avviare i servizi on demand, alla stregua di <command>inetd</command> . Ma questo significa che il sistema di avvio deve essere in grado di sapere come i servizi vengono resi disponibili (potrebbe essere attraverso una socket, un filesystem, o altri), e quindi richiede piccole modifiche per tali servizi.

source: There are also other systems and other operating modes, such as <command>runit</command>, <command>minit</command>, or <command>initng</command>, but they are relatively specialized and not widespread.
it_it: Esistono anche altri sistemi e modalità operative, quali <command>runit</command> , <command>minit</command> , o <command>initng</command> , ma sono relativamente specializzati e non largamente diffusi.
ja_jp: 他の起動システムや他の動作モードも存在します。例えば <command>runit</command>、<command>minit</command>、<command>initng</command> 等です。しかしこれらは比較的特殊で広く使われていません。

source: <primary>level, runlevel</primary>
it_it: <primary>livello, runlevel</primary>
ja_jp: <primary>レベル、ランレベル</primary>

source: <command>init</command> distinguishes several runlevels, so it can switch from one to another with the <command>telinit <replaceable>new-level</replaceable></command> command. Immediately, <command>init</command> executes <command>/etc/init.d/rc</command> again with the new runlevel. This script will then start the missing services and stop those that are no longer desired. To do this, it refers to the content of the <filename>/etc/rc<replaceable>X</replaceable>.d</filename> (where <replaceable>X</replaceable> represents the new runlevel). Scripts starting with “S” (as in “Start”) are services to be started; those starting with “K” (as in “Kill”) are the services to be stopped. The script does not start any service that was already active in the previous runlevel.
it_it: <command>init</command> distingue tra diversi runlevel, in modo che possa passare da uno all'altro con il comando <command>telinit <replaceable>nuovo livello</replaceable></command>. Immediatamente, <command>init</command> esegue <command>/ etc / init.d / rc</command> ancora una volta con il nuovo runlevel. Questo script quindi avvia i servizi mancanti e ferma quelli che non sono più desiderati. Per fare ciò, si riferisce al contenuto del <filename>/ etc / rc <replaceable>X</replaceable> . d</filename> (Dove <replaceable>X</replaceable> rappresenta il nuovo runlevel). Script che iniziano con "S" (come in "Start") sono i servizi da avviare, quelle che iniziano con "K" (come in "Kill") sono i servizi che devono essere arrestati. Lo script non avvia alcun servizio che era già attivo nel runlevel precedente.
ja_jp: <command>init</command> は幾つかのランレベルを区別します。そうすることで、<command>telinit <replaceable>new-level</replaceable></command> コマンドを使ってあるランレベルから別のランレベルに切り替える事ができます。即座に <command>init</command> は新しいランレベルで <command>/etc/init.d/rc</command> を再実行します。このスクリプトは欠けているサービスを開始し、もはや不要なサービスを停止します。これを行うために、<command>init</command> は <filename>/etc/rc<replaceable>X</replaceable>.d</filename> の内容を参照します (ここで <replaceable>X</replaceable> は新しいランレベルです)。(「Start」の)「S」で始まるスクリプトは開始されるサービスです; (「Kill」の)「K」で始まるスクリプトは停止されるサービスです。このスクリプトは前のランレベルですでに起動されているサービスは開始しません。

source: By default, Debian uses four different runlevels:
it_it: Come impostazione predefinita, Debian utilizza quattro diversi runlevel:
ja_jp: デフォルトで、Debian は 4 つのランレベルを使います:

source: Level 0 is only used temporarily, while the computer is powering down. As such, it only contains many “K” scripts.
it_it: Il livello 0 è utilizzato solo temporaneamente, mentre il computer si sta spegnendo. Come tale, essa contiene solo molti script "K".
ja_jp: レベル 0 はコンピュータの電源を切る祭に一時的に使われるだけです。このため「K」スクリプトしか含まれません。

source: Level 1, also known as single-user mode, corresponds to the system in degraded mode; it includes only basic services, and is intended for maintenance operations where interactions with ordinary users are not desired.
it_it: Livello 1, noto anche come modalità utente singolo, corrisponde al sistema in modalità degradata; include solo i servizi basilari, ed è destinato ad operazioni di manutenzione in cui le interazioni con gli utenti ordinari non sono desiderate.
ja_jp: シングルユーザモードとしても知られるレベル 1 はシステムの機能抑制モードに相当します; このモードでは基本的なサービスだけが提供され、一般ユーザにマシンを使わせないメンテナンス作業を対象としています。

source: Level 2 is the level for normal operation, which includes networking services, a graphical interface, user logins, etc.
it_it: Il livello 2 è il livello per il normale funzionamento, che include servizi di rete, un'interfaccia utente grafica, account di accesso, ecc.
ja_jp: レベル 2 は通常動作用のモードで、ネットワークサービス、グラフィカルインターフェイス、ユーザログイン等の機能を使うことが出来ます。

source: Level 6 is similar to level 0, except that it is used during the shutdown phase that precedes a reboot.
it_it: Livello 6 è simile al livello 0, tranne che è utilizzato durante la fase di arresto che precede un riavvio.
ja_jp: レベル 6 はレベル 0 と似ていますが、再起動前のシャットダウン段階中に使われる点が異なります。

source: Other levels exist, especially 3 to 5. By default they are configured to operate the same way as level 2, but the administrator can modify them (by adding or deleting scripts in the corresponding <filename>/etc/rc<replaceable>X</replaceable>.d</filename> directories) to adapt them to particular needs.
it_it: Esistono altri livelli, in particolare 3 a 5. Di default sono configurati per operare allo stesso modo il livello 2, ma l'amministratore può modificare (aggiungendo o eliminando script nella corrispondente <filename>/ etc / rc <replaceable>X</replaceable> . d</filename> directory) per adattarsi a particolari esigenze.
ja_jp: 他のレベル、特に 3 から 5 まで、も存在します。デフォルトでこれらのランレベルはレベル 2 と同じ様に動作しますが、管理者はこれを変えて (ランレベルに対応する <filename>/etc/rc<replaceable>X</replaceable>.d</filename> ディレクトリにスクリプトを追加したりおよび削除したりすることで) 特定の要求に順応させる事が可能です。

source: Boot sequence of a computer running Linux
it_it: Sequenza di avvio di un computer Linux
ja_jp: Linux の動くコンピュータの起動シーケンス

source: <primary>initialization script</primary>
it_it: <primary>script di inizializzazione</primary>
ja_jp: <primary>初期化スクリプト</primary>

source: All the scripts contained in the various <filename>/etc/rc<replaceable>X</replaceable>.d</filename> directories are really only symbolic links — created upon package installation by the <command>update-rc.d</command> program — pointing to the actual scripts which are stored in <filename>/etc/init.d/</filename>. The administrator can fine tune the services available in each runlevel by re-running <command>update-rc.d</command> with adjusted parameters. The <citerefentry><refentrytitle>update-rc.d</refentrytitle><manvolnum>1</manvolnum></citerefentry> manual page describes the syntax in detail. Please note that removing all symbolic links (with the <literal>remove</literal> parameter) is not a good method to disable a service. Instead you should simply configure it to not start in the desired runlevel (while preserving the corresponding calls to stop it in the event that the service runs in the previous runlevel). Since <command>update-rc.d</command> has a somewhat convoluted interface, you may prefer using <command>rcconf</command> (from the <emphasis role="pkg">rcconf</emphasis> package) which provides a more user-friendly interface.
it_it: Tutti gli script contenuti nelle varie directory <filename>/etc/rc<replaceable>X</replaceable>.d</filename> sono solo link simbolici - creati con l'installazione del pacchetto per il programma <command>update-rc.d</command> - indicando gli script reali che vengono memorizzati in <filename>/etc/init.d/</filename>. L'amministratore può specializzare i servizi disponibili in ogni runlevel attraverso il comando <command>update-rc.d</command> con i parametri corretti. La pagina di manuale di <citerefentry><refentrytitle>update-rc.d</refentrytitle><manvolnum>1</manvolnum></citerefentry> descrive la sintassi in dettaglio. Si prega di notare che la rimozione di tutti i collegamenti simbolici (con il parametro <literal>remove</literal>) non è un buon metodo per disabilitare un servizio. Si dovrebbe invece semplicemente configurare quel servizio per non essere lanciato in quel particolare runlevel (pur conservando le chiamate corrispondenti a fermarlo nel caso in cui il servizio viene eseguito nel runlevel precedente). Dal momento che <command>update-rc.d</command> ha un'interfaccia un pò complicata, può essere preferibile usare <command>rcconf</command> (presente nel pacchetto <emphasis role="pkg">rcconf</emphasis>) che fornisce un'interfaccia più intuitiva.
ja_jp: 様々な <filename>/etc/rc<replaceable>X</replaceable>.d</filename> ディレクトリに含まれる全てのスクリプトは <filename>/etc/init.d/</filename> に格納されたスクリプトの実体を指すシンボリックリンク - パッケージのインストール時に <command>update-rc.d</command> プログラムによって作られます - に過ぎません。管理者は、調整したパラメータを与えて <command>update-rc.d</command> を再実行して、各ランレベルで利用可能なサービスを微調整する事が可能です。<command>update-rc.d</command> の構文は <citerefentry><refentrytitle>update-rc.d</refentrytitle><manvolnum>1</manvolnum></citerefentry> マニュアルページに詳しく説明されています。サービスを無効化する目的で、(<literal>remove</literal> パラメータを付けて) 全てのシンボリックリンクを削除するのは悪い方法であるという点に注意してください。その代わりに、単純に希望するランレベルでそのサービスを起動しないよう設定するべきです (一方で、万が一、前のランレベルでそのサービスが実行されている場合に備えて、そのランレベルでもサービスを停止するために必要なシンボリックリンクを確保しておくべきです)。<command>update-rc.d</command> は複雑なインターフェイスを持っているため、(<emphasis role="pkg">rcconf</emphasis> パッケージの提供する) <command>rcconf</command> を使いたいと思うかもしれません。<command>rcconf</command> はよりユーザにとって使い勝手の良いインターフェイスを提供します。

source: <emphasis>DEBIAN POLICY</emphasis> Restarting services
it_it: <emphasis>Debian Policy</emphasis> Riavvio dei servizi
ja_jp: <emphasis>DEBIAN POLICY</emphasis> サービスの再起動

source: <primary>service</primary><secondary>restart</secondary>
it_it: <primary>servizio</primary><secondary>riavvio</secondary>
ja_jp: <primary>サービス</primary><secondary>再起動</secondary>

source: <primary>restarting services</primary>
it_it: <primary>Riavvio dei servizi</primary>
ja_jp: <primary>サービスの再起動</primary>

source: The maintainer scripts for Debian packages will sometimes restart certain services to ensure their availability or get them to take certain options into account. The command that controls a service — <command>/etc/init.d/<replaceable>service</replaceable> <replaceable>operation</replaceable></command> — doesn't take runlevel into consideration, assumes (wrongly) that the service is currently being used, and may thus initiate incorrect operations (starting a service that was deliberately stopped, or stopping a service that is already stopped, etc.). Debian therefore introduced the <command>invoke-rc.d</command> program: this program must be used by maintainer scripts to run services initialization scripts and it will only execute the necessary commands. Note that, contrary to common usage, the <filename>.d</filename> suffix is used here in a program name, and not in a directory.
it_it: Gli script di manutenzione dei pacchetti Debian, a volte, riavvieranno alcuni servizi per garantire la loro disponibilità o per tenere conto di alcune opzioni nell'account. Il comando che controlla un servizio -<command>/etc/init.d/<replaceable>service</replaceable> <replaceable>operation</replaceable></command> - non tiene in considerazione i runlevel, si assume (erroneamente) che il servizio sia attualmente in uso, e possono quindi iniziare delle operazioni errate (a partire da un servizio che è stato deliberatamente fermato, o interrompere un servizio che è già stato arrestato, ecc.) Debian ha pertanto previsto il programma <command>invoke-rc.d</command>: il programma deve essere utilizzato dagli script del manutentore per eseguire gli script di inizializzazione dei servizi ed eseguirà solo quei comandi necessari. Si noti che, contrariamente all'uso comune, il suffisso <filename>.d</filename> è qui usato nel nome di un programma, e non in una directory.
ja_jp: Debian のメンテナスクリプトは、サービスを利用可能にするためか、特定のオプションを考慮するために、特定のサービスを再起動することがあります。サービスを操作するコマンド - <command>/etc/init.d/<replaceable>service</replaceable> <replaceable>operation</replaceable></command> - はランレベルを考慮しません。サービスが現在使用中であると (間違って) 仮定し、間違った操作 (故意に停止されたサービスの開始や既に停止されたサービスの停止など) を開始するかもしれません。このため Debian は <command>invoke-rc.d</command> プログラムを導入しました: メンテナスクリプト内でサービス初期化スクリプトを実行する場合は、必ずこのプログラムを使わなければいけません。このプログラムは必要なコマンドを実行するだけです。通常の使い方と異なり、ディレクトリではなくプログラム名に <filename>.d</filename> サフィックスが使われている点に注意してください。

source: Finally, <command>init</command> starts control programs for various virtual consoles (<command>getty</command>). It displays a prompt, waiting for a username, then executes <command>login <replaceable>user</replaceable></command> to initiate a session.
it_it: Infine, <command>init</command> avvia i programmi di controllo per le varie console virtuali ( <command>getty</command> ). Visualizza un prompt, in attesa di un nome utente, poi esegue <command>login <replaceable>user</replaceable></command> per iniziare una sessione.
ja_jp: 最後に、<command>init</command> は様々な仮想コンソール (<command>getty</command>) 用の制御プログラムを開始します。この制御プログラムがプロンプトを表示し、ユーザ名の入力を待ち、セッションを開始するために <command>login <replaceable>user</replaceable></command> を実行します。

source: <emphasis>VOCABULARY</emphasis> Console and terminal
it_it: <emphasis>VOCABOLARIO</emphasis> Console e terminale
ja_jp: <emphasis>VOCABULARY</emphasis> コンソールと端末

source: The first computers were usually separated into several, very large parts: the storage enclosure and the central processing unit were separate from the peripheral devices used by the operators to control them. These were part of a separate furniture, the “console”. This term was retained, but its meaning has changed. It has become more or less synonymous with “terminal”, being a keyboard and a screen.
it_it: I primi computer furono generalmente divisi in diversi componenti molto grandi: il contenitore di memorizzazione e l'unità di elaborazione centrale erano separate dai dispositivi periferici utilizzati dagli operatori per controllarli. Questi facevano parte di un mobile separato, la "console". Questo termine è stato mantenuto, ma il suo significato è cambiato. E 'diventato più o meno sinonimo di "terminale", essendo una tastiera e uno schermo.
ja_jp: 最初のコンピュータは通常、複数のとても大きな部品に分かれていました: ストレージ筐体と中央処理装置は、それらを操作するオペレータが使う周辺装置と分けられていました。分離された周辺装置、これが「コンソール」です。この用語は残りましたが、意味が変わりました。「コンソール」は「端末」と大体同義語になり、キーボードと画面を備えるようになりました。

source: With the development of computers, operating systems have offered several virtual consoles to allow for several independent sessions at the same time, even if there is only one keyboard and screen. Most GNU/Linux systems offer six virtual consoles (in text mode), accessible by typing the key combinations <keycombo action="simul"> <keycap>Control</keycap> <keycap>Alt</keycap> <keycap>F1</keycap> </keycombo> through <keycombo action="simul"> <keycap>Control</keycap> <keycap>Alt</keycap> <keycap>F6</keycap> </keycombo>.
it_it: Con lo sviluppo dei computer, i sistemi operativi hanno offerto diverse console virtuali per consentire diverse sessioni indipendenti contemporaneamente, anche se vi è solo una tastiera e schermo. La maggior parte dei sistemi GNU / Linux offrono sei console virtuali (in modalità testo), accessibili digitando le combinazioni di tasti da <keycombo action="simul"><keycap>Control</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> a <keycombo action="simul"><keycap>Control</keycap><keycap>Alt</keycap><keycap>F6</keycap></keycombo> .
ja_jp: コンピュータの開発と共に、オペレーティングシステムは、たとえもしマシンに 1 台のキーボードと画面しか接続されていなかったとしても、複数の独立したセッションを同時に取り扱う目的で、複数の仮想コンソールを提供するようになりました。多くの GNU/Linux システムでは、<keycombo action="simul"> <keycap>Control</keycap> <keycap>Alt</keycap> <keycap>F1</keycap> </keycombo> から <keycombo action="simul"> <keycap>Control</keycap> <keycap>Alt</keycap> <keycap>F6</keycap> </keycombo> までのキーの組み合わせをタイプすることで 6 つの仮想コンソールを切り替えられます (テキストモード)。

source: By extension, the terms “console” and “terminal” can also refer to a terminal emulator in a graphical X11 session (such as <command>xterm</command>, <command>gnome-terminal</command> or <command>konsole</command>).
it_it: Per estensione i termini "console" e "terminale" può anche riferirsi ad un emulatore di terminale in una sessione grafica X11 (come <command>xterm</command> , <command>gnome-terminal</command> o <command>konsole</command> ).
ja_jp: 転じて、「コンソール」と「端末」という用語はグラフィカル X11 セッションで使われる端末エミュレータ (<command>xterm</command>、<command>gnome-terminal</command>、<command>konsole</command> など) でも使われています。

source: Remote Login
it_it: Accesso remoto
ja_jp: リモートログイン

source: It is essential for an administrator to be able to connect to a computer remotely. Servers, confined in their own room, are rarely equipped with permanent keyboards and monitors — but they are connected to the network.
it_it: È essenziale per un amministratore di essere in grado di connettersi ad un computer remoto. I server, confinati nella propria stanza, sono raramente dotati di tastiere e monitor permanenti - ma sono connessi alla rete.
ja_jp: 管理者にとってコンピュータにリモートから接続できることは不可欠な要素です。専用の部屋に閉じ込められているサーバに、キーボードとモニタが常設されていることはめったにありません - しかしサーバはネットワークに繋がっています。

source: <emphasis>BACK TO BASICS</emphasis> Client, server
it_it: <emphasis>Concetti di base</emphasis> Client, server
ja_jp: <emphasis>BACK TO BASICS</emphasis> クライアント、サーバ

source: <primary>client/server architecture</primary>
it_it: <primary>architettura client/server</primary>

source: <primary>server</primary><secondary>client/server architecture</secondary>
it_it: <primary>server</primary><secondary>architettura client / server</secondary>
ja_jp: <primary>サーバ</primary><secondary>クライアント/サーバアーキテクチャ</secondary>

source: A system where several processes communicate with each other is often described with the “client/server” metaphor. The server is the program that takes requests coming from a client and executes them. It is the client that controls operations, the server doesn't take any initiative of its own.
it_it: Un sistema in cui diversi processi comunicano tra loro è spesso descritto con la metafora "client / server". Il server è il programma che prende le richieste provenienti da un client e le esegue. Il cliente controlla le operazioni, il server non prende alcuna iniziativa propria.
ja_jp: 複数のプロセスが互いに通信しているシステムはよく「クライアント/サーバ」に例えられます。サーバはクライアントからの要求に応じて、その要求を実行するプログラムです。操作を制御するのがクライアントで、サーバは制御の主導権を握りません。

source: <primary>login</primary><secondary>remote login</secondary>
it_it: <primary>accesso</primary><secondary>accesso remoto</secondary>
ja_jp: <primary>ログイン</primary><secondary>リモートログイン</secondary>

source: <primary>remote login</primary>
it_it: <primary>accesso remoto</primary>
ja_jp: <primary>リモートログイン</primary>

source: Remote Login: <command>telnet</command>
it_it: Accesso remoto: <command>telnet</command>

source: The <emphasis>telnet</emphasis> protocol, the oldest remote login service, is the worst in terms of security. Data and passwords are sent in clear text — that is, not encrypted — leaving them vulnerable to anyone snooping on the network. If necessary, take care to remove this obsolete service, that is no longer installed by default:
it_it: Il <emphasis>telnet</emphasis> protocollo, il più antico servizio di login remoto, è il peggiore in termini di sicurezza. I dati e le password vengono inviate in chiaro - proprio così, non criptato - lasciandoli vulnerabili a snooping da parte di tutti gli utenti della rete. Se necessario, fare attenzione a rimuovere questo servizio obsoleto, che non è più installato di default:

source: There is, however, an adaptation that corrects its most crippling defects; it uses SSL (Secure Socket Layer) to authenticate the partner and encrypt communications. The <emphasis>telnetd-ssl</emphasis> and <emphasis>telnet-ssl</emphasis> packages provide, respectively, the server and client software.
it_it: Vi è, tuttavia, un adattamento che consente di correggere i suoi difetti più paralizzanti, ma utilizza il protocollo SSL (Secure Socket Layer) per autenticare il partner e criptare le comunicazioni. I pacchetti <emphasis>telnetd-ssl</emphasis> e <emphasis>telnet-ssl</emphasis> forniscono, rispettivamente, il software server e client.

source: <emphasis>VOCABULARY</emphasis> Authentication, encryption
it_it: <emphasis>VOCABOLARIO</emphasis> Autenticazione, crittografia
ja_jp: <emphasis>VOCABULARY</emphasis> 認証、暗号化

source: When you need to give a client the ability to conduct or trigger actions on a server, security is important. You must ensure the identity of the client; this is authentication. This identity usually consists of a password that must be kept secret, or any other client could get the password. This is the purpose of encryption, which is a form of encoding that allows two systems to communicate confidential information on a public channel while protecting it from being readable to others.
it_it: Quando è necessario dare ad un client la possibilità di condurre o attivare azioni su un server, la sicurezza è importante. È necessario verificare l'identità del client, questa è l'autenticazione. Questa identità di solito consiste in una password che deve essere tenuta segreta, o qualsiasi altro client potrebbe ottenere la password. Questo è lo scopo della crittografia, che è una forma di codifica che consente a due sistemi di comunicare informazioni riservate su un canale pubblico, proteggendolo dall'essere leggibile agli altri.
ja_jp: サーバ上でクライアントが活動を行ったり始めることを許可する必要がある場合、安全性が重要です。必ずクライアントの本人確認を必要とします; これが認証です。通常、本人確認はパスワードを使って行います。パスワードは人目に触れさせてはいけません。さもなくば、他のクライアントがパスワードを取得できてしまいます。これが暗号化の目的です。暗号化は符号化の形をしています。暗号化することで、2 つのシステムが公衆回線を使って秘密の情報を他人に読まれないように保護した状態でやり取りすることが可能になります。
