Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: Authentication and encryption are often mentioned together, both because they are frequently used together, and because they are usually implemented with similar mathematical concepts.
it_it: L'autenticazione e la crittografia sono spesso menzionati insieme, sia perché essi sono spesso usati insieme, sia perché sono di solito implementate con simili concetti matematici.
ja_jp: 認証と暗号化はしばしば一緒に言及されます。なぜなら両者は同時に使われる事が多く、よく似たの数学的概念を基に実行される事が多いからです。

source: Secure Remote Login: SSH
it_it: Accesso Remoto Sicuro: SSH
ja_jp: 安全なリモートログイン: SSH

source: <primary>Secure Shell</primary>
it_it: <primary>Shell Sicura</primary>

source: <emphasis>CULTURE</emphasis> SSH compared to RSH
it_it: <emphasis>CULTURA</emphasis> SSH rispetto a RSH

source: SSH tools provide secure variants of the programs from the classic RSH (Remote Shell) family — <command>rsh</command>, <command>rlogin</command>, and <command>rcp</command>. These are still available in the <emphasis role="pkg">rsh-server</emphasis> and <emphasis role="pkg">rsh-client</emphasis> packages, but their usage is strongly discouraged.
it_it: Gli strumenti SSH forniscono varianti sicure dei programmi dalla classica famiglia RSH (Remote Shell) - <command>rsh</command> , <command>rlogin</command> , e <command>rcp</command> . Questi sono ancora disponibili nei pacchetti <emphasis role="pkg">rsh-server</emphasis> e <emphasis role="pkg"> rsh-client</emphasis>, ma il loro uso è fortemente sconsigliato.

source: SSH also offers two file transfer services. <command>scp</command> is a command line tool that can be used like <command>cp</command>, except that any path to another machine is prefixed with the machine's name, followed by a colon.
it_it: SSH offre anche due servizi di trasferimento di file. <command>scp</command> è uno strumento a riga di comando che può essere utilizzato come <command>cp</command> , tranne che qualsiasi percorso a un altro computer è prefissato con il nome della macchina, seguito da due punti.
ja_jp: さらに SSH は 2 種類のファイル転送サービスを提供します。<command>scp</command> は <command>cp</command> のように使えるコマンドラインツールです。ただし、他のマシンへのパスを表記するには、パスの前にそのマシンの名前とコロンを付ける点が異なります。

source: <computeroutput>$ </computeroutput><userinput>scp file machine:/tmp/</userinput>
it_it: <computeroutput>$ </computeroutput><userinput>scp file macchina:/tmp/</userinput>

source: <command>sftp</command> is an interactive command, similar to <command>ftp</command>. In a single session, <command>sftp</command> can transfer several files, and it is possible to manipulate remote files with it (delete, rename, change permissions, etc.).
it_it: <command>sftp</command> è un comando interattivo, simile a <command>ftp</command> . In una singola sessione, <command>sftp</command> in grado di trasferire più file, ed è possibile manipolare i file remoti con esso (cancellare, rinominare, modificare le autorizzazioni, ecc.).
ja_jp: <command>sftp</command> は対話的コマンドで <command>ftp</command> に似ています。<command>sftp</command> は単一のセッションの中で、複数のファイルを転送したり、リモートのファイルを操作 (削除、リネーム、パーミッション変更など) することが可能です。

source: Debian uses OpenSSH, a free version of SSH maintained by the <command>OpenBSD</command> project (a free operating system based on the BSD kernel, focused on security) and fork of the original SSH software developed by the SSH Communications Security Corp company, of Finland. This company initially developed SSH as free software, but eventually decided to continue its development under a proprietary license. The OpenBSD project then created OpenSSH to maintain a free version of SSH.
it_it: Debian utilizza OpenSSH, una versione free di SSH, gestito dal progetto <command>OpenBSD</command> (un sistema operativo libero basato sul kernel BSD, incentrato sulla sicurezza) e fork del software originale SSH sviluppato dalla società SSH Communications Security Corp, della Finlandia. Questa società ha inizialmente sviluppato SSH come software libero, ma alla fine ha deciso di continuare il suo sviluppo sotto una licenza proprietaria. Il progetto OpenBSD quindi ha creato OpenSSH per mantenere una versione free di SSH.
ja_jp: Debian は OpenSSH を使います。OpenSSH は SSH のフリー版で <command>OpenBSD</command> (BSD カーネルに基づき、安全性を重要視するフリーオペレーティングシステム) によって保守されており、フィンランドの SSH Communications Security Corp 社が開発した元祖 SSH ソフトウェアのフォークです。SSH Communications Security Corp 社は当初 SSH をフリーソフトウェアとして開発していましたが、結局プロプライエタリライセンスで開発を続けることを決定しました。そして OpenBSD プロジェクトが SSH のフリー版として保守するために OpenSSH を作成しました。

source: A “fork”, in the software field, means a new project that starts as a clone of an existing project, and that will compete with it. From there on, both software will usually quickly diverge in terms of new developments. A fork is often the result of disagreements within the development team.
it_it: Un "fork", in materia di software, significa un nuovo progetto che inizia come un clone di un progetto esistente, e che compete con esso. Da lì in poi, entrambi i software di solito divergono rapidamente in termini di nuovi sviluppi. Un fork è spesso il risultato di disaccordi all'interno del team di sviluppo.
ja_jp: ソフトウェアの分野で「フォーク」とは、既存のプロジェクトのクローンとして始まった新しいプロジェクトを意味しており、既存のプロジェクトの対抗馬です。通常、両方のソフトウェアは新しい開発という観点ですぐに別のものになっていきます。フォークは開発チーム内の意見の不一致によって起こる事が多いです。

source: The option to fork a project is a direct result of the very nature of free software; a fork is a healthy event when it enables the continuation of a project as free software (for example in case of license changes). A fork arising from technical or personal disagreements is often a waste of human resources; another resolution would be preferable. Mergers of two projects that previously went through a prior fork are not unheard of.
it_it: L'opzione per il fork di un progetto è una diretta conseguenza della natura stessa del software libero, un fork è un evento sano quando permette la continuazione di un progetto come software gratuito (per esempio in caso di cambiamenti nella licenza). Un fork derivante da divergenze tecniche o di personale è spesso uno spreco di risorse umane; un'altra soluzione sarebbe preferibile. Fusioni di due progetti che in precedenza hanno attraversato un fork precedentemente non sono inedite.
ja_jp: プロジェクトをフォークするという選択肢は、フリーソフトウェアの本質そのものから生じた、直接的な結果です; フリーソフトウェアとしてのプロジェクトの存続を可能にするための (例えばライセンスが変更された場合などの) フォークは健全な出来事です。技術的および個人的な意見の不一致によって起こるフォークは通常人的資源の無駄です; 別の解決策が望まれます。以前にフォークした 2 つのプロジェクトの合併は未だ前例がありません。

source: Since <emphasis role="distribution">Etch</emphasis>, OpenSSH is split into two packages. The client part is in the <emphasis role="pkg">openssh-client</emphasis> package, and the server is in the <emphasis role="pkg">openssh-server</emphasis> package. The <emphasis role="pkg">ssh</emphasis> meta-package depends on both parts and facilitates installation of both (<command>apt-get install ssh</command>).
it_it: Da <emphasis role="distribution">Etch</emphasis>, OpenSSH è divisa in due pacchetti. La parte client è nel pacchetto <emphasis role="pkg">openssh-client</emphasis>, mentre il server è nel pacchetto <emphasis role="pkg">openssh-server</emphasis>. Il metapacchetto <emphasis role="pkg">ssh</emphasis> dipende da entrambe le parti e facilita l'installazione di entrambi ( <command>apt-get install ssh</command> ).

source: <emphasis>GOING FURTHER</emphasis> Hardware acceleration for SSH
it_it: <emphasis>APPROFONDIMENTO</emphasis> Accelerazione hardware per SSH

source: <primary>OpenSSL</primary><secondary>hardware acceleration</secondary>
it_it: <primary>OpenSSL</primary><secondary>l'accelerazione hardware</secondary>

source: Some hardware provides native support of mathematical functions used by encryption, which can speed up the required calculations, thus increasing performance of some tools (and lightening the load on the main processor). These tools notably include the OpenSSL library, which is in turn used by OpenSSH.
it_it: Alcuni hardware forniscono il supporto nativo di funzioni matematiche utilizzate per la crittografia, in grado di accelerare i calcoli necessari, aumentando così le prestazioni di alcuni strumenti (e alleggerendo il carico sul processore principale). Questi strumenti comprendono in particolare la libreria OpenSSL, che è a sua volta utilizzato da OpenSSH.

source: Although a project for standardization of drivers is underway (notably at the kernel level), the variety of hardware is still managed inequitably and heterogeneously. For example, the Padlock system included in Via C3 processors is only partially supported. While the Linux kernel does offer various encryption algorithms, the OpenSSL 0.9.8 library in <emphasis role="distribution">Squeeze</emphasis> only handles delegation of AES encryption to the hardware dedicated to that purpose, but not the SHA algorithms; you have to recompile it with a patch. <ulink type="block" url="http://www.logix.cz/michal/devel/padlock/" />
it_it: Anche se un progetto per la standardizzazione dei driver è in corso (in particolare a livello di kernel), la varietà di hardware è tuttora gestita ingiustamente ed eterogeneamente. Ad esempio, il sistema Padlock incluso nel processore Via C3 è solo parzialmente supportato. Sebbene il kernel Linux non offra vari algoritmi di crittografia, la libreria OpenSSL 0.9.8 in <emphasis role="distribution">Squeeze</emphasis> gestisce solo la delegazione per la crittografia AES per l'hardware dedicato a questo scopo, ma non gli algoritmi SHA, devi ricompilare il pacchetto con una patch. <ulink type="block" url="http://www.logix.cz/michal/devel/padlock/" />

source: Key-Based Authentication
it_it: Autenticazione basata su chiave
ja_jp: 鍵認証方式

source: Each time someone logs in over SSH, the remote server asks for a password to authenticate the user. This can be problematic if you want to automate a connection, or if you use a tool that requires frequent connections over SSH. This is why SSH offers a key-based authentication system.
it_it: Ogni volta che qualcuno si collega tramite SSH il server remoto richiede una password per autenticare l'utente. Questo può essere problematico se si vuole automatizzare una connessione, o se si utilizza uno strumento che richiede collegamenti frequenti su SSH. È per questo che SSH offre un sistema di autenticazione basato su chiave.
ja_jp: リモートサーバはユーザを認証するために SSH でログインする人に対して毎回パスワードを尋ねます。これは、接続を自動化したい場合や SSH 経由で頻繁に接続を行うツールを使う場合に問題です。このため、SSH は鍵認証システムを提供しています。

source: The user generates a key pair on the client machine with <command>ssh-keygen -t rsa</command>; the public key is stored in <filename>~/.ssh/id_rsa.pub</filename>, while the corresponding private key is stored in <filename>~/.ssh/id_rsa</filename>. The user then uses <command>ssh-copy-id <replaceable>server</replaceable></command> to add their public key to the <filename>~/.ssh/authorized_keys</filename> file on the server. If the private key was not protected with a “passphrase” at the time of its creation, all subsequent logins on the server will work without a password. Otherwise, the private key must be decrypted each time by entering the passphrase. Fortunately, <command>ssh-agent</command> allows us to keep private keys in memory to not have to regularly re-enter the password. For this, you simply use <command>ssh-add</command> (once per work session) provided that the session is already associated with a functional instance of <command>ssh-agent</command>. Debian activates it by default in graphical sessions, but this can be deactivated by changing <filename>/etc/X11/Xsession.options</filename>. For a console session, you can manually start it with <command>eval $(ssh-agent)</command>.
it_it: L'utente genera una coppia di chiavi sulla macchina client con <command>ssh-keygen -t rsa</command>; ka chiava pubblica è conservata in <filename>~/.ssh/id_rsa.pub</filename>, mentre la corrispondente chiave privata è conservata in <filename>~/.ssh/id_rsa</filename>. Successivamente l'utente usa <command>ssh-copy-id <replaceable>server</replaceable></command> per aggiungere la propria chiave pubblica nel file <filename>~/.ssh/authorized_keys</filename> presente sul server. Se la chiave privata non è stata protetta con una "passphrase" al momento della sua creazione, tutti gli accessi successivi sul server funzioneranno senza una password. In caso contrario, la chiave privata dovrà essere decifrata ogni volta inserendo la "passphrase". Fortunatamente, <command>ssh-agent</command> ci permette di mantenere in memoria le chiavi private in modo da non dover reinserire nuovamente la password. Per questo, è sufficiente utilizzare <command>ssh-add</command> (una volta per ogni sessione di lavoro), a condizione che la sessione sia già associata ad un'istanza funzionale di <command>ssh-agent</command>. Debian la attiva come impostazione predefinita nelle sessioni grafiche, ma è possibile disattivare questo comportamento cambiando <filename>/etc/X11/Xsession.options</filename>. Per una sessione della console, è possibile avviarla manualmente tramite <command>eval $(ssh-agent)</command>.
ja_jp: ユーザはクライアントマシンで <command>ssh-keygen -t rsa</command> を使って鍵ペアを生成します; 公開鍵は <filename>~/.ssh/id_rsa.pub</filename> に保存され、一方で対応する秘密鍵は <filename>~/.ssh/id_rsa</filename> に保存されます。その後ユーザは <command>ssh-copy-id <replaceable>server</replaceable></command> を使って、自分の公開鍵をサーバの <filename>~/.ssh/authorized_keys</filename> ファイルに追加します。秘密鍵を生成した際に「パスフレーズ」で保護しなかった場合、公開鍵を登録したサーバに対する以降全てのログインでパスワードは不要です。そうでなければ、秘密鍵を使う際は毎回パスフレーズを入力して復号化しなければいけません。幸いなことに、<command>ssh-agent</command> を使えば秘密鍵がメモリ内に保存され、パスワードを日常的に再入力しなくても良くなります。これを実現するには、セッションが既に機能する<command>ssh-agent</command> のインスタンスに関連付けられている条件下で、単純に (作業セッション毎に 1 回) <command>ssh-add</command> を使ってください。Debian はグラフィカルセッションではデフォルトでこれを有効化しますが、<filename>/etc/X11/Xsession.options</filename> を変更すれば無効化することも可能です。コンソールセッションでは、<command>eval $(ssh-agent)</command> を使って手作業で開始できます。

source: <emphasis>SECURITY</emphasis> Protection of the private key
it_it: <emphasis>SICUREZZA</emphasis> Protezione della chiave privata
ja_jp: <emphasis>SECURITY</emphasis> 秘密鍵の保護

source: Whoever has the private key can login on the account thus configured. This is why access to the private key is protected by a “passphrase”. Someone who acquires a copy of a private key file (for example, <filename>~/.ssh/id_rsa</filename>) still has to know this phrase in order to be able to use it. This additional protection is not, however, impregnable, and if you think that this file has been compromised, it is best to disable that key on the computers in which it has been installed (by removing it from the <filename>authorized_keys</filename> files) and replacing it with a newly generated key.
it_it: Chi ha la chiave privata può effettuare il login sull'account così configurato. Per questo motivo l'accesso alla chiave privata viene protetta da una "password". Chi viene in possesso di una copia di una chiave privata (ad esempio, <filename>~ / .ssh / Id_rsa</filename> ) deve comunque sapere questa frase per essere in grado di utilizzarla. Questa protezione aggiuntiva non è, tuttavia, inespugnabile, e se si pensa che questo file è stata compromesso, è meglio disabilitare la chiave sui computer in cui è stata installata (rimuovendola dal file <filename>authorized_keys</filename>) e sostituendola con una nuova chiave generata.
ja_jp: 秘密鍵を持つものは誰でも、対応する公開鍵を登録したアカウントにログインすることが可能です。このため、秘密鍵の利用は「パスフレーズ」で保護されています。秘密鍵ファイル (例えば <filename>~/.ssh/id_rsa</filename>) のコピーを不正に入手した人が秘密鍵を使うためには、パスフレーズを知らなければいけません。しかしながら、この追加的な保護は堅固ではありません。秘密鍵ファイルが不正に使われていると感じた場合、その秘密鍵に対応する公開鍵をインストールしたコンピュータでその公開鍵を使わないで (<filename>authorized_keys</filename> ファイルから公開鍵を削除して)、新しく生成した鍵で公開鍵を置き換えるのが最良です。

source: <emphasis>CULTURE</emphasis> OpenSSL flaw in Debian <emphasis role="distribution">Etch</emphasis>
it_it: <emphasis>CULTURA</emphasis> OpenSSL difettosa in Debian <emphasis role="distribution">Etch</emphasis>
ja_jp: <emphasis>CULTURE</emphasis> Debian <emphasis role="distribution">Etch</emphasis> における OpenSSL の脆弱性

source: The OpenSSL library, as initially provided in Debian <emphasis role="distribution">Etch</emphasis>, had a serious problem in its random number generator (RNG). Indeed, the Debian maintainer had made a change in order for the library to not be the source of warnings for programs using it and that would be analyzed by memory testing tools like <command>valgrind</command>. Unfortunately, this change also meant that the RNG was employing only one source of entropy corresponding to the process number (PID) whose 32,000 possible values do not offer enough randomness. <ulink type="block" url="http://www.debian.org/security/2008/dsa-1571" />
it_it: La libreria OpenSSL, come inizialmente previsto in Debian <emphasis role="distribution">Etch</emphasis> , ha avuto un problema serio nel suo generatore di numeri casuali (RNG). Infatti, il maintainer Debian ha fatto un cambiamento in modo che la libreria non fosse la fonte di avvertenze per i programmi che la utilizzano e che potrebbero essere analizzati con strumenti di test di memoria, come ad esempio <command>valgrind</command> . Sfortunatamente, questo cambiamento significa anche che la RNG impiegasse una sola fonte di entropia, corrispondente al numero di processo (PID) i cui possibili valori, 32.000, non offrono abbastanza casualità. <ulink type="block" url="http://www.debian.org/security/2008/dsa-1571" />

source: Specifically, whenever OpenSSL was used to generate a key, it always produced a key within a known set of hundreds of thousands of keys (32,000 multiplied by a small number of key lengths). This affected SSH keys, SSL keys, and X.509 certificates used by numerous applications, such as OpenVPN. A cracker had only to try all of the keys to gain unauthorized access. To reduce the impact of the problem, the SSH daemon was modified to refuse problematic keys that are listed in the <emphasis role="pkg">openssh-blacklist</emphasis> and <emphasis role="pkg">openssh-blacklist-extra</emphasis> packages. Additionally, the <command>ssh-vulnkey</command> command allows identification of possibly compromised keys in the system.
it_it: Nello specifico, quando OpenSSL viene impiegato per generare una chiave, produce sempre una chiave all'interno di una serie nota di centinaia di migliaia di chiavi (32.000 moltiplicato per un piccolo numero di lunghezze di chiave). Questo influenza le chiavi SSH, le chiavi SSL, ed i certificati X.509 utilizzati da numerose applicazioni, come ad esempio OpenVPN. Un cracker doveva quindi solo provare tutte le chiavi per ottenere un accesso non autorizzato. Per ridurre l'impatto del problema, il demone SSH è stato modificato in modo da rifiutare le chiavi problematiche che sono elencate nei pacchetti <emphasis role="pkg">openssh-blacklist</emphasis> e <emphasis role="pkg">openssh-blacklist-extra</emphasis>. Inoltre, il comando <command>ssh-vulnkey</command> consente l'identificazione delle chiavi eventualmente compromesse nel sistema.
ja_jp: 具体的に言えば、OpenSSL を使って鍵を生成した場合、生成された鍵は常に数十万 (32,000 かける鍵長種数) の既知の範囲内に有る鍵の内の 1 つになります。この脆弱性は、例えば OpenVPN など数多くのアプリケーションが使う SSH 鍵、SSL 鍵、X.509 証明書に、影響を与えました。クラッカーは、鍵を全種類試すだけで、不正にアクセスすることが可能でした。この問題の影響を減らす目的で、SSH デーモンは <emphasis role="pkg">openssh-blacklist</emphasis> と <emphasis role="pkg">openssh-blacklist-extra</emphasis> パッケージにリストされている問題の有る鍵を拒否するように変更されました。更に、<command>ssh-vulnkey</command> コマンドを使えば、システム内からこの脆弱性の影響を受けているかもしれない鍵を識別することが可能です。

source: A more thorough analysis of this incident brings to light that it is the result of multiple (small) problems, both at the OpenSSL project, as well as with the Debian package maintainer. A widely used library like OpenSSL should — without modifications — not generate warnings when tested by <command>valgrind</command>. Furthermore, the code (especially the parts as sensitive as the RNG) should be better commented to prevent such errors. The Debian maintainer, for his part, wanting to validate his modifications with the OpenSSL developers, simply explained his modifications without providing them the corresponding patch to review. He also did not clearly identify himself as the maintainer of the corresponding Debian package. Finally, in his maintenance choices, the maintainer did not clearly document the changes made to the original code; all the modifications are effectively stored in a Subversion repository, but they ended up all lumped into one single patch during creation of the source package.
it_it: Un'analisi più approfondita di questo incidente mette in luce che è il risultato di molteplici (piccoli) problemi, sia a livello del progetto OpenSSL, così come con il maintainer del pacchetto Debian. Una libreria ampiamente utilizzata come OpenSSL non dovrebbe - senza modifiche - generare avvisi quando viene testata da <command>valgrind</command>. Inoltre, il codice (in particolare quelle parti tanto delicate come la RNG) dovrebbe essere meglio commentato per evitare tali errori. Il maintainer di Debian, da parte sua, voleva confermare le sue modifiche con gli sviluppatori di OpenSSL, semplicemente spiegando le sue modifiche senza fornire loro la corrispondente patch da rivedere. Egli, inoltre, non si è chiaramente identificato come il maintainer del pacchetto Debian corrispondente. Infine, nelle sue scelte di manutenzione, il manutentore non ha chiaramente documentato le modifiche apportate al codice originale, tutte le modifiche sono effettivamente memorizzate in un repository Subversion, ma finirono tutte concentrate in una singola patch durante la creazione del pacchetto sorgente.
ja_jp: この出来事をいっそう詳しく調べると、これは OpenSSL プロジェクトおよび Debian パッケージメンテナ双方の持つ多数の (小さな) 問題の結果であるということが、明らかになります。OpenSSL のように広く使われるライブラリは - 修正せずとも - <command>valgrind</command> でテストした時に警告を出すべきではありません。更に、コード (特に RNG と同様に慎重な箇所) はこのような誤解を避ける目的で詳しい注釈を付けられるべきです。Debian メンテナについて言えば、彼は OpenSSL 開発者から自分の修正に対する検証を受けることを望んでいながら、自分の修正について詳しく説明せず、修正の検証に必要なパッチを OpenSSL 開発者に提供することもしませんでした。さらに、彼は自分が OpenSSL に対応する Debian パッケージのメンテナであることを明らかにしませんでした。最終的に、彼のメンテナンス上の方針で、メンテナは文書の中で元のコードに対して行った修正を明らかにしませんでした; 全ての修正は Subversion リポジトリに効果的に保存されますが、最終的に全ての修正はソースパッケージの作成中に 1 つのパッチにまとめられました。

source: It is difficult under such conditions to find the corrective measures to prevent such incidents from recurring. The lesson to be learned here is that every divergence Debian introduces to upstream software must be justified, documented, submitted to the upstream project when possible, and widely publicized. It is from this perspective that the new source package format (“3.0 (quilt)”) and the Debian patch tracker were developed. <ulink type="block" url="http://patch-tracker.debian.org" />
it_it: In queste condizioni è difficile trovare le misure correttive per evitare il ripetersi di questi incidenti. La lezione da trarre è che ogni divergenza che Debian introduce nel software principale deve essere giustificato, documentato, presentato nel progetto principale, quando possibile, e ampiamente pubblicizzato. E' in base a questa prospettiva che sono stati sviluppati il nuovo formato dei pacchetti sorgente ("3.0 (quilt)") e il tracker patch di Debian. <ulink type="block" url="http://patch-tracker.debian.org" />
ja_jp: このような状況下で、これと同様の出来事が繰り返されることを避けるための適切な矯正措置を見つけるのは難しいです。ここで覚えておくべき教訓は、Debian が上流開発ソフトウェアに対して導入した全ての変更は、正当化され、文書化され、可能であれば上流プロジェクトに提出され、広く公開されなければいけない、ということです。この視点から、新しいソースパッケージフォーマット (「3.0 (quilt)」) と Debian パッチ追跡システムが開発されました。<ulink type="block" url="http://patch-tracker.debian.org" />

source: Using Remote X11 Applications
it_it: Utilizzo di applicazioni X11 remote
ja_jp: リモートの X11 アプリケーションを使う
