Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: <primary>backup</primary><secondary>on tape</secondary>
it_it: <primary>il backup</primary><secondary>su nastro</secondary>
ja_jp: <primary>バックアップ</primary><secondary>テープへの</secondary>

source: <primary>tape, backup</primary>
it_it: <primary>nastro, backup</primary>
ja_jp: <primary>テープ、バックアップ</primary>

source: Historically, the simplest means of making a backup on Unix was to store a <emphasis>TAR</emphasis> archive on a tape. The <command>tar</command> command even got its name from “Tape ARchive”.
it_it: Storicamente, il mezzo più semplice per fare un backup in Unix è stato quello di memorizzare un archivio <emphasis>TAR</emphasis> su un nastro. Il comando <command>tar</command> prende il suo nome da "tape archive".
ja_jp: 歴史的に言って、Unix で最も簡単にバックアップを作成する手段は <emphasis>TAR</emphasis> アーカイブをテープに保存する方法でした。<command>tar</command> コマンドは「Tape ARchive」から命名されています。

source: Hot Plugging: <emphasis>hotplug</emphasis>
it_it: Collegamento a caldo: <emphasis>hotplug</emphasis>
ja_jp: ホットプラグ機能: <emphasis>hotplug</emphasis>

source: Introduction
it_it: Premessa
ja_jp: はじめに

source: The <emphasis>hotplug</emphasis> kernel subsystem loads drivers for peripherals that can be hotplugged. This includes USB peripherals (increasingly common), PCMCIA (common expansion cards for laptops), IEEE 1394 (also called “Firewire” or “I-Link”), some SATA hard drives, and even, for some high-end servers, PCI or SCSI devices. The kernel has a database that associates each device ID with the required driver. This database is used during boot to load all the drivers for the peripheral devices detected on the different buses mentioned, but also when an additional hotplug device is connected. Once a driver is loaded, a message is sent to <command>udevd</command> so it will be able to create the corresponding entry in <filename>/dev/</filename>.
it_it: Il sottosistema del kernel <emphasis>hotplug</emphasis> carica i driver per le periferiche che possono essere hotplugged. Questo include le periferiche USB (sempre più comuni), PCMCIA (comuni schede di espansione per i portatili), IEEE 1394 (chiamato anche "Firewire" o "I-Link"), alcuni hard disk SATA, e anche, per alcuni server di fascia alta, PCI o dispositivi SCSI. Il kernel ha un database che associa ogni ID del dispositivo con il driver richiesto. Questo database viene utilizzato durante il boot per caricare tutti i driver per le periferiche rilevate sui diversi bus menzionati, ma anche quando viene collegato un dispositivo supplementare hotplug. Una volta che un driver è caricato, un messaggio viene inviato a <command>udevd</command> e quindi sarà in grado di creare la voce corrispondente in <filename>/ dev /</filename> .

source: The Naming Problem
it_it: Il problema dei nomi
ja_jp: 命名問題

source: Before the appearance of hotplug connections, it was easy to assign a fixed name to a device. It was based simply on the position of the devices on their respective bus. But this is not possible when such devices can come and go on the bus. The typical case is the use of a digital camera and a USB key, both of which appear to the computer as disk drives. The first one connected may be <filename>/dev/sdb</filename> and the second <filename>/dev/sdc</filename> (with <filename>/dev/sda</filename> representing the computer's own hard drive). The device name is not fixed; it depends on the order in which devices are connected.
it_it: Prima della comparsa dei collegamenti hotplug, era facile assegnare un nome fisso ad un dispositivo. Esso è basato semplicemente sulla posizione dei dispositivi sui loro rispettivi bus. Ma questo non è possibile quando tali dispositivi possono andare e venire sul bus. Il caso tipico è l'uso di una macchina fotografica digitale e una chiave USB, entrambi i quali appaiono al computer come unità disco. Il primo può essere collegato <filename>/ dev / sdb</filename> e la seconda <filename>/ dev / sdc</filename> (con <filename>/ dev / sda</filename> che rappresenta proprio il disco rigido del computer). Il nome del dispositivo non è fisso, ma dipende dall'ordine in cui sono collegati i dispositivi.
ja_jp: ホットプラグ接続の出現前、デバイスに固定された名前を割り当てることは簡単でした。名前は単純にデバイスが接続されたバスの位置を基にしていました。しかしこのやり方では、デバイスが接続されるバスの位置が決まっていない場合に、問題です。典型的な例は、コンピュータがディスクドライブとして認識するデジタルカメラや USB メモリを使う場合です。最初に接続されたデバイスは <filename>/dev/sdb</filename> 、2 番目に接続されたデバイスは <filename>/dev/sdc</filename> と名付けられるかもしれません (<filename>/dev/sda</filename> はコンピュータのハードドライブを表します)。デバイスに対するデバイス名は固定されていません; デバイス名はデバイスが接続された順番に依存します。

source: Additionally, more and more drivers use dynamic values for devices' major/minor numbers, which makes it impossible to have static entries for the given devices, since these essential characteristics may vary after a reboot.
it_it: Inoltre, sempre più driver usano valori dinamici per i numeri maggiori / minori dei dispositivi, il che rende impossibile avere voci statiche per i dispositivi indicati, in quanto tali caratteristiche essenziali possono variare dopo un riavvio.
ja_jp: さらに、ますます多くのドライバがデバイスのメジャー/マイナー番号に動的な値を使うことで、あるデバイスに対する静的なエントリを持つことが不可能になります。なぜなら、これらのエントリは再起動の後に変化するかもしれないからです。

source: <emphasis>udev</emphasis> was created precisely to solve this problem.
it_it: <emphasis>udev</emphasis> è stato creato proprio per risolvere questo problema.
ja_jp: <emphasis>udev</emphasis> はまさにこの問題を解決するために作られました。

source: <emphasis>IN PRACTICE</emphasis> Network card management
it_it: <emphasis>IN PRATICA</emphasis> Gestione delle schede di rete
ja_jp: <emphasis>IN PRACTICE</emphasis> ネットワークカード管理

source: Many computers have multiple network cards (sometimes two wired interfaces and a wifi interface), and with <emphasis>hotplug</emphasis> support on most bus types, the 2.6 kernel no longer guarantees fixed naming of network interfaces. But a user who wants to configure their network in <filename>/etc/network/interfaces</filename> needs a fixed name!
it_it: Molti computer hanno più schede di rete (a volte due interfacce cablate e un'interfaccia wifi), e con <emphasis>hotplug</emphasis> il supporto alla maggior parte dei tipi di bus, il kernel 2.6 non garantisce più nomi prefissati alle interfacce di rete. Ma un utente che vuole configurare la propria rete in <filename>/ etc / network / interfaces</filename> ha bisogno di un nome fisso!
ja_jp: 多くのコンピュータは複数のネットワークカードを持っており (2 つの有線インターフェイスと 1 つの wifi インターフェイス)、<emphasis>hotplug</emphasis> はほとんどのバスタイプをサポートするので 2.6 カーネルはもはや名前の固定されたネットワークインターフェイスを生成しません。しかし <filename>/etc/network/interfaces</filename> の中で自分のネットワークを設定したいユーザは名前を固定しなければいけません!

source: It would be difficult to ask every user to create their own <emphasis>udev</emphasis> rules to address this problem. This is why <emphasis>udev</emphasis> was configured in a rather peculiar manner; on first boot (and, more generally, each time that a new network card appears) it uses the name of the network interface and its MAC address to create new rules that will reassign the same name on subsequent boots. These rules are stored in <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>.
it_it: Sarebbe difficile chiedere ad ogni utente di creare le proprie regole <emphasis>udev</emphasis> per affrontare questo problema. Questo è il motivo per cui <emphasis>udev</emphasis> è stato configurato in un modo piuttosto singolare; al primo avvio (e, più in generale, ogni volta che appare una nuova scheda di rete) <emphasis>udev</emphasis> utilizza il nome dell'interfaccia di rete e il suo indirizzo MAC per creare nuove regole che riassegneranno lo stesso nome per i boot successivi. Queste regole sono memorizzate in <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> .
ja_jp: この問題を解決する目的で、各ユーザに自分の <emphasis>udev</emphasis> ルールを作るようにお願いするのは難しいでしょう。そのため <emphasis>udev</emphasis> は比較的独特なやり方で設定されました; 最初の起動時 (より一般的に言えば、新しいネットワークカードが初めて見つかった時) に、<emphasis>udev</emphasis> はネットワークインターフェイスの名前と MAC アドレスを基にして、2 度目の起動から同じ名前を割り当てられるような新しいルールを作ります。これらのルールは <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> に保存されています。

source: This mechanism has some side effects that you should know about. Let's consider the case of computer that has only one PCI network card. The network interface is named <literal>eth0</literal>, logically. Now say the card breaks down, and the administrator replaces it; the new card will have a new MAC address. Since the old card was assigned the name, <literal>eth0</literal>, the new one will be assigned <literal>eth1</literal>, even though the <literal>eth0</literal> card is gone for good (and the network will not be functional because <filename>/etc/network/interfaces</filename> likely configures an <literal>eth0</literal> interface). In this case, it is enough to simply delete the <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> file before rebooting the computer. The new card will then be given the expected <literal>eth0</literal> name.
it_it: Questo meccanismo produce alcuni effetti collaterali che bisogna conoscere. Consideriamo il caso di un computer che ha una sola scheda di rete PCI. L'interfaccia di rete è denominata <literal>eth0</literal>, logicamente. Ora immaginiamo che la scheda si rompa, e l'amministratore la sostituisca, la nuova scheda avrà un nuovo indirizzo MAC. Dal momento che alla vecchia scheda era stato assegnato un nome, <literal>eth0</literal> , alla nuova verrà assegnato <literal>eth1</literal> , anche se la scheda <literal>eth0</literal> è andata per sempre (e la rete non sarà funzionale, perché <filename>/ etc / network / interfaces</filename> configura probabilmente una interfaccia <literal>eth0</literal>). In questo caso, è sufficiente eliminare semplicemente il <filename>/ etc/udev/rules.d/70-persistent-net.rules</filename> presente prima di riavviare il computer. Alla nuova scheda verrà assegnato il nome previsto <literal>eth0</literal>.
ja_jp: このメカニズムには幾つかの副作用がありますので、それについて知っておくべきです。コンピュータが PCI ネットワークカードを 1 つだけ持っている場合について考えましょう。このネットワークインターフェイスは必然的に <literal>eth0</literal> と名付けられます。カードが壊れて、管理者がそれを交換したとしましょう; 新しいカードは新しい MAC アドレスを持っています。古いカードには <literal>eth0</literal> という名前が割り当てられていたため、<literal>eth0</literal> カードが完全に消え去っているにも関わらず、新しいカードには <literal>eth1</literal> という名前が割り当てられます (ネットワークは機能しません。なぜなら、<filename>/etc/network/interfaces</filename> で <literal>eth0</literal> インターフェイスを設定しているからです)。この場合、コンピュータの再起動前に単純に <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> ファイルを削除すれば十分です。新しいカードはおそらく <literal>eth0</literal> という名前を与えられるでしょう。

source: How <emphasis>udev</emphasis> Works
it_it: Come lavora <emphasis>udev</emphasis>
ja_jp: <emphasis>udev</emphasis> の動作原理

source: When <emphasis>udev</emphasis> is notified by the kernel of the appearance of a new device, it collects various information on the given device by consulting the corresponding entries in <filename>/sys/</filename>, especially those that uniquely identify it (MAC address for a network card, serial number for some USB devices, etc.).
it_it: Quando il kernel notifica a <emphasis>udev</emphasis> la comparsa di un nuovo dispositivo, raccoglie diverse informazioni sul dispositivo dato consultando le voci corrispondenti in <filename>/ sys /</filename> , specialmente quelle che lo identificano in modo univoco (indirizzo MAC di una scheda di rete, numero di serie per alcuni dispositivi USB, ecc.).
ja_jp: <emphasis>udev</emphasis> が新しいデバイスの出現についてカーネルから通知を受けると、<filename>/sys/</filename> 内の対応するエントリを調べて与えられたデバイスに関する様々な情報、特にデバイスを一意に識別する情報 (ネットワークカードの MAC アドレス、USB デバイスのシリアル番号など) を収集します。

source: Armed with all of this information, <emphasis>udev</emphasis> then consults all of the rules contained in <filename>/etc/udev/rules.d/</filename> and <filename>/lib/udev/rules.d/</filename>. In this process it decides how to name the device, what symbolic links to create (to give it alternative names), and what commands to execute. All of these files are consulted, and the rules are all evaluated sequentially (except when a file uses “GOTO” directives). Thus, there may be several rules that correspond to a given event.
it_it: Armato di tutte queste informazioni, <emphasis>udev</emphasis> consulta allora tutte le norme contenute nel <filename>/ etc / udev / rules.d /</filename> e <filename>/ lib / udev / rules.d /</filename> . In questo processo si decide come nominare il dispositivo, quali link simbolici creare (per avere nomi alternativi), e quali comandi eseguire. Tutti questi file vengono consultati, e le regole vengono valutate tutte in sequenza (tranne quando un file utilizza una direttiva "GOTO"). Così, vi possono essere diverse regole che corrispondono ad un dato evento.
ja_jp: この情報を武器にして、<emphasis>udev</emphasis> は <filename>/etc/udev/rules.d/</filename> と <filename>/lib/udev/rules.d/</filename> に含まれる全てのルールを調査します。この過程で <emphasis>udev</emphasis> は、どのような名前をデバイスに割り当てるか、どのような名前でシンボリックリンクを作成するか (別名を与えるために)、どのようなコマンドを実行するか、を決定します。これらのファイルすべてが調査され、ルールが全て順番に評価されます (「GOTO」ディレクティブを使う場合を除いて)。そのため、与えられたイベントに対応する複数のルールが有るかもしれません。

source: The syntax of rules files is quite simple: each row contains selection criteria and variable assignments. The former are used to select events for which there is a need to react, and the latter defines the action to take. They are all simply separated with commas, and the operator implicitly differentiates between a selection criterion (with comparison operators, such as <literal>==</literal> or <literal>!=</literal>) or an assignment directive (with operators such as <literal>=</literal>, <literal>+=</literal> or <literal>:=</literal>).
it_it: La sintassi dei file delle regole è molto semplice: ogni riga contiene i criteri di selezione e le assegnazioni delle variabili. I primi sono utilizzati per selezionare gli eventi per i quali esiste una necessità di reagire, mentre quest'ultimo definisce l'azione da eseguire. Sono tutti semplicemente separati da virgole, e l'operatore distingue implicitamente tra un criterio di selezione (con operatori di confronto, come <literal>==</literal> o <literal>!=</literal> ) o una direttiva di assegnazione (con operatori come <literal>+=</literal> , <literal>-=</literal> o <literal>:=</literal>).
ja_jp: ルールの構文はとても単純です: 各行には、選択基準と変数代入命令が含まれます。選択基準は反応を必要とするイベントを選ぶのに使われ、変数代入命令はイベントに対して行う動作を定義します。選択基準と変数代入命令は単純にコンマで区切られており、演算子を使って選択基準 (<literal>==</literal> または <literal>!=</literal> などの比較演算子を付ける) と変数代入命令 (<literal>=</literal>、<literal>+=</literal>、<literal>:=</literal> などの演算子を付ける) を暗黙のうちに区別します。

source: Comparison operators are used on the following variables:
it_it: Gli operatori di confronto vengono utilizzate per le seguenti variabili:
ja_jp: 比較演算子は以下の変数に使われます:

source: <literal>KERNEL</literal>: the name that the kernel assigns to the device;
it_it: <literal>KERNEL</literal> : Il nome che il kernel assegna al dispositivo;
ja_jp: <literal>KERNEL</literal>: カーネルがデバイスに割り当てた名前;

source: <literal>ACTION</literal>: the action corresponding to the event (“add” when a device has been added, “remove” when it has been removed);
it_it: <literal>AZIONE</literal>: l'azione corrispondente all'evento ("add" quando un dispositivo è stato aggiunto, "remove" quando è stato rimosso);
ja_jp: <literal>ACTION</literal>: イベントに対する動作 (デバイスが追加されたら「add」、デバイスが取り外されたら「remove」);

source: <literal>DEVPATH</literal>: the path of the device's <filename>/sys/</filename> entry;
it_it: <literal>DEVPATH</literal>: il percorso del dispositivo, la voce <filename>/ sys /</filename>;
ja_jp: <literal>DEVPATH</literal>: デバイスの <filename>/sys/</filename> エントリのパス;

source: <literal>SUBSYSTEM</literal>: the kernel subsystem which generated the request (there are many, but a few examples are “usb”, “ide”, “net”, “firmware”, etc.);
it_it: <literal>SUBSYSTEM</literal> : Il sottosistema del kernel che ha generato la richiesta (ce ne sono molti, ma alcuni esempi sono "usb", "ide", "net", "firmware", ecc);
ja_jp: <literal>SUBSYSTEM</literal>: 要求を生成したカーネルサブシステム (種類は沢山ありますが、「usb」、「ide」、「net」、「firmware」などがその例です);

source: <literal>ATTR{<replaceable>attribut</replaceable>}</literal>: file contents of the <replaceable>attribute</replaceable> file in the <filename>/sys/<replaceable>$devpath</replaceable>/</filename> directory of the device. This is where you find the MAC address and other bus specific identifiers;
it_it: <literal>ATTR { <replaceable>attributo</replaceable> }</literal>: il contenuto dei file del file <replaceable>attributo</replaceable> nella directory <filename>/ sys / <replaceable>$ DEVPATH</replaceable> /</filename> del dispositivo. Qui è possibile trovare l'indirizzo MAC e gli identificatori di bus specifici;
ja_jp: <literal>ATTR{<replaceable>attribut</replaceable>}</literal>: デバイスの <filename>/sys/<replaceable>$devpath</replaceable>/</filename> ディレクトリ内の <replaceable>attribute</replaceable> ファイルの内容。これで MAC アドレスやその他のバス固有識別子が判ります。

source: <literal>KERNELS</literal>, <literal>SUBSYSTEMS</literal> and <literal>ATTRS{<replaceable>attributes</replaceable>}</literal> are variations that will try to match the different options on one of the parent devices of the current device;
it_it: <literal>KERNELS</literal> , <literal>SUBSYSTEMS</literal> e <literal>ATTRS { <replaceable>gli attributi</replaceable> }</literal> sono variazioni che cercheranno di soddisfare le diverse opzioni su uno dei dispositivi principali del dispositivo di corrente;
ja_jp: <literal>KERNELS</literal>、<literal>SUBSYSTEMS</literal>、<literal>ATTRS{<replaceable>attributes</replaceable>}</literal> は対象のデバイスの親デバイスの 1 つに対する様々なオプションに対して一致を検査します。

source: <literal>PROGRAM</literal>: delegates the test to the indicated program (true if it returns 0, false if not). The content of the program's standard output is stored so that it can be reused by the <literal>RESULT</literal> test;
it_it: <literal>PROGRAM</literal> : delega il test per il programma indicato (true se restituisce 0, false in caso contrario). Il contenuto dello standard output del programma è memorizzato in modo che possa essere riutilizzato dal test <literal>RESULT</literal>;
ja_jp: <literal>PROGRAM</literal>: 指定されたプログラムを使ってテストを実行します (0 が返されたら真、それ以外は偽)。プログラムの標準出力の内容は保存され、<literal>RESULT</literal> テストによって再利用されます;

source: <literal>RESULT</literal>: execute tests on the standard output stored during the last call to <literal>PROGRAM</literal>.
it_it: <literal>RESULT</literal> : esegue il test sullo standard output memorizzato durante l'ultima chiamata al <literal>PROGRAM</literal> .
ja_jp: <literal>RESULT</literal>: <literal>PROGRAM</literal> が最後に呼び出された時に保存された標準出力に対してテストを実行。

source: The right operands can use pattern expressions to match several values at the same time. For instance, <literal>*</literal> matches any string (even an empty one); <literal>?</literal> matches any character, and <literal>[]</literal> matches the set of characters listed between the square brackets (or the opposite thereof if the first character is an exclamation point, and contiguous ranges of characters are indicated like <literal>a-z</literal>).
it_it: Gli operandi possono utilizzare modelli di espressioni per abbinare diversi valori allo stesso tempo. Ad esempio, <literal>*</literal> corrisponde a qualsiasi stringa (anche vuote); <literal>?</literal> corrisponde a qualsiasi carattere e <literal>[]</literal> corrisponde al set di caratteri elencati tra le parentesi quadre (o la loro opposto se il primo carattere è un punto esclamativo, e gli intervalli di caratteri contigui sono indicati come <literal>a-z</literal> ).
ja_jp: 演算子の右側引数には、複数の値に同時にマッチするようなパターン式を使うことが可能です。例えば、<literal>*</literal> は任意の文字列に (空文字列にも) マッチします; <literal>?</literal> は任意の文字にマッチし、<literal>[]</literal> は角括弧の間にリストされた文字セットにマッチします (最初の文字が感嘆符の場合は、その否定にマッチします。また、文字の連続範囲は <literal>a-z</literal> のように表記します)。

source: Regarding the assignment operators, <literal>=</literal> assigns a value (and replaces the current value); in the case of a list, it is emptied and contains only the value assigned. <literal>:=</literal> does the same, but prevents later changes to the same variable. As for <literal>+=</literal>, it adds an item to a list. The following variables can be changed:
it_it: Per quanto riguarda gli operatori di assegnazione, <literal>=</literal> assegna un valore (e sostituisce il valore corrente); nel caso di un elenco, viene svuotato e contiene solo il valore assegnato. <literal>:=</literal> fa la stessa cosa, ma impedisce successive modifiche alla stessa variabile. Per quanto riguarda <literal>+=</literal>, aggiunge un elemento a un elenco. Le seguenti variabili possono essere modificate:
ja_jp: 代入演算子に関して、<literal>=</literal> は値を代入します (そして現在の値を入れ替えます); リストに代入する場合、リストを空にした後、割り当てた値だけを代入します。<literal>:=</literal> は同じことをしますが、後から値を変更できなくなります。<literal>+=</literal> はリストにアイテムを追加します。代入演算子を使って変更できる変数は以下です:

source: <literal>NAME</literal>: the device filename to be created in <filename>/dev/</filename>. Only the first assignment counts; the others are ignored;
it_it: <literal>NOME</literal> : Il nome del file del dispositivo da creare in <filename>/dev/</filename> . Vale solo la prima assegnazione, le altre vengono ignorate;
ja_jp: <literal>NAME</literal>: <filename>/dev/</filename> 内に作成するデバイスファイル名。最初に代入された値だけが考慮されます; 他は無視されます;

source: <literal>SYMLINK</literal>: the list of symbolic links that will point to the same device;
it_it: <literal>SYMLINK</literal> : L'elenco dei link simbolici che puntano allo stesso dispositivo;
ja_jp: <literal>SYMLINK</literal>: 同じデバイスを指すシンボリックリンクのリスト;

source: <literal>OWNER</literal>, <literal>GROUP</literal> and <literal>MODE</literal> define the user and group that owns the device, as well as the associated permission;
it_it: <literal>PROPRIETARIO</literal> , <literal>GRUPPO</literal> e <literal>MODE</literal> definisce l'utente e gruppo che possiede il dispositivo, nonché l'autorizzazione associata;
ja_jp: <literal>OWNER</literal>、<literal>GROUP</literal>、<literal>MODE</literal> はデバイスを所有するユーザとグループおよびパーミッション定義します;

source: <literal>RUN</literal>: the list of programs to execute in response to this event.
it_it: <literal>RUN</literal> : l'elenco dei programmi da eseguire in risposta a questo evento.
ja_jp: <literal>RUN</literal>: イベントに応答する際に実行するプログラムのリスト。

source: The values assigned to these variables may use a number of substitutions:
it_it: I valori assegnati a queste variabili possono utilizzare un numero di sostituzioni:
ja_jp: これらの変数に割り当てる値に、以下の置換変数を使う事が可能な場合があります:

source: <literal>$kernel</literal> or <literal>%k</literal>: equivalent to <literal>KERNEL</literal>;
it_it: <literal>$kernel</literal> o <literal>%k</literal> : equivalente a <literal>KERNEL</literal> ;
ja_jp: <literal>$kernel</literal> または <literal>%k</literal>: <literal>KERNEL</literal> と同じです;

source: <literal>$number</literal> or <literal>%n</literal>: the order number of the device, for example, for <literal>sda3</literal>, it would be “3”;
it_it: <literal>$number</literal> o <literal>%n</literal> : il numero d'ordine del dispositivo, per esempio, per <literal>sda3</literal>, sarebbe "3";
ja_jp: <literal>$number</literal> または <literal>%n</literal>: デバイスの割り当て番号、例えば、<literal>sda3</literal> の場合「3」です;

source: <literal>$devpath</literal> or <literal>%p</literal>: equivalent to <literal>DEVPATH</literal>;
it_it: <literal>$devpath</literal> o <literal>%p</literal> : equivalente a <literal>DEVPATH</literal> ;
ja_jp: <literal>$devpath</literal> または <literal>%p</literal>: <literal>DEVPATH</literal> と同じです;

source: <literal>$attr{<replaceable>attribute</replaceable>}</literal> or <literal>%s{<replaceable>attribute</replaceable>}</literal>: equivalent to <literal>ATTRS{<replaceable>attribute</replaceable>}</literal>;
it_it: <literal>$attr{ <replaceable>attributo</replaceable> }</literal> o <literal>%s { <replaceable>attributo</replaceable> }</literal> : equivalente a <literal>ATTR { <replaceable>attributo</replaceable> }</literal> ;
ja_jp: <literal>$attr{<replaceable>attribute</replaceable>}</literal> または <literal>%s{<replaceable>attribute</replaceable>}</literal>: <literal>ATTRS{<replaceable>attribute</replaceable>}</literal> と同じです;
