Repository: Neamar/KISS
Catalog: */09_unix-services.po
Languages: it_it, ja_jp

source: <computeroutput>$ </computeroutput><userinput>at 09:00 27.07.12 &lt;&lt;END</userinput> <computeroutput>&gt; </computeroutput><userinput>echo "Don't forget to wish a Happy Birthday to Raphaël!" \</userinput> <computeroutput>&gt; </computeroutput><userinput> | mail lolando@debian.org</userinput> <computeroutput>&gt; </computeroutput><userinput>END</userinput> <computeroutput>warning: commands will be executed using /bin/sh job 31 at Fri Jul 27 09:00:00 2012</computeroutput>
it_it: <computeroutput>$ </computeroutput><userinput>at 09:00 27.07.12 &lt;&lt;END</userinput> <computeroutput>&gt; </computeroutput><userinput>echo "Non dimenticare dli auguri di compleanno per Raphaël!"\</userinput> <computeroutput>&gt; </computeroutput><userinput> | mail lolando@debian.org</userinput> <computeroutput>&gt; </computeroutput><userinput>END</userinput> <computeroutput>warning: commands will be executed using /bin/sh job 31 at Fri Jul 27 09:00:00 2012</computeroutput>

source: An alternative syntax postpones the execution for a given duration: <command>at now + <replaceable>number</replaceable> <replaceable>period</replaceable></command>. The <replaceable>period</replaceable> can be <literal>minutes</literal>, <literal>hours</literal>, <literal>days</literal>, or <literal>weeks</literal>. The <replaceable>number</replaceable> simply indicates the number of said units that must elapse before execution of the command.
it_it: Una sintassi alternativa rimanda l'esecuzione per un determinato periodo: <command>at now + <replaceable>numero</replaceable><replaceable>periodo</replaceable></command> . Il <replaceable>periodo</replaceable> può rappresentare <literal>minuti</literal> , <literal>ore</literal> , <literal>giorni</literal> , o <literal>settimane</literal> . Il <replaceable>numero</replaceable> indica semplicemente il numero di dette unità che devono trascorrere prima dell'esecuzione del comando.
ja_jp: 与えられた期間だけ実行を延期する構文もあります: <command>at now + <replaceable>number</replaceable> <replaceable>period</replaceable></command> です。<replaceable>period</replaceable> には <literal>minutes</literal>、<literal>hours</literal>、<literal>days</literal>、<literal>weeks</literal> を指定することが可能です。<replaceable>number</replaceable> は単純に <replaceable>period</replaceable> で指定した単位の量を表し、この量だけコマンドの実行が延期されます。

source: To cancel a task scheduled by <command>cron</command>, simply run <command>crontab -e</command> and delete the corresponding line in the <emphasis>crontab</emphasis> file. For <command>at</command> tasks, it is almost as easy: run <command>atrm <replaceable>task-number</replaceable></command>. The task number is indicated by the <command>at</command> command when you scheduled it, but you can find it again with the <command>atq</command> command, which gives the current list of scheduled tasks.
it_it: Per annullare un'operazione pianificata in <command>cron</command> , è sufficiente eseguire <command>crontab-e</command> ed eliminare la riga corrispondente nel file <emphasis>crontab</emphasis>. Per le attività <command>at</command> compiti, è quasi più facile: eseguire <command>atrm <replaceable>numero-attività</replaceable></command> . Il numero dell'attività è indicato dal comando <command>at</command> quando lo si pianifica, ma possiamo ritrovarlo con il comando <command>atq</command>, che mostra l'attuale elenco di operazioni pianificate.
ja_jp: <command>cron</command> でスケジュールされたタスクを中止するには、単純に <command>crontab -e</command>を実行し、<emphasis>crontab</emphasis> ファイルから対応する行を削除してください。<command>at</command> タスクの場合、削除はとても簡単です: <command>atrm <replaceable>task-number</replaceable></command> を実行してください。タスク番号は <command>at</command> コマンドで予定を登録した際に表示されたものです。改めて確認するには <command>atq</command> コマンドを実行してください。これはスケジュールされたタスクの現在のリストを表示します。

source: Scheduling Asynchronous Tasks: <command>anacron</command>
it_it: Pianificazione delle attività asincrone: <command>anacron</command>
ja_jp: 非同期タスクのスケジューリング: <command>anacron</command>

source: <command>anacron</command> is the daemon that completes <command>cron</command> for computers that are not on at all times. Since regular tasks are usually scheduled for the middle of the night, they will never be executed if the computer is off at that time. The purpose of <command>anacron</command> is to execute them, taking into account periods in which the computer is not working.
it_it: <command>anacron</command> è il demone che completa <command>cron</command> per i computer che non sono sempre accesi. Dal momento che le attività normali di solito sono in programma per la metà della notte, non potranno mai averle eseguite se il computer è spento in quel momento. Lo scopo di <command>anacron</command> è quello di eseguirli, tenendo conto dei periodi in cui il computer non funziona.
ja_jp: <command>anacron</command> はデーモンで、常に起動されていないコンピュータの <command>cron</command> を完成するものです。定期的なタスクは通常真夜中に予定されているため、その時間にコンピュータの電源が切れていればタスクは決して実行されません。<command>anacron</command> の目的は、コンピュータの電源が切れている期間を考慮して、OFF 期間中のタスクを実行することです。

source: Please note that <command>anacron</command> will frequently execute such activity a few minutes after booting the machine, which can render the computer less responsive. This is why the tasks in the <filename>/etc/anacrontab</filename> file are started with the <command>nice</command> command, which reduces their execution priority and thus limits their impact on the rest of the system. Beware, the format of this file is not the same as that of <filename>/etc/crontab</filename>; if you have particular needs for <command>anacron</command>, see the <citerefentry><refentrytitle>anacrontab</refentrytitle> <manvolnum>5</manvolnum></citerefentry> manual page.
it_it: Da notare che <command>anacron</command> molto spesso esegue le attività pochi minuti dopo l'avvio della macchina, il che può rendere il computer meno reattivo. Ecco perché i compiti nel file <filename>/ etc / anacrontab</filename> vengono avviati con il comando <command>nice</command>, che riduce la priorità di esecuzione e limita così il loro impatto sul resto del sistema. Attenzione, il formato del file non è lo stesso di <filename>/ etc / crontab</filename> ; se si hanno esigenze particolari per <command>anacron</command> , consultare la pagina di manuale <citerefentry><refentrytitle>anacrontab</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
ja_jp: <command>anacron</command> は通常そのようなタスクをマシンの起動数分後に実行します。この事により、コンピュータの反応が遅くなります。このため、<filename>/etc/anacrontab</filename> ファイルに載せられたタスクは <command>nice</command> コマンドと一緒に開始されます。こうすることで、タスクの優先度を低くして実行できるので、システムの残りの部分に対する影響を減らすことが可能です。<filename>/etc/anacrontab</filename> ファイルの書式は <filename>/etc/crontab</filename> と異なる点に注意してください; <command>anacron</command> を使う特定の必要性がある場合、<citerefentry><refentrytitle>anacrontab</refentrytitle> <manvolnum>5</manvolnum></citerefentry> マニュアルページを御覧ください。

source: <emphasis>BACK TO BASICS</emphasis> Priorities and <command>nice</command>
it_it: <emphasis>Concetti di base</emphasis> Priorità e <command>nice</command>
ja_jp: <emphasis>BACK TO BASICS</emphasis> 実行優先度と <command>nice</command>

source: Unix systems (and thus Linux) are multi-tasking and multi-user systems. Indeed, several processes can run in parallel, and be owned by different users: the kernel mediates access to the resources between the different processes. As a part of this task, it has a concept of priority, which allows it to favor certain processes over others, as needed. When you know that a process can run in low priority, you can indicate so by running it with <command>nice <replaceable>program</replaceable></command>. The program will then have a smaller share of the CPU, and will have a smaller impact on other running processes. Of course, if no other processes needs to run, the program will not be artificially held back.
it_it: I sistemi Unix (e quindi Linux) sono sistemi multi-tasking e multi-utente. Infatti, più processi possono essere eseguiti in parallelo, ed essere di proprietà di diversi utenti: il kernel controlla l'accesso alle risorse tra i diversi processi. Come parte di questo compito, ha un concetto di priorità, che consente di favorire certi processi rispetto ad altri, secondo le necessità. Quando sai che un processo può essere eseguito a bassa priorità, è possibile indicare in questo modo eseguendo il <command><replaceable>comando</replaceable>nice</command>. Il programma avrà quindi una quota minore della CPU, e avrà un minore impatto su altri processi in esecuzione. Naturalmente, se nessun altro processo deve essere eseguito, il programma non verrà artificialmente trattenuto.
ja_jp: Unix システム (および Linux) はマルチタスクのマルチユーザシステムです。実際、複数のプロセスは平行して実行され、別のユーザに所有されます: カーネルは異なるプロセス間でリソースへのアクセスを仲介します。このタスクの一部として、カーネルは実行優先度という概念を持ちます。実行優先度に基づき、カーネルは必要に応じてあるプロセスを特別扱いします。あるプログラムを低い優先度で実行しても構わないと判っている場合、そのプログラムに低い優先度を与えて実行を開始するには <command>nice <replaceable>program</replaceable></command> を使います。<command>nice</command> を使って実行を開始されたプログラムは CPU への負担を低く設定され、他の実行中プロセスに対するを影響を低く抑えられるでしょう。もちろん、他に実行中のプロセスがない場合、このプログラムの実行は妨げられません。

source: <command>nice</command> works with levels of “niceness”: the positive levels (from 1 to 19) progressively lower the priority, while the negative levels (from -1 to -20) will increase it — but only root can use these negative levels. Unless otherwise indicated (see the <citerefentry><refentrytitle>nice</refentrytitle> <manvolnum>1</manvolnum></citerefentry> manual page), <command>nice</command> increases the current level by 10.
it_it: <command>nice</command> lavora con livelli di "niceness": i livelli positivi (da 1 a 19) diminuiscono progressivamente la priorità, mentre i livelli negativi (da -1 a -20) la aumentano - ma solo root può usare questi livelli negativi. Salvo diversa indicazione (si veda la pagina di manuale <citerefentry><refentrytitle>nice</refentrytitle><manvolnum>1</manvolnum></citerefentry>), <command>nice</command> aumenta il livello corrente di 10.
ja_jp: <command>nice</command> は「niceness」と呼ばれる優先度と連動します: 正の優先度 (1 から 19) は低い優先度、これに対して、負の優先度 (-1 から-20) は高い優先度です。負の (高い) 優先度を使えるのは root だけです。「niceness」を与えなければ (<citerefentry><refentrytitle>nice</refentrytitle> <manvolnum>1</manvolnum></citerefentry> マニュアルページ参照)、<command>nice</command> は現在の優先度を正方向に 10 だけ増加します。

source: If you discover that an already running task should have been started with <command>nice</command> it is not too late to fix it; the <command>renice</command> command changes the priority of an already running process, in either direction (but reducing the “niceness” of a process is reserved to the root user).
it_it: Se vi accorgete che un compito già in esecuzione avrebbe dovuto essere avviato con <command>nice</command> non è troppo tardi per risolvere il problema, il comando <command>renice</command> modifica la priorità di un processo già in esecuzione, in entrambe le direzioni (ma ridurre la "niceness" di un processo è riservato all'utente root).
ja_jp: 既に実行中のタスクの中に <command>nice</command> で開始するべきプロセスを発見した場合、今からでも優先度を修正することが可能です; <command>renice</command> コマンドは実行中のプロセスの優先度を変更します。優先度を低くすることも高くすることも可能です (ただし、「niceness」を減らす (優先度を高くする) 事ができるのは root だけです)。

source: Installation of the <emphasis role="pkg">anacron</emphasis> package deactivates execution by <command>cron</command> of the scripts in the <filename>/etc/cron.hourly/</filename>, <filename>/etc/cron.daily/</filename>, <filename>/etc/cron.weekly/</filename>, and <filename>/etc/cron.monthly/</filename> directories. This avoids their double execution by <command>anacron</command> and <command>cron</command>. The <command>cron</command> command remains active and will continue to handle the other scheduled tasks (especially those scheduled by users).
it_it: L'installazione del pacchetto <emphasis role="pkg">anacron</emphasis> disattiva l'esecuzione degli script nelle directory <filename>/ etc / cron.hourly /</filename> , <filename>/ etc / cron.daily /</filename> , <filename>/ etc / cron.weekly /</filename> , e <filename>/ etc / cron.monthly /</filename> da <command>cron</command>. Questo evita la loro doppia esecuzione da <command>anacron</command> e <command>cron</command> . Il comando <command>cron</command> rimane attivo e continuerà a gestire le altre attività programmate (in particolare quelle previste dagli utenti).
ja_jp: <emphasis role="pkg">anacron</emphasis> パッケージをインストールすることにより、<command>cron</command> は <filename>/etc/cron.hourly/</filename>、<filename>/etc/cron.daily/</filename>、<filename>/etc/cron.weekly/</filename>、<filename>/etc/cron.monthly/</filename> ディレクトリに含まれるスクリプトを実行しなくなります。これは <command>anacron</command> と <command>cron</command> がスクリプトを二重に実行することを避けるためです。<command>cron</command> コマンドはまだ有効で、他のスケジュールされたタスク (特にユーザがスケジュールしたタスク) を取り扱う事が可能です。

source: Quotas
it_it: Quote
ja_jp: クォータ

source: The quota system allows limiting disk space allocated to a user or group of users. To set it up, you must have a kernel that supports it (compiled with the <varname>CONFIG_QUOTA</varname> option) — as is the case of Debian kernels. The quota management software is found in the <emphasis role="pkg">quota</emphasis> Debian package.
it_it: Il sistema delle quote permette di limitare lo spazio su disco assegnato a un utente o a un gruppo di utenti. Per configurarlo è necessario disporre di un kernel che lo supporti (compilato con l'opzione <varname>CONFIG_QUOTA</varname>) - come nel caso del kernel di Debian. Il software di gestione delle quote si trova nel pacchetto Debian <emphasis role="pkg">quota</emphasis>.
ja_jp: クォータシステムを使うことで、ユーザまたはユーザグループに割り当てられたディスクスペースを制限することが可能です。クォータを設定するには、クォータをサポートする (<varname>CONFIG_QUOTA</varname> オプションを有効化してコンパイルされた) カーネルを使わなければいけません - Debian カーネルはクォータをサポートします。クォータ管理ソフトウェアは <emphasis role="pkg">quota</emphasis> Debian パッケージに含まれています。

source: To activate them in a filesystem, you have to indicate the <literal>usrquota</literal> and <literal>grpquota</literal> options in <filename>/etc/fstab</filename> for the user and group quotas, respectively. Rebooting the computer will then update the quotas in the absence of disk activity (a necessary condition for proper accounting of already used disk space).
it_it: Per attivare le quote in un filesystem, è necessario indicare le opzioni <literal>usrquota</literal> e <literal>grpquota</literal> in <filename>/ etc / fstab</filename> per utente e gruppo, rispettivamente. Riavviando il computer quindi aggiornerà le quote in assenza di attività del disco (una condizione necessaria per un'adeguata contabilità di spazio su disco già utilizzato).
ja_jp: あるファイルシステムでクォータを有効化するには、<filename>/etc/fstab</filename> の中でそれぞれユーザやグループクォータに対応する <literal>usrquota</literal> や <literal>grpquota</literal> オプションを使います。この後コンピュータを再起動すると、ディスク活動の無いときに (これは既に利用されているディスクスペースを適切に計量する必要条件です)、クォータが更新されます。

source: The <command>edquota <replaceable>user</replaceable></command> (or <command>edquota -g <replaceable>group</replaceable></command>) command allows you to change the limits while examining current disk space usage.
it_it: Il comando <command>edquota <replaceable>utente</replaceable></command> (o <command>edquota-g <replaceable>gruppo</replaceable></command> ) consente di modificare i limiti mentre controlla l'utilizzo attuale dello spazio su disco.
ja_jp: <command>edquota <replaceable>user</replaceable></command> (または <command>edquota -g <replaceable>group</replaceable></command>) コマンドを使うと、現在のディスクスペース使用量を検査している最中に、制限を変更することが可能です。

source: <emphasis>GOING FURTHER</emphasis> Defining quotas with a script
it_it: <emphasis>APPROFONDIMENTO</emphasis> Definire le quote con uno script
ja_jp: <emphasis>GOING FURTHER</emphasis> スクリプトを使ったクォータの定義

source: The <command>setquota</command> program can be used in a script to automatically change many quotas. Its <citerefentry><refentrytitle>setquota</refentrytitle> <manvolnum>8</manvolnum></citerefentry> manual page details the syntax to use.
it_it: Il programma <command>setquota</command> può essere utilizzato in uno script per cambiare automaticamente numerose qupte. La sua pagina di manuale <citerefentry><refentrytitle>setquota</refentrytitle><manvolnum>8</manvolnum></citerefentry> descrive la sintassi da utilizzare.
ja_jp: <command>setquota</command> プログラムはスクリプトの中で自動的に多くのクォータを変更する目的で使うことが可能です。構文の使い方は <citerefentry><refentrytitle>setquota</refentrytitle> <manvolnum>8</manvolnum></citerefentry> マニュアルページを御覧ください。

source: The quota system allows you to set four limits:
it_it: Il sistema delle quote consente di impostare quattro limiti:
ja_jp: クォータシステムを使うと 4 種類の制限を設定することが可能です:

source: two limits (soft and hard) refer to the number of inodes used. Each file occupies at least one inode to store information about it (permissions, owner, timestamp of last access, etc.). It is thus a limit on the number of user files.
it_it: due limiti (soft e hard) si riferiscono al numero di inode utilizzati. Ogni file occupa almeno un inode per memorizzare le informazioni su di esso (permessi, proprietario, data e ora dell'ultimo accesso, ecc.) È quindi un limite al numero di file dell'utente.
ja_jp: i ノードに対して 2 種類の制限 (ソフトとハード) があります。各ファイルはファイルの情報 (パーミッション、所有者、最後にアクセスされた時間、など) を保存するために少なくとも 1 つの i ノードを専有します。この性質を使うことで、ユーザファイルの数を制限することが可能です。

source: A “soft” limit can be temporarily exceeded; the user will simply be warned that they are exceeding the quota by the <command>warnquota</command> command, which is usually invoked by <command>cron</command>. A “hard” limit can never be exceeded: the system will refuse any operation that will cause a hard quota to be exceeded.
it_it: Un limite "soft" può essere temporaneamente superato, l'utente sarà semplicemente avvertito che sta superando la quota dal comando <command>warnquota</command>, che di solito è invocato da <command>cron</command> . Un limite "hard" non può mai essere superato: il sistema rifiuterà qualsiasi operazione che causerà il superamento della quota.
ja_jp: 「ソフト」リミットは一時的に超過できます; ユーザは単純に <command>warnquota</command> コマンドからクォータを超過していることに対する警告を受けるだけです。 <command>warnquota</command> コマンドは通常 <command>cron</command> コマンドによって呼び出されます。「ハード」リミットは決して超過できません: システムはハードクォータを超過するような操作を全て拒否します。

source: <emphasis>VOCABULARY</emphasis> Blocks and inodes
it_it: <emphasis>VOCABOLARIO</emphasis> Blocchi e inode
ja_jp: <emphasis>VOCABULARY</emphasis> ブロックと i ノード

source: <primary>block (disk)</primary>
it_it: <primary>blocco (disco)</primary>
ja_jp: <primary>ブロック (ディスク)</primary>

source: A block can be used either to store the real data of a file, or for meta-data used by the filesystem. Among this meta-data, you will especially find the inodes. An inode uses a block on the hard drive (but this block is not taken into consideration in the block quota, only in the inode quota), and contains both the information on the file to which it corresponds (name, owner, permissions, etc.) and the pointers to the data blocks that are actually used. For very large files that occupy more blocks than it is possible to reference in a single inode, there is an indirect block system; the inode references a list of blocks that do not directly contain data, but another list of blocks.
it_it: Un blocco può essere utilizzato per memorizzare i dati reali di un file, o per i meta-dati utilizzati dal file system. Tra questa meta-dati, in particolare troveremo gli inode. Un inode utilizza un blocco sul disco rigido (ma questo blocco non è preso in considerazione per la quota di blocco, ma solo per la quota inode), e contiene sia le informazioni sul file a cui corrisponde (nome, proprietario, permessi, etc .) sia i puntatori ai blocchi di dati che vengono effettivamente utilizzati. Per i file molto grandi che occupano più blocchi è possibile fare riferimento in un singolo inode, esiste un sistema di blocco indiretto; gli inode di riferimento, un elenco di blocchi che non contengono dati direttamente, ma un altro elenco di blocchi.
ja_jp: ブロックはファイルの実データまたはファイルシステムの使うメタデータのどちらか一方を保存するために使われます。メタデータの中でも特に、i ノードについて説明します。1 つの i ノードはハードドライブ上の 1 ブロックを使い (しかし、このブロックはブロッククォータに考慮されず、i ノードクォータだけに考慮されます)、その i ノードに対応するファイルの情報 (名前、所有者、パーミッション、など) と実際に使われるデータブロックへのポインタ情報の両方を含みます。単一の i ノードで対応出来ないくらい多くのブロックを専有するとても大きなファイルのために、間接ブロックシステムがあります; i ノードは、実データではなく別のブロックのリストを保存しているブロックのリストを参照します。

source: With the <command>edquota -t</command> command, you can define a maximum authorized “grace period” within which a soft limit may be exceeded. After this period, the soft limit will be treated like a hard limit, and the user will have to reduce their disk space usage to within this limit in order to be able to write anything to the hard drive.
it_it: Con il comando <command>edquota-t</command>, è possibile definire un "periodo di grazia" massimo autorizzato in cui un limite soft può essere superato. Dopo questo periodo, il limite soft verrà trattato come un limite rigido, e l'utente dovrà ridurre l'utilizzo dello spazio su disco entro questo limite in modo da essere in grado di scrivere altro sul disco rigido.
ja_jp: <command>edquota -t</command> コマンドを使って、ソフトリミットの超過を許す「猶予期間」の最長値を定義することが可能です。この期間の後、ソフトリミットはハードリミットと同じ様に扱われます。ユーザがハードドライブに何かを書き込むには、ディスクスペースの使用量を減らしてクォータの制限内に収めなければいけません。

source: <emphasis>GOING FURTHER</emphasis> Setting up a default quota for new users
it_it: <emphasis>APPROFONDIMENTO</emphasis> Impostazione di una quota predefinita per i nuovi utenti
ja_jp: <emphasis>GOING FURTHER</emphasis> 新しいユーザのデフォルトクォータを設定する

source: To automatically setup a quota for new users, you have to configure a template user (with <command>edquota</command> or <command>setquota</command>) and indicate their user name in the <varname>QUOTAUSER</varname> variable in the <filename>/etc/adduser.conf</filename> file. This quota configuration will then be automatically applied to each new user created with the <command>adduser</command> command.
it_it: Per configurare automaticamente una quota per i nuovi utenti, è necessario configurare un modello di utente (con <command>edquota</command> o <command>setquota</command> ) ed indicare il loro nome utente nella variabile <varname>QUOTAUSER</varname> del file <filename>/ etc / adduser.conf</filename>. Questa configurazione contingente verrà applicata automaticamente ad ogni nuovo utente creato con il comando <command>adduser</command>.
ja_jp: 新規ユーザ向けにクォータを自動設定するには、(<command>edquota</command> または <command>setquota</command> を使って) テンプレートユーザを設定し、<filename>/etc/adduser.conf</filename> ファイルの <varname>QUOTAUSER</varname> 変数にテンプレートユーザの名前をいれなければいけません。このクォータ設定は、<command>adduser</command> コマンドを使って新規ユーザを作成した際に、自動的に適用されます。

source: Making backups is one of the main responsibilities of any administrator, but it is a complex subject, involving powerful tools which are often difficult to master.
it_it: Fare copie di backup è uno dei compiti principali di ogni amministratore, ma rappresenta un argomento complesso, che coinvolge potenti strumenti che sono spesso difficili da padroneggiare.
ja_jp: バックアップを取ることは管理者の主要な責任の 1 つです。しかし、これは通常極めるのが難しい強力なツールを使う複雑な問題です。

source: <primary>backup</primary>
it_it: <primary>il backup</primary>
ja_jp: <primary>バックアップ</primary>

source: <primary>restoration</primary>
it_it: <primary>ripristino</primary>
ja_jp: <primary>復元</primary>
