Repository: Neamar/KISS
Catalog: */15_debian-packaging.po
Languages: ja_jp, pt_br

source: This tool is only a helper, and it sometimes gets it wrong (for instance, since the Debian policy changes over time, <command>lintian</command> is sometimes outdated). It is also not exhaustive: not getting any Lintian error should not be interpreted as a proof that the package is perfect; at most, it avoids the most common errors.
ja_jp: <command>lintian</command> の情報は参考程度にしかならず、間違いを犯す事もあります (例えば、Debian ポリシーは常に変わるものなので、しばしば <command>lintian</command> は時代遅れになる事があります)。<command>lintian</command> は徹底的な調査を行いません: Lintian エラーが無いからと言って、対象のパッケージが完全であることの証明にはなりません; せいぜい、最も一般的な間違いを犯していない事がわかるだけです。
pt_br: Está ferramenta é apenas um ajudante, e algumas vezes falha (por exemplo, já que a política do Debian muda com o tempo, <command>lintian</command> está algumas vezes desatualizado). Também não é exaustiva: não receber nenhum erro no Lintian não deve ser interpretada como prova de que o pacote é perfeito; no máximo, ele evita os erros mais comuns.

source: The <command>piuparts</command> Program
ja_jp: <command>piuparts</command> プログラム

source: This is another important tool: it automates the installation, upgrade, removal and purge of a package (in an isolated environment), and checks that none of these operations leads to an error. It can help in detecting missing dependencies, and it also detects when files are incorrectly left over after the package got purged.
ja_jp: <command>piuparts</command> もまた重要なツールの 1 つです; <command>piuparts</command> は (隔離環境の中で) パッケージのインストール、アップグレード、削除、完全消去の作業を自動化し、これらの作業中にエラーが起きない事を確認します。<command>piuparts</command> は不足している依存関係を検出することにも役立ち、パッケージが完全消去された後にファイルが誤って残されたこと検出します。

source: The <emphasis role="pkg">devscripts</emphasis> package contains many programs helping with a wide array of a Debian developer's job:
ja_jp: <emphasis role="pkg">devscripts</emphasis> パッケージには、Debian 開発者が行う作業の大部分に対する手助けを行う数多くのプログラムが含まれます:
pt_br: O pacote <emphasis role="pkg">devscripts</emphasis> contém diversos programas que ajudam com uma vasta gama do trabalho dos desenvolvedores Debian:

source: <command>debuild</command> allows generating a package (with <command>dpkg-buildpackage</command>) and running <command>lintian</command> to check its compliance with the Debian policy afterwards.
ja_jp: <command>debuild</command> を使うことで、(<command>dpkg-buildpackage</command> から) パッケージを生成したり、Debian ポリシーへの遵守を確認するために後から <command>lintian</command> を実行する事が可能です。
pt_br: <command>debuild</command> permite gerar um pacote (com <command>dpkg-buildpackage</command>) e executando <command>lintian</command> para verificar a compatibilidade com a política Debian depois.

source: <command>debclean</command> cleans a source package after a binary package has been generated.
ja_jp: <command>debclean</command> を使うことで、バイナリパッケージを生成した後にソースパッケージの後片付けをする事が可能です。
pt_br: <command>debclean</command> limpa um pacote fonte após o pacote binário ter sido gerado.

source: <command>dch</command> allows quick and easy editing of a <filename>debian/changelog</filename> file in a source package.
ja_jp: <command>dch</command> を使うことで、素早く簡単にソースパッケージ中の <filename>debian/changelog</filename> ファイルを編集する事が可能です。
pt_br: <command>dch</command> permite rapidamente e facilmente editar o arquivo <filename>debian/changelog</filename> num pacote fonte.

source: <command>uscan</command> checks whether a new version of a software has been released by the upstream author; this requires a <filename>debian/watch</filename> file with a description of the location of such releases.
ja_jp: <command>uscan</command> を使うことで、上流開発者がソフトウェアの新しいバージョンをリリースしたか否かを確認する事が可能です; これを行うにはリリースの場所が書かれた <filename>debian/watch</filename> ファイルが必要です。
pt_br: <command>uscan</command> verifica se foi liberada uma nova versão de um software pelo autor; Isso requer um <filename>debian/watch</filename> arquivo com uma descrição da localização de tais lançamentos.

source: <command>debi</command> allows installing (with <command>dpkg -i</command>) the Debian package that was just generated, and avoid typing its full name and path.
ja_jp: <command>debi</command> を使うことで、Debian パッケージを生成した直後に (<command>dpkg -i</command> から) そのパッケージをインストールする事が可能です。パッケージの完全な名前やパスを指定する必要はありません。
pt_br: <command>debi</command> permite a instalação (com <command>dpkg -i</command>) do pacote Debian que acabou de ser gerado, e evita digitar seu nome completo e caminho.

source: In a similar fashion, <command>debc</command> allows scanning the contents of the recently-generated package (with <command>dpkg -c</command>), without needing to type its full name and path.
ja_jp: 同様の方法で、<command>debc</command> を使うことで、(<command>dpkg -c</command> から) 最近生成されたパッケージの内容を走査する事が可能です。パッケージの完全な名前やパスを指定する必要はありません。
pt_br: De uma maneira similar, <command>debc</command> permite varrer o conteúdo de um pacote recentemente criado (com <command>dpkg -c</command>), sem a necessidade de digitar o nome completo e o caminho.

source: <command>bts</command> controls the bug tracking system from the command line; this program automatically generates the appropriate emails.
ja_jp: <command>bts</command> を使うことで、コマンドラインからバグ追跡システムを制御する事が可能です; このプログラムは適切なメールを自動生成します。
pt_br: <command>bts</command> controla o sistema de bug pela linha de commando, este programa automaticamente gera e-mails apropriados.

source: <command>debrelease</command> uploads a recently-generated package to a remote server, without needing to type the full name and path of the related <filename>.changes</filename> file.
ja_jp: <command>debrelease</command> を使うことで、最近生成されたパッケージをリモートサーバにアップロードする事が可能です。関連する <filename>.changes</filename> ファイルの完全な名前やパスを指定する必要はありません。
pt_br: <command>debrelease</command> envia os pacotes recém gerados a um servidor remoto, sem a necessidades de digitar o nome completo e o caminho do arquivo relacionado <filename>.changes</filename>.

source: <command>debsign</command> signs the <filename>*.dsc</filename> and <filename>*.changes</filename> files.
ja_jp: <command>debsign</command> を使うことで、<filename>*.dsc</filename> と <filename>*.changes</filename> ファイルに署名する事が可能です。
pt_br: <command>debsign</command> assina os arquivos <filename>*.dsc</filename> e <filename>*.changes</filename>.

source: <command>uupdate</command> automates the creation of a new revision of a package when a new upstream version has been released.
ja_jp: <command>uupdate</command> を使うことで、新しい上流開発版がリリースされた場合にパッケージの新しい修正版の作成を自動化する事が可能です。
pt_br: <command>uupdate</command> automatiza a criação de uma nova revisão do pacote quando uma nova versão upstream foi lançada.

source: <emphasis role="pkg">debhelper</emphasis> and <emphasis role="pkg">dh-make</emphasis>
ja_jp: <emphasis role="pkg">debhelper</emphasis> と <emphasis role="pkg">dh-make</emphasis>
pt_br: <emphasis role="pkg">debhelper</emphasis> e <emphasis role="pkg">dh-make</emphasis>

source: Debhelper is a set of scripts easing the creation of policy-compliant packages; these scripts are invoked from <filename>debian/rules</filename>. Debhelper has been widely adopted within Debian, as evidenced by the fact that it is used by the majority of official Debian packages. All the commands it contains have a <command>dh_</command> prefix. Debhelper is mainly developed by Joey Hess.
ja_jp: debhelper はポリシーを遵守するパッケージの作成を簡単にするスクリプト群です; これらのスクリプトは <filename>debian/rules</filename> から実行されます。大多数の公式 Debian パッケージが debhelper を使っているという事実からも分かる通り、debhelper は Debian の中で広く適用されています。debhelper から提供されるすべてのコマンドは名前の頭に <command>dh_</command> が付けられています。debhelper は主として Joey Hess さんによって開発されています。

source: The <command>dh_make</command> script (in the <emphasis>dh-make</emphasis> package) creates files required for generating a Debian package in a directory initially containing the sources for a piece of software. As can be guessed from the name of the program, the generated files use Debhelper by default.
ja_jp: <command>dh_make</command> スクリプト (<emphasis>dh-make</emphasis> パッケージに含まれます) はソフトウェアのソースが最初に含まれるディレクトリ内で Debian パッケージを生成するために必要なファイルを作成します。プログラムの名前から推測されるとおり、生成されたファイルはデフォルトで debhelper を使います。
pt_br: O roteiro <command>dh_make</command> (no pacote <emphasis>dh-make</emphasis>) cria arquivos necessários para geração de um pacote Debian em um diretório inicialmente contendo os fontes do programa. Como você pode ter adivinhado pelo nome do programa, o arquivo gerado usa por padrão o Debhelper.

source: <emphasis role="pkg">cdbs</emphasis> is another approach to Debian packaging, based exclusively on an inheritance system across <filename>Makefile</filename> files.
ja_jp: <emphasis role="pkg">cdbs</emphasis> は Debian パッケージ化に対する別のアプローチで、<filename>Makefile</filename> ファイルを横断する継承システムだけに基づきます。
pt_br: <emphasis role="pkg">cdbs</emphasis> é uma outra abordagem para empacotamento Debian, baseada exclusivamente em um sistema de herança através de arquivos <filename>Makefile</filename>.

source: That tool has its advocates, since it avoids duplicating the same list of <command>dh_*</command> commands in the <filename>debian/rules</filename> file. However, Debhelper version 7 introduced the <command>dh</command> command, which itself automates the appropriate sequence of calls to all the individual commands in the correct order, and CDBS has lost most of its appeal since then.
ja_jp: CDBS が提唱される理由は、CDBS を使うことで、<filename>debian/rules</filename> ファイルの中で同じ <command>dh_*</command> コマンドのリストを複製する必要が無くなるからです。しかしながら、debhelper バージョン 7 で <command>dh</command> コマンドが導入されました。<command>dh</command> コマンドはすべての個別のコマンドを正しい順番で呼び出す作業を自動化します。こうなったことで、CDBS の魅力の大部分が失われました。

source: <command>dupload</command> and <command>dput</command>
ja_jp: <command>dupload</command> と <command>dput</command>
pt_br: <command>dupload</command> e <command>dput</command>

source: The <command>dupload</command> and <command>dput</command> commands allow uploading a Debian package to a (possibly remote) server. This allows developers to publish their package on the main Debian server (<literal>ftp-master.debian.org</literal>) so that it can be integrated to the archive and distributed by mirrors. These commands take a <filename>*.changes</filename> file as a parameter, and deduce the other relevant files from its contents.
ja_jp: <command>dupload</command> と <command>dput</command> コマンドを使うことで、Debian パッケージを (場合によってはリモート) サーバにアップロードする事が可能です。<command>dupload</command> と <command>dput</command> コマンドを使うことで、開発者は主たる Debian サーバ (<literal>ftp-master.debian.org</literal>) 上で自分のパッケージを公開する事が可能です。こうすることで、パッケージはアーカイブに統合され、ミラーによって配布されます。<command>dupload</command> と <command>dput</command> コマンドは <filename>*.changes</filename> ファイルをパラメータとして受け取り、<filename>*.changes</filename> ファイルの内容から他の関連するファイルを推測します。

source: Acceptance Process
ja_jp: 受け入れ過程
pt_br: Processo de Aceitação

source: Becoming a Debian developer is not a simple administrative matter. The process is made of several steps, and is as much an initiation as it is a selection process. In any case, it is formalized and well-documented, so anyone can track their progression on the website dedicated to the new member process. <ulink type="block" url="http://nm.debian.org/" />
ja_jp: Debian 開発者になることは単なる管理上の手続きを経るだけの問題ではありません。受け入れ過程は復数の段階からなり、選考過程に匹敵する入会儀式と言えます。いかなる場合も、受け入れ過程は公認されよく文書化されています。そのため、誰でも新メンバー過程専用のウェブサイト上で進み具合を追跡する事が可能です。<ulink type="block" url="http://nm.debian.org/" />
pt_br: Tornar-se um desenvolvedor Debian não é somente uma questão administrativa. O processo é feito em diversas etapas, e é tanto uma iniciação quando um processo seletivo. Em todo caso, o mesmo é formalizado e bem documentado, então qualquer um pode verificar o progresso no site dedicado para o processo de novos membros. <ulink type="block" url="http://nm.debian.org/" />

source: <emphasis>EXTRA</emphasis> Lightweight process for “Debian Maintainers”
ja_jp: <emphasis>EXTRA</emphasis> 「Debian メンテナ」向けの簡単なプロセス
pt_br: <emphasis>EXTRA</emphasis> Processo leve para "Mantenedores Debian"

source: A “Debian Maintainer” status has recently been introduced. The associated process is quicker, and the privileges granted by this status are only enough to maintain one's own packages. A Debian developer only needs to perform a check on an initial upload, and issue a statement to the effect that they trust the prospective maintainer with the ability to maintain the package on their own.
ja_jp: 最近「Debian メンテナ」の地位が導入されました。これに関連するプロセスは素早いものです。そして、この地位によって与えられる権限は自分自身のパッケージをメンテナンスするには十分です。Debian 開発者は最初のアップロードを確認する必要があり、自分自身のパッケージをメンテナンスする能力を備えた見込みあるメンテナを信用するという声明を発表します。
pt_br: Recentemente foi introduzido um status de "Mantenedor Debian". O processo associado é mais rápido, e os privilégios concedidos por este estatuto são apenas o suficiente para manter os próprios pacotes. Um desenvolvedor Debian só precisa executar uma verificação em um carregamento inicial, e emitir uma declaração para o efeito que eles confiam o mantenedor em prospectivo com a capacidade de manter o pacote por conta própria.

source: <primary>Debian Maintainer</primary>
ja_jp: <primary>Debian メンテナ</primary>
pt_br: <primary>Mantenedor Debian</primary>

source: Prerequisites
ja_jp: 必要条件
pt_br: Pré-requisitos

source: All candidates are expected to have at least a working knowledge of the English language. This is required at all levels: for the initial communications with the examiner, of course, but also later, since English is the preferred language for most of the documentation; also, package users will be communicating in English when reporting bugs, and they will expect replies in English.
ja_jp: すべての候補者は少なくとも実務に役立つ英語力を持つ事を期待されます。英語力はすべての段階で要求されます: 試験官に対する最初の連絡はもちろんその後も必要です。なぜなら、英語はほとんどの文書で推奨される言語だからです; また、パッケージのユーザはバグを報告する際に英語で連絡を取るでしょうし、ユーザは英語で返信をもらう事を期待するでしょう。
pt_br: É esperado de todos os candidatos ter ao menos conhecimento da linguá inglesa. Isto é requerido em todos os níveis: para a comunicação inicial com o examinador, é claro, mas mais tarde também, já que o inglês é a linguá preferida pela maioria dos documentos; também, os usuários dos pacotes se comunicarão em inglês quando reportando erros, e os mesmos esperam uma reposta em inglês.

source: The other prerequisite deals with motivation. Becoming a Debian developer is a process that only makes sense if the candidate knows that their interest in Debian will last for many months. The acceptance process itself may last for several months, and Debian needs developers for the long haul; each package needs permanent maintenance, and not just an initial upload.
ja_jp: 他の必要条件は意欲です。Debian 開発者になることは、候補者が Debian に対する自分の関心が何ヶ月も続く事を判っている場合のみ、合理的な行為です。受け入れ過程は数ヶ月間続き、Debian は開発者に長期に渡る苦労を要求します; それぞれのパッケージは永久的なメンテナンスが必要で、最初のアップロードで終わりではありません。
pt_br: Outro pré-requisito lida com motivação. Tornar-se um desenvolvedor Debian é um processo que somente faz sentido se o candidato sabe que seu interesse no Debian durará mais do que muitos meses. O processo de aceitação em si deve durar diversos meses, e o Debian precisa de desenvolvedores para um longo trajeto; cada pacote precisa de manutenção permanente, e não somente uma versão inicial.

source: Registration
ja_jp: 登録
pt_br: Registrando

source: The first (real) step consists in finding a sponsor or advocate; this means an official developer willing to state that they believe that accepting <emphasis>X</emphasis> would be a good thing for Debian. This usually implies that the candidate has already been active within the community, and that their work has been appreciated. If the candidate is shy and their work is not publicly touted, they can try to convince a Debian developer to advocate them by showing their work in a private way.
ja_jp: 最初の (現実的な) 段階は保証人か支持者を見つける事です; これは、公式の開発者が <emphasis>X</emphasis> さんを受け入れる事が Debian のためになると信じていると喜んで宣言すること意味します。通常これは、候補者が既にコミュニティ内で活発に活動し続けており、候補者の業績が受け入れられ続けている、事を暗黙的に意味します。候補者が遠慮がちで、候補者の業績が公に注目されていなければ、候補者は Debian 開発者に対して個人的な方法で自分の業績を明らかにして自分を支持する事を納得するように試みる事が可能です。

source: At the same time, the candidate must generate a public/private RSA key pair <indexterm><primary>key pair</primary></indexterm> with GnuPG, which should be signed by at least two official Debian developers. The signature authenticates the name on the key. Effectively, during a key signing party, each participant must show an official identification (usually an ID card or passport) together with their key identifiers. This step makes the link between the human and the keys official. This signature thus requires meeting in real life. If you have not yet met any Debian developers in a public free software conference, you can explicitly seek developers living nearby using the list on the following webpage as a starting point. <ulink type="block" url="http://wiki.debian.org/Keysigning" />
ja_jp: 同時に、候補者は GnuPG を使って RSA 公開鍵と秘密鍵のペア<indexterm><primary>鍵ペア</primary></indexterm>を生成しなければいけません。鍵ペアは少なくとも 2 人の公式 Debian 開発者によって署名されるべきです。この署名は鍵に書かれた名前が本物である事を証明するものです。実質的に言えば、キーサインパーティの間、各参加者は鍵識別子と一緒に必ず公式の身分証明書 (ID カードかパスポート) を見せなければいけません。この段階は人と鍵の間の正式な関連付けを行います。このため、署名を受けるには実際に会う必要があります。あなたが公のフリーソフトウェアカンファレンスで Debian 開発者と会っていない場合、あなたは以下のウェブページに載っているリストを足掛かりとして、近くに住んでいる開発者を探す事が可能です。<ulink type="block" url="http://wiki.debian.org/Keysigning" />

source: Once the registration on <literal>nm.debian.org</literal> has been validated by the advocate, an <emphasis>Application Manager</emphasis> is assigned to the candidate. The application manager will then drive the process through multiple pre-defined steps and checks.
ja_jp: 支持者が <literal>nm.debian.org</literal> 上の登録内容の正当性を認めたら、対象の候補者に対して 1 人の<emphasis>応募管理者</emphasis>が割り当てられます。応募管理者は復数の事前に定義された段階と確認を通じて作業を進めます。

source: The first verification is an identity check. If you already have a key signed by two Debian developers, this step is easy; otherwise, the application manager will try and guide you in your search for Debian developers close by to organize a meet-up and a key signing. At the very beginning of the process, when the number of developers was small, there was an exception to this procedure which allowed this step to be completed with a digital scan of official identification documents; this is no longer the case.
ja_jp: 最初の妥当性確認事項は本人確認です。既に 2 人の Debian 開発者が鍵に署名している場合、この段階は簡単です; そうでなければ、応募管理者はあなたに対して、近くにいる Debian 開発者を探し、会ってキーサインする段取りを付けるように指導するでしょう。このプロセスの始まった当初、開発者の数が少なかったとき、この手続には例外規定があり、公式の身分証明書のデジタルスキャンを使ってこの手続きを済ませる事が可能でした; これはもはや当てはまりません。
pt_br: A primeira verificação é uma verificação de identidade. Se você já tiver uma chave assinada por dois desenvolvedores Debian, este passo é fácil; caso contrário, o Gerenciador de aplicativos irá tentar e guiá-lo em sua busca para desenvolvedores Debian por perto para organizar um meet-up e uma chave de assinatura. No início do processo, quando o número de desenvolvedores era pequeno, havia uma exceção a este procedimento que permitiu que esta etapa seja concluída com uma varredura digital de documentos de identificação oficial; isso não é mais o caso.

source: Accepting the Principles
ja_jp: 原則の受け入れ
pt_br: Aceitando os Princípios

source: These administrative formalities are followed with philosophical considerations. The point is to make sure that the candidate understands and accepts the social contract and the principles behind Free Software. Joining Debian is only possible if one shares the values that unite the current developers, as expressed in the founding texts (and summarized in <xref linkend="the-debian-project" />).
ja_jp: 次の管理上の手続きは哲学の検討です。ここで、候補者は社会契約とフリーソフトウェアの背後にある原理を理解して受け入れることに対する確認を取られます。Debian に参加するには、必ず創設理念に表されている (<xref linkend="the-debian-project" />にまとめられている) 現在の開発者を団結させている価値に共感する必要があります。

source: In addition, each candidate wishing to join Debian ranks is expected to know the workings of the project, and how to interact appropriately to solve the problems they will doubtless encounter as time passes. All of this information is generally documented in manuals targeting the new maintainers, and in the Debian developer's reference. An attentive reading of this document should be enough to answer the examiner's questions. If the answers are not satisfactory, the candidate will be informed. He will then have to read (again) the relevant documentation before trying again. In the cases where the existing documentation does not contain the appropriate answer for the question, the candidate can usually reach an answer with some practical experience within Debian, or potentially by discussing with other Debian developers. This mechanism ensures that candidates get involved somewhat in Debian before becoming a full part of it. It is a deliberate policy, by which candidates who eventually join the project are integrated as another piece of an infinitely extensible jigsaw puzzle.
ja_jp: 加えて、Debian に参加したいと思っている各候補者はプロジェクトの仕組みと、時間が経てば間違いなく直面するであろう問題を解決する際に適切に相互協力する方法を知る事を期待されます。すべての情報は新しいメンテナ向けのマニュアルと Debian 開発者リファレンスの中でおおまかに説明されています。試験官の質問に答えるには、この文書を注意深く読むだけで十分です。回答が不十分な場合、候補者は知らされます。候補者は再試験を受ける前に関連する文書を (再度) 読まなければいけません。既存の文書に質問に対する適切な回答が含まれなかった場合、候補者は Debian 内の実務経験を使うか他の Debian 開発者との議論を通じて回答に到達する事が可能です。このメカニズムによって、候補者が Debian のすべての部分に参加する前に一部分だけに参加する事が保証されます。これは慎重な方針です。この方針によって最終的に Debian プロジェクトに参加する候補者は永久的に広がるジグソーパズルのピースの 1 つとして統合されます。
pt_br: Além disso, cada candidato que pretendem aderir fileiras Debian é esperar para saber o funcionamento do projeto e como interagir de forma adequada para resolver os problemas que elas irão sem dúvida encontrar com o passar do tempo. Toda esta informação geralmente está documentado nos manuais visando o novo mantenedor e em referência do desenvolvedor Debian. Uma leitura atenta deste documento deve ser suficiente para responder a perguntas do examinador. Se as respostas não são satisfatórias, o candidato será informado. Em seguida, ele terá que ler (novamente) a documentação pertinente antes de tentar novamente. Nos casos onde a documentação existente não contém a resposta adequada para a questão, o candidato geralmente pode chegar a uma resposta com alguma experiência prática dentro do Debian, ou potencialmente, discutindo com outros desenvolvedores Debian. Esse mecanismo garante que candidatos se envolver um pouco no Debian antes de se tornar parte integral dele. É uma política deliberada, por que candidatos que eventualmente se unem ao projeto integram-se como uma peça de um quebra-cabeça infinitamente extensível.

source: This step is usually known as the <emphasis>Philosophy &amp; Procedures</emphasis> (P&amp;P for short) in the lingo of the developers involved in the new member process. <indexterm><primary><emphasis>Philosophy &amp; Procedures</emphasis></primary></indexterm>
ja_jp: この段階は新メンバー過程に参加する開発者の間で使われる用語の <emphasis>Philosophy &amp; Procedures</emphasis> (略して P&amp;P、哲学と手順) として知られています。<indexterm><primary><emphasis>Philosophy &amp; Procedures</emphasis></primary></indexterm>

source: Checking Skills
ja_jp: 能力の確認
pt_br: Verificando Habilidades

source: Each application to become an official Debian developer must be justified. Becoming a project member requires showing that this status is legitimate, and that it facilitates the candidate's job in helping Debian. The most common justification is that being granted Debian developer status eases maintenance of a Debian package, but it is not the only one. Some developers join the project to contribute to porting to a specific architecture, others want to improve documentation, and so on.
ja_jp: 公式 Debian 開発者になるための申込は理にかなったものでなければいけません。プロジェクトメンバーになるには、プロジェクトメンバーの地位の申し込みが適切なこと、プロジェクトメンバーの地位を得ることで Debian の手助けに関する候補者の仕事が容易になる事を示す必要があります。最も一般的な理由付けは Debian 開発者の地位が Debian パッケージのメンテナンスを簡単にするというものです。しかしこれは唯一の理由ではありません。特定のアーキテクチャへの移植に貢献するためにプロジェクトに参加している開発者もいれば、文書を改良したいと思ってプロジェクトに参加している開発者もいます。
