Repository: Neamar/KISS
Catalog: */15_debian-packaging.po
Languages: ja_jp, pt_br

source: The <command>pbuilder</command> program (in the similarly named package) allows building a Debian package in a <emphasis>chrooted</emphasis> environment. It first creates a temporary directory containing the minimal system required for building the package (including the packages mentioned in the <emphasis>Build-Depends</emphasis> field). This directory is then used as the root directory (<filename>/</filename>), using the <command>chroot</command> command, during the build process.
ja_jp: <command>pbuilder</command> プログラム (同名のパッケージに含まれます) を使うことで、<emphasis>chroot された</emphasis>環境の中で Debian パッケージをビルドする事が可能になります。<command>pbuilder</command> プログラムは最初にパッケージをビルドするために必要な最低限のシステム (と <emphasis>Build-Depends</emphasis> フィールドで指定されているパッケージ) を含む一時ディレクトリを作成します。このディレクトリは <command>chroot</command> コマンドビルド中に使うルートディレクトリ (<filename>/</filename>) として使われます。
pt_br: O comando <command>pbuilder</command> (similarmente ao nome do pacote) permite a construção de um pacote Debian em um ambiente <emphasis>chrooted (enjaulado)</emphasis>. Ele primeiramente cria um diretório temporário contendo um sistema mínimo necessário para a construção do pacote (incluindo os pacotes mencionados no campo <emphasis>Build-Depends</emphasis>). Este diretório é então usado como diretório raiz (<filename>/</filename>), utilizando o comando <command>chroot</command>, durante a fase de construção do pacote.

source: This tool allows the build process to happen in an environment that is not altered by users' manipulations. This also allows for quick detection of the missing build-dependencies (since the build will fail unless the appropriate dependencies are documented). Finally, it allows building a package for a Debian version that is not the one used by the system as a whole: the machine can be using <emphasis role="distribution">Stable</emphasis> for its normal workload, and a <command>pbuilder</command> running on the same machine can be using <emphasis role="distribution">Unstable</emphasis> for package builds.
ja_jp: <command>pbuilder</command> ツールを使うことで、ビルド作業をユーザの操作によって変更されない環境の中で行う事が可能になります。さらに、<command>pbuilder</command> ツールを使うことで、満足されていないビルド依存関係を素早く検知する事が可能になります (なぜなら、適切な依存関係が指定されていなければビルドは失敗するからです)。最後に、<command>pbuilder</command> ツールを使うことで、システム用に使われている Debian バージョン以外の Debian バージョン向けのパッケージをビルドする事が可能になります: マシンは通常の作業用に<emphasis role="distribution">安定版</emphasis>を使う事が可能です。そして、同じマシン上で動作する <command>pbuilder</command> はパッケージビルド専用に<emphasis role="distribution">不安定版</emphasis>を使う事が可能です。
pt_br: Está ferramenta permite ao processo de construção acontecer em um ambiente que não foi alterado pelo usuário. Isto também permite uma detecção rápida de um dependência perdida (já que a construção irá falhar a não ser que as dependência estejam documentadas). Finalmente, ele permite a construção de um pacote para a versão do Debian que não está sendo usada pelo sistema por completo: a máquina pode estar utilizando <emphasis role="distribution">Stable</emphasis> para seu trabalho normal, e um <command>pbuilder</command> rodando na mesma máquina pode estar utilizando <emphasis role="distribution">Unstable</emphasis> para a construção dos pacotes.

source: Building your First Package
ja_jp: 最初のパッケージのビルド
pt_br: Construindo seu Primeiro Pacote

source: Meta-Packages or Fake Packages
ja_jp: メタパッケージか偽物のパッケージ
pt_br: Meta-pacotes ou falsos pacotes

source: Fake packages and meta-packages are similar, in that they are empty shells that only exist for the effects their meta-data have on the package handling stack.
ja_jp: 偽物のパッケージとメタパッケージは似ています。両者は自分のメタデータをパッケージ取り扱いスタックに置いておくためだけに存在する抜け殻です。
pt_br: Pacotes falsos e meta-pacotes são similares, ambos são shells vazios que somente existem para efeito dos metadados que existem na pilha de gerenciamento de pacotes.

source: The purpose of a fake package is to trick <command>dpkg</command> and <command>apt</command> into believing that some package is installed even though it's only an empty shell. This allows satisfying dependencies on a package when the corresponding software was installed outside the scope of the packaging system. Such a method works, but it should still be avoided whenever possible, since there's no guarantee that the manually installed software behaves exactly like the corresponding package would and other packages depending on it would not work properly.
ja_jp: 偽物のパッケージの目的は、<command>dpkg</command> と <command>apt</command> を騙して、抜け殻に過ぎない幾つかのパッケージがインストールされていると信じこませる事にあります。これを使うことで、あるソフトウェアの依存関係を満足させるために必要なソフトウェアがパッケージシステムの管轄外にインストールされている場合に、そのソフトウェアの依存関係を満足させる事が可能です。この方法は問題を解決しますが、これはできる限り避けるべき方法です。なぜなら、手作業でインストールされたソフトウェアが対応するパッケージと全く同様に振る舞う保証はありませんし、手作業でインストールされたソフトウェアに依存する他のパッケージが適切に動く保証もないからです。
pt_br: O propósito de um pacote falso é enganar o <command>dpkg</command> e o <command>apt</command> para acreditarem que algum pacote está instalado mesmo que em realidade seja apenas um shell vazio. Isto permite satisfazer dependências num pacote quando o programa correspondente foi instalado fora do escopo do sistema de pacotes. Este método funciona, porém deve mesmo assim ser evitado sempre que possível, já que não garantias de que o programa instalado manualmente se comportará exatamente como o pacote correspondente faria e outros pacotes dependentes dele poderiam não funcionar corretamente.

source: On the other hand, a meta-package exists mostly as a collection of dependencies, so that installing the meta-package will actually bring in a set of other packages in a single step.
ja_jp: 逆に、メタパッケージはほとんどの場合依存関係の集合体として機能します。メタパッケージをインストールするだけで、一連の他のパッケージがインストールされます。
pt_br: De outra maneira, um meta-pacote existe em sua maioria como uma coleção de dependências, então instalando um meta-pacote na verdade trará um conjunto de pacotes em um único passo.

source: Both these kinds of packages can be created by the <command>equivs-control</command> and <command>equivs-build</command> commands (in the <emphasis role="pkg">equivs</emphasis> package). The <command>equivs-control <replaceable>file</replaceable></command> command creates a Debian package header file that should be edited to contain the name of the expected package, its version number, the name of the maintainer, its dependencies, and its description. Other fields without a default value are optional and can be deleted. The <literal>Copyright</literal>, <literal>Changelog</literal>, <literal>Readme</literal> and <literal>Extra-Files</literal> fields are not standard fields in Debian packages; they only make sense within the scope of <command>equivs-build</command>, and they will not be kept in the headers of the generated package.
ja_jp: 偽物のパッケージとメタパッケージは <command>equivs-control</command> と <command>equivs-build</command> コマンド (<emphasis role="pkg">equivs</emphasis> パッケージに含まれます) を使って作成されます。<command>equivs-control <replaceable>file</replaceable></command> コマンドは Debian パッケージヘッダファイルを作成します。 Debian パッケージヘッダファイルには、パッケージの名前、バージョン番号、メンテナ、依存関係、説明を含めるように編集します。デフォルト値を持たない他のフィールドは任意で、削除する事も可能です。<literal>Copyright</literal>、<literal>Changelog</literal>、<literal>Readme</literal>、<literal>Extra-Files</literal> フィールドは Debian パッケージの標準的なフィールドではありません; これらのフィールドは <command>equivs-build</command> を使う限りにおいて意味を持つものであり、生成されるパッケージのヘッダから削除されるべきです。

source: Header file of the <emphasis>libxml-libxml-perl</emphasis> fake package
ja_jp: <emphasis>libxml-libxml-perl</emphasis> 偽物のパッケージのヘッダファイル
pt_br: Cabeçalho do pacote falso <emphasis>libxml-libxml-perl</emphasis>

source: The next step is to generate the Debian package with the <command>equivs-build <replaceable>file</replaceable></command> command. Voilà: the package is created in the current directory and it can be handled like any other Debian package would.
ja_jp: 次のステップでは、<command>equivs-build <replaceable>file</replaceable></command> コマンドを使って Debian パッケージを生成します。さぁこれで、パッケージは現在のディレクトリに作成され、他の Debian パッケージと同様に取り扱う事が可能になります。
pt_br: O próximo passo é gerar o pacote Debian com o comando <command>equivs-build <replaceable>arquivo</replaceable></command>. Voilà: o pacote foi criado no diretório atual e pode ser manejado como qualquer outro pacote Debian seria.

source: Simple File Archive
ja_jp: 単純なファイルアーカイブ
pt_br: Depósito Simples de Arquivos

source: The Falcot Corp administrators need to create a Debian package in order to ease deployment of a set of documents on a large number of machines. The administrator in charge of this task first reads the “New Maintainer's Guide”, then starts working on their first package. <ulink type="block" url="http://www.debian.org/doc/maint-guide/" />
ja_jp: Falcot Corp の管理者は大量のマシン上に一連の文書を配備する事を簡単に行うために Debian パッケージを作成する必要があります。この作業を担当する管理者は最初に「新メンテナーガイド」を読み、その後最初のパッケージに対する作業に着手します。<ulink type="block" url="http://www.debian.org/doc/maint-guide/" />
pt_br: Os administradores da Falcot Corp precisam criar um pacote Debian para facilitar a instalação de um conjunto de documentos em um grande número de máquina. O administrador responsável por essa tarefa primeiramente lê o “New Maintainer's Guide”, e então começa a trabalhar no seu primeiro pacote. <ulink type="block" url="http://www.debian.org/doc/maint-guide/" />

source: The first step is creating a <filename>falcot-data-1.0</filename> directory to contain the target source package. The package will logically, be named <literal>falcot-data</literal> and bear the <literal>1.0</literal> version number. The administrator then places the document files in a <filename>data</filename> subdirectory. Then they invoke the <command>dh_make</command> command (from the <emphasis role="pkg">dh-make</emphasis> package) to add files required by the package generation process, which will all be stored in a <filename>debian</filename> subdirectory:
ja_jp: 最初に、対象のソースパッケージを含める <filename>falcot-data-1.0</filename> ディレクトリを作成します。このパッケージは必然的に、<literal>falcot-data</literal> と名付けられ、バージョン番号は <literal>1.0</literal> になります。その後、管理者は文書ファイルを <filename>data</filename> サブディレクトリに置きます。その後、管理者は <command>dh_make</command> コマンド (<emphasis role="pkg">dh-make</emphasis> パッケージに含まれます) を実行し、パッケージ生成作業に必要なファイルを追加します。このファイルは <filename>debian</filename> サブディレクトリに保存されます:
pt_br: O primeiro passo é criar um diretório <filename>falcot-data-1.0</filename> que conterá o pacote fonte. O pacote irá logicamente, ser chamado <literal>falcot-data</literal> e terá o número de versão <literal>1.0</literal>. O administrador então coloca os documentos em um subdiretório <filename>data</filename>. Então ele chama o comando <command>dh_make</command> (do pacote <emphasis role="pkg">dh-make</emphasis>) para adicionar os arquivos necessários para o processo de criação do pacote, o qual será armazenado em um subdiretório <filename>debian</filename>:

source: The selected type of package (<emphasis>single binary</emphasis>) indicates that this source package will generate a single binary package depending on the architecture (<literal>Architecture: any</literal>). <emphasis>indep binary</emphasis> acts as a counterpart, and leads to a single binary package that is not dependent on the target architecture (<literal>Architecture: all</literal>). In this case, the latter choice is more relevant since the package only contains documents and no binary programs, so it can be used similarly on computers of all architectures.
ja_jp: パッケージの種類で <emphasis>single binary</emphasis> を選ぶと、ソースパッケージから単一のバイナリパッケージをアーキテクチャ毎に (<literal>Architecture: any</literal>) 生成します。<emphasis>indep binary</emphasis> はその逆の振る舞いで、対象のアーキテクチャに依存しない (<literal>Architecture: all</literal>) 単一のバイナリを生成します。今回作成するパッケージの場合、<emphasis>indep binary</emphasis> がより適切です。なぜなら、このパッケージは文書だけを含みバイナリプログラムを含まないからです。このため、すべてのアーキテクチャのコンピュータで同じように使う事が可能です。
pt_br: O tipo de pacote escolhido (<emphasis>binário único</emphasis>) indica que este pacote fonte irá gerar um único pacote binário dependendo da arquitetura (<literal>Arquitetura: qualquer</literal>). <emphasis>binário Indep</emphasis> atua como contraparte, e leva a um único pacote binário que não é dependente da arquitetura alvo (<literal> Arquiitetura: Todas</literal>). Neste caso, a escolha último é mais relevante uma vez que o pacote contém apenas os documentos e não programas binários, para que possa ser usado de forma semelhante em computadores de todas arquitecturas.

source: The <emphasis>multiple binary</emphasis> type corresponds to a source package leading to several binary packages. A particular case, <emphasis>library</emphasis>, is useful for shared libraries, since they need to follow strict packaging rules. In a similar fashion, <emphasis>kernel module</emphasis> should be restricted to packages containing kernel modules. Finally, <emphasis>cdbs</emphasis> is a specific package build system; it is rather flexible, but it requires some amount of learning. <indexterm><primary>package types</primary></indexterm> <indexterm><primary>package</primary><secondary>types</secondary></indexterm>
ja_jp: <emphasis>multiple binary</emphasis> を選ぶと、ソースパッケージから復数のバイナリパッケージを作成する事になります。<emphasis>library</emphasis> は特別な場合で、共有ライブラリ用に用意されています。なぜなら、共有ライブラリは厳しいパッケージ化規則に従う必要があるからです。同様に、<emphasis>kernel module</emphasis> はカーネルモジュールを含むパッケージ用に用意されています。最後に、<emphasis>cdbs</emphasis> は特定のパッケージビルドシステム用に用意されています; これはかなり柔軟ですが、より多くの知識が必要です。<indexterm><primary>パッケージタイプ</primary></indexterm> <indexterm><primary>パッケージ</primary><secondary>タイプ</secondary></indexterm>
pt_br: O tipo <emphasis>múltiplo binário</emphasis> corresponde a um pacote fonte levando a vários pacotes binários. Um caso particular, <emphasis>biblioteca</emphasis>, é útil para bibliotecas compartilhadas, uma vez que precisa seguir regras rígidas do empacotamento. De forma semelhante, <emphasis>módulo do kernel</emphasis> deve ser restrito aos pacotes contendo módulos do kernel. Finalmente, <emphasis>cdbs</emphasis> é um pacote específico sistema de construção, é bastante flexível, mas requer uma certa quantidade de aprendizagem. <indexterm><primary>tipos de pacote</primary></indexterm> <indexterm><primary>pacote</primary> <secondary>tipos</secondary></indexterm>

source: <emphasis>TIP</emphasis> Maintainer's name and email address
ja_jp: <emphasis>TIP</emphasis> メンテナの名前と電子メールアドレス
pt_br: <emphasis>DICA</emphasis> Nome e endereço de e-mail do mantenedor

source: Most of the programs involved in package maintenance will look for your name and email address in the <varname>DEBFULLNAME</varname> and <varname>DEBEMAIL</varname> or <varname>EMAIL</varname> environment variables. Defining them once and for all will avoid you having to type them multiple times. If your usual shell is <command>bash</command>, it's a simple matter of adding the following two lines in your <filename>~/.bashrc</filename> and <filename>~/.bash_profile</filename> files (you will obviously replace the values with more relevant ones!):
ja_jp: パッケージメンテナンスに関わるほとんどのプログラムはメンテナの名前と電子メールアドレスを <varname>DEBFULLNAME</varname> と <varname>DEBEMAIL</varname> または <varname>EMAIL</varname> 環境変数から取得します。たった 1 回だけこれらの環境変数を定義するだけで、これらの情報を毎回打ち込む必要がなくなります。通常のシェルが <command>bash</command> の場合、<filename>~/.bashrc</filename> と <filename>~/.bash_profile</filename> ファイルに以下の 2 行 (当然ですが、値を自分のものに変えてくださいね!) を追加するだけで簡単にこれを行う事が可能です:
pt_br: A maioria dos programas envolvidos no pacotes de manutenção irão procurar seu nome e endereço de e-mail no <varname>DEBFULLNAME</varname> e <varname>DEBEMAIL</varname> ou variáveis de ambiente <varname>EMAIL</varname>. Defini los de uma vez por todas vai evitar que você tenha de digitá-los várias vezes. Se o shell usual é o <command>bash</command>, é uma simples questão de adicionar as duas linhas seguintes em seus aquivos <filename>~/.bashrc</filename> e <filename>~/.bash_profile</filename> (você obviamente substitui os valores com os mais relevantes!):

source: The <command>dh_make</command> command created a <filename>debian</filename> subdirectory with many files. Some are required, in particular <filename>rules</filename>, <filename>control</filename>, <filename>changelog</filename> and <filename>copyright</filename>. Files with the <filename>.ex</filename> extension are example files that can be used by modifying them (and removing the extension) when appropriate. When they are not needed, removing them is recommended. The <filename>compat</filename> file should be kept, since it is required for the correct functioning of the <emphasis>debhelper</emphasis> suite of programs (all beginning with the <command>dh_</command> prefix) used at various stages of the package build process.
ja_jp: <command>dh_make</command> コマンドは <filename>debian</filename> サブディレクトリと各種ファイルを作成しました。一部のファイル、特に <filename>rules</filename>、<filename>control</filename>、<filename>changelog</filename>、<filename>copyright</filename> は必須です。<filename>.ex</filename> 拡張子を持つファイルは例ファイルで、必要ならばこれらのファイルをひな形として (拡張子を削除して) 使う事が可能です。必要なければ例ファイルを削除する事をおすすめします。<filename>compat</filename> ファイルはそのままにしておくべきです。なぜなら、<filename>compat</filename> ファイルはパッケージビルド作業の様々な段階で使われる <emphasis>debhelper</emphasis> プログラムスイート (<command>dh_</command> から始まるプログラム群) を適切に動作させるために必要だからです。

source: The <filename>copyright</filename> file must contain information about the authors of the documents included in the package, and the related license. In our case, these are internal documents and their use is restricted to within the Falcot Corp company. The default <filename>changelog</filename> file is generally appropriate; replacing the “Initial release” with a more verbose explanation and changing the distribution from <literal>unstable</literal> to <literal>internal</literal> is enough. The <filename>control file</filename> was also updated: the section has been changed to <emphasis>misc</emphasis> and the <literal>Homepage</literal>, <literal>Vcs-Git</literal> and <literal>Vcs-Browser</literal> fields were removed. The <literal>Depends</literal> fields was completed with <literal>iceweasel | www-browser</literal> so as to ensure the availability of a web browser able to display the documents in the package.
ja_jp: <filename>copyright</filename> ファイルには、必ずパッケージに含まれる文書の著者と対応するライセンスに関する情報を含めなければいけません。今回の場合、パッケージには内部文書が含まれ、その使用は Falcot Corp 社内だけに制限されています。デフォルトの <filename>changelog</filename> ファイルはほとんどの場合に適切です; 「Initial release」をより詳しい説明に置き換えたり、<literal>unstable</literal> を <literal>internal</literal> に変えるだけで十分です。<filename>control</filename> ファイルも更新します: section は <emphasis>misc</emphasis> に変更され、<literal>Homepage</literal>、<literal>Vcs-Git</literal>、<literal>Vcs-Browser</literal> は削除されました。<literal>Depends</literal> フィールドには <literal>iceweasel | www-browser</literal> を指定しました。これはパッケージ内の文書を表示するために必要なウェブブラウザがインストールされている事を保証するためです。
pt_br: O arquivo de <filename>direitos autorais</filename> deve conter informações sobre os autores dos documentos incluídos no pacote, e as licenças relacionadas. No nosso caso, estes são documentos internos e sua utilização é limitada para dentro da empresa Corp Falcot. O padrão <filename>changelog</filename> é geralmente apropriado; substituir o "lançamento inicial" com uma explicação mais detalhada e alterar da distribuição <literal>instável</literal> para <literal>interna</literal> é suficiente . O <filename>arquivo de controle</filename> também foi atualizado: a seção foi alterada para <emphasis>variada</emphasis> e a <literal>página inicial</literal>, os campos <literal>Vcs-Git</literal> e <literal>Vcs-Browser</literal> foram removidos. O campo <literal>Dependencia</literal> foi completado com <literal>iceweasel | www-browser</literal>, de modo a assegurar a disponibilidade de um navegador web capaz de exibir os documentos no pacote.

source: The <filename>control</filename> file
ja_jp: <filename>control</filename> ファイル
pt_br: O arquivo <filename>control</filename>

source: The <filename>changelog</filename> file
ja_jp: <filename>changelog</filename> ファイル
pt_br: O arquivo <filename>changelog</filename>

source: The <filename>copyright</filename> file
ja_jp: <filename>copyright</filename> ファイル
pt_br: O arquivo <filename>copyright</filename>

source: <emphasis>BACK TO BASICS</emphasis> <filename>Makefile</filename> file
ja_jp: <emphasis>BACK TO BASICS</emphasis> <filename>Makefile</filename> ファイル
pt_br: <emphasis>DE VOLTA AO BÁSICO</emphasis> arquivo <filename>Makefile</filename>

source: A <filename>Makefile</filename> file is a script used by the <command>make</command> program; it describes rules for how to build a set of files from each other in a tree of dependencies (for instance, a program can be built from a set of source files). The <filename>Makefile</filename> file describes these rules in the following format:
ja_jp: <filename>Makefile</filename> ファイルは <command>make</command> プログラムによって使われるスクリプトです; <filename>Makefile</filename> ファイルは互いに依存関係を持つファイル群をビルドする規則を指定します (例えば、復数のソースファイル群から 1 つのプログラムをビルドする事を指定します)。<filename>Makefile</filename> ファイルはビルド規則を以下のフォーマットで指定します。

source: The interpretation of such a rule is as follows: if one of the <literal>source*</literal> files is more recent than the <literal>target</literal> file, then the target needs to be generated, using <command>command1</command> and <command>command2</command>.
ja_jp: ビルド規則の解釈は以下の通り行われます: <literal>source*</literal> ファイルの 1 つが <literal>target</literal> ファイルよりも新しい場合、<command>command1</command> と <command>command2</command> を使って target を生成します。

source: Note that the command lines must start with a tab character; also note that when a command line starts with a dash character (<literal>-</literal>), failure of the command does not interrupt the whole process.
ja_jp: コマンド行は必ずタブ文字で開始しなければいけない点に注意してください; さらに、コマンド行がダッシュ文字 (<literal>-</literal>) で始まる場合、そのコマンドが失敗しても全体のプロセスは停止されなくなる点に注意してください。
pt_br: Note que as linhas com comandos devem começar com um carácter de tabulação, também note que quando uma linha de comando começa com o carácter travessão (<literal>-</literal>), a falha do comando não interromperá o processo por inteiro.

source: The <filename>rules</filename> file usually contains a set of rules used to configure, build and install the software in a dedicated subdirectory (named after the generated binary package). The contents of this subdirectory is then archived within the Debian package as if it were the root of the filesystem. In our case, files will be installed in the <filename>debian/falcot-data/usr/share/falcot-data/</filename> subdirectory, so that installing the generated package will deploy the files under <filename>/usr/share/falcot-data/</filename>. The <filename>rules</filename> file is used as a <filename>Makefile</filename>, with a few standard targets (including <literal>clean</literal> and <literal>binary</literal>, used respectively to clean the source directory and generate the binary package).
ja_jp: <filename>rules</filename> ファイルには、(生成されるバイナリパッケージにちなんで名付けられた) 専用のサブディレクトリ内で対象のソフトウェアを設定、ビルド、インストールするために使われる一連の規則が定義されています。このサブディレクトリの内容はあたかもサブディレクトリがファイルシステムのルートであるかの如く Debian パッケージの中に保存されます。今回の場合、ファイルは <filename>debian/falcot-data/usr/share/falcot-data/</filename> サブディレクトリにインストールされます。こうすることで、生成されたパッケージをインストールすると、ファイルが <filename>/usr/share/falcot-data/</filename> の下に配備されます。<filename>rules</filename> ファイルは <filename>Makefile</filename> として使われ、幾つかの標準的なターゲット (定義済みの <literal>clean</literal> と <literal>binary</literal> はそれぞれソースディレクトリを削除する場合、バイナリパッケージを生成する場合に使います) が定義されています。
