Repository: Neamar/KISS
Catalog: */15_debian-packaging.po
Languages: ja_jp, pt_br

source: This step represents the opportunity for the candidate to state what they intend to do within the Debian project and to show what they have already done towards that end. Debian is a pragmatic project and saying something is not enough, if the actions do not match what is announced. Generally, when the intended role within the project is related to package maintenance, a first version of the prospective package will have to be validated technically and uploaded to the Debian servers by a sponsor among the existing Debian developers.
ja_jp: この段階で、候補者は Debian プロジェクトの中で何をしたいと思っているのか宣言し、その目的のためにこれまで何をしてきたか示す機会を与えられます。Debian は実用主義的なプロジェクトで、やっている事が言っていることと食い違っている場合、言うだけでは不十分です。一般的に言って、プロジェクト内で希望する役割がパッケージメンテナンスに関連する場合、候補となっているパッケージの最初のバージョンは必ず技術的な正当性を確認され、既存の Debian 開発者から選ばれた保証人によって Debian サーバにアップロードされます。

source: <emphasis>COMMUNITY</emphasis> Sponsoring
ja_jp: <emphasis>COMMUNITY</emphasis> パッケージの支援
pt_br: <emphasis>COMUNIDADE</emphasis> Patrocinando

source: <primary>sponsoring</primary>
ja_jp: <primary>パッケージの支援</primary>
pt_br: <primary>patrocinando</primary>

source: Debian developers can “sponsor” packages prepared by someone else, meaning that they publish them in the official Debian repositories after having performed a careful review. This mechanism enables external persons, who have not yet gone through the new member process, to contribute occasionally to the project. At the same time, it ensures that all packages included in Debian have always been checked by an official member.
ja_jp: Debian 開発者は誰かによって用意されたパッケージを「支援」する事が可能です。これは注意深く調査した後に Debian 開発者が公式の Debian リポジトリの中でパッケージを公開する事を意味します。このメカニズムのお陰で、まだ新メンバー過程を通過していない外部の人も時折 Debian プロジェクトに貢献する事が可能になります。同時に、Debian に含まれるすべてのパッケージは常に公式メンバーによって確認されている事が保証されます。

source: Finally, the examiner checks the candidate's technical (packaging) skills with a detailed questionnaire. Bad answers are not permitted, but the answer time is not limited. All the documentation is available and several tries are allowed if the first answers are not satisfactory. This step does not intend to discriminate, but to ensure at least a modicum of knowledge common to new contributors.
ja_jp: 最後に、試験官は詳細な質問を投げかけて技術的な (パッケージ化) スキルを確認します。間違った回答は許されませんが、回答時間に制限はありません。すべての文書は利用可能で、最初の回答が不十分な場合、何回でも回答を作る事が可能です。この段階は候補者を不当に冷遇するためのものではなく、新しい貢献者が共通に認識しておくべき最低限の僅かな知識を保証するためのものです。
pt_br: Finalmente, o examinador verifica habilidades de técnico (embalagem) do candidato com um questionário detalhado. Respostas ruins não são permitidas, mas o tempo de resposta não é limitado. Toda a documentação está disponível e várias tentativas são permitidas se as primeiras respostas não são satisfatórias. Esta etapa não tem a intenção de discriminar, mas para garantir pelo menos um mínimo de conhecimento comum para novos colaboradores.

source: This step is known as the <emphasis>Tasks &amp; Skills</emphasis> step (T&amp;S for short) in the examiners' jargon. <indexterm><primary><emphasis>Tasks &amp; Skills</emphasis></primary></indexterm>
ja_jp: この段階は試験官の隠語 <emphasis>Tasks &amp; Skills</emphasis> (略して T&amp;S、仕事と技能) として知られています。<indexterm><primary><emphasis>Tasks &amp; Skills</emphasis></primary></indexterm>

source: Final Approval
ja_jp: 最後の承認
pt_br: Aprovação Final

source: At the very last step, the whole process is reviewed by a DAM (<emphasis>Debian Account Manager</emphasis>). The DAM will review all the information about the candidate that the examiner collected, and makes the decision on whether or not to create an account on the Debian servers. In cases where extra information is required, the account creation may be delayed. Refusals are rather rare if the examiner does a good job of following the process, but they sometimes happen. They are never permanent, and the candidate is free to try again at a later time.
ja_jp: 最後の段階で、DAM (<emphasis>Debian アカウントマネージャ</emphasis>) がすべてのプロセスを再確認します。DAM は試験官が集めた候補者に関するすべての情報を再確認し、Debian サーバにアカウントを作成するか否かについて決断を下します。追加的情報が必要な場合、アカウントの作成が遅れるかもしれません。試験官がプロセスに従って良い仕事をしていれば、ここで不合格になることはかなりまれです。しかし、不合格なる場合も時々あります。不合格は永久的なものではありません。候補者は暫くの後再度試験を受ける事が可能です。

source: The DAM's decision is authoritative and (almost) without appeal, which explains why the people in that seat (currently, Jörg Jaspert, Christoph Berg and Enrico Zini) have often been criticized in the past.
ja_jp: DAM の決定は権威的なもので (ほとんど) 覆されません。このお陰で、DAM の役職に就く人 (現在では、Jörg Jaspert さん、Christoph Berg さん、Enrico Zini さん) はこれまずっと批判され続けています。
pt_br: A decisão do DAM é autoritária e (quase sempre) sem apelo, o que explica porque pessoas naquela posição (atualmente, Jörg Jaspert, Christoph Berg e Enrico Zini) foram frequentemente criticados no passado.

source: Rebuilding a binary package is required under several sets of circumstances. In some cases, the administrator needs a software feature that requires the software to be compiled from sources, with a particular compilation option; in others, the software as packaged in the installed version of Debian is not recent enough. In the latter case, the administrator will usually build a more recent package taken from a newer version of Debian — such as <emphasis role="distribution">Testing</emphasis> or even <emphasis role="distribution">Unstable</emphasis> — so that this new package works in their <emphasis role="distribution">Stable</emphasis> distribution; this operation is called “backporting”. As usual, care should be taken, before undertaking such a task, to check whether it has been done already. This can be checked at the <literal>backports.debian.org</literal> site. <indexterm><primary>backport</primary></indexterm>
pt_br: Reconstruir um pacote binário é necessário sob diversas circunstâncias. Em alguns casos, o administrador precisa uma funcionalidade que precisa que o programa seja compilado a partir de suas fontes, com uma opção particular de compilação; em outras, o programa empacotado na versão instalada do Debian não é suficientemente recente. Em último caso, o administrador irá usualmente construir um pacote mais recente retirado de uma versão mais recente do Debian — como <emphasis role="distribution">Testing</emphasis> ou até mesmo <emphasis role="distribution">Unstable</emphasis> — então este novo pacote funcionará em sua distribuição <emphasis role="distribution">Stable</emphasis>; está operação é chamada “backporting”. Como de costume, alguma cautela deve ser tomada, antes de se empreender essa tarefa, para verificar se isto já não foi feito anteriormente. Isto pode ser verificado no site <literal>backports.debian.org</literal>. <indexterm><primary>backport</primary></indexterm>

source: The source of the package is now available in a directory named after the source package and its version (for instance, <emphasis>samba-3.0.24</emphasis>); this is where we'll work on our local changes.
pt_br: O fonte de um pacote está agora disponível em um diretório nomeado após o pacote fonte e sua versão (por exemplo, <emphasis>samba-3.0.24</emphasis>); aqui é onde trabalharemos nas nossas mudanças locais.

source: The first thing to do is to change the package version number, so that the rebuilt packages can be distinguished from the original packages provided by Debian. Assuming the current version is <literal>3.0.24-6</literal>, we can create version <literal>3.0.24-6.falcot1</literal>, which clearly indicates the origin of the package. This makes the package version number higher than the one provided by Debian, so that the package will easily install as an update do the original package. Such a change is best effected with the <command>dch</command> command (<emphasis>Debian CHangelog</emphasis>) from the <emphasis role="pkg">devscripts</emphasis> package, with an invocation such as <command>dch -v 3.0.24-6.falcot1</command>. This invocation invokes a text editor (<command>sensible-editor</command> — this should be your favorite editor if it's mentioned in the <varname>VISUAL</varname> or <varname>EDITOR</varname> environment variables, and default editor otherwise) to allow documenting the differences brought by this rebuild. This editor shows us that <command>dch</command> really did change the <filename>debian/changelog</filename> file.
pt_br: A primeira coisa a se fazer é mudar o número de versão do pacote, para que a reconstrução possa ser distinguida do pacote original provido pelo Debian. Assumindo que a versão atual é <literal>3.0.24-6</literal>,, nós podemos criar uma versão <literal>3.0.24-6.falcot1</literal>, na qual claramente indica a origem do pacote. Isto faz com que a versão do pacote seja maior do que a provida pelo Debian, então o pacote facilmente instalará como se fosse uma atualização do pacte original. Tal mudança tem melhor feito com o comando <command>dch</command> (<emphasis>Debian CHangelog</emphasis>) do pacote <emphasis role="pkg">devscripts</emphasis>, como invocação <command>dch -v 3.0.24-6.falcot1</command>. Está invocação executa um editor de textos (<command>sensible-editor</command> — este deveria ser seu editor de textos favorito se for mencionado na variável de ambiente <varname>VISUAL</varname> ou <varname>EDITOR</varname>, e se não o editor padrão será usado) para permitir a documentação das diferenças trazidas por esta reconstrução. Este editor nos mostra que <command>dch</command> realmente modificou o arquivo <filename>debian/changelog</filename>.

source: When a change in build options is required, changes are made to <filename>debian/rules</filename>, which drives the steps in the package build process. In the simplest cases, the lines concerning the initial configuration (<literal>./configure …</literal>) or the actual build (<literal>$(MAKE) …</literal> or <literal>make …</literal>) are easy to spot. If these commands are not explicitly called, they are probably a side effect of another explicit command, in which case please refer to their documentation to learn more about how to change the default behavior.
pt_br: Quando uma mudança nas opções de construção são necessárias, essas mudanças são feitas no <filename>debian/rules</filename>, o qual controla os passos para o processo de construção do pacote. Nos casos mais simples, as linhas relevantes as configurações iniciais (<literal>./configure …</literal>) ou a construção verdadeira (<literal>$(MAKE) …</literal> ou <literal>make …</literal>) são fáceis de marcar. Se eles comandos são explicitamente chamados, eles provavelmente são efeitos colaterais de outro comando explícito, em cada caso por favor verifique a documentação para aprender mais sobre como modificar o comportamento padrão.

source: If you know for sure that these build-dependencies are too strict, you should feel free to relax them locally. Reading the files which document the standard way of building the software — these files are often called <filename>INSTALL</filename> — will help you figure out the appropriate dependencies. Ideally, all dependencies should be satisfiable from the distribution used for the rebuild; if they are not, a recursive process starts, whereby the packages mentioned in the <literal>Build-Depends</literal> field must be backported before the target package can be. Some packages may not need backporting, and can be installed as-is during the build process (a notable example is <emphasis role="pkg">debhelper</emphasis>). Note that the backporting process can quickly become complex if you are not vigilant. Therefore, backports should be kept to a strict minimum when possible.
pt_br: Se você tem certeza de que estas dependências de compilação são muito rigorosos, você deve se sentir livre para relaxá las localmente. Lendo os arquivos que documentam a forma padrão de construção do software - esses arquivos são chamados frequentemente <filename>INSTALL</filename> - irão ajudar você a descobrir as dependências apropriadas. Idealmente, todas dependências devem ser satisfeitas a partir da distribuição utilizada para a reconstrução, se não forem, um processo recursivo começa, segundo o qual os pacotes mencionados no campo <literal>Build-Depends</literal> deve ser reproduzidos diante do pacote de destino. Alguns pacotes podem não precisar reproduzir, e pode ser instalado como está durante o processo de criação (um exemplo notável é <emphasis role="pkg">debhelper</emphasis>). Observe que o processo reprodução pode tornar-se rapidamente complexo se você não está vigilante. Portanto, a reprodução deve ser mantido a um mínimo estritamente quando possível.

source: <emphasis>TOOL</emphasis> <command>fakeroot</command>
pt_br: <emphasis>FERRAMENTA</emphasis> <command>fakeroot</command>

source: In essence, the package creation process is a simple matter of gathering in an archive a set of existing (or build) files; most of the files will end up being owned by <emphasis>root</emphasis> in the archive. However, building the whole package under this user would imply increased risks; fortunately, this can be avoided with the <command>fakeroot</command> command. This tool can be used to run a program and give it the impression that it runs as <emphasis>root</emphasis> and creates files with arbitrary ownership and permissions. When the program creates the archive that will become the Debian package, it is tricked into creating an archive containing files marked as belonging to arbitrary owners, including <emphasis>root</emphasis>. This setup is so convenient that <command>dpkg-buildpackage</command> uses <command>fakeroot</command> by default when building packages.
pt_br: Essencialmente, o processo de criação de pacotes é simplesmente uma questão de coletar em um arquivo um conjunto de arquivos existentes (ou construídos); a maioria dos arquivos irão acabar sendo de posse do <emphasis>root</emphasis> no arquivo. Entretanto, contruir um pacote inteiro usando este usuário implicaria em riscos maiores, felizmente, isto pode ser evitado com o comando <command>fakeroot</command>. Esta ferramenta pode ser usada para executar um programa e dá-lo a impressão que é executado como <emphasis>root</emphasis> e criar arquivos com posse e permissões arbitrárias. Quando o programa criar o arquivo que se tornará o pacote Debian, ele é enganado a criar um arquivo contendo arquivos marcados pertencendo a usuário arbitrários, incluindo <emphasis>root</emphasis>. Esta configuração é tão conveniente que o <command>dpkg-buildpackage</command> usa o <command>fakeroot</command> por padrão quando cria pacotes.

source: <emphasis>QUICK LOOK</emphasis> <command>pbuilder</command>
pt_br: <emphasis>OLHADA RÁPIDA</emphasis> <command>pbuilder</command>

source: Section: perl Priority: optional Standards-Version: 3.8.4 Package: libxml-libxml-perl Version: 1.57-1 Maintainer: Raphael Hertzog &lt;hertzog@debian.org&gt; Depends: libxml2 (&gt;= 2.6.6) Architecture: all Description: Fake package - module manually installed in site_perl This is a fake package to let the packaging system believe that this Debian package is installed. . In fact, the package is not installed since a newer version of the module has been manually compiled &amp; installed in the site_perl directory.
pt_br: Section: perl Priority: optional Standards-Version: 3.8.4 Package: libxml-libxml-perl Version: 1.57-1 Maintainer: Raphael Hertzog &lt;hertzog@debian.org&gt; Depends: libxml2 (&gt;= 2.6.6) Architecture: all Description: Fake package - módulo instalado manualmente em site_perl Este é um pacote falso para deixar o sistema de empacotamento acreditando que este pacote Debian está instalado. . Na verdade, o pacote não está instalado desde uma versão mais recente do módulo que foi manualmente compilada &amp; instalada no diretório site_perl.

source: <computeroutput>$ </computeroutput><userinput>cd falcot-data-1.0</userinput> <computeroutput>$ </computeroutput><userinput>dh_make --native</userinput> <computeroutput> Type of package: single binary, indep binary, multiple binary, library, kernel module, kernel patch or cdbs? [s/i/m/l/k/n/b] </computeroutput><userinput>i</userinput> <computeroutput> Maintainer name : Raphael Hertzog Email-Address : hertzog@debian.org Date : Mon, 11 Apr 2011 15:11:36 +0200 Package Name : falcot-data Version : 1.0 License : blank Usind dpatch : no Type of Package : Independent Hit &lt;enter&gt; to confirm: Currently there is no top level Makefile. This may require additional tuning. Done. Please edit the files in the debian/ subdirectory now. You should also check that the falcot-data Makefiles install into $DESTDIR and not in / . $</computeroutput>
pt_br: <computeroutput>$ </computeroutput><userinput>cd falcot-data-1.0</userinput> <computeroutput>$ </computeroutput><userinput>dh_make --native</userinput> <computeroutput> Type of package: único binário, binário indep, binário múltiplo, biblioteca, módulo do kernel, patch para o kernel ou cdbs? Type of package: single binary, indep binary, multiple binary, library, kernel module, kernel patch or cdbs? [s/i/m/l/k/n/b] </computeroutput><userinput>i</userinput><computeroutput> Maintainer name : Raphael Hertzog Email-Address : hertzog@debian.org Date : Mon, 11 Apr 2011 15:11:36 +0200 Package Name : falcot-data Version : 1.0 License : blank Usind dpatch : não Type of Package : Independente Pressione &lt;enter&gt; para confirmar: Atualmente não há nível superior Makefile. Isto pode exigir um ajuste adicional. Feito. Por favor, edite os arquivos no agora debian/subdiretório. Você também deve verificar se o instalador falcot-data Makefiles em $DESTDIR e não em /. $</computeroutput>

source: The <command>dh_make</command> command created a <filename>debian</filename> subdirectory with many files. Some are required, in particular <filename>rules</filename>, <filename>control</filename>, <filename>changelog</filename> and <filename>copyright</filename>. Files with the <filename>.ex</filename> extension are example files that can used by modifying them (and removing the extension) when appropriate. When they are not needed, removing them is recommended. The <filename>compat</filename> file should be kept, since it is required for the correct functioning of the <emphasis>debhelper</emphasis> suite of programs (all beginning with the <command>dh_</command> prefix) used at various stages of the package build process.
pt_br: O comando <command>dh_make</command> criou uma pasta <filename>debian</filename> com muitos arquivos. Alguns são necessários, em particular <filename>regras </filename>, <filename>controle</filename>, <filename>changelog</filename> e <filename>copyright</filename>. Arquivos com extensão <filename>ex</filename> são exemplos de arquivos que podem ser utilizados, modificando os (e removendo a extensão), quando apropriado. Quando eles não são necessários, removê los entao é recomendado. O arquivo <filename>compat</filename> deve ser mantido, uma vez que é necessário para o funcionamento correto do conjunto de programas <emphasis>debhelper</emphasis> (todos começando com o prefixo <command> dh_</command>) utilizado em diferentes estágios do pacote do processo de construção.

source: This work was packaged for Debian by Raphael Hertzog &lt;hertzog@debian.org&gt; on Mon, 11 Apr 2011 20:46:33 +0200 Copyright: Copyright (C) 2004-2011 Falcot Corp License: All rights reserved.
pt_br: Este trabalho foi empacotado para o Debian por Raphael Hertzog &lt;hertzog@debian.org&gt; na Seg, 11 Abril 2011 20:46:33 +0200 Direitos Autorais: Direitos Autorais (C) 2004-2011 Falcot Corp Licença: Todos os direitos reservados.

source: A <filename>Makefile</filename> file is a script used by the <command>make</command> program; it describes rules for how to build a set of files from each other in a tree of dependencies (for instance, a program can be build from a set of source files). The <filename>Makefile</filename> file describes these rules in the following format:
pt_br: Um arquivo <filename>Makefile</filename> é um roteiro usado pelo programa <command>make</command>; ele descreve regras para a construção de um conjunto de arquivos a partir de uma árvore de dependências entre si (por exemplo, um programa pode ser construído a partir de um conjunto de arquivos fonte). Os arquivos <filename>Makefile</filename> descrevem essas regras no seguinte formato:

source: target: sources command1 command2
pt_br: target: sources commando1 commando2

source: The interpretation of such a rule is as follows: if one of the files of <literal>sources</literal> is more recent than the <literal>target</literal> file, then the target needs to be generated, using <command>command1</command> and <command>command2</command>.
pt_br: A interpretação dessas regras é como segue: se um dos arquivos <literal>fontes</literal> é mais recente do que o arquivo <literal>alvo</literal>, então o alvo precisará ser gerado, usando o <command>commando1</command> e <command>commando2</command>.

source: At this point, the package can be created. We will however add a lick of paint. Since the administrators want the documents to be easily accessed from the Help menus of graphical desktop environment, we create an entry in the Debian menu system. This is simply done by renaming the <filename>debian/menu.ex</filename> without its extension and editing it as follows:
pt_br: Neste ponto, o pacote pode ser criado. Nós no entanto vamos adicionar um toque especial. Já que os administradores querem que os documentos sejam facilmente acessador a partir dos menus de Ajuda da interface gráfica, nós criaremos uma entrada no sistema de menu do Debian. Isto simplesmente é feito renomeando o <filename>debian/menu.ex</filename> sem sua extensão e editando o seguinte:

source: <emphasis>ALTERNATIVE</emphasis> <command>apt-ftparchive</command>
pt_br: <emphasis>ALTERNATIVA</emphasis> <command>apt-ftparchive</command>

source: <emphasis>ALTERNATIVE</emphasis> CDBS
pt_br: <emphasis>ALTERNATIVA</emphasis> CDBS

source: This step is known as the <emphasis>Tasks &amp; Skills</emphasis> step in the examiners' jargon. <indexterm><primary><emphasis>Tasks &amp; Skills</emphasis></primary></indexterm>
pt_br: Este passo é conhecido como <emphasis>Tasks &amp; Skills</emphasis> no jargão dos examinadores. <indexterm><primary><emphasis>Tasks &amp; Skills</emphasis></primary></indexterm>
