Repository: Neamar/KISS
Catalog: */15_debian-packaging.po
Languages: ja_jp, pt_br

source: Backport
ja_jp: バックポート

source: Rebuild
ja_jp: 再ビルド
pt_br: Reconstruir

source: Source package
ja_jp: ソースパッケージ
pt_br: Pacote fonte

source: Archive
ja_jp: アーカイブ
pt_br: Arquivo

source: Meta-package
ja_jp: メタパッケージ
pt_br: Meta-pacote

source: Debian Developer
ja_jp: Debian 開発者
pt_br: Desenvolvedor Debian

source: Maintainer
ja_jp: メンテナ
pt_br: Mantenedor

source: Creating a Debian Package
ja_jp: Debian パッケージの作成
pt_br: Criando um Pacote Debian

source: It is quite common, for an administrator who has been handling Debian packages in a regular fashion, to eventually feel the need to create their own packages, or to modify an existing package. This chapter aims to answer the most common questions in this field, and provide the required elements to take advantage of the Debian infrastructure in the best way. With any luck, after trying your hand for local packages, you may even feel the need to go further than that and join the Debian project itself!
ja_jp: Debian パッケージを標準的な方法で取り扱ってきた管理者が、いずれは自分自身のパッケージを作成したり、既存のパッケージを変更したりする必要性を感じるということは極めて普通の事です。この章では、パッケージ化に関する最も一般的な質問に答えること、最良のやり方で Debian インフラを上手く使うために必要な要素を提供すること、を目標にしています。運が良ければ、ローカルパッケージを取り扱った後、更に進んで Debian プロジェクト自体に参加する必要性を感じるかもしれません。
pt_br: É muito comum, para um administrador que vem lidando com pacotes Debian de maneira regular, sentir eventualmente a necessidade de criar o seu próprio pacote, ou modificar um pacote existente. Este capítulo tem a intenção de responder as questões mais comuns neste campo, e prover os elementos necessários para tirar vantagem da infraestrutura do Debian da melhor maneira possível. Com alguma sorte, após testar sua mão em pacotes locais, você sinta a necessidade de se aprofundar e eventualmente juntar-se ao projeto Debian em si mesmo!

source: Rebuilding a Package from its Sources
ja_jp: ソースからパッケージを再ビルドする
pt_br: Reconstruindo um Pacote a partir de suas Fontes

source: Rebuilding a binary package is required under several sets of circumstances. In some cases, the administrator needs a software feature that requires the software to be compiled from sources, with a particular compilation option; in others, the software as packaged in the installed version of Debian is not recent enough. In the latter case, the administrator will usually build a more recent package taken from a newer version of Debian — such as <emphasis role="distribution">Testing</emphasis> or even <emphasis role="distribution">Unstable</emphasis> — so that this new package works in their <emphasis role="distribution">Stable</emphasis> distribution; this operation is called “backporting”. As usual, care should be taken, before undertaking such a task, to check whether it has been done already — a quick look on the Package Tracking System's page for that package will reveal that information. <ulink type="block" url="http://packages.qa.debian.org/" /> <indexterm><primary>backport</primary></indexterm>
ja_jp: 幾つかの一連の状況下では、バイナリパッケージの再ビルドが必要です。例えば、管理者は特定のコンパイルオプションを付けてソフトウェアをソースからコンパイルすることで導入されるソフトウェアの機能を必要とする場合があります; また、インストールされた Debian のバージョン向けにパッケージ化されたソフトウェアのバージョンが古い場合があります。ソフトウェアのバージョンが古い場合、管理者は<emphasis role="distribution">テスト版</emphasis>や<emphasis role="distribution">不安定版</emphasis>等の Debian の新しいバージョンから取得したより新しいパッケージをビルドする事が多いです。こうすることで、新しいパッケージを<emphasis role="distribution">安定版</emphasis>ディストリビューションで動かす事が可能です; この操作は「バックポート」と呼ばれています。いつも通り、バックポート作業の前に、既にバックポート作業が実行されているか否かを注意深く確認するべきです。パッケージのパッケージ追跡システムページを一読するだけでこの種の情報が明らかになります。<ulink type="block" url="http://packages.qa.debian.org/" /> <indexterm><primary>backport</primary></indexterm>

source: Getting the Sources
ja_jp: ソースの取得
pt_br: Pegando os Fontes

source: Rebuilding a Debian package starts with getting its source code. The easiest way is to use the <command>apt-get source <replaceable>source-package-name</replaceable></command> command. This command requires a <literal>deb-src</literal> line in the <filename>/etc/apt/sources.list</filename> file, and up-to-date index files (i.e. <command>apt-get update</command>). These conditions should already be met if you followed the instructions from the chapter dealing with APT configuration (see <xref linkend="sect.apt-sources.list" />). Note however, that you'll be downloading the source packages from the Debian version mentioned in the <literal>deb-src</literal> line. If you need another version, you may need to download it manually from a Debian mirror or from the web site. This involves fetching two or three files (with extensions <filename>*.dsc</filename> — for <emphasis>Debian Source Control</emphasis> — <filename>*.tar.<replaceable>comp</replaceable></filename>, and sometimes <filename>*.diff.gz</filename> or <filename>*.debian.tar.<replaceable>comp</replaceable></filename> — <replaceable>comp</replaceable> taking one value among <literal>gz</literal>, <literal>bz2</literal>, <literal>lzma</literal> or <literal>xz</literal> depending on the compression tool in use), then run the <command>dpkg-source -x <replaceable>file.dsc</replaceable></command> command. If the <filename>*.dsc</filename> file is directly accessible at a given URL, there's an even simpler way to fetch it all, with the <command>dget <replaceable>URL</replaceable></command> command. This command (which can be found in the <emphasis role="pkg">devscripts</emphasis> package) fetches the <filename>*.dsc</filename> file at the given address, then analyzes its contents, and automatically fetches the file or files referenced within. With the <literal>-x</literal> option, the source package is even unpacked locally after download.
ja_jp: Debian パッケージの再ビルドはパッケージのソースコードを取得することから始まります。最も簡単な方法は <command>apt-get source <replaceable>source-package-name</replaceable></command> コマンドを使う事です。このコマンドを実行するには <filename>/etc/apt/sources.list</filename> ファイルの中に <literal>deb-src</literal> 行が必要で、さらに最新のインデックスファイル (例えば <command>apt-get update</command> の実行) が必要です。管理者が APT 設定を取り扱う章で説明した内容 (<xref linkend="sect.apt-sources.list" />参照) に従っている場合、これらの状況は既に満足されているはずです。しかしながら、このコマンドは <literal>deb-src</literal> 行で言及されている Debian バージョンのソースパッケージをダウンロードする点に注意してください。もし他のバージョンのソースパッケージが必要な場合、Debian ミラーや Debian のウェブサイトから手作業でダウンロードする必要があるかもしれません。ここでは 2、3 個のファイルを取得します (<emphasis>Debian Source Control</emphasis> 用に <filename>*.dsc</filename> 拡張子を持つファイル、<filename>*.tar.<replaceable>comp</replaceable></filename> としばしば <filename>*.diff.gz</filename> や <filename>*.debian.tar.<replaceable>comp</replaceable></filename> 拡張子を持つファイル、ここで <replaceable>comp</replaceable> は使われている圧縮ツールに応じて <literal>gz</literal>、<literal>bz2</literal>、<literal>lzma</literal>、<literal>xz</literal> の内のどれか 1 つです)。そして<command>dpkg-source -x <replaceable>file.dsc</replaceable></command> コマンドを実行します。<filename>*.dsc</filename> ファイルが URL を指定すれば直接的に利用可能な場合、<command>dget <replaceable>URL</replaceable></command> コマンドを使えばより簡単にすべてを取得する事が可能です。dget コマンドは (<emphasis role="pkg">devscripts</emphasis> パッケージに含まれます) 指定したアドレスから <filename>*.dsc</filename> ファイルを取得し、内容を解析し、ファイル内で参照されている単一もしくは復数のファイルを自動的に取得します。<literal>-x</literal> オプションを付けることで、ダウンロードの後ソースパッケージを展開します。
pt_br: Reconstruir um pacote Debian começado pegando seu código fonte. A maneira mais fácil é utilizando o comando <command>apt-get source <replaceable>nome-do-pacote-fonte</replaceable></command>. Este comando precisa de uma linha <literal>deb-src</literal> no arquivo <filename>/etc/apt/sources.list</filename>, e um indexe de arquivos atualizado(i.e. <command>apt-get update</command>). Estas condições já devem estar corretas se você seguiu as instruções do capítulo que lidou com a configuração do APT (see <xref linkend="sect.apt-sources.list" />). Note entretando, que você baixará o pacote fonte da versão do Debian mencionada na linha <literal>deb-src</literal>. Se você precisar de outra versão, você talvez precise baixá-la manualmente de um espelho Debian ou de seu site.

source: Making Changes
ja_jp: 修正を行う
pt_br: Fazendo Alterações

source: The source of the package is now available in a directory named after the source package and its version (for instance, <emphasis>samba-3.6.16</emphasis>); this is where we'll work on our local changes.
ja_jp: これでパッケージのソースがソースパッケージとバージョンを基に名付けられたディレクトリの中から利用可能になりました (例えば、<emphasis>samba-3.6.16</emphasis> など); このディレクトリ内で我々は修正作業を行います。

source: The first thing to do is to change the package version number, so that the rebuilt packages can be distinguished from the original packages provided by Debian. Assuming the current version is <literal>3.6.16-2</literal>, we can create version <literal>3.6.16-2falcot1</literal>, which clearly indicates the origin of the package. This makes the package version number higher than the one provided by Debian, so that the package will easily install as an update do the original package. Such a change is best effected with the <command>dch</command> command (<emphasis>Debian CHangelog</emphasis>) from the <emphasis role="pkg">devscripts</emphasis> package, with an command such as <command>dch --local falcot</command>. This invokes a text editor (<command>sensible-editor</command> — this should be your favorite editor if it's mentioned in the <varname>VISUAL</varname> or <varname>EDITOR</varname> environment variables, and the default editor otherwise) to allow documenting the differences brought by this rebuild. This editor shows us that <command>dch</command> really did change the <filename>debian/changelog</filename> file.
ja_jp: 最初にパッケージのバージョン番号を変更します。こうすることで、再ビルドされたパッケージを Debian の提供する元パッケージと区別する事が可能です。現在のバージョンが <literal>3.6.16-2</literal> の場合、バージョン <literal>3.6.16-2falcot1</literal> を作成する事が可能です。これはパッケージの出自を明らかに示しています。このパッケージのバージョン番号は Debian が提供するパッケージのバージョン番号よりも大きいため、このパッケージを元パッケージの更新として簡単にインストール可能です。このような作業を極めて効果的に行うには、<emphasis role="pkg">devscripts</emphasis> パッケージの提供する <command>dch</command> コマンド (<emphasis>Debian CHangelog</emphasis>) を <command>dch --local falcot</command> のように使います。これは最良の効果を発揮します。このコマンドはテキストエディタ (<command>sensible-editor</command>、このエディタは <varname>VISUAL</varname> または <varname>EDITOR</varname> 環境変数で定義されている場合お気に入りのエディタです、そうでなければデフォルトエディタです) を起動します。ここで、再ビルドによって導入される変更の内容を記述してください。このエディタは <command>dch</command> が <filename>debian/changelog</filename> ファイルを変更した事を示します。

source: When a change in build options is required, the changes need to be made in <filename>debian/rules</filename>, which drives the steps in the package build process. In the simplest cases, the lines concerning the initial configuration (<literal>./configure …</literal>) or the actual build (<literal>$(MAKE) …</literal> or <literal>make …</literal>) are easy to spot. If these commands are not explicitly called, they are probably a side effect of another explicit command, in which case please refer to their documentation to learn more about how to change the default behavior.
ja_jp: ビルドオプションの変更が必要な場合、<filename>debian/rules</filename> を修正します。<filename>debian/rules</filename> はパッケージビルド作業を動作させるものです。<filename>debian/rules</filename> が最も単純に書かれている場合、初期設定 (<literal>./configure …</literal>) や実際のビルド (<literal>$(MAKE) …</literal> や <literal>make …</literal>) を簡単に見つけられるでしょう。ファイル内にこれらのコマンドが明示的に書かれていない場合、このファイルの内容は別のコマンドに対する作用を書いているのかもしれません。このような場合、デフォルト挙動を変える方法をより詳細に学ぶために文書を参照してください。

source: Depending on the local changes to the packages, an update may also be required in the <filename>debian/control</filename> file, which contains a description of the generated packages. In particular, this file contains <literal>Build-Depends</literal> lines controlling the list of dependencies that must be fulfilled at package build time. These often refer to versions of packages contained in the distribution the source package comes from, but which may not be available in the distribution used for the rebuild. There is no automated way to determine if a dependency is real or only specified to guarantee that the build should only be attempted with the latest version of a library — this is the only available way to force an <emphasis>autobuilder</emphasis> to use a given package version during build, which is why Debian maintainers frequently use strictly versioned build-dependencies.
ja_jp: パッケージに対して行った変更の内容に依っては、<filename>debian/control</filename> ファイルの内容もまた更新する必要があります。<filename>debian/control</filename> ファイルには生成されるパッケージの説明が含まれます。特に、<filename>debian/control</filename> ファイルには、パッケージのビルド時点で満足されなければいけない依存関係のリストを制御する <literal>Build-Depends</literal> 行が含まれます。<literal>Build-Depends</literal> 行で指定されているパッケージのバージョンはソースパッケージが提供されるディストリビューションに含まれるパッケージのバージョンと一致している場合が多いです。しかし、再ビルドを行うディストリビューションではここで指定されているバージョンが利用できないかもしれません。依存関係が本物か、それともビルド時にライブラリの最新版を試す事を保証するためだけ指定されているかを決定する自動的な方法はありません。<literal>Build-Depends</literal> 行を使う事が、<emphasis>autobuilder</emphasis> にビルド中に与えられたパッケージバージョンを使う事を強制するための、唯一の利用可能な方法なので、Debian メンテナはバージョンを厳しく指定したビルド依存関係を使う事が多いです。
pt_br: Dependendo das mudanças locais nos pacotes, uma atualização talvez seja necessária no arquivo <filename>debian/control</filename> , o qual contém uma descrição dos pacotes gerados. Em particular, este arquivo contém linhas <literal>Build-Depends</literal> que controlam uma lista de dependências que devem ser satisfeitas durante a construção do pacote. Estas geralmente se referem a versões de pacotes contidos na distribuição da qual o pacote fonte veio, mas quais talvez não estejam disponíveis na distribuição utilizada na reconstrução. Não há maneira automática para determinar se uma dependência é real ou apenas especificada para garantir que a construção seja apenas tentada com a última versão da biblioteca — esta é a única maneira de se forçar um <emphasis>construtor automático</emphasis> usar um pacote dado durante a construção, eis o porque dos mantenedores Debian frequentemente utilizarem versões restritas das dependências de construção.

source: If you know for sure that these build-dependencies are too strict, you should feel free to relax them locally. Reading the files which document the standard way of building the software — these files are often called <filename>INSTALL</filename> — will help you figure out the appropriate dependencies. Ideally, all dependencies should be satisfiable from the distribution used for the rebuild; if they are not, a recursive process starts, whereby the packages mentioned in the <literal>Build-Depends</literal> field must be backported before the target package can be. Some packages may not need backporting, and can be installed as-is during the build process (a notable example is <emphasis role="pkg">debhelper</emphasis>). Note that the backporting process can quickly become complex if you are not careful. Therefore, backports should be kept to a strict minimum when possible.
ja_jp: もしあなたが、指定されているビルド依存関係が厳しすぎる事が間違いないと判っている場合、手元で自由に依存関係を緩和する事が可能です。対象のソフトウェアをビルドする標準的な方法について説明している <filename>INSTALL</filename> ファイルを読むことは適切な依存関係を明らかにする助けになります。理想的に言えば、再ビルドに使うディストリビューションの要素を使って、すべての依存関係を満足するべきです; それが無理ならば、対象のパッケージをバックポートする前に、再帰的に <literal>Build-Depends</literal> フィールドで言及されているパッケージを必ずバックポートしなければいけません。一部のパッケージはバックポートの必要が無く、ビルド作業中に現状のままインストール可能です (特筆すべき例は <emphasis role="pkg">debhelper</emphasis> です)。バックポート作業は気を付けないとすぐに複雑になる点に注意してください。それゆえ、バックポートは可能な限り厳密に必要最低限に留めるべきです。

source: <emphasis>TIP</emphasis> Installing <literal>Build-Depends</literal>
ja_jp: <emphasis>TIP</emphasis> <literal>Build-Depends</literal> のインストール
pt_br: <emphasis>DICA</emphasis> Instalando <literal>Build-Depends</literal>

source: <indexterm><primary><literal>Build-Depends</literal>, control field</primary></indexterm> <command>apt-get</command> allows installing all packages mentioned in the <literal>Build-Depends</literal> fields of a source package available in a distribution mentioned in a <literal>deb-src</literal> line of the <filename>/etc/apt/sources.list</filename> file. This is a simple matter of running the <command>apt-get build-dep <replaceable>source-package</replaceable></command> command.
ja_jp: <indexterm><primary><literal>Build-Depends</literal>、コントロールフィールド</primary></indexterm> <command>apt-get</command> を使うことで、あるソースパッケージの <literal>Build-Depends</literal> フィールドに指定されているすべてのパッケージをインストールする事が可能です。ここで、<filename>/etc/apt/sources.list</filename> ファイルの <literal>deb-src</literal> 行で指定されているディストリビューションで利用可能なパッケージがインストールされます。これは、<command>apt-get build-dep <replaceable>source-package</replaceable></command> コマンドを実行するだけの単純な方法です。
pt_br: <indexterm><primary><literal>Build-Depends</literal>, campo de controle</primary></indexterm> <command>apt-get</command> permite instalar todos os pacotes mencionados nos campos <literal>Build-Depends</literal> de um pacote fonte disponível em uma distribuição mencionada na linha <literal>deb-src</literal> no arquivo <filename>/etc/apt/sources.list</filename>. Isto é uma questão de simplesmente executar o comando <command>apt-get build-dep <replaceable>source-package</replaceable></command>.

source: Starting the Rebuild
ja_jp: 再ビルドの開始
pt_br: Começando a Reconstrução

source: When all the needed changes have been applied to the sources, we can start generating the actual binary package (<filename>.deb</filename> file). The whole process is managed by the <command>dpkg-buildpackage</command> command.
ja_jp: ソースに対するすべての必要な変更が完了したら、実際のバイナリパッケージ (<filename>.deb</filename> ファイル) を生成します。すべてのプロセスは <command>dpkg-buildpackage</command> コマンドで管理されます。
pt_br: Quando todas mudanças necessárias forem aplicadas aos fontes, podemos começar a gerar o verdadeiro pacote binário (arquivo <filename>.deb</filename>). Todo o processo é gerenciado pelo comando <command>dpkg-buildpackage</command>.

source: Rebuilding a package
ja_jp: パッケージの再ビルド
pt_br: Reconstruindo um pacote

source: In essence, the package creation process is a simple matter of gathering in an archive a set of existing (or built) files; most of the files will end up being owned by <emphasis>root</emphasis> in the archive. However, building the whole package under this user would imply increased risks; fortunately, this can be avoided with the <command>fakeroot</command> command. This tool can be used to run a program and give it the impression that it runs as <emphasis>root</emphasis> and creates files with arbitrary ownership and permissions. When the program creates the archive that will become the Debian package, it is tricked into creating an archive containing files marked as belonging to arbitrary owners, including <emphasis>root</emphasis>. This setup is so convenient that <command>dpkg-buildpackage</command> uses <command>fakeroot</command> by default when building packages.
ja_jp: 基本的に、パッケージ作成作業とは存在する (ビルドされた) ファイル群を 1 つのアーカイブにまとめるという単純作業に過ぎません; ほとんどのファイルは最終的にアーカイブ中で <emphasis>root</emphasis> によって所有される事になります。しかしながら、パッケージ全体を root で作ると暗黙のうちにリスクが増加します; 幸いなことに、<command>fakeroot</command> コマンドを使うことでこれを避ける事が可能です。<command>fakeroot</command> はプログラムを実行したり、<emphasis>root</emphasis> として実行し任意の所有者とパーミッションを持つファイルを作成するするという印象を与えるために使う事が可能です。<command>fakeroot</command> プログラムで Debian パッケージとなるアーカイブを作成した場合、<command>fakeroot</command> プログラムは <emphasis>root</emphasis> を含めた任意の所有者に所属するとしてマークされたアーカイブを作成します。このセットアップはパッケージをビルドする際にデフォルトで <command>dpkg-buildpackage</command> が <command>fakeroot</command> を使う場合にとても便利です。

source: Note that the program is only tricked into “believing” that it operates as a privileged account, and the process actually runs as the user running <command>fakeroot <replaceable>program</replaceable></command> (and the files are actually created with that user's permissions). At no time does it actually get root privileges that it could abuse.
ja_jp: プログラムは騙されて特権アカウントとして操作するように「信じこまされる」だけです。プロセスは <command>fakeroot <replaceable>program</replaceable></command> を実行しているユーザの権限で実行されます (作成されるファイルはそのユーザのパーミッションを与えられます)。fakeroot が実際に root 権限を取得してそれを乱用することは決してありません。
pt_br: Note que o programa é somente enganado a "acreditar" que está operando com uma conta privilegiada, e o processo de fato é executado como o usuário que executou o <command><replaceable>programa</replaceable> fakeroot</command> (e os arquivos são na verdade criados com as permissões daquele usuário). Em nenhum momento ele realmente consegue privilégios de root aos quais poderia abusar.

source: The previous command can fail if the <literal>Build-Depends</literal> fields have not been updated, or if the related packages are not installed. In such a case, it is possible to overrule this check by passing the <literal>-d</literal> option to <command>dpkg-buildpackage</command>. However, explicitly ignoring these dependencies runs the risk of the build process failing at a later stage. Worse, the package may seem to build correctly but fail to run properly: some programs automatically disable some of their features when a required library is not available at build time.
ja_jp: <literal>Build-Depends</literal> フィールドが更新されていなかったり、関連するパッケージがインストールされていなかった場合、<command>dpkg-buildpackage</command> コマンドは失敗します。そのような場合、<command>dpkg-buildpackage</command> に <literal>-d</literal> オプションを指定して、依存関係確認を行わないようにする事も可能です。しかしながら、依存関係を明示的に無視すると、後々の段階でビルド作業が失敗する恐れがあります。さらに悪いことに、パッケージが正常にビルドされたように見えても、正しく動かない可能性があります: 一部のプログラムは、必要なライブラリがビルド時に利用可能でない場合、一部の機能を自動的に無効化します。
pt_br: O comando anterior pode falhar se os campos <literal>Build-Depends</literal> não foram atualizados, ou se os pacotes relacionados não foram instalados. Neste caso, é possível anular esta verificação passando a opção <literal>-d</literal> para o <command>dpkg-buildpackage</command>. Entretanto, ignorando explicitamente essas dependências corre-se o risco do processo de construção falhar em um próximo estágio. Pior, o pacote pode parecer corretamente construído mas falhar ao ser executado: alguns programas automaticamente desabilitam algumas de suas funcionalidades quando uma biblioteca necessária não está disponível em tempo de construção.

source: More often than not, Debian developers use a higher-level program such as <command>debuild</command>; this runs <command>dpkg-buildpackage</command> as usual, but it also adds an invocation of a program that runs many checks to validate the generated package against the Debian policy. This script also cleans up the environment so that local environment variables do not “pollute” the package build. The <command>debuild</command> command is one of the tools in the <emphasis>devscripts</emphasis> suite, which share some consistency and configuration to make the maintainers' task easier.
ja_jp: しばしば、Debian 開発者は <command>debuild</command> 等の高レベルプログラムを使います; <command>debuild</command> は通常通り <command>dpkg-buildpackage</command> を実行しますが、加えて生成されたパッケージの Debian ポリシーに対する妥当性を確認するプログラムを実行します。このスクリプトは、手元の環境変数がパッケージビルドを「汚染」しないように、ビルド環境を整えます。<command>debuild</command> コマンドは <emphasis>devscripts</emphasis> スイートに含まれるツールの 1 つで、メンテナの仕事を簡単にするための幾つかの一貫性と設定を共有します。
pt_br: Mais frequentemente do que nunca, os desenvolvedores Debian usam programas de alto nível como o <command>debuild</command>; ele executa <command>dpkg-buildpackage</command> como de costume, mas ele também incluí a execução de um programa que executa diversas verificações para validar a geração dos pacotes contra a política do Debian. Este script também limpa o ambiente para que variáveis locais não "poluam" a construção do pacote. O comando <command>debuild</command> é umas das ferramentas da suíte <emphasis>devscripts</emphasis>, que divide alguma consistência e configuração para tornar as tarefa dos mantenedores mais fácil.
