Repository: Neamar/KISS
Catalog: */15_debian-packaging.po
Languages: ja_jp, pt_br

source: Although this file is the heart of the process, it increasingly contains only the bare minimum for running a standard set of commands provided by the <command>debhelper</command> tool. Such is the case for files generated by <command>dh_make</command>. To install our files, we simply configure the behavior of the <command>dh_install</command> command by creating the following <filename>debian/falcot-data.install</filename> file:
ja_jp: <filename>rules</filename> ファイルはビルド作業の核心で、<command>debhelper</command> ツールによって提供される標準的なコマンド群を実行するために必要な最低限の要素だけを含みます。これが面倒を見るのは <command>dh_make</command> によって生成されたファイルだけです。自分のファイルをインストールするためには、以下の <filename>debian/falcot-data.install</filename> ファイルを作成して、<command>dh_install</command> コマンドの挙動を単純に設定します。
pt_br: Embora esse arquivo seja o coração do processo, cada vez mais ele contém somente a informação mínima para executar um conjunto padrão de comandos provido pela ferramenta <command>debhelper</command>. Tal é o cado dos arquivos gerados pelo <command>dh_make</command>. Para instalar nossos arquivos, nós simplesmente configuramos o comportamento do comando <command>dh_install</command> criando o seguinte arquivo <filename>debian/falcot-data.install</filename>:

source: At this point, the package can be created. We will however add a lick of paint. Since the administrators want the documents to be easily accessed from the Help menus of graphical desktop environments, we create an entry in the Debian menu system. This is simply done by renaming the <filename>debian/menu.ex</filename> without its extension and editing it as follows:
ja_jp: この時点で、パッケージを作成する事が可能になります。しかしながら、もう少しファイルを追加します。管理者はグラフィカルデスクトップ環境のヘルプメニューから文書へ簡単にアクセスできるようにしたいので、Debian メニューシステムにエントリを作成しました。これは <filename>debian/menu.ex</filename> の拡張子を外し、以下のとおり編集することで、単純に行われます。

source: The <filename>menu</filename> file
ja_jp: <filename>menu</filename> ファイル
pt_br: O arquivo <filename>menu</filename>

source: The <literal>needs</literal> field, when set to <literal>X11|wm</literal> indicates that this entry only makes sense in a graphical interface. It will therefore only be integrated into the menus of the graphical (X11) applications and window managers (hence the <literal>wm</literal>). The <literal>section</literal> field states where in the menu the entry should be displayed. In our case, the entry will be in the Help menu. The <literal>title</literal> field contains the text that will be displayed in the menu. Finally, the <literal>command</literal> field describes the command to run when the user selects the menu entry.
ja_jp: <literal>needs</literal> フィールドが <literal>X11|wm</literal> に設定された場合、このエントリがグラフィカルインターフェースでのみ意味を持つ事を意味します。そのため、このエントリはグラフィカル (X11) アプリケーションとウィンドウマネージャ (<literal>wm</literal>) のメニューに統合されます。<literal>section</literal> フィールドはこのエントリが表示されるメニュー内の場所を指定します。今回の場合、このエントリは Help メニューに表示されます。<literal>title</literal> フィールドはメニューに表示されるテキストを指定します。最後に、<literal>command</literal> フィールドはユーザがメニューエントリを選択した時に実行するコマンドを指定します。

source: The second entry matches the first one, with slight adaptations adapted to the Linux console text mode.
ja_jp: 2 番目のエントリは 1 番目のエントリを Linux コンソールテキストモードに適応させたものです。
pt_br: A segunda entrada combina com a primeira, com pequenas adaptações para o modo texto do Linux.

source: <emphasis>DEBIAN POLICY</emphasis> Menu organization
ja_jp: <emphasis>DEBIAN POLICY</emphasis> メニュー統合
pt_br: <emphasis>POLÍTICA DO DEBIAN</emphasis> Organização do menu

source: The Debian menus are organized in a formal structure, documented in the following text: <ulink type="block" url="http://www.debian.org/doc/packaging-manuals/menu-policy/" />
ja_jp: Debian メニューは規則に従って統合されます。詳細は以下のテキストに書かれています: <ulink type="block" url="http://www.debian.org/doc/packaging-manuals/menu-policy/" />
pt_br: O menus do Debian são organizados em uma estrutura formal, documentada no seguinte texto: <ulink type="block" url="http://www.debian.org/doc/packaging-manuals/menu-policy/" />

source: The <literal>section</literal> in a <filename>menu</filename> file should be picked from the list mentioned in this document.
ja_jp: <filename>menu</filename> ファイルの <literal>section</literal> の値はこの文書で述べられているリストの値を使うべきです。
pt_br: A <literal>seção</literal> no arquivo <filename>menu</filename> deve ser selecionado da lista mencionada neste documento.

source: Simply creating the <filename>debian/menu</filename> file is enough to enable the menu in the package, since the <command>dh_installmenu</command> command is automatically invoked by <command>dh</command> during the package build process.
ja_jp: パッケージ内でメニューを有効化するには、単純に <filename>debian/menu</filename> ファイルを作成するだけで十分です。なぜなら、パッケージビルド作業の間に <command>dh</command> が <command>dh_installmenu</command> コマンドを自動的に呼び出すからです。
pt_br: Simplesmente criando o arquivo <filename>debian/menu</filename> é o suficiente para habilitar o menu no pacote, desde que o comando <command>dh_installmenu</command> seja automaticamente invocado por <command>dh</command> durante o processo de criação do pacote.

source: Our source package is now ready. All that's left to do is to generate the binary package, with the same method we used previously for rebuilding packages: we run the <command>dpkg-buildpackage -us -uc</command> command from within the <filename>falcot-data-1.0</filename> directory.
ja_jp: これでソースパッケージの準備が整いました。最後に残された作業は、以前パッケージを再ビルドした際に使った方法と同じ方法を使って、バイナリパッケージを生成する事です: バイナリパッケージを生成するには、<filename>falcot-data-1.0</filename> ディレクトリの中で、<command>dpkg-buildpackage -us -uc</command> コマンドを実行します。
pt_br: Nosso pacote fonte está pronto. Tudo o que sobrou fazer é gerar um pacote binário, com o mesmo método que usamos anteriormente para construir pacotes: executamos o comando <command>dpkg-buildpackage -us -uc</command> de dentro do diretório <filename>falcot-data-1.0</filename>.

source: Creating a Package Repository for APT
ja_jp: APT 用のパッケージリポジトリの作成
pt_br: Criando um Repositório de Pacotes para o APT

source: <primary>package archive</primary>
ja_jp: <primary>パケージアーカイブ</primary>
pt_br: <primary>arquivo de pacote</primary>

source: <primary>package</primary><secondary>Debian</secondary><tertiary>archive of</tertiary>
ja_jp: <primary>パッケージ</primary><secondary>Debian</secondary><tertiary>アーカイブ</tertiary>
pt_br: <primary>pacote de</primary><secondary>arquivo</secondary><tertiary>Debian</tertiary>

source: Falcot Corp gradually started maintaining a number of Debian packages either locally modified from existing packages or created from scratch to distribute internal data and programs.
ja_jp: Falcot Corp の保守する Debian パッケージの数は次第に増えました。この中には、既存のパッケージから手元で修正したパッケージや、内部データとプログラムを配布するために最初から作成したパッケージなどがあります。
pt_br: Falcot Corp gradualmente começou a manter alguns pacotes Debian modificados localmente a partir de pacotes existentes ou criados do zero para distribuir dados e programas internos.

source: To make deployment easier, they want to integrate these packages in a package archive that can be directly used by APT. For obvious maintenance reasons, they wish to separate internal packages from locally-rebuilt packages. The goal is for the matching entries in a <filename>/etc/apt/sources.list</filename> file to be as follows:
ja_jp: パッケージの配備を簡単にするために、管理者はこれらのパッケージを APT から直接使う事が可能なパッケージアーカイブに統合したいと思っています。明らかなメンテナンス上の理由により、管理者は内部パッケージと手元で再ビルドしたパッケージを別にしたいと思っています。目標は <filename>/etc/apt/sources.list</filename> ファイル内のエントリを以下のようにする事です:
pt_br: Para facilitar a instalação, eles querem a integração destes pacotes em um repositório que possa ser acessado diretamente usando a ferramenta APT. Por motivos de manutenção óbvios, eles querem separar os pacotes internos dos pacotes refeitos localmente. O objetivo é ter as entradas correspondentes no arquivo <filename>/etc/apt/sources.list</filename> como segue:

source: The administrators therefore configure a virtual host on their internal HTTP server, with <filename>/srv/vhosts/packages/</filename> as the root of the associated web space. The management of the archive themselves is delegated to the <command>mini-dinstall</command> command (in the similarly-named package). This tool keeps an eye on an <filename>incoming/</filename> directory (in our case, <filename>/srv/vhosts/packages/mini-dinstall/incoming/</filename>) and waits for new packages there; when a package is uploaded, it is installed into a Debian archive at <filename>/srv/vhosts/packages/</filename>. The <command>mini-dinstall</command> command reads the <filename>*.changes</filename> file created when the Debian package is generated. These files contain a list of all other files associated to the version of the package (<filename>*.deb</filename>, <filename>*.dsc</filename>, <filename>*.diff.gz</filename>/<filename>*.debian.tar.gz</filename>, <filename>*.orig.tar.gz</filename>, or their equivalents with other compression tools), and they allow <command>mini-dinstall</command> to know which files to install. <filename>*.changes</filename> files also contain the name of the target distribution (often <literal>unstable</literal>) mentioned in the latest <filename>debian/changelog</filename> entry, and <command>mini-dinstall</command> uses this information to decide where the package should be installed. This is why administrators must always change this field before building a package, and set it to <literal>internal</literal> or <literal>updates</literal>, depending on the target location. <command>mini-dinstall</command> then generates the files required by APT, such as <filename>Packages.gz</filename>.
ja_jp: このため、管理者は内部 HTTP サーバ上に仮想ホストを設定して、APT リポジトリのルートとして <filename>/srv/vhosts/packages/</filename> を割り当てます。アーカイブ自体の管理は <command>mini-dinstall</command> コマンド (よく似た名前のパッケージに含まれます) に委託されます。<command>mini-dinstall</command> ツールは <filename>incoming/</filename> ディレクトリ (今回の場合、<filename>/srv/vhosts/packages/mini-dinstall/incoming/</filename>) を監視して、新しいパッケージがこのディレクトリにアップロードされる事を待ちます; パッケージがアップロードされたら、<filename>/srv/vhosts/packages/</filename> の Debian アーカイブにインストールされます。<command>mini-dinstall</command> コマンドは Debian パッケージが生成された時に作成される <filename>*.changes</filename> ファイルを読みます。<filename>*.changes</filename> ファイルには、パッケージのバージョンに対応するその他のファイル (<filename>*.deb</filename>、<filename>*.dsc</filename>、<filename>*.diff.gz</filename>/<filename>*.debian.tar.gz</filename>、<filename>*.orig.tar.gz</filename>、他の圧縮ツールを使った場合の同等ファイル) のリストが含まれます。これらのファイルを使うことで、<command>mini-dinstall</command> はインストールするファイルを把握します。さらに <filename>*.changes</filename> ファイルの中で、最新の <filename>debian/changelog</filename> エントリで対象ディストリビューションの名前 (通常 <literal>unstable</literal>) が言及されています。<command>mini-dinstall</command> はこの情報を使ってパッケージをインストールする場所を決めます。このため、管理者はパッケージをビルドする前にこのフィールドを必ず変更し、対象パッケージを配備する場所に従ってこのフィールドを <literal>internal</literal> または <literal>updates</literal> に設定しなければいけません。この後、<command>mini-dinstall</command> は APT が必要とする <filename>Packages.gz</filename> 等のファイルを生成します。

source: If <command>mini-dinstall</command> seems too complex for your Debian archive needs, you can also use the <command>apt-ftparchive</command> command. This tool scans the contents of a directory and displays (on its standard output) a matching <filename>Packages</filename> file. In the Falcot Corp case, administrators could upload the packages directly into <filename>/srv/vhosts/packages/updates/</filename> or <filename>/srv/vhosts/packages/internal/</filename>, then run the following commands to create the <filename>Packages.gz</filename> files:
ja_jp: 必要な Debian アーカイブが <command>mini-dinstall</command> の手に余るほど複雑な場合、<command>apt-ftparchive</command> コマンドを使う事も可能です。<command>apt-ftparchive</command> ツールはディレクトリの内容を走査し、一致する <filename>Packages</filename> ファイルを (標準出力に) 表示します。Falcot Corp の場合、管理者はパッケージを直接 <filename>/srv/vhosts/packages/updates/</filename> や <filename>/srv/vhosts/packages/internal/</filename> にアップロードする事が可能です。その後以下のコマンドを実行して <filename>Packages.gz</filename> ファイルを作成します:

source: The <command>apt-ftparchive sources</command> command allows creating <filename>Sources.gz</filename> files in a similar fashion.
ja_jp: <command>apt-ftparchive sources</command> コマンドを使えば、同様の方法で <filename>Sources.gz</filename> ファイルを作成する事が可能です。
pt_br: O comando <command>apt-ftparchive sources</command> permite criar arquivos <filename>Sources.gz</filename> de maneira similar.

source: Configuring <command>mini-dinstall</command> requires setting up a <filename>~/.mini-dinstall.conf</filename> file; in the Falcot Corp case, the contents are as follows:
ja_jp: <command>mini-dinstall</command> を設定するには、<filename>~/.mini-dinstall.conf</filename> ファイルのセットアップが必要です; Falcot Corp の場合、内容は以下の通りです。
pt_br: Para configurar o <command>mini-dinstall</command> é necessário a configuração do arquivo <filename>~/.mini-dinstall.conf</filename>; no caso da Falcot Corp, o conteúdo é o seguinte:

source: One decision worth noting is the generation of <filename>Release</filename> files for each archive. This can help manage package installation priorities using the <filename>/etc/apt/preferences</filename> configuration file (see <xref linkend="sect.apt.priorities" /> for details).
ja_jp: 各アーカイブに対して <filename>Release</filename> ファイルを作成することに決めた点は注目に値します。こうすることで、<filename>/etc/apt/preferences</filename> 設定ファイルを使ってパッケージインストール優先度を管理することに役立ちます (詳細は<xref linkend="sect.apt.priorities" />参照)。

source: <emphasis>SECURITY</emphasis> <command>mini-dinstall</command> and permissions
ja_jp: <emphasis>SECURITY</emphasis> <command>mini-dinstall</command> とパーミッション
pt_br: <emphasis>SEGURANÇA</emphasis> <command>mini-dinstall</command> e permissões

source: Since <command>mini-dinstall</command> has been designed to run as a regular user, there's no need to run it as root. The easiest way is to configure everything within the user account belonging to the administrator in charge of creating the Debian packages. Since only this administrator has the required permissions to put files in the <filename>incoming/</filename> directory, we can deduce that the administrator authenticated the origin of each package prior to deployment and <command>mini-dinstall</command> does not need to do it again. This explains the <literal>verify_sigs = 0</literal> parameter (which means that signatures need not be verified). However, if the contents of packages are sensitive, we can reverse the setting and elect to authenticate with a keyring containing the public keys of persons allowed to create packages (configured with the <literal>extra_keyrings</literal> parameter); <command>mini-dinstall</command> will then check the origin of each incoming package by analyzing the signature integrated to the <filename>*.changes</filename> file.
ja_jp: <command>mini-dinstall</command> は標準的なユーザとして実行されるように設計されています。root で実行される必要はありません。最も簡単な方法は Debian パッケージ作成担当の管理者グループに所属するユーザアカウント内ですべてを設定する事です。Debian パッケージ作成担当の管理者だけに <filename>incoming/</filename> ディレクトリにファイルを追加するのに必要なパーミッションを持たせた場合、パッケージを追加する前に各パッケージの出自の確認は済んでいると考えられますし、<command>mini-dinstall</command> を使って再度パッケージの出自を再確認する必要も無くなります。このため、パラメータ <literal>verify_sigs = 0</literal> が設定されています (これは <command>mini-dinstall</command> が署名を確認する必要がない事を意味します)。しかしながら、パッケージの内容が機密に関わるものであれば、この設定を逆にして、パッケージ作成担当者の公開鍵を含む鍵束 (<literal>extra_keyrings</literal> パラメータを使って設定されます) を使ってパッケージの出自を確認するように設定する事が可能です; このように設定した場合、<command>mini-dinstall</command> は <filename>*.changes</filename> ファイルに統合された署名を解析することによってアップロードされた各パッケージの出自を確認します。

source: Invoking <command>mini-dinstall</command> actually starts a daemon in the background. As long as this daemon runs, it will check for new packages in the <filename>incoming/</filename> directory every half-hour; when a new package arrives, it will be moved to the archive and the appropriate <filename>Packages.gz</filename> and <filename>Sources.gz</filename> files will be regenerated. If running a daemon is a problem, <command>mini-dinstall</command> can also be manually invoked in batch mode (with the <literal>-b</literal> option) every time a package is uploaded into the <filename>incoming/</filename> directory. Other possibilities provided by <command>mini-dinstall</command> are documented in its <citerefentry><refentrytitle>mini-dinstall</refentrytitle> <manvolnum>1</manvolnum></citerefentry> manual page.
ja_jp: <command>mini-dinstall</command> を実行すると、バックグラウンドでデーモンが開始されます。<command>mini-dinstall</command> デーモンが実行されている限り、デーモンは 30 分毎に <filename>incoming/</filename> ディレクトリにアップロードされた新しいパッケージを確認します; 新しいパッケージがアップロードされると、パッケージはアーカイブに移動され、適切な <filename>Packages.gz</filename> と <filename>Sources.gz</filename> ファイルが再生成されます。デーモンの実行に問題がある場合、<filename>incoming/</filename> ディレクトリにパッケージをアップロードしたら毎回、手作業で <command>mini-dinstall</command> をバッチモードで実行します (<literal>-b</literal> オプションを付けます)。<command>mini-dinstall</command> 他の使い方は <citerefentry><refentrytitle>mini-dinstall</refentrytitle> <manvolnum>1</manvolnum></citerefentry> マニュアルページで説明されています。

source: <emphasis>EXTRA</emphasis> Generating a signed archive
ja_jp: <emphasis>EXTRA</emphasis> 署名済みアーカイブの生成
pt_br: <emphasis>EXTRA</emphasis> Gerando um arquivo assinado

source: The APT suite checks a chain of cryptographic signatures on the packages it handles before installing them (and has done so since <emphasis role="distribution">Etch</emphasis>), in order to ensure their authenticity (see <xref linkend="sect.package-authentication" />). Private APT archives can then be a problem, since the machines using them will keep displaying warnings about unsigned packages. A diligent administrator will therefore integrate private archives with the secure APT mechanism.
ja_jp: APT スイートは対象のパッケージをインストールする前にそのパッケージに含まれる一連の暗号署名を確認し (<emphasis role="distribution">Etch</emphasis> 以降、APT は署名を確認するようになりました)、そのパッケージの信頼性を確かめます (<xref linkend="sect.package-authentication" />参照)。この挙動はプライベート APT アーカイブにとって問題です。なぜなら、プライベート APT アーカイブを使うマシンでは署名されていないパッケージに関する警告が表示され続けるからです。真面目な管理者は安全な APT メカニズムを使ってプライベート APT アーカイブを統合するでしょう。

source: To help with this process, <command>mini-dinstall</command> includes a <literal>release_signscript</literal> configuration option that allows specifying a script to use for generating the signature. A good starting point is the <filename>sign-release.sh</filename> script provided by the <emphasis role="pkg">mini-dinstall</emphasis> package in <filename>/usr/share/doc/mini-dinstall/examples/</filename>; local changes may be relevant.
ja_jp: この作業を助けるために、<command>mini-dinstall</command> には、署名の生成に使うスクリプトを指定する <literal>release_signscript</literal> 設定オプションが含まれます。<emphasis role="pkg">mini-dinstall</emphasis> パッケージによって提供された <filename>/usr/share/doc/mini-dinstall/examples/</filename> 内に含まれる <filename>sign-release.sh</filename> スクリプトが良い足掛かりとなるでしょう; 手元で修正が必要かもしれません。

source: Becoming a Package Maintainer
ja_jp: パッケージメンテナになる
pt_br: Tornando-se um Mantenedor de Pacotes

source: Learning to Make Packages
ja_jp: パッケージを作るための知識
pt_br: Aprendendo a Fazer Pacotes

source: Creating a quality Debian package is not always a simple task, and becoming a package maintainer takes some learning, both with theory and practice. It's not a simple matter of building and installing software; rather, the bulk of the complexity comes from understanding the problems and conflicts, and more generally the interactions, with the myriad of other packages available.
ja_jp: 上質な Debian パッケージを作成することは簡単な作業ではありません。パッケージメンテナになるためには理論と実践の両方の知識が必要です。ソフトウェアをビルドしたりインストールすることは簡単ではありません; むしろ複雑さの大部分は他の無数の利用可能なパッケージとの問題と対立、より一般には相関性、を理解することに由来します。
pt_br: Criar um pacote Debian de qualidade não é sempre uma tarefa fácil, e tornar-se um mantenedor de pacote necessita aprendizado, tanto na teoria e na prática. Não é simplesmente uma questão de construir ou instalar programas, em vez disso, a maior parte da complexidade vem do entendimento de problemas e conflitos, e mais geralmente as interações, com a miríade de outros pacotes disponíveis.

source: Rules
ja_jp: 規則
pt_br: Regras

source: A Debian package must comply with the precise rules compiled in the Debian policy, and each package maintainer must know them. There is no requirement to know them by heart, but rather to know they exist and to refer to them whenever a choice presents a non-trivial alternative. Every Debian maintainer has made mistakes by not knowing about a rule, but this is not a huge problem as soon as the error is fixed when a user reports it as a bug report, which tends to happen fairly soon thanks to advanced users. <ulink type="block" url="http://www.debian.org/doc/debian-policy/" />
ja_jp: Debian パッケージは必ず Debian ポリシーにまとめられた正確な規則に従わなければいけません。各パッケージメンテナはこの規則を知らなければいけません。規則を暗記する必要はありませんが、規則の存在を知り、重要な判断を下す局面では常に規則を参照する必要があります。Debian メンテナは全員規則をよく知らない事が原因で間違いを犯した経験がありますが、これは大きな問題ではありません。なぜなら、ユーザがバグ報告としてこの間違いを報告すればすぐにその間違いは修正されるからです。上級ユーザのお陰で修正はかなり素早く行われる事が多いです。<ulink type="block" url="http://www.debian.org/doc/debian-policy/" />

source: Procedures
ja_jp: 手続き
pt_br: Procedimentos

source: <primary>Debian Developer's Reference</primary>
ja_jp: <primary>Debian 開発者リファレンス</primary>
pt_br: <primary>Referência do desenvolvedor Debian</primary>

source: Debian is not a simple collection of individual packages. Everyone's packaging work is part of a collective project; being a Debian developer involves knowing how the Debian project operates as a whole. Every developer will, sooner or later, interact with others. The Debian Developer's Reference (in the <emphasis role="pkg">developers-reference</emphasis> package) summarizes what every developer must know in order to interact as smoothly as possible with the various teams within the project, and to take the best possible advantages of the available resources. This document also enumerates a number of duties a developer is expected to fulfill. <ulink type="block" url="http://www.debian.org/doc/developers-reference/" />
ja_jp: Debian は各パッケージを単純に集めたものではありません。全員のパッケージ化作業は共同プロジェクトの一部です; Debian 開発者になるには、Debian プロジェクトが全体としてどのように運営されているかを知る必要があります。Debian 開発者は全員、遅かれ早かれ、他人と協力して行動することになるでしょう。Debian 開発者リファレンス (<emphasis role="pkg">developers-reference</emphasis> パッケージに含まれます) では、開発者全員が、プロジェクト内の様々なチームと可能な限り円滑に一緒に仕事を行ったり利用可能な資源を大いに活用するために、必ず知らなければいけない事を要約しています。また、Debian 開発者リファレンスは管理者が果たすべき数多くの義務も列挙しています。<ulink type="block" url="http://www.debian.org/doc/developers-reference/" />

source: Tools
ja_jp: ツール
pt_br: Ferramentas

source: Many tools help package maintainers in their work. This section describes them quickly, but does not give the full details, since they all have comprehensive documentation on their own.
ja_jp: 数多くのツールがパッケージメンテナの仕事を手伝います。この節では、それらのツールを簡単に説明し、詳細は説明しません。なぜなら、これらのツールには、総合的な文書が用意されているからです。
pt_br: Muitas ferramentas ajudam os mantenedores dos pacotes em seu trabalho. Esta seção descreve elas rapidamente, mas não dá todos os detalhes, já que eles contém uma documentação abrangente em si.

source: The <command>lintian</command> Program
ja_jp: <command>lintian</command> プログラム
pt_br: O Programa <command>lintian</command>

source: This tool is one of the most important: it's the Debian package checker. It is based on a large array of tests created from the Debian policy, and detects quickly and automatically a great many errors that can be fixed before packages are released.
ja_jp: <command>lintian</command> は最も重要なツールの 1 つです: <command>lintian</command> は Debian パッケージをチェックします。<command>lintian</command> は Debian ポリシーから作成された大量のテスト群に基づき、パッケージがリリースされる前に修正する事が可能な多くのエラーを素早く自動的に検出します。
pt_br: Está ferramenta é uma das mais importantes: é o verificador de pacotes Debian. É baseada em uma vasta matriz de testes criada pela política do Debian, e detecta rapidamente e automaticamente um grande número de error que podem ser arrumados antes do pacote ser lançado.
