Repository: Neamar/KISS
Catalog: */70_conclusion.po
Languages: fr_fr, ja_jp

source: Future
fr_fr: Avenir
ja_jp: 将来

source: Improvements
fr_fr: Améliorations
ja_jp: 改善

source: Opinions
ja_jp: 意見

source: Conclusion: Debian's Future
fr_fr: Conclusion : l'avenir de Debian
ja_jp: 結論: Debian の未来

source: The story of Falcot Corp ends with this last chapter; but Debian lives on, and the future will certainly bring many interesting surprises.
fr_fr: L'histoire de Falcot SA s'arrête, pour le moment, avec ce dernier chapitre. Mais celle de Debian continue et l'avenir nous réserve à coup sûr de nombreuses et agréables surprises.
ja_jp: Falcot Corp の物語はこの最後の章で終わります; しかし Debian は生き続け、そして Debian の将来が多くの興味深い驚きをもたらすことは間違いありません。

source: Upcoming Developments
fr_fr: Développements à venir
ja_jp: 今後の開発

source: Weeks (or months) before a new version of Debian is released, the Release Manager picks the codename for the next version. Now that Debian version 7 is out, the developers are already busy working on the next version, codenamed <emphasis role="distribution">Jessie</emphasis>…
fr_fr: Quelques semaines à quelques mois avant la sortie d'une nouvelle version, le <foreignphrase>Release Manager</foreignphrase> choisit le nom de code de la prochaine. La version actuelle de Debian est la version 7, mais les développeurs s'affairent déjà à la préparation de la version suivante : nom de code <emphasis role="distribution">Jessie</emphasis>…
ja_jp: Debian の新バージョンがリリースされる数週間前 (または数ヶ月前) にリリースマネージャは次のバージョンのコードネームを選びます。Debian バージョン 7 がリリースされています。開発者は既に次のバージョン、コードネーム <emphasis role="distribution">Jessie</emphasis>、の作業で忙しいです…

source: There's no official list of planned changes, and Debian never makes promises relating to technical goals of the coming versions. However, a few development trends can already be noted, and we can try some bets on what might happen (or not).
fr_fr: Il n'existe pas de liste des changements prévus et Debian ne s'engage jamais quant aux objectifs techniques de la version suivante. Mais quelques axes de développement existent et on peut se risquer à quelques paris quant à ce qui pourrait arriver.
ja_jp: 予定されている変更に関する公式のリストは存在しませんし、Debian が次期バージョンの技術的目標に関して約束をすることは絶対にありません。しかしながら、幾つかの開発傾向が既に説明されており、何が起こるか(起こらないか) について予想する事が可能です。

source: The default “init” process (<command>sysvinit</command>) will hopefully be replaced by a more modern system such as <command>upstart</command> or <command>systemd</command>. Some ports will be gone: <literal>s390</literal> has been superseded by <literal>s390x</literal>, <literal>sparc</literal> and <literal>ia64</literal> might follow as they suffer from multiple problems (lack of recent hardware, lack of Debian porters, lack of upstream support, etc.). <command>dpkg</command> will gain a <command>--verify</command> command that renders <command>debsums</command> mostly obsolete.
fr_fr: Avec un peu de chance, le processus « init » par défaut (actuellement <command>sysvinit</command>) sera remplacé par un système plus moderne comme <command>upstart</command> ou <command>systemd</command>. Certains ports vont disparaître : <literal>s390</literal> a été rendu obsolète par <literal>s390x</literal> ; <literal>sparc</literal> et <literal>ia64</literal> risquent de suivre le même chemin, du fait de nombreux problèmes (notamment le manque de matériel récent disponible, le manque de porteurs, le manque de support en amont, etc.). <command>dpkg</command> gagnera une commande <command>--verify</command> qui rendra <command>debsums</command> à peu près obsolète.
ja_jp: 上手くいけば、デフォルトの「init」プロセス (<command>sysvinit</command>) は <command>upstart</command> や <command>systemd</command> などのより現代的なシステムに変更されるでしょう。幾つかの移植版のサポートは終了されるでしょう: <literal>s390</literal> は <literal>s390x</literal> に変わりました。<literal>sparc</literal> と <literal>ia64</literal> は復数の問題 (最新のハードウェアの不足、Debian 移植版開発者の不足、上流開発サポートの不足など) に悩まされているため、サポートが終了されるかもしれません。<command>dpkg</command> に <command>--verify</command> コマンドが追加されるでしょう。これは <command>debsums</command> はほとんど時代遅れと宣告しています。

source: Of course, all the main software suites will have had a major release. Apache 2.4 (or newer) will have a strong impact on deployed websites as many configuration files will have to be updated. The Linux kernel is likely to have a much improved container support (with user namespaces, paving the path towards more secure containers). And the latest version of the various desktops will bring better usability and new features. GNOME 3 will be much more polished and the fans of the good old GNOME 2 will be pleased with the inclusion of <ulink url="http://mate-desktop.org/">MATE</ulink> in Debian.
fr_fr: Bien sûr, toutes les grandes suites logicielles verront au moins une mise à jour majeure. Apache 2.4 (ou plus) aura un impact important sur les sites déployés, puisque de nombreux fichiers de configuration devront être mis à jour. Le noyau Linux aura vraisemblablement grandement amélioré le support des conteneurs (notamment le support des espaces de nommage pour les utilisateurs, ce qui tracera le chemin vers des conteneurs plus sécurisés qu'actuellement). Et la dernière version des divers bureaux apportera son lot d'améliorations en termes de fonctionnalités et de confort d'utilisation. GNOME 3 en particulier sera beaucoup plus abouti ; les inconditionnels du bon vieux GNOME 2 seront soulagés d'apprendre l'inclusion de <ulink url="http://mate-desktop.org/">MATE</ulink> dans Debian.
ja_jp: もちろん、すべての主要なソフトウェアスイートはメジャーリリースに更新されるでしょう。Apache 2.4 (およびそれより高いバージョン) は配備されたウェブサイトに対して大きな衝撃を与えるでしょうから、多くの設定ファイルを更新しなければいけないでしょう。Linux カーネルのコンテナサポートがより改善されそうです (ユーザ名前空間を持つことで、コンテナをより安全に動かす事が可能になります)。様々なデスクトップの最新版がユーザビリティと新しい機能をもたらすことでしょう。GNOME 3 はさらに洗練され、古き良き GNOME 2 の愛好者は <ulink url="http://mate-desktop.org/">MATE</ulink> を Debian 内に含めたことに満足するでしょう。

source: Debian's Future
fr_fr: Avenir de Debian
ja_jp: Debian の未来

source: In addition to these internal developments, one can reasonably expect new Debian-based distributions to come to light, as many tools keep making this task easier. New specialized subprojects will also be started, in order to widen Debian's reach to new horizons.
fr_fr: En dehors de ces développements internes, il est probable que de nouvelles distributions fondées sur Debian verront le jour grâce aux nombreux outils qui simplifient cette tâche. Par ailleurs de nouveaux sous-projets spécifiques naîtront, élargissant toujours le spectre des domaines couverts par Debian.
ja_jp: これらの内部開発に加えて、新しい Debian ベースのディストリビューションが登場する事がかなり期待されます。なぜなら、多くのツールのお陰で Debian ベースのディストリビューションを作る方法がさらに簡単になっているからです。Debian の使われる分野を更に広くするために、新しい専門化サブプロジェクトが開始されるでしょう。

source: The Debian user community will increase, and new contributors will join the project… including, maybe, you!
fr_fr: La communauté des utilisateurs Debian se sera étoffée, et de nouveaux contributeurs rejoindront le projet... dont vous serez peut-être !
ja_jp: Debian ユーザコミュニティは増加し、新しい貢献者が Debian プロジェクトに参加するでしょう… その貢献者とはあなたかもしれません!

source: The Debian project is stronger than ever, and well on its way towards its goal of a universal distribution; the inside joke within the Debian community is about <foreignphrase>World Domination</foreignphrase>.
fr_fr: Force est de constater que le projet Debian est plus vigoureux que jamais, et qu'il est désormais bien lancé vers son objectif de distribution universelle. <foreignphrase>World Domination</foreignphrase> (ou domination mondiale), dit-on en plaisantant dans les rangs de Debian.
ja_jp: Debian プロジェクトは以前にもまして強力なものとなり、ユニバーサルディストリビューションという Debian の目標に向かって進むでしょう; Debian コミュニティ内の内輪ネタ的な表現をすれば<foreignphrase>世界征服</foreignphrase>を成し遂げるでしょう。

source: In spite of its old age and its respectable size, Debian keeps on growing in all kinds of (sometimes unexpected) directions. Contributors are teeming with ideas, and discussions on development mailing lists, even when they look like bickerings, keep increasing the momentum. Debian is sometimes compared to a black hole, of such density that any new free software project is attracted.
fr_fr: Malgré son ancienneté et sa taille déjà importante Debian continue de croître et d'évoluer dans de nombreuses directions — certaines sont d'ailleurs inattendues. Les contributeurs ne manquent jamais d'idées, et les discussions sur les listes de développement — même si parfois elles ressemblent à des chamailleries — ne cessent d'alimenter la machine. Certains comparent même Debian à un trou noir : sa densité est telle qu'elle attire systématiquement tout nouveau projet libre.
ja_jp: Debian は高齢で相当な大きさにも関わらず、Debian はあらゆる (しばしば予想外の) 方面に成長し続けています。貢献者はアイディアに満ちており、言い争いになる場合もありますが、開発メーリングリスト上の議論は勢いを増し続けています。Debian はしばしばブラックホールと比較されます。Debian の密度は新しいフリーソフトウェアプロジェクトを惹きつけています。

source: Beyond the apparent satisfaction of most Debian users, a deep trend is becoming more and more indisputable: people are increasingly realising that collaborating, rather than working alone in their corner, leads to better results for everyone. Such is the rationale used by distributions merging into Debian by way of subprojects.
fr_fr: Au-delà du fait que Debian semble satisfaire une majorité de ses utilisateurs il y a une tendance de fond : les gens commencent à se rendre compte qu'en collaborant — plutôt que de faire sa cuisine dans son coin — il est possible d'obtenir un résultat meilleur pour tous. C'est bien la logique suivie par toutes les distributions qui se greffent à Debian, en formant des sous-projets.
ja_jp: Debian は ほとんどの Debian ユーザを満足させるだけに留まらず、Debian の根幹を成す方向性はますます確実なものになりつつあります: 人々は、1 人で仕事を行うよりも協力して仕事するほうが皆にとってより良い結果につながる、ということに次第に気がつき始めています。これはサブプロジェクトの型で Debian に合流するディストリビューションが使う論理的根拠です。

source: The Debian project is therefore not threatened by extinction…
fr_fr: Le projet Debian n'est donc pas près de disparaître...
ja_jp: ゆえに Debian プロジェクトは絶滅の危機に脅かされることはありません…

source: Future of this Book
fr_fr: Avenir de ce livre
ja_jp: この本の将来

source: We would like this book to evolve in the spirit of free software. We therefore welcome contributions, remarks, suggestions, and criticism. Please direct them to Raphaël (<email>hertzog@debian.org</email>) or Roland (<email>lolando@debian.org</email>). For actionable feedback, feel free to open bug reports against the <literal>debian-handbook</literal> Debian package. The website will be used to gather all information relevant to its evolution, and you will find there information on how to contribute, in particular if you want to translate this book to make it available to an even larger public than today. <ulink type="block" url="http://debian-handbook.info/" />
fr_fr: Nous souhaitons que ce livre puisse évoluer dans l'esprit du logiciel libre. C'est pourquoi nous vous invitons à y contribuer en nous faisant part de vos remarques, de vos suggestions et de vos critiques. Pour cela, vous pouvez écrire directement à Raphaël (<email>hertzog@debian.org</email>) et Roland (<email>lolando@debian.org</email>). Le site web ci-contre regroupera l'ensemble des informations portant sur son évolution. Vous y trouverez aussi les informations sur comment y contribuer, en particulier si vous souhaitez aider à traduire ce livre et le rendre disponible à un public encore plus vaste qu'aujourd'hui. <ulink type="block" url="http://debian-handbook.info/" />
ja_jp: 我々はこの本がフリーソフトウェアの精神で進化する事を望んでいます。そのため、我々は貢献、意見、提案、批判を歓迎します。これらを Raphaël (<email>hertzog@debian.org</email>) か Roland (<email>lolando@debian.org</email>) 宛にお送りください。実用的なフィードバックの場合、気軽に <literal>debian-handbook</literal> Debian パッケージに対してバグ報告を出してください。我々のウェブサイトはパッケージの進化に関するすべての情報を集めるために使われています。このウェブサイトには貢献する方法に関する情報が含まれ、特にこの本を翻訳して今よりも多くの人々が利用できるものにしたいと思っている人にとって有用です。<ulink type="block" url="http://debian-handbook.info/" />

source: We tried to integrate most of what our experience at Debian taught us, so that anyone can use this distribution and take the best advantage of it as soon as possible. We hope this book contributes to making Debian less confusing and more popular, and we welcome publicity around it!
fr_fr: Nous avons essayé d'intégrer tout ce que notre expérience chez Debian nous a fait découvrir, afin que tout un chacun puisse utiliser cette distribution et en tirer le meilleur profit le plus rapidement possible. Nous espérons que ce livre contribue à la démystification et à la popularisation de Debian. N'hésitez donc pas à le recommander !
ja_jp: この本で我々は Debian から教えられた経験の内容のほとんどを統合する事を試みました。そうすれば、誰もが Debian ディストリビューションを使う事が可能になり、可能な限り素早く Debian を最大限に活用する事が可能になるからです。我々はこの本が Debian をより判りやすくより人気にするための一助となる事を望んでおり、この本の評判が高くなる事を歓迎します!

source: We'd like to conclude on a personal note. Writing (and translating) this book took a considerable amount of time out of our usual professional activity. Since we're both freelance consultants, any new source of income grants us the freedom to spend more time improving Debian; we hope this book to be successful and to contribute to this. In the meantime, feel free to retain our services! <ulink type="block" url="http://www.freexian.com" /> <ulink type="block" url="http://www.gnurandal.com" />
fr_fr: Pour conclure, nous aimerions finir sur une note plus personnelle. La réalisation de ce livre nous a pris un temps considérable en dehors de nos activités professionnelles habituelles. Comme nous sommes tous deux des consultants informatiques indépendants, toute source de revenus complémentaires nous offre la liberté de consacrer encore plus de temps au développement de Debian. Nous espérons que le succès de ce livre y contribuera. En attendant, n'hésitez pas à faire appel à nos services ! <ulink type="block" url="http://www.freexian.com" /> <ulink type="block" url="http://www.gnurandal.com" />
ja_jp: 我々は最後に個人的内容でこの本を締め括りたいと思っています。我々はこの本を執筆 (及び翻訳) するために、通常の本業の他に、かなりの時間をかけました。我々 2 人はどちらもフリーランスのコンサルタントなので、新しい収入源があることで Debian を改善するためにより長い時間を使う事が可能になります; 我々はこの本が成功し、我々の新しい収入源になる事を期待しています。また、遠慮無く我々のコンサルティングサービスをお使いください! <ulink type="block" url="http://www.freexian.com" /> <ulink type="block" url="http://www.gnurandal.com" />

source: See you soon!
fr_fr: À bientôt !
ja_jp: それではまた!
