Repository: Neamar/KISS
Catalog: */90_derivative-distributions.po
Languages: ar_ma, de_de, es_es, zh_cn

source: Live CD
ar_ma: قرص حي

source: Specificities
ar_ma: خصوصيات
de_de: Besonderheiten
es_es: Especificidades
zh_cn: 具体

source: Particular Choices
ar_ma: خيارات متميزة
de_de: Eine kleine Auswahl
es_es: Elecciones particulares
zh_cn: 特定选择

source: Derivative Distributions
ar_ma: توزيعات مشتقة
de_de: Derivate (Abgeleitete Distributionen)
es_es: Distribuciones derivadas
zh_cn: 衍生发行版

source: <indexterm><primary>derivative distribution</primary></indexterm> <indexterm><primary>distribution, derivative</primary></indexterm> Many Linux distributions are derivatives of Debian and reuse Debian's package management tools. They all have their own interesting properties, and it is possible one of them will fulfill your needs better than Debian itself.
ar_ma: <indexterm><primary>توزيعة مشتقة</primary></indexterm> <indexterm><primary>مشتق، توزيعة</primary></indexterm> هناك العديد من توزيعات لينكس المشتقة من دبيان والتي تستفيد من أدوات دبيان لإدارة الحزم. لكل منها خصائصها المميزة، ولعل إحداها تلبي احتياجاتك بشكل أفضل من دبيان نفسها.
de_de: <indexterm><primary>Abgeleitete Distributionen</primary></indexterm> <indexterm><primary>Distribution, abgeleitet</primary></indexterm>Viele Linux Distributionen sind Derivate von Debian und verwenden Debians Paketverwaltung. Alle haben eigene interessante Eigenschaften und es ist möglich, dass eine von ihnen die gestellten Bedürfnisse besser erfüllt als Debian selbst.
es_es: <indexterm><primary>distribución derivada</primary></indexterm> <indexterm><primary>derivada, distribuciones</primary></indexterm> Muchas distribuciones Linux son derivadas de Debian y reutilizan las herramientas de gestión de paquetes de Debian. Todas tiene características interesantes y es posible que una de ellas se adapte mejor a sus necesidades que Debian en sí.
zh_cn: <indexterm><primary>衍生发行版</primary></indexterm> <indexterm><primary>发新版, 衍生物</primary></indexterm>很多的Linux发行版都是Debian的衍生物并且使用Debian的包管理工具。它们都有他们自己的有趣的特性，并且很有可能其中一款比原Debian更适合你的需要。

source: Census and Cooperation
ar_ma: الإحصاء والتعاون
de_de: Beteiligung und Kooperation
es_es: Censo y cooperación
zh_cn: 调查和合作

source: The Debian project fully acknowledges the importance of derivative distributions and actively supports collaboration between all involved parties. This usually involves merging back the improvements initially developed by derivative distributions so that everyone can benefit and long-term maintenance work is reduced.
ar_ma: يدرك مشروع دبيان تماماً أهمية التوزيعات المشتقة ويدعم التعاون مع كل الأطراف المشتركة بنشاط. هذا يشمل إعادة دمج التحسينات التي تطورها التوزيعات المشتقة عادة، حتى يستفيد منها الجميع وتبسيط عملية الصيانة على المدى الطويل.
de_de: Das Debian-Projekt erkennt die Wichtigkeit von abgeleiteten Distributionen an und unterstützt aktiv die Zusammenarbeit zwischen allen Beteiligten. Diese Zusammenarbeit beinhaltet das Integrieren von Verbesserungen die ursprünglich von abgeleiteten Distributionen entwickelt wurden, sodass jeder daraus einen Vorteil zieht und die Arbeit zur langfristigen Pflege reduziert wird.
es_es: El Proyecto Debian reconoce plenamente la importancia de distribuciones derivadas y respalda activamente la colaboración entre todas las partes involucradas. Usualmente esto involucra integrar mejoras desarrolladas inicialmente por una distribución derivada de tal manera que cualquiera pueda beneficiarse y se reduzca el trabajo de mantenimiento a largo plazo.
zh_cn: Debian项目非常肯定衍生版本的重要性，并且积极支持所有参与方之间的合作。通常是通过合并衍生版开发的一些改进到Debian主线，这样其它的参与方也就能从中受益并且长远的减轻他们的维护工作量。

source: This explains why derivative distributions are invited to become involved in discussions on the <literal>debian-derivatives@lists.debian.org</literal> mailing-list, and to participate in the derivative census. This census aims at collecting information on work happening in a derivative so that official Debian maintainers can better track the state of their package in Debian variants. <ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />
ar_ma: هذا يفسّر سبب دعوة التوزيعات المشتقة للمساهمة في النقاشات على القائمة البريدية <literal>debian-derivatives@lists.debian.org</literal>، والمشاركة في إحصاء المشتقات. يهدف هذا الإحصاء لجمع المعلومات عن الأعمال التي تجري في المشتقات بحيث يتمكن مشرفو دبيان من تتبع حالة حزمهم في المشتقات الدبيانية بشكل أفضل. <ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />
de_de: Dies erklärt, warum abgeleitete Distributionen eingeladen sind, sich in Diskussionen auf der <literal>debian-derivatives@lists.debian.org</literal> Mailing-Liste einzubringen und am Zensus zu abgeleiteten Distributionen teilzunehmen. Das Ziel der Beteiligung ist es, Informationen zu Arbeiten an den abgeleiteten Distributionen zu sammeln, damit die offiziellen Debian Maintainer besser den Status ihrer Pakete in den Debian Varianten verfolgen können. <ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />
es_es: Esto explica porqué se invita a las distribuciones derivadas a involucrarse en las discusiones en la lista de correo <literal>debian-derivatives@lists.debian.org</literal> y participar en el censo de derivados. Este censo tiene el objetivo de recolectar información sobre el trabajo que ocurre en un derivado para que los desarrolladores Debian oficiales puedan seguir más fácilmente el estado de sus paquetes en las variantes de Debian. <ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />
zh_cn: 这就解释了为什么衍生版被邀请到<literal>debian-derivatives@lists.debian.org</literal>邮件列表种参与讨论，并且参与衍生版的调查。这种调查的目的是手机衍生版开发过程种的信息，以便官方Debian维护者能够更好的跟踪在Debian变种种的属于他们的软件包。<ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />

source: Let us now briefly describe the most interesting and popular derivative distributions.
ar_ma: دعنا الآن نتحدث سريعاً عن أفضل وأشهر التوزيعات المشتقة.
de_de: Lassen Sie uns nun kurz die interessantesten und bekanntesten Derivate ansehen.
es_es: Ahora describiremos brevemente las distribuciones derivadas más interesantes y populares.
zh_cn: 现在给大家简要的介绍一下最有意思和受欢迎的衍生版本。

source: Ubuntu
ar_ma: أوبنتو

source: <primary>Ubuntu</primary>
ar_ma: <primary>أوبنتو</primary>

source: Ubuntu made quite a splash when it came on the Free Software scene, and for good reason: Canonical Ltd., the company that created this distribution, started by hiring thirty-odd Debian developers and publicly stating the far-reaching objective of providing a distribution for the general public with a new release twice a year. They also committed to maintaining each version for a year and a half.
ar_ma: حققت أوبنتو (Ubuntu) ظهوراً عندما دخلت ساحة البرمجيات الحرة، وهذا لسبب وجيه: إذ بدأت شركة .Canonical Ltd، وهي الشركة التي أنشأت هذه التوزيعة، باستئجار حوالي ثلاثين مطور دبيان وأعلنت الهدف الذي تسمو إليه ألا وهو توفير توزيعة لعموم الناس تصدر مرتين سنوياً. كما التزموا بصيانة كل نسخة لمدة سنة ونصف.
es_es: Ubuntu causó gran revuelo cuando llegó al escenario del Software Libre, y por buenas razones: Canonical Ltd., la empresa que creó esta distribución, comenzó contratando poco más de treinta desarrolladores Debian y publicando su objetivo a muy largo plazo de proveer una distribución para el público en general con una nueva versión dos veces al año. También se comprometieron a mantener cada versión por un año y medio.

source: These objectives necessarily involve a reduction in scope; Ubuntu focuses on a smaller number of packages than Debian, and relies primarily on the GNOME desktop (although an official Ubuntu derivative, called “Kubuntu”, relies on KDE). Everything is internationalized and made available in a great many languages.
ar_ma: لتحقيق هذه الأهداف لا بد من تضييق مجال العمل؛ حيث تركز أوبنتو على عدد من الحزم أقل من عدد حزم دبيان، وتعتمد على سطح المكتب GNOME بشكل أساسي (رغم وجود نسخة مشتقة رسمية تعتمد على KDE اسمها ”Kubuntu“). كل شيء مهيأ للترجمة (internationalized) ويتوفر في عدد كبير من اللغات.
es_es: Estos objetivos necesariamente conllevaron una reducción en su alcance; Ubuntu se concentra en una menor cantidad de paquetes que Debian y está basada principalmente en el escritorio GNOME (aunque una distribución oficial derivada de Ubuntu, llamada «Kubuntu», está basada en KDE). Todo es internacionalizado y está disponible en muchos idiomas.

source: So far, Ubuntu has managed to keep this release rhythm. They also publish <emphasis>Long Term Support</emphasis> (LTS) releases, with a 5-year maintenance promise. As of November 2013, the current LTS version is version 12.04, nicknamed Precise Pangolin. The latest non-LTS version is 13.10, nicknamed Saucy Salamander. Version numbers describe the release date: 13.10, for example, was released in October 2013.
ar_ma: تمكنت أوبنتو من المحافظة على إيقاع الإصدارات هذا حتى الآن. كما أنهم يطلقون إصدارات طويلة الدعم (<emphasis>Long Term Support</emphasis>، أو LTS اختصاراً) فترة دعمها 5 سنوات. إصدار LTS الحالي (في نوفمبر 2013) هو 12.04، الذي يدعى Percise Pangolin. أما آخر إصدار عادي فهو 13.10، الذي يدعى Saucy Salamander. تعبّر أرقام النسخة عن تاريخ الإصدار: فمثلاً أصدرت 13.10 في أكتوبر 2013.
es_es: Hasta ahora, Ubuntu logró mantener este ritmo de publicación. También publican versiones de <emphasis>soporte a largo plazo</emphasis> (LTS: «Long Term Support»), con una promesa de manutención de 5 años. En Noviembre de 2013, la versión LTS actual es la 12.04, apodada «Precise Pangolin». La última versión no LTS es la 12.10, apodada «Saucy Salamander». Los números de versión describen la fecha de publicación: 13.10, por ejemplo, fue publicada en Octubre de 2013.

source: <emphasis>IN PRACTICE</emphasis> Ubuntu's support and maintenance promise
ar_ma: <emphasis>ممارسة عملية</emphasis> التزام أوبنتو بالدعم والتحديثات
es_es: <emphasis>EN LA PRÁCTICA</emphasis> el soporte que ofrece Ubuntu y la promesa de mantenimiento

source: Canonical has adjusted multiple times the rules governing the length of the period during which a given release is maintained. Canonical, as a company, promises to provide security updates to all the software available in the <literal>main</literal> and <literal>restricted</literal> sections of the Ubuntu archive, for 5 years for LTS releases and for 9 months for non-LTS releases. Everything else (available in the <literal>universe</literal> and <literal>multiverse</literal>) is maintained on a best-effort basis by volunteers of the MOTU team (<emphasis>Masters Of The Universe</emphasis>). Be prepared to handle security support yourself if you rely on packages of the latter sections.
ar_ma: لقد عدلت Canonical القواعد التي تحدد طول مدة دعم كل إصدار عدة مرات. تلتزم Canonical ‒كشركة‒ بتوفير التحديثات الأمنية لكافة البرمجيات المتوفرة في القسمين <literal>main</literal> و<literal>restricted</literal> من مستودعات أوبنتو، لمدة 5 سنوات للإصدارات طويلة الدعم، و9 شهور للإصدارات العادية. كل ما عدا ذلك (الموجود في <literal>universe</literal> و<literal>multiverse</literal>) فيديره فريق MOTU‏ (<emphasis>Masters Of The Universe</emphasis>) تطوعياً بأفضل ما يستطيعون. عليك أن تستعد لمعالجة الترقيعات الأمنية وحدك إذا كنت تعتمد على حزم من هذين القسمين الأخيرين.
es_es: Canonical ha ajustado varias veces las reglas que controlan la longitud del período durante el que se mantiene una publicación dada. Canonical, como empresa, promete proveer actualizaciones de seguridad para todo el software disponible en las secciones <literal>main</literal> y <literal>restricted</literal> del compendio de Ubuntu durante 5 años para publicaciones LTS y por 9 meses para publicaciones que no lo sean. Los miembros del equipo MOTU (<emphasis>dueños del universo</emphasis>: «Masters Of The Universe») mantienen todos los demás paquetes (disponibles en <literal>universe</literal> y <literal>multiverse</literal>) según el mejor esfuerzo posible. Prepárese para gestionar el soporte de seguridad por su cuenta si depende de paquetes en estas últimas secciones.

source: Ubuntu has reached a wide audience in the general public. Millions of users were impressed by its ease of installation, and the work that went into making the desktop simpler to use.
ar_ma: نجحت أوبنتو في الوصول لشريحة كبيرة من الجماهير. لقد أبهرت ملايين المستخدمين بسهولة تثبيتها، والعمل الذي بذلته لتبسيط استخدام سطح المكتب.
de_de: Ubuntu hat mitlerweile eine breite Anhängerschaft in der Öffentlichkeit erreicht. Millionen Benutzer sind beeindruckt von seiner einfachen Installation und der Arbeit die in die Verbesserung der Benutzerfreundlichkeit des Desktops gesteckt wurde.
es_es: Ubuntu llegó a una amplia audiencia en el público general. Millones de usuarios se impresionaron por su facilidad de instalación y el trabajo que se realizó en hacer que el escritorio sea más sencillo de utilizar.
zh_cn: Ubuntu已经在普通用户中有非常大的用户数了。数以百万的用户对其安装简单，桌面环境的简单易用留下了深刻的影响。

source: However, not everything is fine and dandy, especially for Debian developers who placed great hopes in Ubuntu contributing directly to Debian. Even though this situation has improved over the years, many have been irked by the Canonical marketing, which implied Ubuntu were good citizens in the Free Software world simply because they made public the changes they applied to Debian packages. Free Software proponents understand that an automatically-generated patch is of little use to the upstream contribution process. Getting one's work integrated requires direct interaction with the other party.
ar_ma: لكن ليس كل شيء أنيقاً وجميلاً، خصوصاً من وجهة نظر مطوري دبيان الذين وضعوا آمالاً كبيرة في مساهمة أوبنتو في دبيان مباشرة. رغم أن هذا الوضع قد تحسن على مر السنين، إلا أن سياسة Canonical التسويقية قد أغاظت الكثيرين، حيث كانت تلمح إلى أن أوبنتو كانت مواطناً صالحاً في عالم البرمجيات الحرة من خلال عرض التعديلات التي يجرونها على حزم دبيان للعموم. أنصار البرمجيات الحرة يعرفون أن الترقيعات المولدة آلياً لا تفيد كثيراً في عملية المساهمة في المنبع (upstream). عليك التفاعل مباشرة مع الطرف الآخر حتى تدمج أعمالك معه.
de_de: Trotzdem ist nicht alles eitel Sonnenschein. Speziell die Debian-Entwickler hatten große Hoffnungen darin gesetzt, Ubuntu würde auch direkt zu Debian beitragen. Auch wenn sich die Situation im Laufe der Jahre gebessert hat, haben sich viele über das Ubuntu-Marketing geärgert. Dieses hatte vorgegeben, Ubuntu sei der "gute Bürger" in der Welt der Freien Software, nur weil sie die Änderungen an den Debian-Paketen öffentlich gemacht haben. Befürworter von Freier Software wissen, dass ein automatisch generierter Patch wenig hilfreich für den Entwicklungsprozess ist. Um die Arbeit eines Einzelnen zu integrieren bedarf es der Interaktion und Zusammenarbeit mit den anderen Beteiligten.
es_es: Sin embargo, no todo es color de rosa, especialmente para los desarrolladores Debian que tenían mucha esperanza en que Ubuntu contribuyera directamente con Debian. Si bien esta situación mejoró con el paso de los años, muchos se irritan por el mercadeo de Canonical en el que implican que Ubuntu es un buen ciudadano en el mundo del Software Libre simplemente porque publican los cambios que realizan a los paquetes Debian. Los partidarios del Software Libre entienden que un parche generado automáticamente no tiene mucha utilidad en el proceso de contribución con el origen. Conseguir que nuestro trabajo sea integrado requiere interacción directa con la otra parte.
zh_cn: 然而，并不是所有的东西都是最好的，特别是那些想让Ubuntu可以直接给Debian贡献而予厚望的Debian开发者来说。尽管多年来情况有所改善，但是仍然又很多人被Canonical的营销所激怒，这也就意味者Ubuntu是自由软件界的良好公民只是因为它把适用于域Debian软件包的改变公开了。自由软件支持者们明白自动生成的补丁对于上游的贡献是无用的。

source: This interaction is becoming more common over time, thanks in part to the Ubuntu community and the efforts it makes in educating its new contributors. <ulink type="block" url="http://www.ubuntu.com/" />
ar_ma: يزداد التفاعل أكثر وأكثر مع الزمن، ويعود ذلك جزئياً إلى مجتمع أوبنتو والجهود التي يبذلها في تدريب المساهمين الجدد. <ulink type="block" url="http://www.ubuntu.com/" />
es_es: Esta interacción es cada vez más común con el tiempo, en parte gracias a la comunidad de Ubuntu y el esfuerzo que realiza en la educación de sus nuevos colaboradores. <ulink type="block" url="http://www.ubuntu.com/" />

source: <primary>bootable CD-ROM</primary>
ar_ma: <primary>قرص CD-ROM إقلاعي</primary>
es_es: <primary>arranque, CD-ROM de arranque</primary>

source: <primary>CD-ROM</primary><secondary>bootable</secondary>
ar_ma: <primary>CD-ROM</primary><secondary>إقلاعي</secondary>
es_es: <primary>CD-ROM</primary><secondary>de arranque</secondary>

source: The Knoppix distribution barely needs an introduction. It was the first popular distribution to provide a <emphasis>LiveCD</emphasis>; in other words, a bootable CD-ROM that runs a turn-key Linux system with no requirement for a hard-disk — any system already installed on the machine will be left untouched. Automatic detection of available devices allows this distribution to work in most hardware configurations. The CD-ROM includes almost 2 GB of (compressed) software.
ar_ma: توزيعة Knoppix (نوبيكس) لا تحتاج لأي تعريف. كانت هذه أول توزيعة مشهورة تقدم قرص إقلاع حي (<emphasis>LiveCD</emphasis>)؛ أي أنه قرص إقلاعي يحوي نظام لينكس جاهز للعمل دون الاعتماد على القرص الصلب نهائياً — وبذلك لا تلمس نظم التشغيل المثبتة على الجهاز من قبل. يسمح الاكتشاف التلقائي للعتاد لهذه التوزيعة بالعمل مع معظم أنواع العتاد. يحوي القرص الليزري حوالي 2 غيغابايت من البرمجيات (المضغوطة).
es_es: La distribución Knoppix casi no necesita introducción. Fue la primera distribución popular que proveyó un <emphasis>LiveCD</emphasis>; en otras palabras, un CD-ROM de arranque que ejecutaba un sistema Linux listo sin necesitar un disco duro — se mantendría intacto cualquier sistema ya instalado en la máquina. La detección automática de los dispositivos disponibles le permitió a esta distribución funcionar en la mayoría de las configuraciones de hardware. El CD-ROM incluye casi 2 Gb de software (comprimido).

source: Combining this CD-ROM to a USB stick allows carrying your files with you, and to work on any computer without leaving a trace — remember that the distribution doesn't use the hard-disk at all. Knoppix is mostly based on LXDE (a lightweight graphical desktop), but many other distributions provide other combinations of desktops and software. This is, in part, made possible thanks to the <emphasis role="pkg">live-build</emphasis> Debian package that makes it relatively easy to create a LiveCD. <ulink type="block" url="http://live.debian.net/" />
ar_ma: إذا جمعت هذا القرص مع مفتاح USB فسوف تتمكن من حمل ملفاتك معك والعمل على أي حاسوب دون ترك أي أثر — فالتوزيعة لا تستخدم القرص الصلب أبداً. تعتمد نوبيكس غالباً على LXDE (سطح مكتب خفيف)، لكن هناك توزيعات أخرى توفر مجموعات أخرى من سطوح المكتب والبرمجيات. تساهم حزمة <emphasis role="pkg">live-build</emphasis> في هذا جزئياً، فهي تسهل إنشاء الأقراص الحيّة نوعاً ما. <ulink type="block" url="http://live.debian.net/" />
es_es: La combinación de este CD-ROM y una llave USB le permite llevar sus archivos a todos lados y trabajar en cualquier equipo sin dejar rastros — recuerde que la distribución no utiliza el disco duro en absoluto. Knoppix está basado en su mayor parte en LXDE (un escritorio gráfico liviano), pero muchas otras distribuciones proveen otras combinaciones de escritorios y software. Esto es posible, en parte, gracias al paquete Debian <emphasis role="pkg">live-build</emphasis> que hace relativamente sencillo crear un LiveCD. <ulink type="block" url="http://live.debian.net/" />

source: Note that Knoppix also provides an installer: you can first try the distribution as a LiveCD, then install it on a hard-disk to get better performance. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />
ar_ma: لاحظ أن نوبيكس توفر أيضاً برنامج تثبيت: يمكنك تجربة التوزيعة أولاً من القرص الحي، وبعدها تثبيتها على القرص الصلب للحصول على أداء أفضل. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />
de_de: Knoppix liefert auch einen Installer: Sie können die Distribution erst als LiveCD ausprobieren und sie dann auf eine Festplatte installieren um bessere Performance zu erhalten. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />
es_es: Sepa que Knoppix también provee un instalador: puede primero probar la distribución como LiveCD y luego instalarla en un disco duro para obtener mejor rendimiento. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />
zh_cn: 提示一下，Knoppix也体统安装程序：你可以先把它作为LiveCD来使用，然后把它安装到硬盘上以获取更好的性能。<ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />

source: Linux Mint is a (partly) community-maintained distribution, supported by donations and advertisements. Their flagship product is based on Ubuntu, but they also provide a “Linux Mint Debian Edition” variant that evolves continuously (as it's based on Debian Testing). In both cases, the initial installation involves booting a LiveDVD.
ar_ma: Linux Mint (لينكس منت) هي توزيعة يدعمها المجتمع (جزئياً)، حيث تدعمها التبرعات والإعلانات. منتجهم الأبرز يعتمد على أوبنتو، لكنهم يوفرون أيضاً ”Linux Mint Debian Edition“ التي تتطور بشكل دائم (تعتمد هذه النسخة على دبيان الاختبارية). في كلا الحالتين، تحتاج الإقلاع من قرص DVD حي لتثبيتها أول مرة.
es_es: Linux Mint es una distribución (parcialmente) mantenida por la comunidad, respaldada con donaciones y publicidad. Su producto estrella está basado en Ubuntu, pero también proveen una variante «Linux Mint Debian Edition» que evoluciona continuamente (y está basada en Debian Testing). En ambos casos, la instalación inicial involucra arrancar con un LiveDVD.

source: The distribution aims at simplifying access to advanced technologies, and provides specific graphical user interfaces on top of the usual software. For instance, even though Linux Mint relies on GNOME, it provides a different menu system; similarly, the package management interface, although based on APT, provides a specific interface with an evaluation of the risk from each package update.
ar_ma: تهدف التوزيعة لتبسيط الوصول للتقنيات الحديثة، وتوفير واجهات مستخدم رسومية خاصة للبرمجيات العادية. مثلاً، رغم أن Linux Mint تعتمد على GNOME، إلا أنها توفر نظام قوائم مختلف؛ كما توفر واجهة إدارة الحزم واجهة خاصة، رغم أنها مبنية على APT، تعرض تقييماً للمخاطرة التي تنتج عن تحديث كل واحدة من الحزم.
de_de: Das Ziel der Distribution ist die Vereinfachung des Zugriffs auf fortschrittliche Technologien. Sie bietet spezielle grafische Oberflächen für die übliche Software. Zum Beispiel bietet Linux Mint ein anderes Menüsystem, obwohl es auf GNOME basiert. Auch die Software-Paketverwaltung, obwohl auf APT aufbauend, bietet ein spezielles Interface mit einer Vorab-Prüfung auf evtl. Gefahren und Probleme bei einem Paket-Update.
es_es: La distribución intenta simplificar el acceso a tecnologías avanzadas y provee interfaces gráficas específicas sobre el software usual. Por ejemplo, si bien Linux Mint está basado en GNOME, provee un sistema de menús diferente; de forma similar, la interfaz de gestión de paquetes, aunque basada en APT, provee una interfaz específica con una evaluación del riesgo en cada actualización de un paquete.
zh_cn: 这个发行版的目的是可以简化访问先进技术，在通用软件之上提供特定的图形用户界面。例如，尽管Linux Mint依赖GNOME，但是它还是提供了一个不同的菜单系统；同样，包管理界面，虽然是基于APT的，但是也提供了一个特定的的评估软件包升级风险的接口。
