Repository: Neamar/KISS
Catalog: */90_derivative-distributions.po
Languages: ar_ma, de_de, es_es, zh_cn

source: Linux Mint includes a large amount of proprietary software to improve the experience of users who might need those. For example: Adobe Flash and multimedia codecs. <ulink type="block" url="http://www.linuxmint.com/" />
ar_ma: تحوي Linux Mint كمية كبيرة من البرمجيات المحتكرة لتحسين تجربة المستخدمين الذين قد يحتاجونها. مثلاً: Adobe Flash وبرامج ترميز الوسائط المتعددة (codecs). <ulink type="block" url="http://www.linuxmint.com/" />
de_de: Linux Mint beinhaltet eine große Anzahl proprietärer Software, um die bestmögliche Nutzererfahrung sicherzustellen. Zum Beispiel: Adobe Flash und Multimedia Codecs. <ulink type="block" url="http://www.linuxmint.com/" />
es_es: Linux Mint incluye una gran cantidad de software privativo para mejorar la experiencia de los usuarios que lo puedan necesitar. Por ejemplo: Adobe Flash y «codecs» multimedia. <ulink type="block" url="http://www.linuxmint.com/" />
zh_cn: Linux Mint包括了大量的用户可能用到的用于提升用户体验的专有软件。比如：Adobe Flash 和多媒体编解码器。<ulink type="block" url="http://www.linuxmint.com/" />

source: SimplyMEPIS is a commercial distribution very similar to Knoppix. It provides a turn-key Linux system from a LiveCD, and includes a number of non-free software packages: device drivers for nVidia video cards, Flash for animations embedded in many websites, RealPlayer, Sun's Java, and so on. The goal is to provide a 100 % working system out of the box. Mepis is internationalized and handles many languages. <ulink type="block" url="http://www.mepis.org/" />
ar_ma: SimplyMEPIS هي توزيعة تجارية تشبه Knoppix كثيراً. توفر هذه التوزيعة نظام لينكس جاهز للعمل من قرص حي، كما تتضمن عدداً من حزم البرمجيات غير الحرة: كتعاريف بطاقات العرض من nVidia، ودعم الفلاش لتشغيل الحركات المضمنة في العديد من مواقع الوب، بالإضافة إلى RealPlayer، ونسخة جافا التي توفرها شركة Sun، وغيرها. الهدف هو تقديم نظام يعمل بالكامل مباشرة. Mepis قابلة للترجمة وتدعم لغات عديدة. <ulink type="block" url="http://www.mepis.org/" />
es_es: SimplyMEPIS es una distribución comercial muy similar a Knoppix. Provee un sistema Linux listo desde un LiveCD e incluye una cantidad de paquetes de software privativo: controladores de dispositivo para tarjetas de video nVidia, Flash para las animaciones incluidas en muchos sitios web, RealPlayer, Java de Sun, etc. El objetivo es proveer un sistema 100% funcional desde el primer momento. Mepis está internacionalizado e incluye muchos idiomas. <ulink type="block" url="http://www.mepis.org/" />

source: This distribution was originally based on Debian; it went to Ubuntu for a while, then came back to Debian Stable, which allows its developers to focus on adding features without having to stabilize packages coming from Debian's <emphasis role="distribution">Unstable</emphasis> distribution.
ar_ma: كانت التوزيعة مبنية في الأصل على دبيان؛ لكنها انتقلت إلى أوبنتو لفترة من الزمن، بعدها عادت إلى دبيان المستقرة، التي تسمح لمطوريها بالتركيز على إضافة المزايا الجديدة دون الحاجة لإصلاح الحزم التي ترد من توزيعة دبيان <emphasis role="distribution">غير المستقرة</emphasis>.
de_de: Diese Distribution basierte ursprünglich auf Debian; For einiger Zeit wanderte Sie ab zu Ubuntu, kam dann aber zurück zu Debian, wodurch sich die Entwickler auf das Entwickeln neuer Funktionen konzentrieren konnten ohne sich um das stabilisieren von Paketen aus Debians <emphasis role="distribution">Unstable</emphasis> Zweig kümmern zu müssen.
es_es: Esta distribución estaba originalmente basada en Debian; se mudó a Ubuntu por un tiempo, luego volvió a Debian Stable, lo que le permitía a sus desarrolladores agregar funcionalidad sin tener que estabilizar los paquetes que provenían de la distribución <emphasis role="distribution">Unstable</emphasis> de Debian.
zh_cn: 这个发行版原本是基于Debian的，但是期间有一段时间基于过Ubuntu，然后又回到基于Debian的Stable版本，这样开发者就只需关注添加功能而不用再花精力去稳定从Debian的<emphasis role="distribution">Unstable</emphasis>版本种来的软件包了。

source: Aptosid (Formerly Sidux)
ar_ma: ‏Aptosid (سابقاً Sidux)
de_de: Aptosid (Ehemals Sidux)
es_es: Aptosid (anteriormente Sidux)

source: This community-based distribution tracks the changes in Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Unstable</emphasis>) — hence its name — and tries to release 4 new versions each year. The modifications are limited in scope: the goal is to provide the most recent software and to update drivers for the most recent hardware, while still allowing users to switch back to the official Debian distribution at any time. <ulink type="block" url="http://aptosid.com" />
ar_ma: تتابع هذه التوزيعة المجتمعية التغيّرات في دبيان <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">غير المستقرة</emphasis>) —من هنا جاء الاسم— وتحاول إطلاق 4 إصدارات جديدة كل عام. التعديلات مداها ضيق: الهدف هو توفير أحدث البرمجيات وتحديث التعاريف بما يناسب آخر قطع العتاد، مع السماح للمستخدمين بالعودة إلى توزيعة دبيان الرسمية في أي وقت.
es_es: Esta distribución basada en la comunidad sigue los cambios de Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Unstable</emphasis>) — de allí su nombre — e intenta publicar 4 versiones nuevas cada año. Las modificaciones tienen alcances limitados: el objetivo es proveer el software más reciente y actualizar los controladores para el hardware más reciente al mismo tiempo que permite a sus usuarios volver a la distribución oficial de Debian en cualquier momento. <ulink type="block" url="http://aptosid.com" />

source: Grml is a LiveCD with many tools for system administrators, dealing with installation, deployment, and system rescue. The LiveCD is provided in two flavors, <literal>full</literal> and <literal>small</literal>, both available for 32-bit and 64-bit PCs. Obviously, the two flavors differ by the amount of software included and by the resulting size. <ulink type="block" url="http://grml.org" />
ar_ma: Grml هي قرص حي يحوي أدوات عديدة لمديري النظم، التي تركز على التثبيت، والنشر، وإنقاذ النظام. يتوفر القرص الحي في شكلين، <literal>full</literal> و<literal>small</literal>، وكل منهما متوفر لحواسيب 32 بت و64 بت. من الواضح أن الشكلين يختلفان عن بعضهما بكمية البرمجيات المضمنة وبالحجم النهائي الناتج. <ulink type="block" url="http://grml.org" />
es_es: Grml es un LiveCD con muchas herramientoas para administradores de sistemas que tienen que ver con la instalación, despliegue y rescate de sistemas. Se provee el LiveCD en dos versiones, <literal>full</literal> («completo») y <literal>small</literal> («pequeño»), ambas disponibles para equipos de 32 y 64 bits. Obviamente, la diferencia entre estas versiones es la cantidad de software incluído y el tamaño del resultado. <ulink type="block" url="http://grml.org" />

source: DoudouLinux targets young children (starting from 2 years old). To achieve this goal, it provides an heavily customized graphical interface (based on LXDE) and comes with many games and educative applications. Internet access is filtered to prevent children from visiting problematic websites. Advertisements are blocked. The goal is that parents should be free to let their children use their computer once booted into DoudouLinux. And children should love using DoudouLinux, just like they enjoy their gaming console. <ulink type="block" url="http://www.doudoulinux.org" />
ar_ma: تستهدف DoudouLinux الأطفال الصغار (بدءاً من عمر السنتين). لتحقيق هذا الهدف، تقدم التوزيعة واجهة رسومية معدلة بشكل كبير (تعتمد على LXDE) وترفق بالعديد من الألعاب والتطبيقات التعليمية. كما يفلتر الوصول للإنترنت لمنع الأطفال من زيارة المواقع غير المرغوبة. كما أن الإعلانات محجوبة. الهدف هو أن يتمكن الوالدان (إلى حد ما) من ترك أطفالهم يستخدمون حاسوبهم دون قلق بعد إقلاعه إلى DoudouLinux. ويفترض أن يحب الأطفال استخدام DoudouLinux، كما يستمتعون باستخدام منصات الألعاب. <ulink type="block" url="http://www.doudoulinux.org" />
es_es: DoudouLinux tiene como objetivo a los niños pequeños (desde los 2 años de edad). Para conseguir este objetivo, provee una interfaz gráfica muy modificada (basada en LXDE) y contiene muchos juegos y aplicaciones educativas. El acceso a Internet está filtrado para evitar que los niños accedan a sitios web problemáticos. Y la publicidad se encuentra bloqueada. El objetivo es que los padres puedan dejar tranquilamente que sus hijos utilicen el equipo una vez que inició DoudouLinux. Y los niños deberían estar encantados con DoudouLinux de la misma forma que disfrutan consolas de videojuegos. <ulink type="block" url="http://www.doudoulinux.org" />

source: And Many More
ar_ma: وغيرها الكثير
de_de: und viele mehr
es_es: Y muchas más
zh_cn: 其它更多

source: The Distrowatch website references a huge number of Linux distributions, many of which are based on Debian. Browsing this site is a great way to get a sense of the diversity in the Free Software world. <ulink type="block" url="http://distrowatch.com" />
ar_ma: يشير موقع Distrowatch لعدد هائل من توزيعات لينكس، والكثير منها مبني على دبيان. تصفح هذا الموقع هو طريقة فعالة لأخذ فكرة عن مقدار التنوع في عالم البرمجيات الحرة. <ulink type="block" url="http://distrowatch.com" />
de_de: Die Distrowatch Website verweist auf eine riesige Zahl von Linux Distributionen, von denen viele auf Debian basieren. Auf dieser Seite zu stöbern ist ein großartiger Weg um ein Gefühl für die Vielfalt in der Welt Freier Software zu bekommen. <ulink type="block" url="http://distrowatch.com" />
es_es: El sitio web Distrowatch hace referencia a una inmensa cantidad de distribuciones Linux, muchas de las cuales están basadas en Debian. Navegar este sitio es una excelente forma de adentrarse en la diversidad del mundo del Software Libre. <ulink type="block" url="http://distrowatch.com" />
zh_cn: Distrowatch网站收集了大量Linux发行版，其中许多是基于Debian的。浏览这个网站是学习自由软件世界中的差异化的非常好的方法。<ulink type="block" url="http://distrowatch.com" />

source: The search form can help track down a distribution based on its ancestry. In November 2013, selecting Debian led to 143 active distributions! <ulink type="block" url="http://distrowatch.com/search.php" />
ar_ma: يستطيع نموذج البحث مساعدتك على عرض التوزيعات حسب أصلها. في نوفمبر 2013، حصلنا على 143 توزيعة نشطة عندما اخترنا عرض التوزيعات المشتقة من دبيان! <ulink type="block" url="http://distrowatch.com/search.php" />
es_es: El formulario de búsqueda le puede ayudar a rastrear una distribución según su linaje. En noviembre de 2013, ¡seleccionar Debian llevaba a 143 distribuciones activas! <ulink type="block" url="http://distrowatch.com/search.php" />

source: <primary><literal>universe</literal></primary>
es_es: <primary>unvierse</primary>

source: <primary><literal>multiverse</literal></primary>
es_es: <primary>multiverse</primary>

source: <indexterm><primary>Ubuntu</primary></indexterm> Ubuntu made quite a splash when it came on the Free Software scene, and for good reason: Canonical Ltd., the company that created this distribution, started by hiring thirty-odd Debian developers and publicly stating the far-reaching objective of providing a distribution for the general public with a new release twice a year. They also committed to maintaining each version for a year and a half for both core and security-related components.
de_de: <indexterm><primary>Ubuntu</primary></indexterm> Ubuntu hat für viel Wirbel gesorgt als es in der Freie-Software-Szene auftauchte. Und das aus gutem Grund: Canonical Ltd., die Firma, die die Distribution erstellt hat stellte 30 Debian-Entwickler ein und gab als langfristiges Ziel an, eine zweimal jährlich erscheinende Distribution für Jedermann auf den Markt zu bringen. Sie verpflichteten sich auch dazu, jede Version für eineinhalb Jahre zu unterstützen und zwar sowohl was die Kernkomponenten betrifft, als auch sicherheitskritische Aspekte.
zh_cn: <indexterm><primary>Ubuntu</primary></indexterm>Ubuntu在自由软件界的出现带来了非常大的凡响，也是因为一个很好的原因： Canonical Ltd. 这家公司开创了Ubuntu的发行版，由它雇用了30多个Debian的开发者开始，公开声明了一个具有深远意义的目标：以每年发行两次版本的速度为普通大众提供一个发行版。他们并且承诺为每一个发布版的核心和安全相关组件提供一年半的维护。

source: These objectives necessarily involve a reduction in scope; Ubuntu focuses on a smaller number of packages than Debian, and relies primarily on the GNOME desktop (although an official Ubuntu derivative, called “Kubuntu”<indexterm><primary>Kubuntu</primary></indexterm>, relies on KDE). Everything is internationalized and made available in a great many languages.
de_de: Diese Ziele bedeuten zwangsläufig auch eine Reduzierung des Umfanges. Ubuntu richtet sein Hauptaugenmerk auf eine kleinere Anzahl an Software-Paketen als Debian und stützt sich primär auf den GNOME-Desktop (obwohl offiziell auch eine KDE-basierte Version namens “Kubuntu”<indexterm><primary>Kubuntu</primary></indexterm> unterstützt wird). Alle Komponenten wurden internationalisiert und in sehr viele Sprachen übersetzt.
zh_cn: 这样的目标是需要放在一个小的范围种的；Ubuntu就关注比Debian小的一些软件包，并且主要依赖于GNOME桌面（尽管还有一个官方的Ubuntu的衍生版叫“kubuntu”<indexterm><primary>Kubuntu</primary></indexterm>，依赖于KDE）。一切都是国际化的并且提供了许多种语言支持。

source: So far, Ubuntu has managed to keep this release rhythm. They also publish <emphasis>Long Term Support</emphasis> (LTS) releases, with a 5-year maintenance promise. As of April 2012, the current LTS version is version 12.04, nicknamed Precise Pangolin. The latest non-LTS version is 11.10, nicknamed Oneiric Ocelot. Version numbers describe the release date: 11.10, for example, was released in October 2011.
de_de: Bis jetzt konnte Ubuntu ihren Release-Rythmus einhalten. Ebenfalls veröffentlichen sie <emphasis>Long Term Support</emphasis> (LTS) Versionen, die einen 5-Jahre-Wartungssupport bieten. Im April 2012 ist die aktuelle LTS-Version die Version 12.04 erschienen, Spitzname "Precise Pangolin". Die aktuellste nicht-LTS-Version ist 11.10, Spitzname "Oneiric Ocelot". Die Versionsnummern beschreiben das Veröffentlichungsdatum: Beispielsweise steht 11.10 für den Oktober (10. Monat) des Jahres 2011.
zh_cn: 到目前为止，Ubuntu已成功的保持这样的发布节奏。它还发布了<emphasis>Long Term Support</emphasis> (LTS)版本。上一个非LTS版本是11.10，代号是 Oneiric Ocelot。版本号是对发布日期的一个说明，比如这个版本就是在2011年10月发布的。

source: This interaction is becoming more common over time, thanks in part to the Ubuntu community and the efforts it makes in educating its new contributors. But this policy is still not enforced by Canonical on its employees. Some kept true to their roots, and do make the required effort (Colin Watson, Martin Pitt and Matthias Klose are noteworthy in this regard), but others — often overworked — can no longer find it in them. <ulink type="block" url="http://www.ubuntu.com/" />
de_de: Diese Zusammenarbeit ist im Laufe der Zeit besser geworden, vor allem Dank der Arbeit der Ubuntu Gemeinschaft und den Bemühungen, neue Beitragende anzuleiten. Diese Politik wird jedoch von Canonical immer noch nicht bei den allen Mitarbeitern durchgesetzt. Einige blieben ihren Wurzeln treu und bemühen sich (Colin Watson, Martin Pitt und Matthias Klose sind hier positiv hervorzuheben) aber andere, weil oftmals überarbeitet, finden sich nicht mehr in diesem Kreis. <ulink type="block" url="http://www.ubuntu.com/" />
zh_cn: 随着时间的推移这种交互变得越来越普遍，也是部分由于Ubuntu社区和它为培养新贡献者所做的努力。但是这种策略并没有被Canonical强制执行。有一些人保持他们自己的原则继续为此而努力（Colin Watson, Martin Pitt 和 Matthias Klose 这方面是值得一提的），但是其他人-经常很忙-就没有了。<ulink type="block" url="http://www.ubuntu.com/" />

source: <indexterm><primary><foreignphrase>LiveCD</foreignphrase></primary></indexterm> <indexterm><primary>Knoppix</primary></indexterm> <indexterm><primary>bootable CD-ROM</primary></indexterm> <indexterm><primary>CD-ROM</primary><secondary>bootable</secondary></indexterm> The Knoppix distribution barely needs an introduction. It was the first popular distribution to provide a <emphasis>LiveCD</emphasis>; in other words, a bootable CD-ROM that runs a turn-key Linux system with no requirement for a hard-disk — any system already installed on the machine will be left untouched. Automatic detection of available devices allows this distribution to work in most hardware configurations. The CD-ROM includes almost 2 GB of (compressed) software.
de_de: <indexterm><primary><foreignphrase>Live-CD</foreignphrase></primary></indexterm> <indexterm><primary>Knoppix</primary></indexterm> <indexterm><primary>bootfähige CD-ROM</primary></indexterm> <indexterm><primary>CD-ROM</primary><secondary>bootfähig</secondary></indexterm> Knoppix braucht man wohl kaum noch jemandem vorzustellen. Es war die erste Distribution, die sich von einer <emphasis>Live-CD</emphasis> starten ließ. Mit anderen Worten: Knoppix kam auf einer bootfähigen CD-ROM mit einem vollständigen Linux-System, das sich auch auf Rechnern ohne Festplatte starten ließ; alle bereits auf dem Rechner installierten Systeme wurde nicht angerührt. Die automatische Hardware-Erkennung erlaubt es dieser Distribution, auf nahezu allen Rechnern zu arbeiten. Die CD-ROM enthält fast 2 GB (gepackte) Software.
zh_cn: <indexterm><primary><foreignphrase>LiveCD</foreignphrase></primary></indexterm> <indexterm><primary>Knoppix</primary></indexterm> <indexterm><primary>可启动 CD-ROM</primary></indexterm> <indexterm><primary>CD-ROM</primary><secondary>bootable</secondary></indexterm>Knoppix发行版几乎不需要介绍，它是第一个广为流传的提供了<emphasis>LiveCD</emphasis>的发行版；换句话说，它是一个可启动的CD-ROM，它可以无需磁盘而启动一个lnux系统，而不改变机器上已经安装的其它系统。在大多出的硬件配置上它可以自动检测可以使系统运行可用硬件。它的CD-ROM包含了近2G（压缩过的）软件包。

source: Combining this CD-ROM and a USB stick allows carrying your files with you, and to work on any computer without leaving a trace — remember that the distribution doesn't use the hard-disk at all. Knoppix is mostly based on LXDE (a lightweight graphical desktop), but many other distributions provide other combinations of desktops and software. This is, in part, made possible thanks to the <emphasis role="pkg">live-build</emphasis> Debian package that makes it relatively easy to create a LiveCD. <ulink type="block" url="http://live.debian.net/" />
de_de: Diese CD-ROM in Verbindung mit einem USB-Stick erlaubt es, Ihre Daten mitzunehmen und auf jedem beliebigen Computer zu arbeiten, ohne Spuren zu hinterlassen. Das liegt daran, dass die Distribution die Festplatte überhaupt nicht benutzt. Knoppix baut hauptsächlich auf LXDE (einem sehr schlanken grafischen Desktop) auf; andere Distributionen nutzen andere Zusammenstellungen von Desktop und Software. Dies wird teilweise durch das Debian <emphasis role="pkg">live-build</emphasis>-Paket ermöglicht, das es relativ einfach macht, Live-CDs zu erstellen. <ulink type="block" url="http://live.debian.net/" />
zh_cn: 结合这个CD-ROM和一个可以存储文件的USB记忆棒，你就可以在任何电脑上不留痕迹的工作了--记住一点这个发行版一点也不使用硬盘的。Knoppix大多出是基于LXDE（一个轻量级的图形桌面），但是许多其他的发行版提供了其它桌面组件和软件包。这样的使用一方面也是要归功于<emphasis role="pkg">live-build</emphasis>，Debian的软件包使得它可以相对容易的制作一个LiveCD。 <ulink type="block" url="http://live.debian.net/" />

source: <indexterm><primary>Linux Mint</primary></indexterm> Linux Mint is a (partly) community-maintained distribution, supported by donations and advertisements. Their flagship product is based on Ubuntu, but they also provide a “Linux Mint Debian Edition” variant that evolves continuously (as it's based on Debian Testing). In both cases, the initial installation involves booting a LiveDVD.
de_de: <indexterm><primary>Linux Mint</primary></indexterm> Linux Mint ist eine teilweise von der Community gepflegte Distribution, die durch Spenden und Werbung dinanziert wird. Ihr Hauptzweig basiert auf Ubuntu, es gibt jedoch auch eine “Linux Mint Debian Edition”, die ständig weiterentwickelt wird. Sie basiert auf Debian Testing. In beiden Fällen wird die Installation über eine Live-CD gestartet.
zh_cn: <indexterm><primary>Linux Mint</primary></indexterm>Linux Mint是一个（部分的）社区维护发布版，由捐助和广告来支持。它的主要版本是基于Ubuntu的，但是它也提供了一个“Linux Mint Deiban Editon”变种，它处于不断的发展中（因为它基于Debian的Testing版本）。在这两种发行版种，初始安装都是从LiveDVD启动的。

source: <indexterm><primary>SimplyMEPIS</primary></indexterm> SimplyMEPIS is a commercial distribution very similar to Knoppix. It provides a turn-key Linux system from a LiveCD, and includes a number of non-free software packages: device drivers for nVidia video cards, Flash for animations embedded in many websites, RealPlayer, Sun's Java, and so on. The goal is to provide a 100 % working system out of the box. Mepis is internationalized and handles many languages. <ulink type="block" url="http://www.mepis.org/" />
de_de: <indexterm><primary>SimplyMEPIS</primary></indexterm> SimplyMEPIS ist eine kommerzielle Distribution, die Knoppix sehr ähnelt. Es bietet ein sofort nutzbares Linux-System von einer Live-CD und enthält eine Reihe unfreier Software: Gerätetreiber für nVidia-Grafikkarten, Flash für die Animationen vieler Webseiten, RealPlayer, Sun's Java usw. Das Ziel ist ein 100 % funktionsfähiges System vom Start weg. Mepis wurde internationalisiert und unterstützt viele Sprachen. <ulink type="block" url="http://www.mepis.org/" />
zh_cn: <indexterm><primary>SimplyMEPIS</primary></indexterm>SimplyMEPIS是一个和Knoppix非常类似的商业发行版。它提供了一种从LiveCD的交钥匙Linux系统，并且包括了大量非自由软件包：nVidia视频卡的设备驱动，播放嵌入许多网站动画的Flash，Reallayer，Sun的Java等等。它的目标是提供一个100%开启即用的工作系统。Mepis是一个国际化的，支持多国语言的系统。<ulink type="block" url="http://www.mepis.org/" />

source: <indexterm><primary>Sidux</primary></indexterm> <indexterm><primary>Aptosid</primary></indexterm> This community-based distribution tracks the changes in Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Unstable</emphasis>) — hence its name — and tries to release 4 new versions each year. The modifications are limited in scope: the goal is to provide the most recent software and to update drivers for the most recent hardware, while still allowing users to switch back to the official Debian distribution at any time. <ulink type="block" url="http://aptosid.com" />
de_de: <indexterm><primary>Sidux</primary></indexterm> <indexterm><primary>Aptosid</primary></indexterm> Diese von der Community betriebene Distributin verfolgt die Änderungen in Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Unstable</emphasis>), daher der Name. Sie versucht vier mal im Jahr neue Versionen zu veröffentlichen. Die Änderungen haben einen begrenzten Umfang: Ziel ist das Bereitstellen der aktuellsten Software und Treiber für die neueste Hardware bei gleichzeitiger Möglichkeit des jederzeitigen Wechsels zurück zur offiziellen Debian-Distribution. <ulink type="block" url="http://aptosid.com" />
zh_cn: <indexterm><primary>Sidux</primary></indexterm> <indexterm><primary>Aptosid</primary></indexterm>这种以社区为基础的发行版跟随的是Deiban<emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Unstable</emphasis>)的变化--所以它的名字，并且它试图每年发4个新版本。修改范围限制在：目标是提供最新的软件，并更新最新的硬件驱动程序，同时还允许用户随时切换到Debian官方版本。<ulink type="block" url="http://aptosid.com" />

source: Damn Small Linux
de_de: Damn Small Linux ("verdammt kleines Linux")

source: This distribution provides a tiny LiveCD, weighing only 50 MB, so that it can fit on a CD-ROM with the shape and size of a business card. To achieve this, Damn Small Linux only includes lightweight software tools. This can be interesting to use a Debian-like system on an aging computer. <ulink type="block" url="http://www.damnsmalllinux.org/" />
de_de: Diese Distribution liefert eine sehr kleine LiveCD von nur 50 MB, so dass sie auf eine CD-ROM der Form und Größe einer Visitenkarte passt. Das kann hilfreich sein, um Debian auf einem älteren Computer zu nutzen. <ulink type="block" url="http://www.damnsmalllinux.org/" />
zh_cn: 这个发行版提供一个非常小的LiveCD，大小只有50MB，所以它可以装载一个名片大小的CD-ROM中，Damn Small Linux仅仅包含了轻量级的软件工具。它可以非常有趣的在一个老电脑上使用类Debian系统。<ulink type="block" url="http://www.damnsmalllinux.org/" />
