Repository: Neamar/KISS
Catalog: */90_derivative-distributions.po
Languages: ar_ma, de_de, es_es, zh_cn

source: The search form can help track down a distribution based on its ancestry. In January 2012, selecting Debian led to 141 active distributions! <ulink type="block" url="http://distrowatch.com/search.php" />
de_de: Die Suche kann helfen eine Distribution basierend auf ihrer Abstammung aufzuspüren. Im Januar 2012 führte die Auswahl von Debian zu 141 aktiven Distributionen! <ulink type="block" url="http://distrowatch.com/search.php" />
zh_cn: 网站上的搜索框可以帮你查到某个发现版的先祖。在2012年1月，查询Debian可以看到又141一个活跃的发行版！<ulink type="block" url="http://distrowatch.com/search.php" />
