Repository: Neamar/KISS
Catalog: */92_short-remedial-course.po
Languages: ar_ma, ja_jp

source: Kernel
ar_ma: نواة
ja_jp: カーネル

source: Process
ar_ma: عملية
ja_jp: プロセス

source: Hierarchy
ar_ma: بنية شجرية
ja_jp: 階層構造

source: Basic Commands
ar_ma: الأوامر الأساسية
ja_jp: 基本コマンド

source: Short Remedial Course
ar_ma: دورة تذكيرية قصيرة
ja_jp: 簡単な補習講座

source: Even though this book primarily targets administrators and “power-users”, we wouldn't like to exclude motivated beginners. This appendix will therefore be a crash-course describing the fundamental concepts involved in handling a Unix computer.
ar_ma: بالرغم من أن هذا الكتاب يستهدف مديري النظم و ”المستخدمين المتقدمين“، إلا أننا لم نرغب باستبعاد المبتدئين المتحفزين. وبالتالي فإن هذا الملحق بمثابة حلقة دراسية مكثفة تصف المفاهيم الأساسية المرتبطة بالتحكم في حواسيب يونـِكس.
ja_jp: この本は主として管理者と「パワーユーザ」を対象にしているとはいえ、やる気のある初心者を仲間はずれにしたくはありません。そのため、この付録は Unix コンピュータを取り扱う際に求められる基礎的な概念を説明する集中講座になるでしょう。

source: Shell and Basic Commands
ar_ma: الصَدَفة (shell) والأوامر الأساسية
ja_jp: シェルと基本コマンド

source: In the Unix world, every administrator has to use the command line sooner or later; for example, when the system fails to start properly and only provides a command-line rescue mode. Being able to handle such an interface, therefore, is a basic survival skill for these circumstances.
ar_ma: في عالم اليونِكس، يضطر كل مدير نظم إلى استخدام سطر الأوامر عاجلاً أو آجلاً؛ مثلاً، عندما يخفق النظام في الإقلاع بشكل صحيح ويكون وضع الإنقاذ النصي متوفرًا فقط. وبالتالي، فإن القدرة على التحكم بمثل هذه الواجهة هي مهارة إنقاذ أساسية في مثل هذه الحالات.
ja_jp: Unix 世界では、管理者全員が遅かれ早かれコマンドラインを使わなければいけません; 例えば、システムが正常な起動に失敗して、コマンドラインのレスキューモードだけが提供される場合です。それゆえ、このような状況下ではコマンドラインインターフェースを取り扱う事が可能な事が基本的なサバイバル技術です。

source: <emphasis>QUICK LOOK</emphasis> Starting the command interpreter
ar_ma: <emphasis>نظرة سريعة</emphasis> بدء مفسر الأوامر
ja_jp: <emphasis>QUICK LOOK</emphasis> コマンドインタプリタの起動

source: A command-line environment can be run from the graphical desktop, by an application known as a “terminal”, such as those found under the <menuchoice><guimenu>Applications</guimenu> <guisubmenu>Accessories</guisubmenu></menuchoice> menu for GNOME, and in <menuchoice><guimenu>K</guimenu> <guisubmenu>Applications</guisubmenu> <guisubmenu>System</guisubmenu></menuchoice> for KDE.
ar_ma: يمكن تشغيل بيئة سطر الأوامر من سطح المكتب الرسومي، وذلك باستخدام تطبيق يُعرف باسم ”terminal“، يمكن العثور على مثل هذه التطبيقات في قائمة <menuchoice><guimenu>Applications</guimenu> <guisubmenu>Accessories</guisubmenu></menuchoice> بالنسبة لغنوم، وفي قائمة <menuchoice><guimenu>K</guimenu> <guisubmenu>Applications</guisubmenu> <guisubmenu>System</guisubmenu></menuchoice> بالنسبة لـKDE.
ja_jp: コマンドライン環境はグラフィカルデスクトップから「端末」として知られるアプリケーションを使って実行可能です。「端末」は GNOME の場合 <menuchoice><guimenu>アプリケーション</guimenu> <guisubmenu>アクセサリ</guisubmenu></menuchoice> メニュー、KDE の場合 <menuchoice><guimenu>K</guimenu> <guisubmenu>アプリケーション</guisubmenu> <guisubmenu>システム</guisubmenu></menuchoice> の中にあります。

source: This section only gives a quick peek at the commands. They all have many options not described here; accordingly, they also have abundant documentation in their respective manual pages.
ar_ma: يلقي هذا القسم نظرة سريعة على الأوامر فقط. كل هذه الأوامر لها العديد من الخيارات التي لم نذكرها هنا؛ وعليه نقول، إن لهذه الأوامر وثائق وافرة في صفحات الكتيبات (manual pages) الخاصة بها.
ja_jp: この説では、コマンドを簡単に見ていきます。すべてのコマンドは多くのオプションを持っていますが、ここでは説明しません; また、コマンドのマニュアルページには豊富な文書が用意されています。

source: Browsing the Directory Tree and Managing Files
ar_ma: استعراض شجرة المجلدات وإدارة الملفات
ja_jp: ディレクトリツリーの閲覧とファイル管理

source: Once a session is open, the <command>pwd</command> command (which stands for <emphasis>print working directory</emphasis>) displays the current location in the filesystem. The current directory is changed with the <command>cd <replaceable>directory</replaceable></command> command (<command>cd</command> is for <emphasis>change directory</emphasis>). The parent directory is always called <literal>..</literal> (two dots), whereas the current directory is also known as <literal>.</literal> (one dot). The <command>ls</command> command allows <emphasis>listing</emphasis> the contents of a directory. If no parameters are given, it operates on the current directory.
ja_jp: 一度セッションが開始されたら、<command>pwd</command> コマンド (これは <emphasis>print working directory</emphasis> の略語です) でファイルシステム上の現在の場所を表示する事が可能です。現在のディレクトリを変更するには、<command>cd <replaceable>directory</replaceable></command> コマンド (<command>cd</command> は <emphasis>change directory</emphasis> の略語です) を使います。親ディレクトリは常に <literal>..</literal> (ドット 2 つ) で表します。これに対して、現在のディレクトリは <literal>.</literal> (ドット 1 つ) で表します。<command>ls</command> コマンドは指定したディレクトリの内容を <emphasis>listing (表示)</emphasis> します。パラメータを与えなかった場合、<command>ls</command> コマンドは現在のディレクトリの内容を表示します。

source: A new directory can be created with <command>mkdir <replaceable>directory</replaceable></command>, and an existing (empty) directory can be removed with <command>rmdir <replaceable>directory</replaceable></command>. The <command>mv</command> command allows <emphasis>moving</emphasis> and/or renaming files and directories; <emphasis>removing</emphasis> a file involves <command>rm <replaceable>file</replaceable></command>.
ar_ma: يمكن إنشاء مجلد جديد باستخدام الأمر <command>mkdir <replaceable>directory</replaceable></command>، ويمكن إزالة مجلد (فارغ) موجود سابقًا بالأمر <command>rmdir <replaceable>directory</replaceable></command>. يسمح الأمر <command>mv</command> بنقل <emphasis>move</emphasis> و/أو إعادة تسمية الملفات والمجلدات؛ لإزالة <emphasis>remove</emphasis> ملف ستحتاج للأمر <command>rm <replaceable>file</replaceable></command>.
ja_jp: 新しいディレクトリを作成するには <command>mkdir <replaceable>directory</replaceable></command> を使い、既存の (空) ディレクトリを削除するには <command>rmdir <replaceable>directory</replaceable></command> を使います。<command>mv</command> コマンドを使うことでファイルとディレクトリの <emphasis>moving (移動)</emphasis> 及び名前変更が可能です; ファイルを <emphasis>removing (削除)</emphasis> するには <command>rm <replaceable>file</replaceable></command> を実行します。

source: Displaying and Modifying Text Files
ar_ma: استعراض وتعديل الملفات النصية
ja_jp: テキストファイルの表示と書き換え

source: The <command>cat <replaceable>file</replaceable></command> command (intended to <emphasis>concatenate</emphasis> files on its standard output) reads a file and displays its contents in the terminal. If the file is too big to fit on a screen, use a pager such as <command>less</command> (or <command>more</command>) to display it page by page.
ar_ma: يقرأ الأمر <command>cat <replaceable>file</replaceable></command> (يعني <emphasis>concatenate</emphasis> ملف إلى الخرج القياسي أي ربطه معه) ملفًا ويعرض محتوياته في سطر الأوامر. إذا كان الملف أكبر من أن يتسع في الشاشة، استعمل أمرَ تصفّحٍ مثل <command>less</command> (أو <command>more</command>) لعرضه صفحة بعد أخرى.
ja_jp: <command>cat <replaceable>file</replaceable></command> コマンド (ファイルを標準出力に <emphasis>concatenate (連結)</emphasis> する) はファイルを読み込んで内容を端末に表示する。ファイルが画面上に表示するには大きすぎる場合、<command>less</command> (および <command>more</command>) などのページャーを使い、ページごとに内容を表示します。

source: The <command>editor</command> command always points at a text editor (such as <command>vi</command> or <command>nano</command>) and allows creating, modifying and reading text files. The simplest files can sometimes be created directly from the command interpreter thanks to redirection: <command>echo "<replaceable>text</replaceable>" &gt;<replaceable>file</replaceable></command> creates a file named <replaceable>file</replaceable> with “<replaceable>text</replaceable>” as its contents. Adding a line at the end of this file is possible too, with a command such as <command>echo "<replaceable>line</replaceable>" &gt;&gt;<replaceable>file</replaceable></command>.
ar_ma: يشير الأمر <command>editor</command> دائمًا إلى محرر نصوص (مثل <command>vi</command> أو <command>nano</command>) ويسمح بإنشاء، وتعديل وقراءة الملفات النصية. يمكن إنشاء الملفات البسيطة أحيانًا من مفسِّر الأوامر مباشرة بفضل خاصية إعادة التوجيه: ينشئ الأمر <command>echo "<replaceable>text</replaceable>" &gt;<replaceable>file</replaceable></command> ملفاً باسم <replaceable>file</replaceable> يحتوي على ”<replaceable>text</replaceable>“. من الممكن إضافة سطر إلى آخر هذا الملف أيضًا، باستخدام الأمر <command>echo "<replaceable>line</replaceable>" &gt;&gt;<replaceable>file</replaceable></command>.
ja_jp: <command>editor</command> コマンドは常にテキストエディタ (<command>vi</command> や <command>nano</command> など) を指しており、テキストファイルの作成、修正、読み込みを行います。リダイレクト機能のお陰で、しばしばコマンドインタプリタから最も簡単なファイルを作る事が可能です: <command>echo "<replaceable>text</replaceable>" &gt;<replaceable>file</replaceable></command> は「<replaceable>text</replaceable>」という内容で <replaceable>file</replaceable> と名付けられたファイルを作成します。<command>echo "<replaceable>line</replaceable>" &gt;&gt;<replaceable>file</replaceable></command> などのコマンドを使えば、ファイルの最後に行を追加する事も可能です。

source: Searching for Files and within Files
ar_ma: البحث عن الملفات، والبحث ضمن الملفات
ja_jp: ファイルとファイル内容の検索

source: The <command>find <replaceable>directory</replaceable> <replaceable>criteria</replaceable></command> command looks for files in the hierarchy under <replaceable>directory</replaceable> according to several criteria. The most commonly used criterion is <literal>-name <replaceable>name</replaceable></literal>: it allows looking for a file by its name.
ar_ma: يبحث الأمر <command>find <replaceable>directory</replaceable> <replaceable>criteria</replaceable></command> عن ملفات تحت المجلد <replaceable>directory</replaceable> وفقًا لعدة معايير. المعيار الأكثر استخدامًا هو <literal>-name <replaceable>name</replaceable></literal>: الذي يسمح بالبحث عن ملف بالاسم.
ja_jp: <command>find <replaceable>directory</replaceable> <replaceable>criteria</replaceable></command> コマンドは <replaceable>directory</replaceable> の下にあるファイルから条件に一致するものを探します。最もよく使われる条件は <literal>-name <replaceable>name</replaceable></literal> です: これは名前を基にしてファイルを探します。

source: The <command>grep <replaceable>expression</replaceable> <replaceable>files</replaceable></command> command searches the contents of the files and extracts the lines matching the regular expression (see sidebar <xref linkend="sidebar.regexp" />). Adding the <literal>-r</literal> option enables a recursive search on all files contained in the directory passed as a parameter. This allows looking for a file when only a part of the contents are known.
ja_jp: <command>grep <replaceable>expression</replaceable> <replaceable>files</replaceable></command> コマンドはファイルの内容を検索して、正規表現 (傍注<xref linkend="sidebar.regexp" />参照) に一致する行を抽出します。<literal>-r</literal> オプションを追加すれば、パラメータとして指定されたディレクトリに含まれるすべてのファイルに対して再帰検索する事が可能です。<literal>-r</literal> オプションを使うことで、内容の一部がわかっているファイルを探す事が可能です。

source: Managing Processes
ar_ma: إدارة العمليات
ja_jp: プロセス管理

source: The <command>ps aux</command> command lists the processes currently running and allows identifying them by their <emphasis>pid</emphasis> (process id). Once the <emphasis>pid</emphasis> of a process is known, the <command>kill -<replaceable>signal</replaceable> <replaceable>pid</replaceable></command> command allows sending it a signal (if the process belongs to the current user). Several signals exist; most commonly used are <literal>TERM</literal> (a request to terminate) and <literal>KILL</literal> (a heavy-handed kill).
ar_ma: يسرد الأمر <command>ps aux</command> العمليات التي تعمل حاليًا ويسمح بالتعرف عليها من خلال <emphasis>pid</emphasis> الخاص بها (process id أي معرِّف العملية). بمجرد معرفة <emphasis>pid</emphasis> عملية ما، يسمح الأمر <command>kill -<replaceable>signal</replaceable> <replaceable>pid</replaceable></command> بإرسال إشارة إليها (إذا كانت العملية خاصة بالمستخدم الحالي). توجد عدة إشارات؛ أكثرها استخدامًا <literal>TERM</literal> (طلب إنهاء العملية) و <literal>KILL</literal> (إنهاء بالضربة القاضية!).
ja_jp: <command>ps aux</command> コマンドは現在実行中のプロセスをリストし、プロセスの <emphasis>pid</emphasis> (プロセス ID) を使ってプロセスを識別する事が可能です。プロセスの <emphasis>pid</emphasis> が判ったら、<command>kill -<replaceable>signal</replaceable> <replaceable>pid</replaceable></command> コマンドを使ってプロセスにシグナルを送信する事が可能です (対象のプロセスがシグナルを送信するユーザのものである場合に限ります)。シグナルには様々な種類があります; 最もよく使われるのが <literal>TERM</literal> (処理の終了を依頼する) と <literal>KILL</literal> (強制的に終了する)。

source: The command interpreter can also run programs in the background if the command ends with “&amp;”. By using the ampersand, the user resumes control of the shell immediately even though the command is still running (hidden from the user; as a background process). The <command>jobs</command> command lists the processes running in the background; running <command>fg %<replaceable>job-number</replaceable></command> (for <emphasis>foreground</emphasis>) restores a job to the foreground. When a command is running in the foreground (either because it was started normally, or brought back to the foreground with <command>fg</command>), the <keycombo action="simul"><keycap>Control</keycap><keycap>Z</keycap></keycombo> key combination pauses the process and resumes control of the command-line. The process can then be restarted in the background with <command>bg %<replaceable>job-number</replaceable></command> (for <foreignphrase>background</foreignphrase>).
ja_jp: コマンドインタプリタは、コマンドの最後に「&amp;」がついていた場合、バックグラウンドでプログラムを実行します。アンパサンドを使うことで、ユーザは、コマンドがまだ実行中であっても、すぐにシェルの制御を再開する事が可能です (ここで実行したコマンドはユーザから見えなくなります; バックグラウンドプロセスになります)。<command>jobs</command> コマンドはバックグラウンドで実行中のプロセスをリストします; <command>fg %<replaceable>job-number</replaceable></command> (<emphasis>foreground</emphasis> の略語) は指定したジョブをフォアグラウンドに復活させます。コマンドがフォアグラウンドで実行されている場合 (通常通り開始した場合も、<command>fg</command> でフォアグラウンドに復活した場合も)、<keycombo action="simul"><keycap>Control</keycap><keycap>Z</keycap></keycombo> キーの組み合わせでフォアグラウンドプロセスを一時停止してコマンドラインの制御を再開する事が可能です。プロセスをバックグラウンドで再開するには、<command>bg %<replaceable>job-number</replaceable></command> (<foreignphrase>background</foreignphrase> の略語) を使います。

source: System Information: Memory, Disk Space, Identity
ar_ma: معلومات النظام: الذاكرة، مساحة الأقراص، الهوية
ja_jp: システム情報: メモリ、ディスク領域、識別情報

source: The <command>free</command> command displays information on memory; <command>df</command> (<emphasis>disk free</emphasis>) reports on the available disk space on each of the disks mounted in the filesystem. Its <literal>-h</literal> option (for <emphasis>human readable</emphasis>) converts the sizes into a more legible unit (usually mebibytes or gibibytes). In a similar fashion, the <command>free</command> command understands the <literal>-m</literal> and <literal>-g</literal> options, and displays its data either in mebibytes or in gibibytes, respectively.
ja_jp: <command>free</command> コマンドはメモリに関する情報を表示します; <command>df</command> (<emphasis>disk free</emphasis>) はファイルシステムにマウントされた各ディスクの利用可能なディスク領域を報告します。<literal>-h</literal> オプション (<emphasis>human readable</emphasis> の意味) はサイズを判りやすい単位 (通常メガバイトやギガバイト) で変換します。同様に、<command>free</command> コマンドに <literal>-m</literal> と <literal>-g</literal> オプションを渡した場合、データはそれぞれメガバイトかギガバイト単位で表示されます。

source: <computeroutput>$ </computeroutput><userinput>free</userinput> <computeroutput> total used free shared buffers cached Mem: 1028420 1009624 18796 0 47404 391804 -/+ buffers/cache: 570416 458004 Swap: 2771172 404588 2366584 $ </computeroutput><userinput>df</userinput> <computeroutput>Filesystem 1K-blocks Used Available Use% Mounted on /dev/sda2 9614084 4737916 4387796 52% / tmpfs 514208 0 514208 0% /lib/init/rw udev 10240 100 10140 1% /dev tmpfs 514208 269136 245072 53% /dev/shm /dev/sda5 44552904 36315896 7784380 83% /home </computeroutput>
ja_jp: <computeroutput>$ </computeroutput><userinput>free</userinput> <computeroutput> total used free shared buffers cached Mem: 1028420 1009624 18796 0 47404 391804 -/+ buffers/cache: 570416 458004 Swap: 2771172 404588 2366584 $ </computeroutput><userinput>df</userinput> <computeroutput>ファイルシス 1K-ブロック 使用 使用可 使用% マウント位置 /dev/sda2 9614084 4737916 4387796 52% / tmpfs 514208 0 514208 0% /lib/init/rw udev 10240 100 10140 1% /dev tmpfs 514208 269136 245072 53% /dev/shm /dev/sda5 44552904 36315896 7784380 83% /home </computeroutput>

source: The <command>id</command> command displays the identity of the user running the session, along with the list of groups they belong to. Since access to some files or devices may be limited to group members, checking available group membership may be useful.
ar_ma: يعرض الأمر <command>id</command> هوية المستخدم الذي يشغل الجلسة، بالإضافة إلى قائمة بالمجموعات التي ينتمي إليها. نظراً لأن الوصول إلى بعض الملفات أو الأجهزة قد يكون محدوداً بأعضاء مجموعة ما، فقد يكون التحقق من عضوية المجموعات مفيداً.
ja_jp: <command>id</command> コマンドはセッションを実行しているユーザの識別情報をユーザが所属するグループのリストと一緒に表示します。一部のファイルやデバイスへのアクセスはグループメンバーだけに制限されているかもしれませんので、ユーザの所属するグループの確認する事が役に立つ場合があります。

source: Organization of the Filesystem Hierarchy
ar_ma: تنظيم البنية الشجرية لنظام الملفات
ja_jp: ファイルシステム階層の構成

source: <primary>Filesystem Hierarchy</primary>
ar_ma: <primary>البنية الشجرية لنظام الملفات</primary>
ja_jp: <primary>ファイルシステム階層</primary>

source: The Root Directory
ar_ma: المجلد الرئيسي (Root)
ja_jp: ルートディレクトリ

source: A Debian system is organized along the <emphasis>File Hierarchy Standard</emphasis> (FHS). This standard defines the purpose of each directory. For instance, the top-level directories are described as follows:
ar_ma: نظام ديبيان منظم وفق <emphasis>معيار البنية الشجرية للملفات</emphasis> (FHS = File Hierarchy Standard). يحدد هذا المعيار الغرض من كل مجلد. مثلا، المجلدات في المستوى الأعلى موصوفة كما يلي:
ja_jp: Debian システムは<emphasis>ファイルシステム階層標準</emphasis> (FHS) に沿って構成されています。ファイルシステム階層標準ではそれぞれのディレクトリの目的が定義されています。例えば、最上位ディレクトリに含まれるディレクトリの目的は以下のとおり定義されています:

source: <filename>/bin/</filename>: basic programs;
ar_ma: <filename>/bin/</filename>: البرامج الأساسية؛
ja_jp: <filename>/bin/</filename>: 基本プログラム;

source: <filename>/boot/</filename>: Linux kernel and other files required for its early boot process;
ar_ma: <filename>/boot/</filename>: النواة لينوكس وملفات أخرى تحتاجها أثناء عملية الإقلاع المبكرة؛
ja_jp: <filename>/boot/</filename>: Linux カーネルと起動処理の初期に要求されるその他のファイル;

source: <filename>/dev/</filename>: device files;
ar_ma: <filename>/dev/</filename>: ملفات الأجهزة؛
ja_jp: <filename>/dev/</filename>: デバイスファイル;

source: <filename>/etc/</filename>: configuration files;
ar_ma: <filename>/etc/</filename>: ملفات الإعدادات؛
ja_jp: <filename>/etc/</filename>: 設定ファイル;

source: <filename>/home/</filename>: user's personal files;
ar_ma: <filename>/home/</filename>: ملفات المستخدمين الشخصية؛
ja_jp: <filename>/home/</filename>: ユーザの個人ファイル;

source: <filename>/lib/</filename>: basic libraries;
ar_ma: <filename>/lib/</filename>: المكتبات الأساسية؛
ja_jp: <filename>/lib/</filename>: 基本ライブラリ;

source: <filename>/media/*</filename>: mount points for removable devices (CD-ROM, USB keys and so on);
ar_ma: <filename>/media/*</filename>: نقاط التركيب للأجهزة النقالة (الأقراص الليزرية، مفاتيح USB وغيرها)؛
ja_jp: <filename>/media/*</filename>: リムーバブルデバイス (CD-ROM、USB メモリなど) 用のマウントポイント;

source: <filename>/mnt/</filename>: temporary mount point;
ar_ma: <filename>/mnt/</filename>: نقاط تركيب مؤقتة؛
ja_jp: <filename>/mnt/</filename>: 一時的なマウントポイント;

source: <filename>/opt/</filename>: extra applications provided by third parties;
ar_ma: <filename>/opt/</filename>: تطبيقات إضافية تقدمها أطراف ثالثة؛
ja_jp: <filename>/opt/</filename>: サードパーティが提供する追加アプリケーション;

source: <filename>/root/</filename>: administrator's (root's) personal files;
ar_ma: <filename>/root/</filename>: ملفات مدير النظام (root) الشخصية؛
ja_jp: <filename>/root/</filename>: 管理者 (root) の個人ファイル;

source: <filename>/sbin/</filename>: system programs;
ar_ma: <filename>/bin/</filename>: برامج النظام؛
ja_jp: <filename>/sbin/</filename>: システムプログラム;

source: <filename>/srv/</filename>: data used by servers hosted on this system;
ar_ma: <filename>/srv/</filename>: بيانات تستخدمها المخدّمات المستضافة على هذا النظام؛
ja_jp: <filename>/srv/</filename>: このシステムでホストされているサーバが使うデータ

source: <filename>/tmp/</filename>: temporary files; this directory is often emptied at boot;
ar_ma: <filename>/tmp/</filename>: ملفات مؤقتة؛ غالبًا ما يُفرَّغ هذا المجلد عند الإقلاع؛
ja_jp: <filename>/tmp/</filename>: 一時ファイル; このディレクトリの内容は起動時に削除されます;

source: <filename>/usr/</filename>: applications; this directory is further subdivided into <filename>bin</filename>, <filename>sbin</filename>, <filename>lib</filename> (according to the same logic as in the root directory). Furthermore, <filename>/usr/share/</filename> contains architecture-independent data. <filename>/usr/local/</filename> is meant to be used by the administrator for installing applications manually without overwriting files handled by the packaging system (<command>dpkg</command>).
ar_ma: <filename>/usr/</filename>: التطبيقات؛ هذا المجلد مقسَّم إلى <filename>bin</filename>، <filename>sbin</filename>، <filename>lib</filename> (وفقا للأسلوب نفسه المتَّبع في مجلد root). أكثر من ذلك، <filename>/usr/share/</filename> يحتوي على بيانات مستقلة عن المعمارية. والمجلد <filename>/usr/local/</filename> مخصص ليستخدمه مدير النظام لتثبيت البرامج يدويًا دون الكتابة فوق الملفات التي تتحكم بها أداة التحزيم (<command>dpkg</command>).
ja_jp: <filename>/usr/</filename>: アプリケーション; このディレクトリは <filename>bin</filename>、<filename>sbin</filename>、<filename>lib</filename> のようにさらに細分されます (各ディレクトリの目的はルートディレクトリにこれらのディレクトリが含まれる場合と同じです)。更に、<filename>/usr/share/</filename> にはアーキテクチャに依存しないデータが含まれます。<filename>/usr/local/</filename> は管理者が手作業でアプリケーションをインストールするために使われる事を意味します。こうすることで、パッケージ化システム (<command>dpkg</command>) によって取り扱われるファイルを上書きしなくても済むようになります。

source: <filename>/var/</filename>: variable data handled by daemons. This includes log files, queues, spools, caches and so on.
ar_ma: <filename>/var/</filename>: بيانات متغيرة يتحكم بها الحراس. منها ملفات السجلات (log files)، والأرتال (queues)، و spools، و caches وهكذا.
ja_jp: <filename>/var/</filename>: デーモンの取り扱う可変データ。これには、ログファイル、キュー、スプール、キャッシュなどが含まれます。

source: <filename>/proc/</filename> and <filename>/sys/</filename> are specific to the Linux kernel (and not part of the FHS). They are used by the kernel for exporting data to user-space.
ar_ma: <filename>/proc/</filename> و <filename>/sys/</filename> مخصصة للنواة لينوكس (وليست جزءاً من FHS). تستخدم النواة هذين المجلدين لتصدير البيانات إلى ساحة المستخدم.
ja_jp: <filename>/proc/</filename> と <filename>/sys/</filename> は Linux カーネルに特有のディレクトリです (FHS で定義されていません)。カーネルはユーザ空間にデータを書き出すためにこれらのディレクトリを使います。

source: The User's Home Directory
ar_ma: مجلد بيت المستخدم (Home)
ja_jp: ユーザのホームディレクトリ

source: The contents of a user's home directory is not standardized, but there are still a few noteworthy conventions. One is that a user's home directory is often referred to by a tilde (“~”). That is useful to know because command interpreters automatically replace a tilde with the correct directory (usually <filename>/home/<replaceable>user</replaceable>/</filename>).
ar_ma: إن محتويات مجلد بيت المستخدم غير مقيدة بمعيار، لكن توجد بعض العادات الجديرة بالذكر. أحدها أن مجلد بيت المستخدم غالباً ما يرمز له بالتيلدا (”~“). من المفيد أن تعلم ذلك لأن مفسرات الأوامر تستبدل التيلدا أوتوماتيكيًا بالمجلد الصحيح (عادة <filename>/home/<replaceable>user</replaceable>/</filename>).
ja_jp: ユーザのホームディレクトリの内容は標準化されていませんが、特筆すべき規則が存在します。1 つ目は、ユーザのホームディレクトリがチルダ (「~」) で表される場合が多いという事です。これを知っておくと便利です。なぜなら、コマンドラインインタプリタは自動的にチルダを正しいディレクトリ (通常 <filename>/home/<replaceable>user</replaceable>/</filename>) に置き換えるからです。
