Repository: Neamar/KISS
Catalog: */92_short-remedial-course.po
Languages: ar_ma, ja_jp

source: Although <emphasis>daemon</emphasis> term shares its Greek etymology with <emphasis>demon</emphasis>, the former does not imply diabolical evil, instead, it should be understood as a kind of helper spirit. This distinction is subtle enough in English; it's even worse in other languages where the same word is used for both meanings.
ja_jp: <emphasis>daemon</emphasis> という用語はギリシャ神話の <emphasis>demon</emphasis> と起源を共にしているにも関わらず、<emphasis>daemon</emphasis> は暗に残虐な悪魔を意味しておらず、その代わりに <emphasis>daemon</emphasis> は守り神のようなものとして理解されています。この区別は英語ではかなりわかりにくいものです; 両方の意味を同じ言葉で表している他の言語ではもっとわかりにくいです。

source: Several such daemons are described in detail in <xref linkend="unix-services" />.
ar_ma: عدة حراس مثل هؤلاء موصوفين بالتفصيل في <xref linkend="unix-services" />.
ja_jp: このようなデーモンは<xref linkend="unix-services" />で詳細に説明されています。

source: Inter-Process Communications
ar_ma: التواصل بين العمليات
ja_jp: プロセス間通信

source: <primary>Inter-Process Communications</primary>
ar_ma: <primary>التواصل بين العمليات</primary>
ja_jp: <primary>プロセス間通信</primary>

source: An isolated process, whether a daemon or an interactive application, is rarely useful on its own, which is why there are several methods allowing separate processes to communicate together, either to exchange data or to control one another. The generic term referring to this is <emphasis>inter-process communication</emphasis>, or IPC for short.
ar_ma: إن العملية المعزولة، سواء كانت حارساً أو تطبيقًا تفاعليًا، نادراً ما تكون مفيدة بحد ذاتها، وهو السبب وراء وجود العديد من أساليب التواصل بين العمليات المنفصلة، سواء لتبادل البيانات أو لتتحكم واحدتها بالأخرى. المصطلح العام للتعبير عن هذا المفهوم هو <emphasis>التواصل بين العمليات</emphasis>، أو IPC اختصاراً لـ inter-process communication.
ja_jp: デーモンでも対話的アプリケーションでも、単独のプロセスは便利ではありません。このため、異なるプロセス同士がデータを交換したり、相互に制御し合うための様々な通信方法があります。これを意味する一般的な用語が <emphasis>プロセス間通信</emphasis> 略して IPC です。

source: The simplest IPC system is to use files. The process that wishes to send data writes it into a file (with a name known in advance), while the recipient only has to open the file and read its contents.
ar_ma: أبسط نظام IPC هو استخدام الملفات. تكتب العملية التي ترغب بإرسال البيانات بياناتها في ملف (له اسم معروف مسبقًا)، في حين تحتاج العملية المتلقية إلى فتح الملف وقراءة محتوياته فقط.
ja_jp: 最も簡単な IPC システムではファイルを使います。データ送信側のプロセスが送信内容をファイルに書き込み (事前にファイル名を決めておく必要があります)、受信側はファイルを開いてその内容を読むだけです。

source: <primary><emphasis>pipe</emphasis></primary>
ar_ma: <primary><emphasis>أنبوب</emphasis></primary>
ja_jp: <primary><emphasis>パイプ</emphasis></primary>

source: In the case where one does not wish to store data on disk, one can use a <emphasis>pipe</emphasis>, which is simply an object with two ends; bytes written in one end are readable at the other. If the ends are controlled by separate processes, this leads to a simple and convenient inter-process communication channel. Pipes can be classified into two categories: named pipes, and anonymous pipes. A named pipe is represented by an entry on the filesystem (although the transmitted data is not stored there), so both processes can open it independently if the location of the named pipe is known beforehand. In cases where the communicating processes are related (for instance, a parent and its child process), the parent process can also create an anonymous pipe before forking, and the child inherits it. Both processes will then be able to exchange data through the pipe without needing the filesystem.
ja_jp: データをディスクに保存したくないと思っている場合、<emphasis>パイプ</emphasis>を使う事が可能です。<emphasis>パイプ</emphasis>は 2 つの端を持つ単純なオブジェクトです; 片側に書き込まれたデータを逆側から読み出す事が可能です。パイプの一方の端が別のプロセスによって制御されている場合、これは単純で便利なプロセス間通信チャネルになります。パイプは 2 種類に分類分けされます: 名前付きパイプと無名パイプです。名前付きパイプはファイルシステム上のエントリによって表現されます (転送されたデータは保存されません)。事前に名前付きパイプの場所がわかっていれば、2 つのプロセスが独立に名前付きパイプを開く事が可能です。通信プロセス同士に関連性がある場合 (例えば、親と子プロセス)、親プロセスはフォークの前に無名パイプを作成し、子プロセスがこれを継承するだけで済みます。両方のプロセスはパイプを通じてデータを交換する事が可能です。ファイルシステムは必要ありません。

source: <emphasis>IN PRACTICE</emphasis> A concrete example
ar_ma: <emphasis>أثناء العمل</emphasis> مثال قوي
ja_jp: <emphasis>IN PRACTICE</emphasis> 具体例

source: Let's describe in some detail what happens when a complex command (a <emphasis>pipeline</emphasis>) is run from a shell. We assume we have a <command>bash</command> process (the standard user shell on Debian), with <emphasis>pid</emphasis> 4374; into this shell, we type the command: <command>ls | sort</command> .
ar_ma: دعنا نناقش ما يحدث عند تنفيذ أمر معقد (<emphasis>خط أنابيب</emphasis>) من الصَدَفة بشيء من التفصيل. نحن نفترض أن لدينا عملية <command>bash</command> (صَدَفة المستخدم القياسية على ديبيان)، لها <emphasis>pid</emphasis> مساو لـ 4374؛ وفي هذه الصدفة، سنكتب الأمر : <command>ls | sort</command> .
ja_jp: それでは、複雑なコマンド (<emphasis>パイプライン</emphasis>) がシェルから実行された場合に何が起きるか詳しく説明しましょう。<emphasis>pid</emphasis> 4374 の <command>bash</command> プロセス (Debian の標準的なユーザシェル) があると仮定します; このシェルの中で、次のコマンドをタイプします: <command>ls | sort</command> 。

source: The shell first interprets the command typed in. In our case, it understands there are two programs (<command>ls</command> and <command>sort</command>), with a data stream flowing from one to the other (denoted by the <userinput>|</userinput> character, known as <emphasis>pipe</emphasis>). <command>bash</command> first creates an unnamed pipe (which initially exists only within the <command>bash</command> process itself).
ar_ma: تُفَسِّر الصدفة أولاً الأمر المكتوب فيها. في حالتنا، ستفهم أن هناك برنامجين (<command>ls</command> و <command>sort</command>)، مع مجرى بيانات يتدفق من أحدهما إلى الآخر (ممثل بالمحرف <userinput>|</userinput>، الذي يعرف <emphasis>بالأنبوب</emphasis>). تنشئ <command>bash</command> أولاً أنبوبًا مجهولاً (الذي يكون مبدئيًا ضمن عملية <command>bash</command> نفسها).
ja_jp: シェルは最初に入力されたコマンドを解釈します。今回の場合、シェルは 2 種類のプログラム (<command>ls</command> と <command>sort</command>) が存在して、一方からもう一方へ流れるデータストリームがある (<userinput>|</userinput> 文字によって表されます。これは<emphasis>パイプ</emphasis>としても知られています) と理解します。<command>bash</command> は最初に無名パイプ (これは <command>bash</command> プロセス自身の中だけに存在します) を作成します。

source: Then the shell clones itself; this leads to a new <command>bash</command> process, with <emphasis>pid</emphasis> #4521 (<emphasis>pids</emphasis> are abstract numbers, and generally have no particular meaning). Process #4521 inherits the pipe, which means it is able to write in its “input” side; <command>bash</command> redirects its standard output stream to this pipe's input. Then it executes (and replaces itself with) the <command>ls</command> program, which lists the contents of the current directory. Since <command>ls</command> writes on its standard output, and this output has previously been redirected, the results are effectively sent into the pipe.
ar_ma: تستنسخ الصدفة نفسها؛ هذا يؤدي إلى عملية <command>bash</command> جديدة، لها <emphasis>pid</emphasis> رقمه 4521 (<emphasis>pid</emphasis> هي مجرد أرقام، وعادة لا يكون لها أي معنى محدد). ترث العملية #4521 الأنبوب، ما يعني أنها قادرة على الكتابة في نهاية ”الإدخال“ الخاصة به؛ تُعيد <command>bash</command> توجيه مجرى خرجها القياسي إلى دخل هذا الأنبوب. بعدها تنفذ (وتستبدل نفسها بـ) البرنامج <command>ls</command>، الذي يسرد محتويات المجلد الحالي. نظراً لأن <command>ls</command> يكتب على مجرى خرجه القياسي، وقد أعيد توجيه هذا المجرى مسبقًا، سيتم إرسال النتائج عمليًا إلى الأنبوب.
ja_jp: その後、シェルは自分自身の複製を作ります; これは新しい <command>bash</command> プロセスで <emphasis>pid</emphasis> #4521 を持っています (<emphasis>pid</emphasis> は抽象的な数で、一般に特別な意味はありません)。プロセス #4521 はパイプを継承します。これは「入力」側に書き込む事が可能という事を意味しています; <command>bash</command> は自分の標準出力ストリームをパイプの入力にリダイレクトします。その後、<command>bash</command> は <command>ls</command> プログラムを実行します (さらに自分自身を置き換えます)。<command>ls</command> は現在のディレクトリの内容をリストします。<command>ls</command> の書き込み先は標準出力で、この出力は予めリダイレクトされていたため、結果はパイプに送られます。

source: A similar operation happens for the second command: <command>bash</command> clones itself again, leading to a new <command>bash</command> process with pid #4522. Since it is also a child process of #4374, it also inherits the pipe; <command>bash</command> then connects its standard input to the pipe output, then executes (and replaces itself with) the <command>sort</command> command, which sorts its input and displays the results.
ar_ma: تحدث عملية مشابهة للأمر الثاني تستنسخ <command>bash</command> نفسها ثانية، منتجة عملية <command>bash</command> جديدة لها pid مساو لـ 4522. ولأنها أيضًا ابنة للعملية #4374، ترث الأنبوب؛ بعدها تربط <command>bash</command> دخلها القياسي إلى خرج الأنبوب، بعدها تنفذ (وتستبدل نفسها بـ) الأمر <command>sort</command>، الذي يرتب دخله ويعرض النتائج.
ja_jp: 2 番目のコマンドについても同様の操作が行われます: <command>bash</command> は再度自分自身の複製を作り、これにより pid #4522 の新しい <command>bash</command> プロセスが作成されます。pid #4522 の新しい <command>bash</command> プロセスは #4374 の子プロセスで、パイプを継承します; <command>bash</command> は自分の標準入力をパイプの出力に接続し、その後 <command>sort</command> コマンドを実行します (さらに自分自身を置き換えます)。<command>sort</command> コマンドは自分の入力をソートして結果を表示します。

source: All the pieces of the puzzle are now set up: <command>ls</command> reads the current directory and writes the list of files into the pipe; <command>sort</command> reads this list, sorts it alphabetically, and displays the results. Processes numbers #4521 and #4522 then terminate, and #4374 (which was waiting for them during the operation), resumes control and displays the prompt to allow the user to type in a new command.
ja_jp: これで、パズルのすべてのピースが揃った状態になります: <command>ls</command> は現在のディレクトリを読み込んで、ファイルのリストをパイプに書き込みます; <command>sort</command> はファイルのリストを読み込んで、アルファベット順にソートして、結果を表示します。プロセス番号 #4521 と #4522 は終了し、#4374 (操作中の他プロセスを待っていました) は制御を取り戻し、ユーザが新しいコマンドを入力するためのプロンプトを表示します。

source: Not all inter-process communications are used to move data around, though. In many situations, the only information that needs to be transmitted are control messages such as “pause execution” or “resume execution”. Unix (and Linux) provides a mechanism known as <emphasis>signals</emphasis>, through which a process can simply send a signal (chosen within a fixed list of a few tens of predefined signals) to another process. The only requirement is to know the <emphasis>pid</emphasis> of the target.
ja_jp: しかしながら、すべてのプロセス間通信がデータを移動させるために使われるわけではありません。多くの状況で、送信する必要のある情報は「実行を一時停止」や「実行を再開」などの制御メッセージです。Unix (と Linux) は <emphasis>シグナル</emphasis> として知られているメカニズムを提供します。このメカニズムを使って、プロセスは別のプロセスに対して簡単にシグナルを送信する事が可能です (送信するシグナルは事前に定義された数十個のシグナルのリストから選びます)。送信に必要な情報は送信先の <emphasis>pid</emphasis> だけです。

source: For more complex communications, there are also mechanisms allowing a process to open access, or share, part of its allocated memory to other processes. Memory shared between them can be used to move data across.
ja_jp: 更に複雑な通信を行うには、プロセスが他のプロセスに対して自分が割り当てられたメモリの一部へのアクセスを開放したり、共有するメカニズムを使います。プロセス間のメモリ共有はデータを交換するために使われます。

source: Finally, network connections can also help processes communicate; these processes can even be running on different computers, possibly thousands of kilometers apart.
ar_ma: أخيرًا، يمكن أن تساعد الاتصالات الشبكية بالتواصل بين العمليات؛ يمكن أن توجد هذه العمليات على حواسيب مختلفة، وقد تبعد عن بعضها آلاف الكيلومترات.
ja_jp: 最後に、ネットワーク接続を使ってプロセス同士を通信させる事が可能です; 数千キロ離れた異なるコンピュータで動いているプロセス同士でも通信可能です。

source: It is quite standard for a typical Unix-like system to make use of all these mechanisms to various degrees.
ar_ma: من العادي جداً لأي نظام نموذجي مشابه لـ يونكس أن يستخدم جميع هذه الآليات بدرجات متفاوتة.
ja_jp: 典型的な Unix 系システムでは、様々なレベルでこれらのメカニズムを使っており、かなり標準的な手法になっています。

source: Libraries
ar_ma: المكتبات
ja_jp: ライブラリ

source: <primary>library (of functions)</primary>
ar_ma: <primary>مكتبة (للدوال)</primary>
ja_jp: <primary>(関数) ライブラリ</primary>

source: Function libraries play a crucial role in a Unix-like operating system. They are not proper programs, since they cannot be executed on their own, but collections of code fragments that can be used by standard programs. Among the common libraries, you can find:
ja_jp: 関数ライブラリは Unix 系オペレーティングシステムで重要な役割を果たします。関数ライブラリは厳密な意味でプログラムではありません。なぜなら、関数ライブラリ自体は実行できず、ただのコードの断片に過ぎないからです。しかし、標準的なプログラムは関数ライブラリを使っています。共有ライブラリの中でも特に以下のものが有名です:

source: the standard C library (<emphasis>glibc</emphasis>), which contains basic functions such as ones to open files or network connections, and others facilitating interactions with the kernel;
ar_ma: مكتبة C القياسية (<emphasis>glibc</emphasis>)، التي تحوي الوظائف الأساسية مثل دوال فتح الملفات أو الاتصالات الشبكية، وأخرى تسهل التفاعل مع النواة؛
ja_jp: 標準 C ライブラリ (<emphasis>glibc</emphasis>)、これにはファイルやネットワーク接続を開く関数やカーネルとの通信を容易にする関数などの基本的な関数が含まれます;

source: graphical toolkits, such as Gtk+ and Qt, allowing many programs to reuse the graphical objects they provide;
ja_jp: Gtk+ と Qt などのグラフィカルツールキット、これを使うことで、多くのプログラムはツールキットの提供するグラフィカルオブジェクトを再利用する事が可能です;

source: the <emphasis>libpng</emphasis> library, that allows loading, interpreting and saving images in the PNG format.
ar_ma: مكتبة <emphasis>libpng</emphasis>، التي تسمح بتحميل، وتفسير وحفظ الصور بصيغة PNG.
ja_jp: <emphasis>libpng</emphasis> ライブラリ、これを使うことで、PNG フォーマットイメージを読み込み、編集、保存する事が可能になります。

source: Thanks to those libraries, applications can reuse existing code. Their development is thus correspondingly simplified, in particular when many applications reuse the same functions. Since libraries are often developed by different persons, the global development of the system is closer to Unix's historical philosophy.
ar_ma: بفضل هذه المكتبات، تستطيع البرامج إعادة استخدام الكود. ونتيجة لذلك يصبح تطوير هذه البرامج أبسط، خصوصا عندما تستخدم عدة تطبيقات الدوال نفسها. نظرا لأن المكتبات يطورها أشخاص مختلفين عادة، فإن التطوير الكلي للنظام أقرب إلى فلسفة يونكس التاريخية.
ja_jp: これらのライブラリのお陰で、アプリケーションは既存のコードを再利用する事が可能です。これに応じて、アプリケーションの開発が簡単になります。多くのアプリケーションが同じ関数を再利用している場合、この傾向は特に顕著になります。通常ライブラリはアプリケーションとは別の人によって開発されているため、システムの大域的な開発は Unix の歴史的哲学に近いものです。

source: <emphasis>CULTURE</emphasis> The Unix Way: one thing at a time
ar_ma: <emphasis>ثقافة</emphasis> أسلوب يونكس: مهمة واحدة في الوقت الواحد
ja_jp: <emphasis>CULTURE</emphasis> Unix 流: 一度に一つの事をせよ

source: One of the fundamental concepts that underlies the Unix family of operating systems is that each tool should only do one thing, and do it well; applications can then reuse these tools to build more advanced logic on top. This Way can be seen in many incarnations. Shell scripts may be the best example: they assemble complex sequences of very simple tools (such as <command>grep</command>, <command>wc</command>, <command>sort</command>, <command>uniq</command> and so on). Another implementation of this philosophy can be seen in code libraries: the <emphasis>libpng</emphasis> library allows reading and writing PNG images, with different options and in different ways, but it does only that; no question of including functions that display or edit images.
ar_ma: أحد المفاهيم الأساسية التي تحدد عائلة نظم تشغيل يونكس هو أن كل أداة يجب أن تفعل شيئا واحدا فقط، وأن تتمه بشكل جيد؛ يمكن للتطبيقات بعد ذلك إعادة استخدام هذه الأدوات لبناء منطق أكثر تقدّما فوقها. يمكن أن نرى هذه الطريقة في العديد من تمثيلات يونكس. قد تكون سكريبتات الصدفة أفضل مثال: فهي تجمع متتاليات معقدة لأدوات بسيطة جدًا (مثل <command>grep</command>، <command>wc</command>، <command>sort</command>، و<command>uniq</command> وهكذا). يمكن أن نرى تطبيقًا آخر لهذه الفلسفة في مكتبات الكود: تسمح مكتبة <emphasis>libpng</emphasis> بقراءة وكتابة صور PNG، بخيارات مختلفة وبأساليب متنوعة، لكنها لا تفعل غير ذلك؛ لا توجد إمكانية لتضمين دوال تعرض الصور أو تحررها.
ja_jp: Unix 系オペレーティングシステムの根底にある基本的概念の一つとして、それぞれのツールがたった 1 つの事を担当し、それを上手くこなす、というものがあります; アプリケーションはこれらのツールを再利用して、より高度な論理をつくり上げる事が可能です。この基本的概念は様々な形で具現化されています。シェルスクリプトは最良の例かもしれません: シェルスクリプトは極めて簡単なツール (例えば <command>grep</command>、<command>wc</command>、<command>sort</command>、<command>uniq</command> など) を複雑に並べたものです。コードライブラリも基本的概念を具現化したものとして見る事が可能です: <emphasis>libpng</emphasis> ライブラリを使うことで、様々なオプションと様々な方法を使って、PNG イメージの読み込みと書き込みを行う事が可能です。しかし、<emphasis>libpng</emphasis> ライブラリはそれ以上の事を行いません; イメージを表示したり編集する関数は含まれません。

source: Moreover, these libraries are often referred to as “shared libraries”, since the kernel is able to only load them into memory once, even if several processes use the same library at the same time. This allows saving memory, when compared with the opposite (hypothetical) situation where the code for a library would be loaded as many times as there are processes using it.
ar_ma: وأكثر من ذلك، غالبا ما يُشَار إلى هذه المكتبات على أنها ”مكتبات مشتركة“، نظرا لأن النواة تستطيع تحميلها إلى الذاكرة مرة واحدة فقط، حتى لو كانت عدة عمليات تستخدم المكتبة نفسها في الوقت ذاته. يسمح هذا بتوفير الذاكرة، مقارنة مع الحالة (النظرية) النقيضة لها حيث يتم تحميل كود المكتبة بعدد العمليات التي تستخدمها.
ja_jp: さらに、これらのライブラリは「共有ライブラリ」とも呼ばれています。なぜなら、複数のプロセスが同じライブラリを同時に使う場合、カーネルはライブラルの読み込みを一回だけで済ませる事が可能だからです。プロセスが使うライブラリのコードを何度も読み込むような逆の (仮想的) 状況に比べて、これはメモリを節約することになります。

source: BIOS
ar_ma: بيوس

source: Unix
ar_ma: يونكس

source: <primary>Firewire</primary>
ar_ma: <primary>فاير واير</primary>

source: <primary>BIOS</primary>
ar_ma: <primary>بيوس</primary>
