Repository: Neamar/KISS
Catalog: */92_short-remedial-course.po
Languages: ar_ma, ja_jp

source: These programs have a <literal>-v</literal> option, that lists much more detailed (but usually not necessary) information. Finally, the <command>lsdev</command> command (in the <emphasis role="pkg">procinfo</emphasis> package) lists communication resources used by devices.
ar_ma: لهذه البرامج خيار <literal>-v</literal>، الذي يسرد معلومات مفصلة أكثر بكثير (لكن عادة غير ضرورية). أخيراً، يسرد الأمر <command>lsdev</command> (الموجود في الحزمة <emphasis role="pkg">procinfo</emphasis>) موارد التواصل التي تستهلكها الأجهزة.
ja_jp: これらのプログラムは <literal>-v</literal> オプションを取ります。<literal>-v</literal> オプションを使うことで、より詳しい (通常は不要な) 情報が表示されます。最後に、<command>lsdev</command> コマンド (<emphasis role="pkg">procinfo</emphasis> に含まれます) はデバイスによって使われている通信リソースをリストします。

source: Applications often access devices by way of special files created within <filename>/dev/</filename> (see sidebar <xref linkend="sidebar.special-files" />). These are special files that represent disk drives (for instance, <filename>/dev/hda</filename> and <filename>/dev/sdc</filename>), partitions (<filename>/dev/hda1</filename> or <filename>/dev/sdc3</filename>), mice (<filename>/dev/input/mouse0</filename>), keyboards (<filename>/dev/input/event0</filename>), soundcards (<filename>/dev/snd/*</filename>), serial ports (<filename>/dev/ttyS*</filename>), and so on.
ja_jp: アプリケーションは <filename>/dev/</filename> 内に作られた特殊ファイルを介してデバイスにアクセスする場合が多いです (傍注<xref linkend="sidebar.special-files" />参照)。<filename>/dev/</filename> 内には特殊ファイルがあり、これらはディスクドライブ (例えば、<filename>/dev/hda</filename> や <filename>/dev/sdc</filename>)、パーティション (<filename>/dev/hda1</filename> や <filename>/dev/sdc3</filename>)、その他 (<filename>/dev/input/mouse0</filename>)、キーボード (<filename>/dev/input/event0</filename>)、サウンドカード (<filename>/dev/snd/*</filename>)、シリアルポート (<filename>/dev/ttyS*</filename>)、などを表します。

source: Filesystems
ar_ma: نظم الملفات
ja_jp: ファイルシステム

source: <primary>filesystem</primary>
ar_ma: <primary>نظام ملفات</primary>
ja_jp: <primary>ファイルシステム</primary>

source: <primary>system, filesystem</primary>
ar_ma: <primary>نظام، نظام ملفات</primary>
ja_jp: <primary>システム、ファイルシステム</primary>

source: Filesystems are one of the most prominent aspects of the kernel. Unix systems merge all the file stores into a single hierarchy, which allows users (and applications) to access data simply by knowing its location within that hierarchy.
ar_ma: أنظمة الملفات هي إحدى أهم مظاهر النواة. تدمج النظم المشابهة لـ يونكس جميع أجهزة تخزين الملفات في شجرة واحدة، والتي تسمح للمستخدمين (والتطبيقات) بالوصول إلى البيانات ببساطة بمعرفة مكانها ضمن تلك الشجرة.
ja_jp: ファイルシステムはカーネルの最も目立つ側面の 1 つです。Unix システムはすべてのファイルを統合し、1 つの階層構造の中に保存します。こうすることで、ユーザ (とアプリケーション) は階層構造の中のファイルの場所を知るだけでデータにアクセスする事が可能です。

source: The starting point of this hierarchical tree is called the root, <filename>/</filename>. This directory can contain named subdirectories. For instance, the <literal>home</literal> subdirectory of <filename>/</filename> is called <filename>/home/</filename>. This subdirectory can, in turn, contain other subdirectories, and so on. Each directory can also contain files, where the actual data will be stored. Thus, the <filename>/home/rmas/Desktop/hello.txt</filename> name refers to a file named <literal>hello.txt</literal> stored in the <literal>Desktop</literal> subdirectory of the <literal>rmas</literal> subdirectory of the <literal>home</literal> directory present in the root. The kernel translates between this naming system and the actual, physical storage on a disk.
ar_ma: تدعى نقطة البداية لهذه الشجرة الهرمية بالجذر root، ويرمز لها بـ <filename>/</filename>. يستطيع هذا المجلد أن يحوي مجلدات فرعية مسماة. مثلا، يدعى مجلد <literal>home</literal> (البيت) المتفرع عن <filename>/</filename> باسم <filename>/home/</filename>. يمكن لهذا المجلد الفرعي، بدوره، أن يحوي مجلدات فرعية أخرى، وهكذا. يمكن لكل مجلد أيضًا أن يحوي ملفات، حيث يتم تخزين البيانات الفعلية. بالتالي، يشير الاسم <filename>/home/rmas/Desktop/hello.txt</filename> إلى الملف المسمى <literal>hello.txt</literal> المخزن في المجلد <literal>Desktop</literal> المتفرع عن المجلد <literal>rmas</literal> المتفرع عن المجلد <literal>home</literal> الموجود في الجذر. تترجم النواة بين نظام التسمية هذا وبين نظام التخزين الفعلي الفيزيائي على القرص.
ja_jp: 階層構造ツリーの起点はルート、<filename>/</filename>、と呼ばれています。ルートディレクトリには名前を付けられたサブディレクトリが含まれます。例えば、<filename>/</filename> の <literal>home</literal> サブディレクトリは <filename>/home/</filename> と呼ばれます。このサブディレクトリには、更に別のサブディレクトリを含める事が可能です。各ディレクトリには、実際のデータが保存されるファイルを含める事も可能です。そんなわけで、<filename>/home/rmas/Desktop/hello.txt</filename> ファイルはルートディレクトリ内の <literal>home</literal> サブディレクトリ内の <literal>rmas</literal> サブディレクトリ内の <literal>Desktop</literal> サブディレクトリ内の <literal>hello.txt</literal> と名付けられたファイルを表します。カーネルはこの命名システムと実際のディスク上の物理的な保存領域を変換します。

source: Unlike other systems, there's only one such hierarchy, and it can integrate data from several disks. One of these disks is used as the root, and the others are “mounted” on directories in the hierarchy (the Unix command is called <command>mount</command>); these other disks are then available under these “mount points”. This allows storing users' home directories (traditionally stored within <filename>/home/</filename>) on a second hard disk, which will contain the <literal>rhertzog</literal> and <literal>rmas</literal> directories. Once the disk is mounted on <filename>/home/</filename>, these directories become accessible at their usual locations, and paths such as <filename>/home/rmas/Desktop/hello.txt</filename> keep working.
ja_jp: 他のシステムと異なり、このような階層構造は一つしかありません。そしてこの単独の階層構造に複数のディスクからのデータを統合できます。1 台のディスクがルートディレクトリとして使われ、他のディスクは階層構造中のディレクトリに「マウント」されます (Unix コマンドは <command>mount</command> と呼ばれます)。マウントされたディスクは「マウントポイント」の下から利用可能になります。これのお陰で、2 台目のハードディスクにユーザのホームディレクトリ (伝統的に <filename>/home/</filename> の中に保存されます) を保存する事が可能です。このディスクには <literal>rhertzog</literal> と <literal>rmas</literal> ディレクトリが含まれます。2 台目のハードディスクを <filename>/home/</filename> にマウントすると、ユーザのホームディレクトリの通常の場所からこれらのディレクトリにアクセス可能になり、<filename>/home/rmas/Desktop/hello.txt</filename> などのパスが動作するようになります。

source: There are many filesystems, corresponding to many ways of physically storing data on disks. The most widely known are <emphasis>ext2</emphasis>, <emphasis>ext3</emphasis> and <emphasis>ext4</emphasis>, but others exist. For instance, <emphasis>vfat</emphasis> is the system that was historically used by DOS and Windows operating systems, which allows using hard disks under Debian as well as under Windows. In any case, a filesystem must be prepared on a disk before it can be mounted and this operation is known as “formatting”. Commands such as <command>mkfs.ext3</command> (where <command>mkfs</command> stands for <emphasis>MaKe FileSystem</emphasis>) handle formatting. These commands require, as a parameter, a device file representing the partition to be formatted (for instance, <filename>/dev/sda1</filename>). This operation is destructive and should only be run once, except if one deliberately wishes to wipe a filesystem and start afresh.
ar_ma: يوجد العديد من نظم الملفات، نظراً للطرق العديدة لتخزين البيانات فيزيائيًا على الأقراص. أكثر نظم الملفات شهرة هي <emphasis>ext2</emphasis> ،<emphasis>ext3</emphasis> و <emphasis>ext4</emphasis>، لكن يوجد غيرها. مثلاً، <emphasis>vfat</emphasis> هو النظام الذي استخدمه دوس قديمًا ونظام التشغيل ويندوز، ما يسمح باستخدام الأقراص الصلبة تحت ديبيان كما تحت ويندوز. على أية حال، يجب تجهيز نظام ملفات على القرص قبل أن نتمكن تركيبه على شجرة الملفات وتعرف هذه العملية باسم ”التهيئة“. تعالج الأوامر مثل <command>mkfs.ext3</command> (حيث <command>mkfs</command> تعني <emphasis>MaKe FileSystem</emphasis> أي اصنع نظام ملفات) عملية التهيئة. تتطلب هذه الأوامر، كمتغير، ملف جهاز يمثل القسم المراد تهيئته (مثلاً، <filename>/dev/sda1</filename>). هذه العملية مدمرة ويجب تشغيلها مرة واحدة فقط، إلا إذا أراد المرء مسح نظام الملفات والبدء من جديد عمدًا.
ja_jp: ディスク上に物理的にデータを保存する方法の違いに対応して、多くのファイルシステムが存在します。最も広く知られているファイルシステムは <emphasis>ext2</emphasis>、<emphasis>ext3</emphasis>、<emphasis>ext4</emphasis> ですが、他にも存在します。例えば、<emphasis>vfat</emphasis> は歴史的に DOS と Windows オペレーティングシステムで使われていたファイルシステムで、<emphasis>vfat</emphasis> ファイルシステムを使っているハードディスクは Debian および Windows の下で使う事が可能です。いかなる場合でも、ディスクをマウントする前に必ずディスク上にファイルシステムを準備しなければいけません。この準備作業は「フォーマット」として知られています。フォーマットを行うには <command>mkfs.ext3</command> (ここで <command>mkfs</command> は <emphasis>MaKe FileSystem</emphasis> の略語です) などのコマンドを使います。<command>mkfs</command> コマンドには、フォーマットされるパーティションを指すデバイスファイル (例えば <filename>/dev/sda1</filename>) をパラメータとして渡す必要があります。ファイルシステムの作成作業は破壊的なものです。意図的にファイルシステムを完全消去して、最初からやり直したい場合を除いて、2 回やってはいけません。

source: There are even network filesystems, such as <acronym>NFS</acronym>, where data is not stored on a local disk. Instead, data is transmitted through the network to a server that stores and retrieves them on demand. The filesystem abstraction shields users from having to care: files remain accessible in their usual hierarchical way.
ar_ma: توجد حتى نظم ملفات شبكية، مثل <acronym>NFS</acronym>، حيث لا تخزن البيانات على قرص محلي. بل ترسل البيانات عبر الشبكة إلى مخدم يخزنها ويسترجعها حسب الطلب. إن تجريد نظم الملفات يحمي المستخدمين من الحاجة للاهتمام بذلك: تبقى الملفات متوفرة للوصول بالطريقة الشجرية المعتادة.
ja_jp: 更に、<acronym>NFS</acronym> などのネットワークファイルシステムが存在します。ネットワークファイルシステムを使った場合、データはローカルディスクに保存されません。その代わり、データはネットワークを介してサーバに送信されます。サーバは要求に応じてデータを保存したり、読み出したりします。ファイルシステムを抽象化したことによるユーザが特に心がける点はありません: ファイルは通常の階層構造的方法を使ってアクセス可能です。

source: Shared Functions
ar_ma: الوظائف المشتركة
ja_jp: 共有機能

source: Since a number of the same functions are used by all software, it makes sense to centralize them in the kernel. For instance, shared filesystem handling allows any application to simply open a file by name, without needing to worry where the file is stored physically. The file can be stored in several different slices on a hard disk, or split across several hard disks, or even stored on a remote file server. Shared communication functions are used by applications to exchange data independently of the way the data is transported. For instance, transport could be over any combination of local or wireless networks, or over a telephone landline.
ja_jp: 数多くの同じ機能がすべてのソフトウェアで使われますから、これらの機能をカーネルに集中させることは合理的です。例えば、共有ファイルシステムを取り扱う機能を使うことで、名前から簡単にファイルを開く事が可能になります。ファイルが物理的に保存されている場所を気にする必要はありません。ファイルは 1 台のハードディスクの複数の異なる部分に保存したり、複数のハードディスクに渡って分割したり、リモートファイルサーバに保存する事が可能です。アプリケーションはデータを交換するために共有された通信機能を使います。アプリケーション側からするとデータを転送する方法を意識する必要はありません。例えば、データ転送はローカル、ワイヤレスネットワーク、固定電話回線の任意の組み合わせを通じて行われるかもしれません。

source: A process is a running instance of a program. This requires memory to store both the program itself and its operating data. The kernel is in charge of creating and tracking them. When a program runs, the kernel first sets aside some memory, then loads the executable code from the filesystem into it, and then starts the code running. It keeps information about this process, the most visible of which is an identification number known as <emphasis>pid</emphasis> (<emphasis>process identifier</emphasis>).
ja_jp: プロセスとはプログラムの実行中インスタンスです。プロセスはプログラム自身とその動作データを保存するためのメモリを要求します。カーネルはプロセスの作成と追跡を担当します。プログラムが実行されると、カーネルは最初に幾らかのメモリを確保し、次にファイルシステムから確保したメモリに実行可能なコードを読み込み、次にコードの実行を開始します。カーネルはプロセスに関する情報を保持します。中でも最もよく知られている情報は <emphasis>pid</emphasis> (<emphasis>プロセス識別子</emphasis>) として知られる識別番号です。

source: Unix-like kernels (including Linux), like most other modern operating systems, are able of “multi-tasking”. In other words, they allow running many processes “at the same time”. There's actually only one running process at any one time, but the kernel cuts time into small slices and runs each process in turn. Since these time slices are very short (in the millisecond range), they create the illusion of processes running in parallel, although they're actually only active during some time intervals and idle the rest of the time. The kernel's job is to adjust its scheduling mechanisms to keep that illusion, while maximizing the global system performance. If the time slices are too long, the application may lack in snappiness and user interactivity. Too short, and the system loses time switching tasks too frequently. These decisions can be tweaked with process priorities. High-priority processes will run for longer and more frequent time slices than low-priority processes.
ja_jp: Unix 系カーネル (Linux を含めて) は、多くの他の現代的なオペレーティングシステムと同様、「マルチタスク」機能を備えています。言い換えれば、Unix 系カーネルは多くのプロセスを「同時に」実行する事が可能です。ある時点で動いているのは 1 つのプロセスだけですが、カーネルは時間を小さな単位に切り分け、順繰りにそれぞれのプロセスを実行します。これらの時分割単位は極めて短い (ミリ秒程度) ので、プロセスが並列実行されているような錯覚を起こさせます。しかし実際のところプロセスはある時間周期で活動しており、残りの時間は動いていません。カーネルの仕事はこの錯覚を保つためにスケジューリングメカニズムを調節し、同時にシステム全体の性能を最大化する事です。時分割単位が長すぎる場合、アプリケーションからの応答が遅れ、ユーザとの対話処理に支障をきたすかもしれません。短すぎる場合、タスク切り替えが頻繁に起こるようになり、システムは処理時間を損する事になります。プロセス優先度を使えば、時分割単位を微調整する事が可能です。優先度の高いプロセスは優先度の低いプロセスに比べて長くそしてより頻繁な時分割単位で実行されます。

source: <emphasis>NOTE</emphasis> Multi-processor systems (and variants)
ar_ma: <emphasis>ملاحظة</emphasis> الأنظمة متعددة المعالجات (ومشتقاتها)
ja_jp: <emphasis>NOTE</emphasis> マルチプロセッサシステム (とその亜種)

source: The restriction described here is only a corner case. The actual restriction is that there can only be one running process <emphasis>per processor core</emphasis> at a time. Multi-processor, multi-core or “hyper-threaded” systems allow several processes to run in parallel. The same time-slicing system is still used, though, so as to handle cases where there are more active processes than available processor cores. This is far from unusual: a basic system, even a mostly idle one, almost always has tens of running processes.
ja_jp: ここで説明している制限はかなり珍しいケースです。実用上の制限としては、同時に実行されるプロセスの数が<emphasis>プロセッサのコア 1 つあたり</emphasis> 1 つという制限です。マルチプロセッサ、マルチコア、「ハイパースレッディング」システムを使うことで、複数のプロセスを並列実行する事が可能です。ここでも同じ時分割システムを使いますが、このシステムは利用可能なプロセッサコアよりも多くのプロセスを実行させるようなケースを取り扱う事が可能です。これは決して珍しいことではありません: ベースシステムはほとんど動いていませんが、ほとんど常時数十個の実行中プロセスを抱えています。

source: Of course, the kernel allows running several independent instances of the same program. But each can only access its own time slices and memory. Their data thus remain independent.
ar_ma: طبعًا، تسمح النواة بتشغيل أكثر من نسخة مستقلة من البرنامج نفسه. لكن كل واحدة منها تستطيع استخدام ذاكرتها وشرائحها الزمنية الخاصة فقط. وبذلك تبقى بياناتها مستقلة.
ja_jp: もちろん、カーネルは同じプログラムの複数の独立したインスタンスも取り扱う事が可能です。しかし各プロセスは自分自身以外の時分割基準とメモリにアクセスすることはできません。このため、プロセスごとのデータは独立に管理されています。

source: Rights Management
ar_ma: إدارة الحقوق
ja_jp: 権限管理

source: Unix-like systems are also multi-user. They provide a rights management system that allows separate groups and users; it also allows choosing to permit or block actions based on permissions. The kernel manages, for each process, data allowing permission checking. Most of the time, this means the process' “identity” is the same as the user that started it. And the process is only able to take the actions allowed to its owner. For instance, trying to open a file requires the kernel to check the process identity against access permissions (for more details on this particular example, see <xref linkend="sect.rights-management" />).
ja_jp: Unix 系システムはマルチユーザに対応しています。Unix 系システムの提供する権限管理システムを使うことで、グループとユーザを別々に管理する事が可能です; さらに、パーミッションに基いて操作を許可したり拒否したりする事が可能です。カーネルがそれぞれのプロセスについてパーミッション確認用のデータを管理しています。ほとんどの場合、これはプロセスの「識別情報」はプロセスを起動したユーザと同じということ意味しています。そして、プロセスは自分を起動した所有者の可能な動作だけを実行吸う事が可能です。例えば、プロセスがファイルを開く前に、カーネルによってそのプロセスの識別情報がアクセスパーミッションを持つ事を確認されます (具体的な例についてのより詳しい情報は<xref linkend="sect.rights-management" />をご覧ください)。

source: <primary>user space</primary>
ar_ma: <primary>ساحة المستخدم</primary>
ja_jp: <primary>ユーザ空間</primary>

source: <primary>kernel space</primary>
ar_ma: <primary>ساحة النواة</primary>
ja_jp: <primary>カーネル空間</primary>

source: “User-space” refers to the runtime environment of normal (as opposed to kernel) processes. This does not necessarily mean these processes are actually started by users because a standard system routinely has several “daemon” processes running before the user even opens a session. Daemon processes are user-space processes.
ar_ma: تشير ”ساحة المستخدم“ إلى بيئة تشغيل العمليات العادية (مقارنة بعمليات النواة). لا يعني هذا بالضرورة أن المستخدم يُشَغِّل هذه العمليات لأن النظام القياسي له عادة عدة عمليات ”حراسة“ تعمل قبل أن يبدأ المستخدم جلسة العمل حتى. عمليات الحراسة تنتمي لساحة المستخدم.
ja_jp: 「ユーザ空間」とは通常 (カーネルに対して) プロセスの実行環境を意味します。「ユーザ空間」プロセスとは実際にユーザによって開始されたプロセスという意味ではありません。なぜなら、標準的なシステムでは、ユーザがセッションを開始する前から実行されている定期的に複数の「デーモン」プロセスが存在するからです。デーモンプロセスはユーザ空間プロセスです。

source: When the kernel gets past its initialization phase, it starts the very first process, <command>init</command>. Process #1 alone is very rarely useful by itself, and Unix-like systems run with a whole lifecycle of processes.
ar_ma: عندما تنهي النواة طور تهيئتها، تبدأ العملية الأولى، <command>init</command>. العملية #1 وحدها نادرًا ما تكون مفيدة بحد ذاتها، ونظم التشغيل المشابهة لـيونكس تعمل مع مجموعة كبيرة من العمليات.
ja_jp: カーネルはその初期化終了後に、最初のプロセス <command>init</command> を開始します。最初のプロセス <command>init</command> はそれ自身が役に立つことはほとんどなく、Unix 系システムでは他の様々なプロセスが動いています。

source: <primary><emphasis>fork</emphasis></primary>
ar_ma: <primary><emphasis>مشتق</emphasis></primary>
ja_jp: <primary><emphasis>フォーク</emphasis></primary>

source: First of all, a process can clone itself (this is known as a <emphasis>fork</emphasis>). The kernel allocates a new, but identical, process memory space, and another process to use it. At this point in time, the only difference between these two processes is their <emphasis>pid</emphasis>. The new process is customarily called a child process, and the process whose <emphasis>pid</emphasis> doesn't change, is called the parent process.
ar_ma: أولاً، يمكن للعملية استنساخ نفسها (تعرف هذه العملية <emphasis>بالاشتقاق fork</emphasis>). تخصص النواة مساحة ذاكرة جديدة للعملية، لكن مطابقة للقديمة، وعملية أخرى لاستخدامها. عند هذه اللحظة، الاختلاف الوحيد بين العمليتين هو رقم التعريف <emphasis>pid</emphasis>. تدعى العملية الجديدة بالعملية الابن عادة، والعملية التي لم يتغير رقم تعريفها، بالعملية الأم.
ja_jp: まず最初に、プロセスは自分自身を複製 (これは<emphasis>フォーク</emphasis>として知られています) する事が可能です。カーネルは全く同じプロセスを新しいメモリ空間に割り当てます。そして、複製したプロセスが複製されたプロセスを使います。この時点で、2 つのプロセスの違いは <emphasis>pid</emphasis> だけです。新しいプロセスは習慣的に子プロセスと呼ばれています。そして <emphasis>pid</emphasis> が変わらなかったプロセスは親プロセスと呼ばれています。

source: Sometimes, the child process continues to lead its own life independently from its parent, with its own data copied from the parent process. In many cases, though, this child process executes another program. With a few exceptions, its memory is simply replaced by that of the new program, and execution of this new program begins. One of the very first actions of process number 1, for instance, is to duplicate itself (which means there are, for a tiny amount of time, two running copies of the same <command>init</command> process), but the child process is then replaced by the first system initialization script, usually <filename>/etc/init.d/rcS</filename>. This script, in turn, clones itself and runs several other programs. At some point, one process among <command>init</command>'s offspring starts a graphical interface for users to log in to (the actual sequence of events is described in more details in <xref linkend="sect.system-boot" />).
ja_jp: しばしば、子プロセスは親プロセスからコピーされたデータを持った状態で、親プロセスから独立して引き続き実行されます。とはいえ、子プロセスは他のプログラムを実行する場合が多いです。この場合、いくつかの例外を除いて、子プロセスのメモリは単純に新しいプログラムで置き換えられ、新しいプログラムの実行が始まります。例えば、プロセス番号 1 の最も初期の挙動の 1 つは自分自身を複製する事ですが (これは、ごく僅かな時間ですが、同じ <command>init</command> プロセスの 2 つの実行コピーが存在する事を意味します)、子プロセスは最初のシステム初期化スクリプト <filename>/etc/init.d/rcS</filename> で置き換えられます。システム初期化スクリプトは自分自身の複製を取り、複数の他のプログラムを実行します。同時に、<command>init</command> の子プロセスの 1 つがログイン機能を提供するユーザ用のグラフィカルインターフェースを開始します(実際のイベントの順番は<xref linkend="sect.system-boot" />に詳しく書かれています)。

source: When a process finishes the task for which it was started, it terminates. The kernel then recovers the memory assigned to this process, and stops giving it slices of running time. The parent process is told about its child process being terminated, which allows a process to wait for the completion of a task it delegated to a child process. This behavior is plainly visible in command-line interpreters (known as <emphasis>shells</emphasis>). When a command is typed into a shell, the prompt only comes back when the execution of the command is over. Most shells allow for running the command in the background, it is a simple matter of adding an <userinput>&amp;</userinput> to the end of the command. The prompt is displayed again right away, which can lead to problems if the command needs to display data of its own.
ar_ma: عندما تنهي العملية المهمة التي بدأت لأجلها، تنتهي العملية. بعدها تستعيد النواة الذاكرة المحددة لهذه العملية، وتقطع عنها شرائح التشغيل الزمنية. تُخبَر العملية الأم عن انتهاء عمليتها الابن، ما يسمح لعملية ما أن تنتظر إنهاء مهمة فوضت بها عملية ابن. هذا السلوك واضح للعين المجردة في مفسرات سطر الأوامر (تعرف باسم <emphasis>الأصداف</emphasis>). عند كتابة أمر في الصَدَفَة، لا تعود إشارة الإدخال قبل انتهاء تنفيذ الأمر. تسمح معظم الأصداف بتشغيل الأوامر في الخلفية، يكون ذلك بسهولة بإضافة <userinput>&amp;</userinput> إلى نهاية الأمر. ستظهر إشارة الإدخال مجددًا مباشرة، وهو ما قد يسبب مشاكل إذا كان الأمر يحتاج لإظهار بيانات خاصة به.
ja_jp: プロセスが開始時に設定されたタスクを完了したら、プロセスは終了します。その後、カーネルがこのプロセスに割り当てられたメモリを回収し、カーネルはプロセスに実行時間を与える事を停止します。親プロセスは子プロセスが終了したことについて通知を受けます。このお陰で、親プロセスは子プロセスに委託したタスクの完了を待つ事が可能になります。コマンドラインインタプリタ (<emphasis>シェル</emphasis>として知られています) ではこの挙動がはっきりと見えます。コマンドがシェルに入力された場合、コマンドの実行が終了するまでプロンプトは戻って来ません。ほとんどのシェルでは、コマンドをバックグラウンドで実行する事が可能です。これを行うには、コマンドの最後に <userinput>&amp;</userinput> を追加するだけです。この場合、プロンプトはすぐに戻ってきます。コマンドからデータが表示される場合、このやり方は問題を引き起こすかもしれません。

source: Daemons
ar_ma: الحُرَّاس Daemons
ja_jp: デーモン

source: <primary>daemon</primary>
ar_ma: <primary>الحراس</primary>
ja_jp: <primary>デーモン</primary>

source: A “daemon” is a process started automatically by the boot sequence. It keeps running (in the background) to perform maintenance tasks or provide services to other processes. This “background task” is actually arbitrary, and does not match anything particular from the system's point of view. They are simply processes, quite similar to other processes, which run in turn when their time slice comes. The distinction is only in the human language: a process that runs with no interaction with a user (in particular, without any graphical interface) is said to be running “in the background” or “as a daemon”.
ar_ma: ”الحارس“ هو عملية تُشغِّلها متتالية الإقلاع آلياً. تبقى قيد التشغيل (في الخلفية) لتنفيذ مهام صيانة أو تقديم خدمات للعمليات الأخرى. هذه ”المهمة في الخلفية“ عشوائية في الحقيقة، ولا تقابل أي شيء محدد من وجهة نظر النظام. هي مجرد عمليات، شبيهة بالعمليات الأخرى تماماً، التي تعمل بدورها عندما تحين حصتها من الوقت. هذا التمييز موجود في لغة البشر فقط: أية عملية تعمل بدون أي تفاعل مع المستخدم (على الأخص، بدون واجهة رسومية) يقال أنها تعمل ”في الخلفية“ أو أنها ”حارس“.
ja_jp: 「デーモン」は起動シーケンスによって自動的に開始されるプロセスです。「デーモン」はメンテナンス作業を実行したり他のプロセスにサービスを提供するために (バックグラウンドで) 実行され続けます。ここで実際の「バックグラウンドタスク」はどんなものでも構いませんし、システムの観点から何か特別なタスクを意味しているわけではありません。簡単に言って「バックグラウンドタスク」はプロセスで、他のプロセスとよく似ており、自分に割り当てられたタイムスライスが来た時に動きます。プロセスの区別は人間の言葉に過ぎません: ユーザと対話せずに実行される (特にグラフィカルインターフェースを持たない) プロセスは「バックグラウンドで実行される」とか「デーモンとして実行される」などと表現されます。

source: <emphasis>VOCABULARY</emphasis> Daemon, demon, a derogatory term?
ar_ma: <emphasis>مصطلحات</emphasis> Daemon، demon، مصطلح ازدرائي؟
ja_jp: <emphasis>VOCABULARY</emphasis> Daemon (守り神)、demon (悪魔)、中傷的用語?
