Repository: Neamar/KISS
Catalog: */92_short-remedial-course.po
Languages: ar_ma, ja_jp

source: Traditionally, application configuration files are often stored directly under the user's home directory, but their names usually start with a dot (for instance, the <command>mutt</command> email client stores its configuration in <filename>~/.muttrc</filename>). Note that filenames that start with a dot are hidden by default; and <command>ls</command> only lists them when the <literal>-a</literal> option is used, and graphical file managers need to be told to display hidden files.
ja_jp: 伝統的に、アプリケーション設定ファイルはユーザのホームディレクトリの下に直接保存されている場合が多く、設定ファイルの名前は通常ドットで始まります (例えば、<command>mutt</command> 電子メールクライアントの設定は <filename>~/.muttrc</filename> に保存されます)。ドットで始まるファイル名はデフォルトで隠されることに注意してください; <command>ls</command> でドットで始まるファイル名を持つファイルを表示するには、<literal>-a</literal> オプションをつけてください。グラフィカルファイルマネージャで隠しファイルを表示するには、それぞれのアプリケーションの設定を変更してください。

source: Some programs also use multiple configuration files organized in one directory (for instance, <filename>~/.ssh/</filename>). Some applications (such as the Iceweasel web browser) also use their directory to store a cache of downloaded data. This means that those directories can end up using a lot of disk space.
ja_jp: 一部のプログラムは 1 つのディレクトリに含まれる複数の設定ファイルを使用します (例えば、<filename>~/.ssh/</filename>)。また、一部のアプリケーション (Iceweasel ウェブブラウザなど) は自分の設定ディレクトリをダウンロードデータをキャッシュする目的で使います。これはアプリケーション設定ディレクトリが大量のディスク領域を消費する場合がある事を意味します。

source: These configuration files stored directly in a user's home directory, often collectively referred to as <emphasis>dotfiles</emphasis>, have long proliferated to the point that these directories can be quite cluttered with them. Fortunately, an effort led collectively under the FreeDesktop.org umbrella has resulted in the “XDG Base Directory Specification”, a convention that aims at cleaning up these files and directory. This specification states that configuration files should be stored under <filename>~/.config</filename>, cache files under <filename>~/.cache</filename>, and application data files under <filename>~/.local</filename> (or subdirectories thereof). This convention is slowly gaining traction, and several applications (especially graphical ones) have started following it.
ja_jp: これらの設定ファイルはユーザのホームディレクトリに直接保存され、まとめて<emphasis>ドットファイル</emphasis>と呼ばれており、増え続けることでユーザのホームディレクトリを散らからせる原因となっています。幸いなことに、FreeDesktop.org の傘下で行われた努力により「XDG 基本ディレクトリ仕様」が生まれました。これは設定ファイルと設定ディレクトリを一掃する事を目的とする仕様です。XDG 基本ディレクトリ仕様によれば、設定ファイルは <filename>~/.config</filename> に、キャッシュファイルは <filename>~/.cache</filename> に、アプリケーションデータファイルは <filename>~/.local</filename> (およびそのサブディレクトリ) に保存すると決められています。XDG 基本ディレクトリ仕様はゆっくりと勢いを増しつつあり、一部のアプリケーション (特にグラフィカルアプリケーション) はこの仕様に従うようになっています。

source: Graphical desktops usually display the contents of the <filename>~/Desktop/</filename> directory (or whatever the appropriate translation is for systems not configured in English) on the desktop (ie, what's visible on screen once all applications are closed or iconized).
ja_jp: 通常グラフィカルデスクトップは <filename>~/Desktop/</filename> ディレクトリ (または英語で設定されていないシステムの場合、適切に翻訳された名前のディレクトリ) の内容をデスクトップ (つまり、すべてのアプリケーションを閉じるかアイコン化した時の画面の内容) に表示します。

source: Finally, the email system sometimes stores incoming emails into a <filename>~/Mail/</filename> directory.
ar_ma: أخيرًا، أحيانا يخزن نظام البريد الإلكتروني البريد الوارد في مجلد <filename>~/Mail/</filename>.
ja_jp: 最後に、電子メールシステムは受信した電子メールを <filename>~/Mail/</filename> ディレクトリに保存する場合があります。

source: Inner Workings of a Computer: the Different Layers Involved
ar_ma: آلية العمل الداخلية للحاسوب: الطبقات المختلفة المشارِكة
ja_jp: コンピュータ内部の仕組み: 様々な層の関係性

source: A computer is often considered as something rather abstract, and the externally visible interface is much simpler than its internal complexity. Such complexity comes in part from the number of pieces involved. However, these pieces can be viewed in layers, where a layer only interacts with those immediately above or below.
ar_ma: غالبًا ما يعتبر الحاسوب شيئًا مجردًا إلى حد ما، والواجهة الظاهرية أبسط بكثير من التعقيد الداخلي. يأتي هذا التعقيد جزئيًا نتيجة عدد المكونات التي تشترك مع بعضها. يمكن تصنيف هذه المكونات، على أية حال، في طبقات حيث تتفاعل كل طبقة مع الطبقة التي تسبقها أو تتلوها مباشرة فقط.
ja_jp: コンピュータは抽象的なものとして考えられる場合が多く、外から見えるインターフェースは内部の複雑さに比べてずっと簡単なものです。この複雑さの原因は関連する要素が多い事です。しかしながら、これらの要素は層状構造をしており、ある層が影響を及ぼしたり影響を受けたりするその層の真上と真下の層だけです。

source: An end-user can get by without knowing these details… as long as everything works. When confronting a problem such as, “The internet doesn't work!”, the first thing to do is to identify in which layer the problem originates. Is the network card (hardware) working? Is it recognized by the computer? Does the Linux kernel see it? Are the network parameters properly configured? All these questions isolate an appropriate layer and focus on a potential source of the problem.
ar_ma: يمكن للمستخدم العادي أن يتدبر أمره دون معرفة هذه التفاصيل… طالما أن كل شيء على ما يرام. لكن عند مواجهة مشكلة من قبيل ”الإنترنت لا يعمل!“، فأول شيء يجب عمله هو تعريف الطبقة التي تسبب المشكلة. هل تعمل بطاقة الشبكة (عتاد)؟ هل تعرَّف عليها الحاسوب؟ هل تستطيع نواة لينوكس رؤيتها؟ هل أُعِدَّت متغيرات الشبكة بصورة صحيحة؟ كل من هذه الأسئلة يعزل طبقة مناسبة ويركز على مصدر محتمل للمشكلة.
ja_jp: すべてが上手く動作している限り… エンドユーザは各層の詳細を理解する必要はありません。「インターネットに繋がらない!」などの問題に直面した場合、最初に問題の原因になっている層を特定する事が重要です。ネットワークカード (ハードウェア) は動いていますか? コンピュータはネットワークカードを認識していますか? Linux カーネルはネットワークカードを認識していますか? ネットワークパラメータは適切に設定されていますか? これらの質問により、コンピュータは適切な層に分割され、問題の本質的な原因になっている層を特定する事が可能です。

source: The Deepest Layer: the Hardware
ar_ma: أعمق طبقة: العتاد
ja_jp: 最下層: ハードウェア

source: <primary>Serial ATA</primary>
ja_jp: <primary>シリアル ATA</primary>

source: <primary>Parallel ATA</primary>
ja_jp: <primary>パラレル ATA</primary>

source: Let us start with a basic reminder that a computer is, first and foremost, a set of hardware elements. There is generally a main board (known as the <emphasis>motherboard</emphasis>), with one (or more) processor(s), some RAM, device controllers, and extension slots for option boards (for other device controllers). Most noteworthy among these controllers are IDE (Parallel ATA), SCSI and Serial ATA, for connecting to storage devices such as hard disks. Other controllers include USB, which is able to host a great variety of devices (ranging from webcams to thermometers, from keyboards to home automation systems) and IEEE 1394 (Firewire). These controllers often allow connecting several devices so the complete subsystem handled by a controller is therefore usually known as a “bus”. Option boards include graphics cards (where monitor screens will be plugged in to), sound cards, network interface cards, and so on. Some main boards are pre-built with these features, and don't need option boards.
ja_jp: 基本的な事を思い出すことからはじめましょう。何よりもまず、コンピュータはハードウェア部品の集合体である、という点です。ほとんどの場合主要基板 (<emphasis>マザーボード</emphasis>として知られています) があり、これには 1 台 (または複数台) のプロセッサ、RAM、デバイスコントローラ、(他のデバイスコントローラを搭載する) 拡張ボード用の拡張スロットが取り付けられています。特に注意すべきコントローラはハードディスクなどのストレージデバイスを接続する IDE (パラレル ATA)、SCSI、シリアル ATA、です。その他のコントローラには、多くの様々なデバイス (ウェブカメラから温度計、キーボードからホームオートメーションシステム) をホストする事が可能な USB と IEEE 1394 (Firewire) があります。これらのコントローラには複数のデバイスを接続する事が可能です。このため、コントローラによって取り扱われる完全なサブシステムは「バス」と呼ばれます。拡張ボードには、グラフィックカード (モニタ画面をここに接続します)、サウンドカード、ネットワークインターフェースカード、などがあります。一部のマザーボードはいくつかの機能を予め備えており、拡張カードを必要としません。

source: <emphasis>IN PRACTICE</emphasis> Checking that the hardware works
ar_ma: <emphasis>أثناء العمل</emphasis> تحقق أن العتاد يعمل
ja_jp: <emphasis>IN PRACTICE</emphasis> ハードウェアが動作していることの確認

source: Checking that a piece of hardware works can be tricky. On the other hand, proving that it doesn't work is sometimes quite simple.
ar_ma: قد يكون التحقق من أن قطعة عتاد تعمل بشكل صحيح معقدًا. من ناحية أخرى، فإن إثبات أن تلك القطعة لا تعمل بالغ البساطة أحيانا.
ja_jp: ハードウェアの一部が動作している事を確認することは難しいです。逆に、ハードウェアが動作していない事を証明することはとても簡単です。

source: A hard disk drive is made of spinning platters and moving magnetic heads. When a hard disk is powered up, the platter motor makes a characteristic whir. It also dissipates energy as heat. Consequently, a hard disk drive that stays cold and silent when powered up is broken.
ar_ma: يتألف القرص الصلب من أطباق دائرة ورؤوس مغناطيسية متحركة. عند توصيل الطاقة للقرص الصلب، يعطي محرك الأطباق أزيزا مميزا. كما أنه يبدد الطاقة بشكل حرارة. بالتالي، فإن سواقة الأقراص الصلبة التي تبقى باردة وهادئة عند تشغيلها معطوبة.
ja_jp: ハードディスクドライブは回転する円盤と移動する磁気ヘッドから構成されています。ハードディスクの電源を入れると、円盤モータから特徴的な音が聞こえます。さらに円盤モータはエネルギーを熱として放出します。したがって、電源を入れても冷たいままで、音が聞こえないハードディスクドライブは故障しています。

source: Network cards often include LEDs displaying the state of the link. If a cable is plugged in and leads to a working network hub or switch, at least one LED will be on. If no LED lights up, either the card itself, the network device, or the cable between them, is faulty. The next step is therefore testing each component individually.
ja_jp: ネットワークカードは多くの場合リンク状態を示す LED を備えています。ケーブルが装着されており、そのケーブルが動いているネットワークハブまたはスイッチにつなげられている場合、少なくとも 1 つの LED が点灯しているはずです。すべての LED が消灯している場合、ネットワークカード本体、ネットワーク機器、両者をつなげるケーブルが壊れています。それ故、次の段階では各要素を個別にテストします。

source: Some option boards — especially 3D video cards — include cooling devices, such as heat sinks and/or fans. If the fan does not spin even though the card is powered up, a plausible explanation is the card overheated. This also applies to the main processor(s) located on the main board.
ar_ma: بعض البطاقات الإضافية — خصوصًا بطاقات الفيديو ثلاثي الأبعاد — تحوي أجهزة تبريد، مثل مبرِّدات معدنية و/أو مراوح. إذا لم تدر المروحة بالرغم من تشغيل البطاقة، فقد يكون تفسير ذلك أن البطاقة ساخنة أكثر من اللازم. هذا ينطبق أيضًا على المعالجات الأساسية المتوضعة على اللوحة الرئيسية.
ja_jp: 一部のオプションボード - 特に 3D ビデオカード - はヒートシンクやファンなどの冷却装置を備えています。カードの電源が入っているにも関わらずファンが回転していない場合、もっともらしい状況はカードが過熱している状況です。マザーボードに装着されているプロセッサにも同じ事が言えます。

source: The Starter: the BIOS
ar_ma: مفتاح التشغيل: البيوس
ja_jp: スタート係: BIOS

source: Hardware, on its own, is unable to perform useful tasks without a corresponding piece of software driving it. Controlling and interacting with the hardware is the purpose of the operating system and applications. These, in turn, require functional hardware to run.
ar_ma: العتاد وحده غير قادر على تنفيذ مهام مفيدة دون البرمجية المناسبة التي تقوده. إن التحكم والتفاعل مع العتاد هو هدف نظام التشغيل والتطبيقات. وهذه بدورها تحتاج إلى عتاد سليم لتعمل.
ja_jp: ハードウェアを制御するソフトウェアがなければ、ハードウェアをまともに動作させることはできません。オペレーティングシステムとアプリケーションは、ハードウェアを制御したりハードウェアと情報をやりとりする機能を提供します。同様に、これを行うためにはハードウェアを正常に機能させる必要があります。

source: This symbiosis between hardware and software does not happen on its own. When the computer is first powered up, some initial setup is required. This role is assumed by the BIOS, a tiny piece of software embedded into the main board that runs automatically upon power-up. Its primary task is searching for software it can hand over control to. Usually, this involves looking for the first hard disk with a boot sector (also known as the <emphasis>master boot record</emphasis> or <acronym>MBR</acronym>), loading that boot sector, and running it. From then on, the BIOS is usually not involved (until the next boot).
ar_ma: هذا التضامن بين العتاد والبرمجيات لا يكون هكذا وحده. عند بدء تشغيل الحاسوب، توجد حاجة لبعض الإعداد الأولي. يقوم بيوس بهذا الدور، برمجية صغيرة جدًا مبيتة في اللوحة الرئيسية تعمل تلقائيًا عند التشغيل. مهمتها الأساسية هي البحث عن برمجيات يمكن أن تسلمها التحكم بالجهاز. عادة ما يتضمّن هذا البحث عن القرص الصلب الأول الذي يحوي قطاع إقلاعي (يُعرف أيضا باسم <emphasis>سجل الإقلاع الرئيسي</emphasis> أو <acronym>MBR = Master Boot Record</acronym>)، وتحميل ذلك القطاع، وتشغيله. بعد ذلك، لا يتدخل بيوس في شيء (حتى الإقلاع التالي).
ja_jp: ハードウェアとソフトウェアの共生関係はひとりでに発生するものではありません。コンピュータ起動時には、いくつかの初期設定が必要です。この初期設定を担当するのが BIOS です。BIOS はマザーボードに組み込まれた小さなソフトウェアで、起動中に自動的に実行されます。BIOS の最も重要な役割に、ハードウェアの制御を引き継ぐソフトウェアを検索する役割があります。通常、これはブートセクタ (<emphasis>マスターブートレコード</emphasis>や <acronym>MBR</acronym> として知られています) を備えた最初のハードディスクを検索し、ブートセクタを読み込んで、ブートセクタに収められているソフトウェアを実行します。BIOS の関与する動作はここまでです (次回起動時まで関与しません)。

source: <emphasis>TOOL</emphasis> Setup, the BIOS configuration tool
ar_ma: <emphasis>أدوات</emphasis> Setup، أداة إعداد البيوس
ja_jp: <emphasis>TOOL</emphasis> Setup、BIOS 設定ツール

source: The BIOS also contains a piece of software called Setup, designed to allow configuring aspects of the computer. In particular, it allows choosing which boot device is preferred (for instance, the floppy disk or CD-ROM drive), setting the system clock, and so on. Starting Setup usually involves pressing a key very soon after the computer is powered on. This key is often <keycap>Del</keycap> or <keycap>Esc</keycap>, sometimes <keycap>F2</keycap> or <keycap>F10</keycap>. Most of the time, the choice is flashed on screen while booting.
ar_ma: يحتوي بيوس أيضًا على برمجية تدعى Setup، مصممة لتسمح بإعداد النواحي المختلفة للحاسوب. تحديدًا، تسمح هذه البرمجية باختيار الجهاز الإقلاعي المفضل (مثلا، القرص المرن أو سواقة الأقراص الليزرية)، ضبط ساعة النظام، وغيرها. لبدء تشغيل Setup تحتاج عادة لضغط مفتاح بُعَيْد تشغيل الحاسوب. غالبًا ما يكون مفتاح <keycap>Del</keycap> أو <keycap>Esc</keycap>، وأحيانًا <keycap>F2</keycap> أو <keycap>F10</keycap>. أغلب الأوقات، يتم عرض المفتاح الواجب ضغطه على الشاشة أثناء الإقلاع.
ja_jp: BIOS には、Setup と呼ばれるソフトウェアが含まれます。Setup はコンピュータを設定する目的で設計されています。特に、Setup を使うことで優先する起動デバイス (例えば、フロッピーディスクや CD-ROM ドライブなど) を選択したり、システム時計を設定したりする事が可能です。Setup を開始するには、コンピュータ起動直後の非常に早い時期に特定のキーを押します。多くの場合このキーは <keycap>Del</keycap> か <keycap>Esc</keycap> で、時々 <keycap>F2</keycap> や <keycap>F10</keycap> の場合もあります。ほとんどの場合、Setup を開始するキーは起動画面に一瞬表示されます。

source: The boot sector, in turn, contains another tiny piece of software, called the bootloader, whose purpose is to find and run an operating system. Since this bootloader is not embedded in the main board but loaded from disk, it can be smarter than the BIOS, which explains why the BIOS does not load the operating system by itself. For instance, the bootloader (often GRUB on Linux systems) can list the available operating systems and ask the user to choose one. Usually, a time-out and default choice is provided. Sometimes the user can also choose to add parameters to pass to the kernel, and so on. Eventually, a kernel is found, loaded into memory, and executed.
ar_ma: يحتوي القطاع الإقلاعي بدوره على برمجية صغيرة أخرى، تدعى مُحمِّل الإقلاع، غرضها العثور على نظام التشغيل وبدء تشغيله. نظرًا لأن محمل الإقلاع هذا ليس مضمَّناً في اللوحة الرئيسية بل يتم تحميله من القرص، يمكن أن يكون متطورًا أكثر من بيوس، ما يفسر عدم تحميل نظام التشغيل بوساطة بيوس نفسه. مثلا، يمكن لمحمَّل الإقلاع (غالبًا ما يكون GRUB على نظم لينوكس) أن يسرد نظم التشغيل المتوفرة وأن يطلب من المستخدم اختيار واحد منها. عادة، يتم توفير خَيَار إفتراضي يتم اختياره تلقائيًا بعد انقضاء فترة زمنية معينة. يمكن أحيانًا أن يختار المستخدم أيضًا إضافة خيارات لتمريرها للنواة، وهكذا. في النهاية سيُعثَر على نواة ما، وسَتُحمَّل إلى الذاكرة، ويبدأ تنفيذها.
ja_jp: ブートセクタには、別の小さなソフトウェアが含まれます。これはブートローダと呼ばれ、オペレーティングシステムを探して実行するためのものです。ブートローダはマザーボードに組み込まれているのではなく、ディスクから読み込まれます。このため、BIOS よりも多くの機能を持っています。BIOS 自身がオペレーティングシステムを読み込まないのはこれが理由です。例えば、ブートローダ (Linux システムでは GRUB を使う事が多いです) は利用可能なオペレーティングシステムを表示し、ユーザに起動するオペレーティングシステムを尋ねる事が可能です。通常、タイムアウトとデフォルトの回答が設定されています。ここでユーザはカーネルに渡すパラメータを追加したりする事も可能です。最終的に、カーネルが見つかり、メモリに読み込まれ、実行されます。

source: The BIOS is also in charge of detecting and initializing a number of devices. Obviously, this includes the IDE/SATA devices (usually hard disk(s) and CD/DVD-ROM drives), but also PCI devices. Detected devices are often listed on screen during the boot process. If this list goes by too fast, use the <keycap>Pause</keycap> key to freeze it for long enough to read. Installed PCI devices that don't appear are a bad omen. At worst, the device is faulty. At best, it is merely incompatible with the current version of the BIOS or main board. PCI specifications evolve, and old main boards are not guaranteed to handle newer PCI devices.
ja_jp: さらに BIOS は多数のデバイスを検出して初期化します。言うまでもなくこのデバイスには、IDE/SATA デバイス (通常ハードディスクおよび CD/DVD-ROM デバイス) だけでなく PCI デバイスも含まれます。検出されたデバイスは起動処理中に画面に表示されます。デバイスリストがすぐに消えてしまう場合、<keycap>Pause</keycap> キーを押せば表示を止めて内容を読む事が可能です。インストールされた PCI デバイスがリストに含まれないのは悪い兆しです。最悪の場合、デバイスは欠陥品ということになります。良くても、デバイスは BIOS かマザーボードの現在のバージョンと互換性が無いということになります。PCI 仕様は進化しており、古いマザーボードで新しい PCI デバイスを使える保証はありません。

source: The Kernel
ar_ma: النواة
ja_jp: カーネル

source: Both the BIOS and the bootloader only run for a few seconds each; now we're getting to the first piece of software that runs for a longer time, the operating system kernel. This kernel assumes the role of a conductor in an orchestra, and ensures coordination between hardware and software. This role involves several tasks including: driving hardware, managing processes, users and permissions, the filesystem, and so on. The kernel provides a common base to all other programs on the system.
ar_ma: يعمل كلُّ من البيوس ومحمّل الإقلاع لثوان قليلة فقط لكل منهما؛ لقد وصلنا الآن إلى البرمجية الأولى التي تعمل لفترة أطول، ألا وهي نواة نظام التشغيل. تتولى النواة مهمة المايسترو في الأوركسترا، وتكفل التناغم بين العتاد والبرمجيات. هذا الدور يتضمن عدة مهام منها: قيادة العتاد، إدارة العمليات، والمستخدمين والصلاحيات، ونظام الملفات، وغيرها. تقدم النواة قاعدة مشتركة لجميع البرامج الأخرى في النظام.
ja_jp: BIOS とブートローダはそれぞれ数秒間だけ実行されます; これでついに、長時間実行するソフトウェア、オペレーティングシステムカーネル、に到達します。カーネルはオーケストラの指揮者の役割を果たし、ハードウェアとソフトウェア間の調整を行います。カーネルは複数の仕事を担当しています: ハードウェアの駆動、プロセスの管理、ユーザとパーミッション、ファイルシステム、などです。カーネルはシステム上のすべての他のプログラムに共通基盤を提供します。

source: The User Space
ar_ma: ساحة المستخدم
ja_jp: ユーザ空間

source: Although everything that happens outside of the kernel can be lumped together under “user-space”, we can still separate it into software layers. However, their interactions are more complex than before, and the classifications may not be as simple. An application commonly uses libraries, which in turn involve the kernel, but the communications can also involve other programs, or even many libraries calling each other.
ar_ma: بالرغم من أننا نستطيع جمع كل ما يحدث خارج النواة معًا تحت اسم ”ساحة المستخدم“، إلا أنه يمكن تقسيم هذه الأحداث إلى طبقات برمجية. على أية حال، فإن التفاعلات بين هذه الطبقات أعقد من سابقتها، وقد لا تكون تصنيفات هذه الطبقات بالسهولة نفسها. من الشائع أن تستفيد التطبيقات من المكتبات، والتي بدورها تستعين بالنواة، وقد تدخل برامج أخرى في هذه الاتصالات، أو يمكن أن تستدعي عدة مكتبات بعضها البعض.
ja_jp: カーネルの以外のすべては「ユーザ空間」の意味でひとくくりにされますが、「ユーザ空間」を更にいくつかのソフトウェア層に分割する事が可能です。しかしながら、ソフトウェア層同士の相互作用は以前に比べてさらに複雑化しており、ソフトウェア層の分類分けは単純ではありません。アプリケーションは一般にライブラリを使います。ライブラリはカーネルと通信しますが、通信には他のプログラムまたはさらに多くのライブラリが必要です。

source: Some Tasks Handled by the Kernel
ar_ma: بعض المهام التي تتحكم بها النواة
ja_jp: カーネルが担当する一部の操作

source: Driving the Hardware
ar_ma: إدارة العتاد
ja_jp: ハードウェアの操作

source: The kernel is, first and foremost, tasked with controlling the hardware parts, detecting them, switching them on when the computer is powered on, and so on. It also makes them available to higher-level software with a simplified programming interface, so applications can take advantage of devices without having to worry about details such as which extension slot the option board is plugged into. The programming interface also provides an abstraction layer; this allows video-conferencing software, for example, to use a webcam independently of its make and model. The software can just use the <emphasis>Video for Linux</emphasis> (V4L) interface, and the kernel translates the function calls of this interface into the actual hardware commands needed by the specific webcam in use.
ar_ma: النواة تهتم، أولاً وقبل كل شيء، بالتحكم بقطع العتاد، والتعرف عليها، تشغيلها عند تشغيل الحاسوب، وهكذا. كما أنها توفر واجهة برمجية مبسطة للعتاد تستفيد منها البرمجيات عالية المستوى، حتى تستغل التطبيقات مزايا العتاد دون الحاجة للاهتمام بالتفاصيل مثل أي منفذ توسيعي تم تركيب البطاقة الإضافية عليه. تُقدّم الواجهة البرمجية أيضًا طبقة عزل؛ تسمح هذه لبرمجيات اللقاءات الفيديوية، مثلاً، باستخدام كاميرا الوب بغض النظر عن صانعها وطرازها. يمكن للبرمجيات أن تستخدم واجهة <emphasis>فيديو لأجل لينوكس</emphasis> (V4L = Video for Linux)، وستترجم النواة نداءات دوال هذه الواجهة إلى أوامر العتاد الفعلية التي تحتاجها كاميرا الوب الخاصة المستعملة.
ja_jp: カーネルの第一義はハードウェア部分を制御すること、検知すること、コンピュータが起動された時に切り替える事です。更にカーネルは単純化されたプログラミングインターフェースを使った高レベルソフトウェアからのハードウェアの利用を可能にします。こうすることで、アプリケーションは拡張ボードがどの拡張スロットに接続されているかなどの詳細を気にすることなくデバイスを上手く活用する事が可能になります。更にこのプログラミングインターフェースは抽象化レイヤを提供します; 抽象化レイヤを使うことで、例えばビデオ会議ソフトは種類やモデル番号を気にせずにウェブカメラを使う事が可能です。ビデオ会議ソフトは <emphasis>Video for Linux</emphasis> (V4L) を使うだけです。カーネルが V4L インターフェースの機能呼び出しを特定のウェブカメラを制御するために必要な実際のハードウェアコマンドに変換します。

source: <indexterm><primary><command>lspci</command></primary></indexterm> <indexterm><primary><command>lsusb</command></primary></indexterm> <indexterm><primary><command>lsdev</command></primary></indexterm> <indexterm><primary><command>lspcmcia</command></primary></indexterm> The kernel exports many details about detected hardware through the <filename>/proc/</filename> and <filename>/sys/</filename> virtual filesystems. Several tools summarize those details. Among them, <command>lspci</command> (in the <emphasis role="pkg">pciutils</emphasis> package) lists PCI devices, <command>lsusb</command> (in the <emphasis role="pkg">usbutils</emphasis> package) lists USB devices, and <command>lspcmcia</command> (in the <emphasis role="pkg">pcmciautils</emphasis> package) lists PCMCIA cards. These tools are very useful for identifying the exact model of a device. This identification also allows more precise searches on the web, which in turn, lead to more relevant documents.
ar_ma: <indexterm><primary><command>lspci</command></primary></indexterm> <indexterm><primary><command>lsusb</command></primary></indexterm> <indexterm><primary><command>lsdev</command></primary></indexterm> <indexterm><primary><command>lspcmcia</command></primary></indexterm> تصدر النواة العديد من التفاصيل عن العتاد المُتعرَّف عليه من خلال نظامي الملفات الوهميين <filename>/proc/</filename> و <filename>/sys/</filename>. تُلَخِّص أدوات عدة هذه التفاصيل. من بينها، <command>lspci</command> (في الحزمة <emphasis role="pkg">pciutils</emphasis>) التي تسرد أجهزة PCI، والأداة <command>lsusb</command> (في الحزمة <emphasis role="pkg">usbutils</emphasis>) التي تسرد أجهزة USB، وأيضًا <command>lspcmcia</command> (في الحزمة <emphasis role="pkg">pcmciautils</emphasis>) التي تسرد بطاقات PCMCIA. هذه الأدوات مفيدة جداً للتعرف على الطراز الدقيق للجهاز. هذا التعريف يسمح بإجراء أبحاث أدق على الوب، ما يؤدي بدوره إلى وثائق ذات صلة أكبر.
ja_jp: <indexterm><primary><command>lspci</command></primary></indexterm> <indexterm><primary><command>lsusb</command></primary></indexterm> <indexterm><primary><command>lsdev</command></primary></indexterm> <indexterm><primary><command>lspcmcia</command></primary></indexterm> カーネルは検出されたハードウェアに関する多くの詳細を <filename>/proc/</filename> と <filename>/sys/</filename> 仮想ファイルシステムを通じて書き出します。ハードウェアの詳細をまとめて表示するツールも存在します。中でも、<command>lspci</command> (<emphasis role="pkg">pciutils</emphasis> パッケージに含まれます) は PCI デバイスをリストし、<command>lsusb</command> (<emphasis role="pkg">usbutils</emphasis> パッケージに含まれます) は USB デバイスをリストし、<command>lspcmcia</command> (<emphasis role="pkg">pcmciautils</emphasis> パッケージに含まれます) は PCMCIA カードをリストします。これらのツールはデバイスの正確なモデル番号を識別するのに役立ちます。デバイスの正確なモデル番号を使えば、より的確に検索したり、より関連性の高い文書を見つける事が可能です。

source: Example of information provided by <command>lspci</command> and <command>lsusb</command>
ar_ma: مثال عن المعلومات التي يقدمها الأمر <command>lspci</command> والأمر <command>lsusb</command>
ja_jp: <command>lspci</command> と <command>lsusb</command> で提供される情報の例
