Repository: Neamar/KISS
Catalog: */Book_Info.po
Languages: ar_ma, pt_br

source: The Debian Administrator's Handbook
ar_ma: دفتر مدير دبيان
pt_br: O Manual do Administrador Debian

source: Debian Wheezy from Discovery to Mastery
ar_ma: دبيان ويزي من الاستكشاف إلى الاحتراف

source: Debian
ar_ma: دبيان

source: A reference book presenting the Debian distribution, from initial installation to configuration of services.
ar_ma: مرجع يستعرض توزيعة دبيان، من التثبيت الأولي وحتى إعداد خدمات النظام.
pt_br: Um livro de referência apresentando a distribuição Debian, da instalação inicial até a configuração de serviços.

source: ISBN: 979-10-91414-02-9 (English paperback)
ar_ma: ‏ISBN: ‏979-10-91414-02-9 (النسخة الورقية)

source: ISBN: 979-10-91414-03-6 (English ebook)
ar_ma: ‏ISBN: ‏979-10-91414-03-6 (الكتاب الإلكتروني)

source: This book is available under the terms of two licenses compatible with the Debian Free Software Guidelines.
ar_ma: هذا الكتاب متوفر وفقاً لشروط رخصتين متوافقتين مع توصيات دبيان للبرمجيات الحرة.
pt_br: Este livro está disponível sob os termos de duas licenças compatíveis com as Diretrizes de Software Livre Debian.

source: Creative Commons License Notice:
ar_ma: إشعار رخصة Creative Commons:
pt_br: Nota da Licença Creative Commons:

source: This book is licensed under a Creative Commons Attribution-ShareAlike 3.0 Unported License. <ulink type="block" url="http://creativecommons.org/licenses/by-sa/3.0/" />
ar_ma: هذا الكتاب مرخص وفق رخصة Creative Commons Attribution-ShareAlike 3.0 Unported. <ulink type="block" url="http://creativecommons.org/licenses/by-sa/3.0/" />
pt_br: Este livro está licenciado sob a Licença Creative Commons Attribution-ShareAlike 3.0 Unported. <ulink type="block" url="http://creativecommons.org/licenses/by-sa/3.0/" />

source: GNU General Public License Notice:
ar_ma: إشعار رخصة غنو الشعبية العامة:
pt_br: Nota da Licença Pública Geral da GNU:

source: This book is free documentation: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 2 of the License, or (at your option) any later version.
ar_ma: هذا الكتاب هو توثيق حر: يمكنك إعادة توزيعه و/أو تعديله وفق شروط رخصة غنو العامة GPL كما نشرتها مؤسسة البرمجيات الحرة، سواء النسخة 2 منها، أو (حسب اختيارك) أية نسخة لاحقة.
pt_br: Este livro é documentação livre; você pode redistribuí-lo e/ou modificá-lo dentro dos termos da Licença Pública Geral GNU como publicada pela Fundação do Software Livre, na versão 2 da Licença, ou (na sua opinião) qualquer versão.

source: This book is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ar_ma: تم توزيع هذا الكتاب على أمل أن يكون مفيداً، <emphasis role="bold">لكن بدون أية ضمانات؛ ولا حتى ضمانات الترويج والتسويق أو الملائمة المحددة لغرض ما</emphasis>. انظر رخصة غنو الشعبية العامة لمزيد من التفاصيل.
pt_br: Este livro é distribuído na esperança de que ele seja útil, mas SEM QUALQUER GARANTIA; sem ao menos a garantia implícita de COMERCIALIZAÇÃO ou ADEQUAÇÃO PARA UM PROPÓSITO PARTICULAR. Veja a Licença Pública Geral GNU para mais detalhes.

source: You should have received a copy of the GNU General Public License along with this program. If not, see <ulink url="http://www.gnu.org/licenses/" />.
ar_ma: يجب أن تستلم نسخة من رخصة غنو العامة مع هذا البرنامج. إذا لم يحدث ذلك، انظر <ulink url="http://www.gnu.org/licenses/" />.
pt_br: Você deve ter recebido uma cópia da Licença Pública Geral GNU junto com este programa. Se não, veja <ulink url="http://www.gnu.org/licenses/" />.

source: Show your appreciation
ar_ma: أظهر تقديرك لعملنا
pt_br: Mostre sua apreciação

source: This book is published under a free license because we want everybody to benefit from it. That said maintaining it takes time and lots of efforts, and we appreciate being thanked for this. If you find this book valuable, please consider contributing to its continued maintenance either by buying a paperback copy or by making a donation through the book's official website: <ulink type="block" url="http://debian-handbook.info" />
ar_ma: نشرنا هذا الكتاب وفق رخصة حرة لأننا نريد أن يستفيد الجميع منه. ومع ذلك فإن صيانة هذا الكتاب تستهلك وقتاً بالإضافة إلى الكثير من الجهد، ونحن نقدّر من يشكرنا على جهدنا. إذا وجدت هذا الكتاب قيّماً، فنرجو أن تأخذ بعين الاعتبار المشاركة في صيانته المستمرة سواءً بشراء نسخة ورقية أو بالتبرع من خلال موقع الكتاب الرسمي (التبرعات تعود لدعم النسخة الأجنبية): <ulink type="block" url="http://debian-handbook.info" />
pt_br: Este livro é publicado sob uma licença livre porque queremos que todos se beneficiem dele. Dito isto, mantê-lo requer tempo e muito esforço, e nós gostamos de ser agradecidos por isso. Se você achar este livro valioso, por favor, considere contribuir para sua contínua manutenção, seja através da compra do livro ou fazendo uma doação através do site oficial do livro: <ulink type="block" url="http://debian-handbook.info" />

source: Debian Squeeze from Discovery to Mastery
pt_br: Debian Squeeze da descoberta à maestria

source: ISBN: 979-10-91414-00-5 (paperback)
pt_br: ISBN: 979-10-91414-00-5 (brochura)
